[
  {
    "id": "7df41e1f94cc9bc099241a80cde063b41b165c88",
    "title": "Successful accomplishment of Development of Service Module Propulsion System technology for Gaganyaan Missions",
    "page_link": "https://www.isro.gov.in/Successful_accomplishment_SMPS_Gaganyaan.html",
    "page_content": "July 11, 2025\nISRO has successfully completed the development of Service Module Propulsion System (SMPS) for Gaganyaan Mission with the completion of the qualification test programme. A full duration hot test of SMPS for 350s was conducted to validate the integrated performance of the SMPS for flight off-nominal mission profile of SM based mission abort on July 11, 2025. The overall performance of the propulsion system during the hot test was normal as per pre-test predictions.\nThe Service Module (SM) of Gaganyaan is a regulated bi-propellant based propulsion system that caters to the requirements of the Orbital Module for orbit circularization, on-orbit control, de-boost manoeuvring and Service Module based abort during the ascent phase. The Liquid Apogee Motor (LAM) engines provide the main propulsive force during the orbit circularisation & de-boost phases, while the Reaction Control System (RCS) thrusters ensures precise attitude control.\nA System Demonstration Model (SDM) test bed was realised emulating the fluid circuit of the Service Module Propulsion System, encompassing the propellant tank feed system, helium pressurization system, flight-qualified thrusters, and control components. SDM for Service Module Propulsion System has undergone 25 tests under nominal and off-nominal conditions for a cumulative duration of 14,331s for various Gaganyaan mission scenarios and human rating requirements.\nThe Gaganyaan Service Module Propulsion System is designed, developed, and realized by Liquid Propulsion Systems Centre (LPSC) and the tests were carried out at ISRO Propulsion Complex (IPRC), Mahendragiri.",
    "date": "July 11, 2025"
  },
  {
    "id": "a92147f92ffe556f4140b76cfd4c430da730027b",
    "title": "Progress of Axiom-4 mission and tentative schedule for undocking from ISS to return journey to earth",
    "page_link": "https://www.isro.gov.in/Progress_Axiom-4_mission_tentative_schedule_undocking_ISS_to_earth.html",
    "page_content": "July 11, 2025\nGaganyatri Shubhanshu Shukla is actively advancing a suite of seven microgravity experiments as part of India’s participation in the Axiom-04 space mission. Amongst these four experiments have been successfully completed and three are nearing completion. Four completed experiments include Indian strain of Tardigrades involving survival, revival, reproduction and transcriptome; Myogenesis studying the impact of space environment on human muscle cells; Sprouting of methi & moong seeds with relevance to crew nutrition; Cyanobacteria experiment studying the growth of two varieties with relevance to life support systems. The completed microgravity experiments are being readied for their journey back to earth for further analysis. Three experiments that are nearing completion include studying Microalgae, Crop seeds and Voyoger Display. These Indian-led microgravity experiments represent a significant leap in space science and technology, contributing critical knowledge to support Gaganyaan, Bhartiya Antariksha Station, and future planetary missions.\nISRO’s flight surgeons are continuously monitoring & ensuring the overall health and fitness of the Gaganyatri through participation in Private Medical/Psychological Conferences. Gaganyatri Shubhanshu is in good health condition and in high spirit.\nAxiom Space Inc., USA has informed that undocking from ISS to return journey to earth is expected on July 14, 2025 at 16:30hrs (IST). Following a series of orbital maneuvers after undocking, Crew Dragon spacecraft is expected to splashdown near the coast of California, USA on July 15, 2025 at 15:00hrs (IST). Post splashdown, the Gaganyatri will undergo a rehabilitation program (about 7 days) under supervision of Flight Surgeons to adapt back to Earth’s gravity.\nSprouts Experiment\nMyogenesis Experiment",
    "date": "July 11, 2025"
  },
  {
    "id": "7e9fbb0629db5bde60fd13c267c0e96f7d88f3ba",
    "title": "ISRO conducts student interactions with Gaganyatri onboard ISS",
    "page_link": "https://www.isro.gov.in/Student_interactions_with_Gaganyatri.html",
    "page_content": "July 03, 2025\nISRO through its student outreach activities aims to stoke curiosity of younger minds in space activities, technology and application. In this context, ISRO has planned outreach activities with Indian student community on the sidelines of the first mission of ISRO’s Gaganyatri to the International Space Station (ISS).\nOn 3rdJuly, 2025, Gaganyatri Shubhanshu Shukla interacted with the students through sessions organized in Trivandrum and Lucknow. Around 200 students from across the state of Kerala participated in the interaction organized at the premises of ISRO’s Vikram Sarabhai Space Centre (VSSC), Trivandrum. Similarly, around 300 students from across the state of Uttar Pradesh participated in the interaction from the premises of City Montessori School, Lucknow. The outreach event in Lucknow was coordinated by ISRO’s Telemetry, Tracking and Command Network (ISTRAC) team.\nOn the sidelines of this event, students gathered at VSSC participated in interactive sessions with ISRO scientists and visited the Space Museum, gaining insights to ISRO’s achievements and future planned missions. Likewise, the students participated in interactive sessions with Director, ISTRAC, ISRO scientists and Gaganyatri Angad Pratap in Lucknow.\nThese events mark a significant moment in ISRO’s efforts on awareness of space activities in the younger generation which will drive them to take up challenging careers in the field of science & technology in future and contribute in realizing the vision of Viksit Bharat.",
    "date": "July 03, 2025"
  },
  {
    "id": "eb7628c8c1bd3f86dc013f833acb4eb296f325e3",
    "title": "Update on Microgravity Research Experiments onboard the International Space Station",
    "page_link": "https://www.isro.gov.in/Microgravity_Research_Experiments.html",
    "page_content": "July 03, 2025\nGaganyatri has successfully completed the microgravity experiment involving Tardigrades onboard ISS. The study focused on their survival, revival, and reproductive behaviour in space. This study will provide valuable insights into the underlying biological mechanisms leading to resilience of extremophile organisms in microgravity environment and has potential applications on Earth especially in the area of therapeutics.\nThe Myogenesis study, which explores the effects of microgravity on human muscle regeneration, is progressing with planned interventions and recording of observations as per the experiment protocol by Gaganyatri. In parallel, other Indian experiments for studying selected strains of microalgae and cyanobacteria under space conditions are ongoing, contributing to research on regenerative life support systems and crew nutrition.\nAs part of theElectronic Displayshuman research study, the Gaganyatri carried out daily software-based cognitive and interface assessments. The study aims to optimize crew interaction with digital systems in the unique environment of space.\nISRO aims to inspire students and the public by bringing the experience of space closer to Earth through its Outreach activities. Microgravity environment provides a great tool to demonstrate scientific principles. During this mission, the Gaganyatri is also conducting science demonstrations onboard the ISS, as part of ISRO’s planned scientific outreach activity.",
    "date": "July 03, 2025"
  },
  {
    "id": "83b5c671ac9e9cce4bd1573795249ad73f4ed00f",
    "title": "Ax-04 Mission Press Update",
    "page_link": "https://www.isro.gov.in/Ax-04_MissionUpdates_14062025.html",
    "page_content": "June 14, 2025\nDuring a follow-on coordination meeting between ISRO, Axiom Space, and  SpaceX, it was confirmed that the liquid oxygen leak observed in the  Falcon 9 launch vehicle has been successfully resolved.\nSeparately, Axiom Space informed that they are working closely with  NASA to assess the pressure anomaly in the Zvezda Service Module  onboard the International Space Station.\nAxiom Space is now working out a new date for the earliest possible launch of the Ax-04 mission.",
    "date": "June 14, 2025"
  }
]