[
  {
    "id": "2207676",
    "ministry": "President's Secretariat",
    "title": "PRESIDENT OF INDIA ADDRESSES IB CENTENARY ENDOWMENT LECTURE ON THE SUBJECT ‘PEOPLE-CENTRIC NATIONAL SECURITY: COMMUNITY PARTICIPATION IN BUILDING VIKSIT BHARAT’",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207676",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau President's Secretariat PRESIDENT OF INDIA ADDRESSES IB CENTENARY ENDOWMENT LECTURE ON THE SUBJECT ‘PEOPLE-CENTRIC NATIONAL SECURITY: COMMUNITY PARTICIPATION IN BUILDING VIKSIT BHARAT’ SECURITY IS AMONG THE KEY DRIVERS OF ECONOMIC INVESTMENT AND GROWTH: PRESIDENT DROUPADI MURMU BY PLACING CITIZEN WELFARE AND PUBLIC PARTICIPATION AT THE HEART OF OUR STRATEGY, WE CAN EMPOWER OUR CITIZENS TO BECOME EFFECTIVE SOURCES OF INTELLIGENCE AND SECURITY: PRESIDENT DROUPADI MURMU प्रविष्टि तिथि:\r\n                23 DEC 2025 1:45PM by PIB Delhi The President of India, Smt Droupadi Murmu, addressed the IB Centenary Endowment Lecture on the subject ‘People-Centric National Security: Community Participation in Building Viksit Bharat’ in New Delhi today (December 23, 2025). Speaking on the occasion, the President said that it is a matter of pride that after Independence, IB has been playing a stellar role in providing security to the people of India and assuring the unity and integrity of the Nation. The President said that the theme for this lecture ‘People-Centric National Security: Community Participation in Building Viksit Bharat’ is of immediate as well as long-term significance for our country. All institutions concerned, including IB, should spread awareness among our people that national security is the responsibility of every citizen. Alert citizens can provide formidable support to the efforts of government agencies engaged in national security. When organised as communities, our citizens can achieve great synergy and support the government’s initiatives for national security. Our Constitution enumerates the Fundamental Duties of citizens. Many of these duties relate to wider dimensions of national security. Students, teachers, media, resident welfare associations, civil society organizations and several other communities can propagate these duties. The President said that community participation strengthens national security. There are numerous examples of alert citizens helping professional forces with their inputs in averting security crises. An expanded meaning and strategy of national security places people at the centre. People need not be passive observers of what happens around them. They should become alert and active partners in the security of their own surroundings and also of regions beyond it. ‘Jan Bhagidari’ is the cornerstone of people-centric security. The President said that our civil police and internal security agencies have to work with the spirit of serving the people. This spirit of service will build trust among the people. This trust is a precondition of developing a people-centric national security strategy in which community participation will be a key element. The President said that India has been facing multi-dimensional security challenges and threats. Tensions in the border areas, terrorism and militancy, insurgency and communal radicalization have been traditional areas of security concern. In recent years, cybercrimes have emerged as a substantial security threat. She underlined that the lack of security in any part of the country has economic impact that goes beyond the affected area. Security is among the key drivers of economic investment and growth. Building ‘Surakshit Bharat’ is necessary for building ‘Samriddh Bharat’. The President noted that left-wing-extremism is close to total eradication. She stated that intensive action by forces and agencies engaged in the sphere of internal security has been a key element behind the near-eradication of left-wing-extremism. She noted that a holistic approach was adopted to win the trust of communities through several initiatives. Promoting socio-economic inclusion in tribal and remote areas has proved effective against exploitation of the people by left-wing-extremists and insurgent groups. The President said that social media has transformed the world of information and communication. It has the potential for both creation and destruction. Protecting people from misinformation is a very challenging task. This task must be carried out continuously and very effectively. There is a need to create a community of active social media users who consistently present fact-based narratives in the national interest. The President said that the most complex challenges to national security are non-traditional and digital in nature. Most of these problems originate from cutting-edge technologies. In this context, there is a need to develop technologically competent communities. The growing problem of digital fraud requires vigilance at the household, institutional, and community levels. Digital platforms can empower citizens to report phishing, digital fraud, and online abuse. They can provide real-time data to relevant agencies. By analyzing such real-time data, predictive policing models can be developed. Vigilant and competent communities of citizens will not only be less susceptible to cybercrimes but will also act as a firewall against such crimes. The President said that by placing citizen welfare and public participation at the heart of our strategy, we can empower our citizens to become effective sources of intelligence and security. This transformation, driven by public participation, will help address the complex, multifaceted security challenges of the 21st century. She expressed confidence that through public participation, we will all move rapidly towards building a vigilant, peaceful, secure and prosperous India. Please click here to see the President's Speech- **** MJPS/SR (रिलीज़ आईडी: 2207676) आगंतुक पटल  : 147 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu President's Secretariat PRESIDENT OF INDIA ADDRESSES IB CENTENARY ENDOWMENT LECTURE ON THE SUBJECT ‘PEOPLE-CENTRIC NATIONAL SECURITY: COMMUNITY PARTICIPATION IN BUILDING VIKSIT BHARAT’ SECURITY IS AMONG THE KEY DRIVERS OF ECONOMIC INVESTMENT AND GROWTH: PRESIDENT DROUPADI MURMU BY PLACING CITIZEN WELFARE AND PUBLIC PARTICIPATION AT THE HEART OF OUR STRATEGY, WE CAN EMPOWER OUR CITIZENS TO BECOME EFFECTIVE SOURCES OF INTELLIGENCE AND SECURITY: PRESIDENT DROUPADI MURMU प्रविष्टि तिथि:\r\n                        23 DEC 2025 1:45PM by PIB Delhi The President of India, Smt Droupadi Murmu, addressed the IB Centenary Endowment Lecture on the subject ‘People-Centric National Security: Community Participation in Building Viksit Bharat’ in New Delhi today (December 23, 2025). Speaking on the occasion, the President said that it is a matter of pride that after Independence, IB has been playing a stellar role in providing security to the people of India and assuring the unity and integrity of the Nation. The President said that the theme for this lecture ‘People-Centric National Security: Community Participation in Building Viksit Bharat’ is of immediate as well as long-term significance for our country. All institutions concerned, including IB, should spread awareness among our people that national security is the responsibility of every citizen. Alert citizens can provide formidable support to the efforts of government agencies engaged in national security. When organised as communities, our citizens can achieve great synergy and support the government’s initiatives for national security. Our Constitution enumerates the Fundamental Duties of citizens. Many of these duties relate to wider dimensions of national security. Students, teachers, media, resident welfare associations, civil society organizations and several other communities can propagate these duties. The President said that community participation strengthens national security. There are numerous examples of alert citizens helping professional forces with their inputs in averting security crises. An expanded meaning and strategy of national security places people at the centre. People need not be passive observers of what happens around them. They should become alert and active partners in the security of their own surroundings and also of regions beyond it. ‘Jan Bhagidari’ is the cornerstone of people-centric security. The President said that our civil police and internal security agencies have to work with the spirit of serving the people. This spirit of service will build trust among the people. This trust is a precondition of developing a people-centric national security strategy in which community participation will be a key element. The President said that India has been facing multi-dimensional security challenges and threats. Tensions in the border areas, terrorism and militancy, insurgency and communal radicalization have been traditional areas of security concern. In recent years, cybercrimes have emerged as a substantial security threat. She underlined that the lack of security in any part of the country has economic impact that goes beyond the affected area. Security is among the key drivers of economic investment and growth. Building ‘Surakshit Bharat’ is necessary for building ‘Samriddh Bharat’. The President noted that left-wing-extremism is close to total eradication. She stated that intensive action by forces and agencies engaged in the sphere of internal security has been a key element behind the near-eradication of left-wing-extremism. She noted that a holistic approach was adopted to win the trust of communities through several initiatives. Promoting socio-economic inclusion in tribal and remote areas has proved effective against exploitation of the people by left-wing-extremists and insurgent groups. The President said that social media has transformed the world of information and communication. It has the potential for both creation and destruction. Protecting people from misinformation is a very challenging task. This task must be carried out continuously and very effectively. There is a need to create a community of active social media users who consistently present fact-based narratives in the national interest. The President said that the most complex challenges to national security are non-traditional and digital in nature. Most of these problems originate from cutting-edge technologies. In this context, there is a need to develop technologically competent communities. The growing problem of digital fraud requires vigilance at the household, institutional, and community levels. Digital platforms can empower citizens to report phishing, digital fraud, and online abuse. They can provide real-time data to relevant agencies. By analyzing such real-time data, predictive policing models can be developed. Vigilant and competent communities of citizens will not only be less susceptible to cybercrimes but will also act as a firewall against such crimes. The President said that by placing citizen welfare and public participation at the heart of our strategy, we can empower our citizens to become effective sources of intelligence and security. This transformation, driven by public participation, will help address the complex, multifaceted security challenges of the 21st century. She expressed confidence that through public participation, we will all move rapidly towards building a vigilant, peaceful, secure and prosperous India. Please click here to see the President's Speech- **** MJPS/SR (रिलीज़ आईडी: 2207676)",
    "scraped_at": "2025-12-23T09:47:39.658946"
  },
  {
    "id": "2207694",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister shares an article on how India’s FTAs are part of a broader mission to strengthen the economy",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207694",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister shares an article on how India’s FTAs are part of a broader mission to strengthen the economy प्रविष्टि तिथि:\r\n                23 DEC 2025 2:58PM by PIB Delhi The Prime Minister, Shri Narendra Modi today shared an article written by Union Minister, Shri Piyush Goyal which explains that India’s FTAs today go well beyond tariff reductions, forming part of a broader mission to strengthen the economy and improve the lives of millions.\"He highlights that the India-New Zealand FTA is a historic milestone as it is India’s first women-led FTA. Almost the entire negotiating team comprised women\", Shri Modi stated. Responding to a post by Union Minister, Shri Piyush Goyal on X, Shri Modi said: \"In this insightful article, Union Minister Shri @PiyushGoyal explains that India’s FTAs today go well beyond tariff reductions, forming part of a broader mission to strengthen the economy and improve the lives of millions. He highlights that the India-New Zealand FTA is a historic milestone as it is India’s first women-led FTA. Almost the entire negotiating team comprised women.\" In this insightful article, Union Minister Shri @PiyushGoyal explains that India’s FTAs today go well beyond tariff reductions, forming part of a broader mission to strengthen the economy and improve the lives of millions. He highlights that the India-New Zealand FTA is a… https://t.co/sJIatUyCnB — PMO India (@PMOIndia) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207694) आगंतुक पटल  : 72 Prime Minister's Office Prime Minister shares an article on how India’s FTAs are part of a broader mission to strengthen the economy प्रविष्टि तिथि:\r\n                        23 DEC 2025 2:58PM by PIB Delhi The Prime Minister, Shri Narendra Modi today shared an article written by Union Minister, Shri Piyush Goyal which explains that India’s FTAs today go well beyond tariff reductions, forming part of a broader mission to strengthen the economy and improve the lives of millions.\"He highlights that the India-New Zealand FTA is a historic milestone as it is India’s first women-led FTA. Almost the entire negotiating team comprised women\", Shri Modi stated. Responding to a post by Union Minister, Shri Piyush Goyal on X, Shri Modi said: \"In this insightful article, Union Minister Shri @PiyushGoyal explains that India’s FTAs today go well beyond tariff reductions, forming part of a broader mission to strengthen the economy and improve the lives of millions. He highlights that the India-New Zealand FTA is a historic milestone as it is India’s first women-led FTA. Almost the entire negotiating team comprised women.\" In this insightful article, Union Minister Shri @PiyushGoyal explains that India’s FTAs today go well beyond tariff reductions, forming part of a broader mission to strengthen the economy and improve the lives of millions. He highlights that the India-New Zealand FTA is a… https://t.co/sJIatUyCnB — PMO India (@PMOIndia) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207694)",
    "scraped_at": "2025-12-23T09:47:41.267192"
  },
  {
    "id": "2207594",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister shares Sanskrit Subhashitam emphasising the importance of Farmers",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207594",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister shares Sanskrit Subhashitam emphasising the importance of Farmers प्रविष्टि तिथि:\r\n                23 DEC 2025 9:41AM by PIB Delhi The Prime Minister, Shri Narendra Modi, shared a Sanskrit Subhashitam- “सुवर्ण-रौप्य-माणिक्य-वसनैरपि पूरिताः। तथापि प्रार्थयन्त्येव कृषकान् भक्ततृष्णया।।” The Subhashitam conveys that even when possessing gold, silver, rubies, and fine clothes, people still have to depend on farmers for food. The Prime Minister wrote on X; “सुवर्ण-रौप्य-माणिक्य-वसनैरपि पूरिताः। तथापि प्रार्थयन्त्येव कृषकान् भक्ततृष्णया।।\" सुवर्ण-रौप्य-माणिक्य-वसनैरपि पूरिताः। तथापि प्रार्थयन्त्येव कृषकान् भक्ततृष्णया।। pic.twitter.com/C3DXH9O0a7 — Narendra Modi (@narendramodi) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207594) आगंतुक पटल  : 394 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Bengali , Assamese , Gujarati , Tamil , Telugu , Kannada , Malayalam Prime Minister's Office Prime Minister shares Sanskrit Subhashitam emphasising the importance of Farmers प्रविष्टि तिथि:\r\n                        23 DEC 2025 9:41AM by PIB Delhi The Prime Minister, Shri Narendra Modi, shared a Sanskrit Subhashitam- “सुवर्ण-रौप्य-माणिक्य-वसनैरपि पूरिताः। तथापि प्रार्थयन्त्येव कृषकान् भक्ततृष्णया।।” The Subhashitam conveys that even when possessing gold, silver, rubies, and fine clothes, people still have to depend on farmers for food. The Prime Minister wrote on X; “सुवर्ण-रौप्य-माणिक्य-वसनैरपि पूरिताः। तथापि प्रार्थयन्त्येव कृषकान् भक्ततृष्णया।।\" सुवर्ण-रौप्य-माणिक्य-वसनैरपि पूरिताः। तथापि प्रार्थयन्त्येव कृषकान् भक्ततृष्णया।। pic.twitter.com/C3DXH9O0a7 — Narendra Modi (@narendramodi) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207594)",
    "scraped_at": "2025-12-23T09:47:42.909363"
  },
  {
    "id": "2207593",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister pays tributes to former PM Chaudhary Charan Singh ji on his birth anniversary",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207593",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister pays tributes to former PM Chaudhary Charan Singh ji on his birth anniversary प्रविष्टि तिथि:\r\n                23 DEC 2025 9:39AM by PIB Delhi The Prime Minister, Shri Narendra Modi, has paid tributes to the former Prime Minister, Bharat Ratna Chaudhary Charan Singh ji on his birthday anniversary today. \"He dedicated his life to the welfare of the deprived sections of society as well as to the progress of agriculture and the prosperity of farmers. A grateful nation can never forget his contributions to nation-building\", Shri Modi said. The Prime Minister posted on X: \"पूर्व प्रधानमंत्री भारत रत्न चौधरी चरण सिंह जी को उनकी जयंती पर आदरपूर्ण श्रद्धांजलि। उन्होंने समाज के वंचित वर्गों के कल्याण के साथ-साथ कृषि की प्रगति और किसानों की समृद्धि के लिए अपना जीवन समर्पित कर दिया। राष्ट्र निर्माण में उनके योगदान को कृतज्ञ राष्ट्र कभी भुला नहीं सकता।\" पूर्व प्रधानमंत्री भारत रत्न चौधरी चरण सिंह जी को उनकी जयंती पर आदरपूर्ण श्रद्धांजलि। उन्होंने समाज के वंचित वर्गों के कल्याण के साथ-साथ कृषि की प्रगति और किसानों की समृद्धि के लिए अपना जीवन समर्पित कर दिया। राष्ट्र निर्माण में उनके योगदान को कृतज्ञ राष्ट्र कभी भुला नहीं सकता। pic.twitter.com/naGrTf5mVM — Narendra Modi (@narendramodi) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207593) आगंतुक पटल  : 318 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Manipuri , Bengali , Assamese , Gujarati , Tamil , Telugu , Kannada , Malayalam Prime Minister's Office Prime Minister pays tributes to former PM Chaudhary Charan Singh ji on his birth anniversary प्रविष्टि तिथि:\r\n                        23 DEC 2025 9:39AM by PIB Delhi The Prime Minister, Shri Narendra Modi, has paid tributes to the former Prime Minister, Bharat Ratna Chaudhary Charan Singh ji on his birthday anniversary today. \"He dedicated his life to the welfare of the deprived sections of society as well as to the progress of agriculture and the prosperity of farmers. A grateful nation can never forget his contributions to nation-building\", Shri Modi said. The Prime Minister posted on X: \"पूर्व प्रधानमंत्री भारत रत्न चौधरी चरण सिंह जी को उनकी जयंती पर आदरपूर्ण श्रद्धांजलि। उन्होंने समाज के वंचित वर्गों के कल्याण के साथ-साथ कृषि की प्रगति और किसानों की समृद्धि के लिए अपना जीवन समर्पित कर दिया। राष्ट्र निर्माण में उनके योगदान को कृतज्ञ राष्ट्र कभी भुला नहीं सकता।\" पूर्व प्रधानमंत्री भारत रत्न चौधरी चरण सिंह जी को उनकी जयंती पर आदरपूर्ण श्रद्धांजलि। उन्होंने समाज के वंचित वर्गों के कल्याण के साथ-साथ कृषि की प्रगति और किसानों की समृद्धि के लिए अपना जीवन समर्पित कर दिया। राष्ट्र निर्माण में उनके योगदान को कृतज्ञ राष्ट्र कभी भुला नहीं सकता। pic.twitter.com/naGrTf5mVM — Narendra Modi (@narendramodi) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207593)",
    "scraped_at": "2025-12-23T09:47:44.528126"
  },
  {
    "id": "2207687",
    "ministry": "Ministry of Defence",
    "title": "Raksha Mantri releases ‘Guide on Preparation of Detailed Project Reports for Road Infrastructure Projects’",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207687",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Defence Raksha Mantri releases ‘Guide on Preparation of Detailed Project Reports for Road Infrastructure Projects’ प्रविष्टि तिथि:\r\n                23 DEC 2025 2:38PM by PIB Delhi Raksha Mantri Shri Rajnath Singh released the ‘Guide on Preparation of Detailed Project Reports (DPRs) for Road Infrastructure Projects’ prepared by the Border Roads Organisation (BRO), in South Block, New Delhi on December 23, 2025. The BRO is entrusted with the construction and maintenance of highways & strategic roads in some of the most remote & challenging terrains of the country, and the DPRs serve as a comprehensive document covering engineering design, construction methodology, execution strategy, quality control & cost analysis. BRO has developed the guide to provide a concise, comprehensive and uniform reference encompassing specifications, standards, guidelines & procedures for DPR preparation. It is intended to assist engineers at every stage of project formulation, whether for new construction or upgradation of existing road infrastructure. The guide aims to address the issues of time and cost overruns arising from inadequately prepared DPRs. It is expected to significantly enhance the quality and consistency of the reports, ensuring timely execution of projects & contributing to improved strategic connectivity and socio-economic development of border regions through systematic planning, technical accuracy, quality assurance & cost-effectiveness. Chief of the Army Staff General Upendra Dwivedi, Defence Secretary Shri Rajesh Kumar Singh, Secretary, Ministry of Road Transport & Highways Shri V Umashankar, DG Border Roads Lt Gen Raghu Srinivasan, and other senior civil & military officials were present on the occasion. ***** SR/Savvy (रिलीज़ आईडी: 2207687) आगंतुक पटल  : 108 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu Ministry of Defence Raksha Mantri releases ‘Guide on Preparation of Detailed Project Reports for Road Infrastructure Projects’ प्रविष्टि तिथि:\r\n                        23 DEC 2025 2:38PM by PIB Delhi Raksha Mantri Shri Rajnath Singh released the ‘Guide on Preparation of Detailed Project Reports (DPRs) for Road Infrastructure Projects’ prepared by the Border Roads Organisation (BRO), in South Block, New Delhi on December 23, 2025. The BRO is entrusted with the construction and maintenance of highways & strategic roads in some of the most remote & challenging terrains of the country, and the DPRs serve as a comprehensive document covering engineering design, construction methodology, execution strategy, quality control & cost analysis. BRO has developed the guide to provide a concise, comprehensive and uniform reference encompassing specifications, standards, guidelines & procedures for DPR preparation. It is intended to assist engineers at every stage of project formulation, whether for new construction or upgradation of existing road infrastructure. The guide aims to address the issues of time and cost overruns arising from inadequately prepared DPRs. It is expected to significantly enhance the quality and consistency of the reports, ensuring timely execution of projects & contributing to improved strategic connectivity and socio-economic development of border regions through systematic planning, technical accuracy, quality assurance & cost-effectiveness. Chief of the Army Staff General Upendra Dwivedi, Defence Secretary Shri Rajesh Kumar Singh, Secretary, Ministry of Road Transport & Highways Shri V Umashankar, DG Border Roads Lt Gen Raghu Srinivasan, and other senior civil & military officials were present on the occasion. ***** SR/Savvy (रिलीज़ आईडी: 2207687)",
    "scraped_at": "2025-12-23T09:47:46.165106"
  },
  {
    "id": "2207631",
    "ministry": "Ministry of Defence",
    "title": "CISC underscores strategic importance of critical minerals for defence preparedness and Viksit Bharat 2047",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207631",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Defence CISC underscores strategic importance of critical minerals for defence preparedness and Viksit Bharat 2047 प्रविष्टि तिथि:\r\n                23 DEC 2025 11:37AM by PIB Delhi The Centre for Joint Warfare Studies (CENJOWS), in collaboration with IP Bazzaar, hosted Tech Talk, a high-level, closed-door roundtable discussion on the theme “Minerals That Matter: Geopolitics, Sovereignty & Value Chains” on 17 December 2025 in New Delhi. In his keynote address, Air Marshal Ashutosh Dixit, Chief of Integrated Defence Staff to Chairman Chiefs of Staff Committee (CISC) highlighted that critical minerals have emerged as a strategic enabler for national security, defence capability development, and technological sovereignty. He noted that modern defence systems including jet engines, missiles, precision munitions, radars, satellites, batteries, and semiconductors are intrinsically dependent on assured access to these minerals. Air Marshal Dixit emphasised that global supply chains for critical minerals are highly concentrated and increasingly subject to export controls and geopolitical pressures, making excessive import dependence a strategic vulnerability. He observed that self-reliant defence manufacturing and operational readiness are inseparable from secure and resilient mineral supply chains, aligned with India’s vision of Viksit Bharat 2047 and Aatmanirbhar Bharat. Addressing recent national efforts, the Air Marshal drew attention to India’s initiatives such as the identification of critical minerals, the establishment of the National Critical Mineral Mission, and the government’s push to enhance the entire value chain - from extraction to processing, manufacturing, and recycling. These efforts, he noted, are crucial for translating India’s policy intentions into concrete outcomes. As part of the event, he also inaugurated a collection of 30 technical reports on critical minerals, showcasing in-depth IP landscape studies and market analyses. The invitation-only forum convened senior policymakers, defence experts, industry leaders, technology innovators, academia, and intellectual property (IP) professionals to explore India’s strategic approach to critical minerals in the context of a rapidly evolving global environment. The event received the gracious best wishes of Shri G. Kishan Reddy, Minister of Coal and Mines, Government of India. ********* SR/Savvy (रिलीज़ आईडी: 2207631) आगंतुक पटल  : 273 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Defence CISC underscores strategic importance of critical minerals for defence preparedness and Viksit Bharat 2047 प्रविष्टि तिथि:\r\n                        23 DEC 2025 11:37AM by PIB Delhi The Centre for Joint Warfare Studies (CENJOWS), in collaboration with IP Bazzaar, hosted Tech Talk, a high-level, closed-door roundtable discussion on the theme “Minerals That Matter: Geopolitics, Sovereignty & Value Chains” on 17 December 2025 in New Delhi. In his keynote address, Air Marshal Ashutosh Dixit, Chief of Integrated Defence Staff to Chairman Chiefs of Staff Committee (CISC) highlighted that critical minerals have emerged as a strategic enabler for national security, defence capability development, and technological sovereignty. He noted that modern defence systems including jet engines, missiles, precision munitions, radars, satellites, batteries, and semiconductors are intrinsically dependent on assured access to these minerals. Air Marshal Dixit emphasised that global supply chains for critical minerals are highly concentrated and increasingly subject to export controls and geopolitical pressures, making excessive import dependence a strategic vulnerability. He observed that self-reliant defence manufacturing and operational readiness are inseparable from secure and resilient mineral supply chains, aligned with India’s vision of Viksit Bharat 2047 and Aatmanirbhar Bharat. Addressing recent national efforts, the Air Marshal drew attention to India’s initiatives such as the identification of critical minerals, the establishment of the National Critical Mineral Mission, and the government’s push to enhance the entire value chain - from extraction to processing, manufacturing, and recycling. These efforts, he noted, are crucial for translating India’s policy intentions into concrete outcomes. As part of the event, he also inaugurated a collection of 30 technical reports on critical minerals, showcasing in-depth IP landscape studies and market analyses. The invitation-only forum convened senior policymakers, defence experts, industry leaders, technology innovators, academia, and intellectual property (IP) professionals to explore India’s strategic approach to critical minerals in the context of a rapidly evolving global environment. The event received the gracious best wishes of Shri G. Kishan Reddy, Minister of Coal and Mines, Government of India. ********* SR/Savvy (रिलीज़ आईडी: 2207631)",
    "scraped_at": "2025-12-23T09:47:47.776996"
  },
  {
    "id": "2207615",
    "ministry": "Ministry of Defence",
    "title": "INDIAN NAVY’S PIONEERING STITCHED SAILING VESSEL – INSV KAUNDINYA TO EMBARK ON HER MAIDEN VOYAGE",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207615",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Defence INDIAN NAVY’S PIONEERING STITCHED SAILING VESSEL – INSV KAUNDINYA TO EMBARK ON HER MAIDEN VOYAGE Will symbolically retrace the historic maritime routes प्रविष्टि तिथि:\r\n                23 DEC 2025 11:09AM by PIB Delhi INSV Kaundinya, the Indian Navy’s pioneering stitched sailing vessel that revives India’s ancient shipbuilding and seafaring traditions, will undertake her maiden overseas voyage on 29 Dec 2025. The vessel will be flagged off from Porbandar, Gujarat, for Muscat, Oman, symbolically retracing the historic maritime routes that connected India with the wider Indian Ocean world for millennia. Inspired by depictions of ancient Indian ships and constructed entirely using traditional stitched-plank techniques, INSV Kaundinya represents a rare convergence of history, craftsmanship and modern naval expertise. Unlike contemporary vessels, her wooden planks are stitched together using coconut coir rope and sealed with natural resins, reflecting a shipbuilding tradition once prevalent along India’s coasts and across the Indian Ocean. This technology enabled Indian mariners to undertake long-distance voyages to West Asia, Africa and Southeast Asia long before the advent of modern navigation and metallurgy. ( https://www.pib.gov.in/PressReleasePage.aspx?PRID=2130294®=3&lang=2 ) The project was undertaken through a tripartite MoU between Ministry of Culture, Indian Navy and M/s Hodi Innovations as part of India’s efforts to rediscover and revive indigenous knowledge systems. Built by traditional artisans under the guidance of master shipwright Shri Babu Sankaran and supported by extensive research, design and testing by the Indian Navy and academic institutions, the vessel is fully seaworthy and capable of oceanic navigation. Named after the legendary mariner Kaundinya, who is believed to have sailed from India to Southeast Asia in ancient times, the ship embodies India’s historic role as a maritime nation. ______________________________________________________________ VM/SKY                                                                                                     280/25 (रिलीज़ आईडी: 2207615) आगंतुक पटल  : 431 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Marathi , Urdu , हिन्दी , Gujarati , Tamil Ministry of Defence INDIAN NAVY’S PIONEERING STITCHED SAILING VESSEL – INSV KAUNDINYA TO EMBARK ON HER MAIDEN VOYAGE Will symbolically retrace the historic maritime routes प्रविष्टि तिथि:\r\n                        23 DEC 2025 11:09AM by PIB Delhi INSV Kaundinya, the Indian Navy’s pioneering stitched sailing vessel that revives India’s ancient shipbuilding and seafaring traditions, will undertake her maiden overseas voyage on 29 Dec 2025. The vessel will be flagged off from Porbandar, Gujarat, for Muscat, Oman, symbolically retracing the historic maritime routes that connected India with the wider Indian Ocean world for millennia. Inspired by depictions of ancient Indian ships and constructed entirely using traditional stitched-plank techniques, INSV Kaundinya represents a rare convergence of history, craftsmanship and modern naval expertise. Unlike contemporary vessels, her wooden planks are stitched together using coconut coir rope and sealed with natural resins, reflecting a shipbuilding tradition once prevalent along India’s coasts and across the Indian Ocean. This technology enabled Indian mariners to undertake long-distance voyages to West Asia, Africa and Southeast Asia long before the advent of modern navigation and metallurgy. ( https://www.pib.gov.in/PressReleasePage.aspx?PRID=2130294®=3&lang=2 ) The project was undertaken through a tripartite MoU between Ministry of Culture, Indian Navy and M/s Hodi Innovations as part of India’s efforts to rediscover and revive indigenous knowledge systems. Built by traditional artisans under the guidance of master shipwright Shri Babu Sankaran and supported by extensive research, design and testing by the Indian Navy and academic institutions, the vessel is fully seaworthy and capable of oceanic navigation. Named after the legendary mariner Kaundinya, who is believed to have sailed from India to Southeast Asia in ancient times, the ship embodies India’s historic role as a maritime nation. ______________________________________________________________ VM/SKY                                                                                                     280/25 (रिलीज़ आईडी: 2207615)",
    "scraped_at": "2025-12-23T09:47:50.517644"
  },
  {
    "id": "2207641",
    "ministry": "Ministry of Finance",
    "title": "India and New Zealand conclude Free Trade Agreement Negotiations on Financial Services, a part of Annex to the Trade in Services Chapter",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207641",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Finance India and New Zealand conclude Free Trade Agreement Negotiations on Financial Services, a part of Annex to the Trade in Services Chapter Negotiations on financial services annex commenced in May 2025; Comprehensive financial services annex text evolved into 18 articles through India's constructive engagement, drawing from previous FTA experiences A forward-looking, balanced agreement to strengthen bilateral cooperation in financial services with innovative provisions on digital payments, fintech, data transfer and back-office services; potential to establish India as a fintech hub Market opportunities for Indian payment service providers to leverage India's technological expertise in digital payment systems such as UPI and NPCI Parity of treatment with New Zealand domestic institutions; facilitating market access for Indian banks, insurance companies and other financial service suppliers प्रविष्टि तिथि:\r\n                23 DEC 2025 12:01PM by PIB Delhi India and New Zealand have concluded negotiations on the Financial Services Annex of the India-New Zealand Free Trade Agreement (FTA) on 22 nd December,2025. This marks a significant milestone in strengthening bilateral economic and strategic cooperation. This landmark achievement was finalized during the last round of negotiations held on December 10, 2025. India and New Zealand share a robust commitment to strengthen bilateral cooperation in the financial services sector. Recognizing the significance of this relationship, both nations have worked collaboratively to develop a forward-looking, balanced and mutually beneficial agreement that will unlock enhanced opportunities for their respective financial services sectors. This FTA will provide the necessary institutional and regulatory framework to accelerate bilateral collaboration, facilitate market access and catalyze deeper integration of the two economies' financial systems. The India-New Zealand Financial Services Annex marks a notable advancement over standard GATS commitments, evolving to a total of 18 articles. The key achievements of Financial Services Annex include the following: Electronic Payments and Real-Time Transaction Infrastructure: India and NZ have committed to collaborate on developing domestic payments interoperability and supporting real-time cross-border remittances and merchant payments through integrated Fast Payment Systems (FPS). This provision directly strengthens India's digital payments ecosystem and fintech sector, enhances remittance flows from the Indian diaspora, creates market opportunities for Indian payment service providers and leverages India's technological expertise in digital payment systems such as UPI and NPCI. Financial Technology and Regulatory Innovation: India and NZ have committed to strengthen collaborative efforts in financial services innovation. The agreement includes specific provisions for learning from each other's Regulatory Sandbox and Digital Sandbox frameworks for cross-border applications. These provisions position India as a fintech hub within the bilateral partnership. Further it facilitates knowledge exchange and regulatory learning with a developed economy and create collaboration opportunities for Indian fintech companies while supporting India's regulatory sandbox initiatives. Transfer and Protection of Financial Information: India and NZ recognize each party's right to maintain legislative and regulatory requirements concerning the transfer, processing and storage of financial information, and aims to facilitate financial service suppliers to establish cross-border digital operations while ensuring complete regulatory control over data sovereignty and consumer privacy protections. Credit Rating and Non-Discrimination: Indian financial institutions are cushioned from arbitrary or discriminatory credit assessment practices in the New Zealand market. This provision ensures parity of treatment with New Zealand domestic institutions, facilitates market access for Indian banks, insurance companies, and other financial service suppliers, and prevents discriminatory regulatory treatment that could restrict Indian financial institutions' operational capabilities. Back-Office and Support Functions: In the financial services annex, India and NZ have committed to support the provision of back-office and financial services support functions. This will leverage India's world-leading information technology and business process services capabilities. This will enable cost-efficient delivery of financial services through centralized back-office operations in India, will also support growth in India's financial services, IT and business process outsourcing sectors. This demonstrates mutual recognition of India's critical infrastructure capacity for the bilateral financial services partnership. Increased FDI Investment limits and Bank Branches: The schedules of specific commitments reflect progressive collaboration among both sides, with comprehensive commitments on Market Access and National Treatment in key Banking and Insurance Sectors and Subsectors. India's sectoral offers represent a forward-looking liberalization approach, featuring enhanced Foreign Direct Investment (FDI) limits in banking and insurance, alongside a liberalized bank branch licensing framework allowing up to 15 bank branches to be established over a four-year period. This is a significant expansion from the previously offered GATS limits of 12 branches. These offers will enable Indian financial service suppliers to expand operations into New Zealand, strengthening India's position in financial services exports and cultivating progressive sectoral growth. They also position New Zealand’s financial institutions competitively in India's dynamic and rapidly expanding financial services market, while simultaneously reflecting India's commitment to progressive market liberalization in consonance with its broader strategic objectives. Overall, the conclusion of negotiations on the India-New Zealand Financial Services Annex underscores both governments' commitment to deepening the economic ties and harnessing mutual opportunities in the rapidly evolving financial services landscape. The agreement is forward-looking, balanced and designed to provide enhanced market access, regulatory clarity and cooperative frameworks that will benefit financial institutions and service providers from both countries. Currently, two Indian banks—Bank of Baroda and Bank of India—maintain subsidiary operations in New Zealand with a combined total of four branches while New Zealand currently has no banking or insurance presence in India, and no Indian insurance companies have established operations in New Zealand. This FTA, by establishing clear market access commitments, regulatory transparency and bilateral cooperation frameworks, will facilitate increased bilateral investment, institutional presence and services delivery. The agreement will serve as an important catalyst for broadening India's financial services presence in New Zealand and welcoming New Zealand financial institutions to India's growing and dynamic financial services markets. ***** NB/PK (रिलीज़ आईडी: 2207641) आगंतुक पटल  : 414 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी , Bengali , Gujarati Ministry of Finance India and New Zealand conclude Free Trade Agreement Negotiations on Financial Services, a part of Annex to the Trade in Services Chapter Negotiations on financial services annex commenced in May 2025; Comprehensive financial services annex text evolved into 18 articles through India's constructive engagement, drawing from previous FTA experiences A forward-looking, balanced agreement to strengthen bilateral cooperation in financial services with innovative provisions on digital payments, fintech, data transfer and back-office services; potential to establish India as a fintech hub Market opportunities for Indian payment service providers to leverage India's technological expertise in digital payment systems such as UPI and NPCI Parity of treatment with New Zealand domestic institutions; facilitating market access for Indian banks, insurance companies and other financial service suppliers प्रविष्टि तिथि:\r\n                        23 DEC 2025 12:01PM by PIB Delhi India and New Zealand have concluded negotiations on the Financial Services Annex of the India-New Zealand Free Trade Agreement (FTA) on 22 nd December,2025. This marks a significant milestone in strengthening bilateral economic and strategic cooperation. This landmark achievement was finalized during the last round of negotiations held on December 10, 2025. India and New Zealand share a robust commitment to strengthen bilateral cooperation in the financial services sector. Recognizing the significance of this relationship, both nations have worked collaboratively to develop a forward-looking, balanced and mutually beneficial agreement that will unlock enhanced opportunities for their respective financial services sectors. This FTA will provide the necessary institutional and regulatory framework to accelerate bilateral collaboration, facilitate market access and catalyze deeper integration of the two economies' financial systems. The India-New Zealand Financial Services Annex marks a notable advancement over standard GATS commitments, evolving to a total of 18 articles. The key achievements of Financial Services Annex include the following: Electronic Payments and Real-Time Transaction Infrastructure: India and NZ have committed to collaborate on developing domestic payments interoperability and supporting real-time cross-border remittances and merchant payments through integrated Fast Payment Systems (FPS). This provision directly strengthens India's digital payments ecosystem and fintech sector, enhances remittance flows from the Indian diaspora, creates market opportunities for Indian payment service providers and leverages India's technological expertise in digital payment systems such as UPI and NPCI. Financial Technology and Regulatory Innovation: India and NZ have committed to strengthen collaborative efforts in financial services innovation. The agreement includes specific provisions for learning from each other's Regulatory Sandbox and Digital Sandbox frameworks for cross-border applications. These provisions position India as a fintech hub within the bilateral partnership. Further it facilitates knowledge exchange and regulatory learning with a developed economy and create collaboration opportunities for Indian fintech companies while supporting India's regulatory sandbox initiatives. Transfer and Protection of Financial Information: India and NZ recognize each party's right to maintain legislative and regulatory requirements concerning the transfer, processing and storage of financial information, and aims to facilitate financial service suppliers to establish cross-border digital operations while ensuring complete regulatory control over data sovereignty and consumer privacy protections. Credit Rating and Non-Discrimination: Indian financial institutions are cushioned from arbitrary or discriminatory credit assessment practices in the New Zealand market. This provision ensures parity of treatment with New Zealand domestic institutions, facilitates market access for Indian banks, insurance companies, and other financial service suppliers, and prevents discriminatory regulatory treatment that could restrict Indian financial institutions' operational capabilities. Back-Office and Support Functions: In the financial services annex, India and NZ have committed to support the provision of back-office and financial services support functions. This will leverage India's world-leading information technology and business process services capabilities. This will enable cost-efficient delivery of financial services through centralized back-office operations in India, will also support growth in India's financial services, IT and business process outsourcing sectors. This demonstrates mutual recognition of India's critical infrastructure capacity for the bilateral financial services partnership. Increased FDI Investment limits and Bank Branches: The schedules of specific commitments reflect progressive collaboration among both sides, with comprehensive commitments on Market Access and National Treatment in key Banking and Insurance Sectors and Subsectors. India's sectoral offers represent a forward-looking liberalization approach, featuring enhanced Foreign Direct Investment (FDI) limits in banking and insurance, alongside a liberalized bank branch licensing framework allowing up to 15 bank branches to be established over a four-year period. This is a significant expansion from the previously offered GATS limits of 12 branches. These offers will enable Indian financial service suppliers to expand operations into New Zealand, strengthening India's position in financial services exports and cultivating progressive sectoral growth. They also position New Zealand’s financial institutions competitively in India's dynamic and rapidly expanding financial services market, while simultaneously reflecting India's commitment to progressive market liberalization in consonance with its broader strategic objectives. Overall, the conclusion of negotiations on the India-New Zealand Financial Services Annex underscores both governments' commitment to deepening the economic ties and harnessing mutual opportunities in the rapidly evolving financial services landscape. The agreement is forward-looking, balanced and designed to provide enhanced market access, regulatory clarity and cooperative frameworks that will benefit financial institutions and service providers from both countries. Currently, two Indian banks—Bank of Baroda and Bank of India—maintain subsidiary operations in New Zealand with a combined total of four branches while New Zealand currently has no banking or insurance presence in India, and no Indian insurance companies have established operations in New Zealand. This FTA, by establishing clear market access commitments, regulatory transparency and bilateral cooperation frameworks, will facilitate increased bilateral investment, institutional presence and services delivery. The agreement will serve as an important catalyst for broadening India's financial services presence in New Zealand and welcoming New Zealand financial institutions to India's growing and dynamic financial services markets. ***** NB/PK (रिलीज़ आईडी: 2207641)",
    "scraped_at": "2025-12-23T09:47:52.149953"
  },
  {
    "id": "2207628",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister and Minister of Cooperation Shri Amit Shah pays tribute to Swami Shraddhanand on his Balidaan Diwas",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207628",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah pays tribute to Swami Shraddhanand on his Balidaan Diwas Swami Shraddhanand Saraswati Ji contributed to Swaraj and Indian culture equally and fought against social maladies throughout his life He played an unforgettable role in promoting women's education and the Indian intellectual tradition प्रविष्टि तिथि:\r\n                23 DEC 2025 11:33AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah paid tribute to Swami Shraddhanand on his Balidaan Diwas. In a post on ‘X’, Union Home Minister Shri Amit Shah said Swami Shraddhanand Saraswati Ji contributed to Swaraj and Indian culture equally and fought against social maladies throughout his life. Shri Shah said that he played an unforgettable role in promoting women's education and the Indian intellectual tradition. Tribute to Swami Shraddhanand Ji on his Balidaan Diwas. स्वराज व स्वसंस्कृति की दिशा में समानांतर योगदान देने वाले स्वामी श्रद्धानंद सरस्वती जी ने सामाजिक कुरीतियों के विरुद्ध आजीवन संघर्ष किया। उन्होंने नारी शिक्षा व भारतीय ज्ञान-परंपरा को बढ़ावा देने में अविस्मरणीय भूमिका निभाई। स्वामी श्रद्धानंद जी को उनके बलिदान दिवस पर नमन करता… pic.twitter.com/nWAeTSQZme — Amit Shah (@AmitShah) December 23, 2025 *** RK / RR / PS (रिलीज़ आईडी: 2207628) आगंतुक पटल  : 192 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Bengali , Gujarati , Telugu , Kannada , Malayalam Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah pays tribute to Swami Shraddhanand on his Balidaan Diwas Swami Shraddhanand Saraswati Ji contributed to Swaraj and Indian culture equally and fought against social maladies throughout his life He played an unforgettable role in promoting women's education and the Indian intellectual tradition प्रविष्टि तिथि:\r\n                        23 DEC 2025 11:33AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah paid tribute to Swami Shraddhanand on his Balidaan Diwas. In a post on ‘X’, Union Home Minister Shri Amit Shah said Swami Shraddhanand Saraswati Ji contributed to Swaraj and Indian culture equally and fought against social maladies throughout his life. Shri Shah said that he played an unforgettable role in promoting women's education and the Indian intellectual tradition. Tribute to Swami Shraddhanand Ji on his Balidaan Diwas. स्वराज व स्वसंस्कृति की दिशा में समानांतर योगदान देने वाले स्वामी श्रद्धानंद सरस्वती जी ने सामाजिक कुरीतियों के विरुद्ध आजीवन संघर्ष किया। उन्होंने नारी शिक्षा व भारतीय ज्ञान-परंपरा को बढ़ावा देने में अविस्मरणीय भूमिका निभाई। स्वामी श्रद्धानंद जी को उनके बलिदान दिवस पर नमन करता… pic.twitter.com/nWAeTSQZme — Amit Shah (@AmitShah) December 23, 2025 *** RK / RR / PS (रिलीज़ आईडी: 2207628)",
    "scraped_at": "2025-12-23T09:47:54.455870"
  },
  {
    "id": "2207625",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister Shri Amit Shah pays tribute to former Prime Minister, a great leader of the farmers and Bharat Ratna Chaudhary Charan Singh Ji on his birth anniversary",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207625",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister Shri Amit Shah pays tribute to former Prime Minister, a great leader of the farmers and Bharat Ratna Chaudhary Charan Singh Ji on his birth anniversary Chaudhary Charan Singh's life was dedicated to the upliftment of the agricultural system, the welfare of farmers and social service He courageously placed farmers and agriculture at the center of governance and also played a significant role in overthrowing the Emergency and the dictatorial regime प्रविष्टि तिथि:\r\n                23 DEC 2025 11:27AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah paid tribute to former Prime Minister, great farmer leader and Bharat Ratna Chaudhary Charan Singh on his birth anniversary. In a post on ‘X’, Union Home Minister Shri Amit Shah said, tribute to former Prime Minister, a great leader of the farmers and Bharat Ratna Chaudhary Charan Singh Ji on his birth anniversary. He said that Chaudhary Charan Singh's life was dedicated to the upliftment of the agricultural system, the welfare of farmers and social service. Shri Shah said that he courageously placed farmers and agriculture at the center of governance and also played a significant role in overthrowing the Emergency and the dictatorial regime. पूर्व प्रधानमंत्री, महान किसान नेता, भारत रत्न चौधरी चरण सिंह जी को उनकी जयंती पर नमन करता हूँ। चौधरी चरण सिंह जी का जीवन कृषि व्यवस्था के उत्थान, किसानों के कल्याण और समाजसेवा को समर्पित रहा था। उन्होंने किसान और किसानी को शासन के केंद्र में स्थापित करने का साहसिक कार्य किया।… pic.twitter.com/nbOGMnexqh — Amit Shah (@AmitShah) December 23, 2025 *** RK / RR / PS (रिलीज़ आईडी: 2207625) आगंतुक पटल  : 156 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Bengali , Gujarati , Kannada , Malayalam Ministry of Home Affairs Union Home Minister Shri Amit Shah pays tribute to former Prime Minister, a great leader of the farmers and Bharat Ratna Chaudhary Charan Singh Ji on his birth anniversary Chaudhary Charan Singh's life was dedicated to the upliftment of the agricultural system, the welfare of farmers and social service He courageously placed farmers and agriculture at the center of governance and also played a significant role in overthrowing the Emergency and the dictatorial regime प्रविष्टि तिथि:\r\n                        23 DEC 2025 11:27AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah paid tribute to former Prime Minister, great farmer leader and Bharat Ratna Chaudhary Charan Singh on his birth anniversary. In a post on ‘X’, Union Home Minister Shri Amit Shah said, tribute to former Prime Minister, a great leader of the farmers and Bharat Ratna Chaudhary Charan Singh Ji on his birth anniversary. He said that Chaudhary Charan Singh's life was dedicated to the upliftment of the agricultural system, the welfare of farmers and social service. Shri Shah said that he courageously placed farmers and agriculture at the center of governance and also played a significant role in overthrowing the Emergency and the dictatorial regime. पूर्व प्रधानमंत्री, महान किसान नेता, भारत रत्न चौधरी चरण सिंह जी को उनकी जयंती पर नमन करता हूँ। चौधरी चरण सिंह जी का जीवन कृषि व्यवस्था के उत्थान, किसानों के कल्याण और समाजसेवा को समर्पित रहा था। उन्होंने किसान और किसानी को शासन के केंद्र में स्थापित करने का साहसिक कार्य किया।… pic.twitter.com/nbOGMnexqh — Amit Shah (@AmitShah) December 23, 2025 *** RK / RR / PS (रिलीज़ आईडी: 2207625)",
    "scraped_at": "2025-12-23T09:47:56.067094"
  },
  {
    "id": "2207690",
    "ministry": "PIB Headquarters",
    "title": "Industrial Parks Facilitating Smarter Infrastructure and Stronger Industrial Growth",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207690",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters Industrial Parks Facilitating Smarter Infrastructure and Stronger Industrial Growth प्रविष्टि तिथि:\r\n                23 DEC 2025 2:50PM by PIB Delhi Key Takeaways India has 4500+ industrial parks mapped on the India Industrial Land Bank, spanning 7.70 lakh hectares , with 1.35 lakh hectares still available. 306 plug-and-play parks and 20 National Industrial Corridor Development Corporation Limited (NICDC)-led parks/smart cities. The Industrial Park Rating System (IPRS) 3.0 brings a sharper focus on sustainability, green infrastructure, logistics, digitalization, skill linkages, and tenant feedback. Introduction Industrial parks have emerged as a principal vehicle for accelerating the country’s industry and innovation agenda. Developed in partnership with state governments and the private sector, these parks are reinforcing India’s industrial base by promoting investment, progress-driven development, and economic ascendancy. They stimulate employment generation while also encouraging sustainable development. As the government increasingly adopts the role of facilitator rather than regulator, these parks are sculpting a globally competitive industrial economy in India. Industrial Parks Empowering Competitive and Viable Growth An industrial park refers to a planned tract of land that is subdivided and developed for industrial use, with or without ready-built factories, and supported by shared facilities for multiple industries. These parks form an essential institutional foundation and act as policy instruments that advance national economic development goals by increasing industrial output and strengthening the pace of economic progression. Industrial Parks balance economic growth with environmental and social responsibility . Park management ensures adherence to environmental laws , spreads awareness on standards, and rewards companies that follow eco-friendly practices. They support resource efficiency by guiding firms on improved technologies and conducting audits to identify savings. Emissions are regularly monitored to control air, noise, and light pollution, while strict oversight prevents soil and groundwater contamination . Biodiversity protection is built into planning to safeguard ecosystem services, manage climate risks, and use land efficiently. These parks also strengthen social well-being . They provide social infrastructure for employees and nearby communities, along with safe accommodation where necessary. Security systems protect workers and assets across the industrial area. Health and safety are promoted through medical checks, protective equipment, and monitoring of exposure levels. Gender-sensitive facilities and workplace inclusion ensure equitable participation. Openness to trade unions and civil society engagement helps improve labour conditions, transparency, and community trust. Building Blocks of a Successful Industrial Park: Special regulatory regime - Industrial parks operate under liberal and incentive-based rules for labour, land use, and foreign investment. Integrated infrastructure - They offer shared hard and soft facilities such as utilities, telecom networks, waste systems, laboratories, internal roads, one-stop clearances, training centres, security, and emergency services. Defined geography - Development takes place on clearly demarcated, master-planned land with uniform standards for buildings and facilities. Dedicated management - A single authority oversees firm entry, ensures regulatory compliance, and drives long-term park development. Multi-tenant clusters - Multiple firms operate within the park, collaborate, share resources, and enhance productivity through agglomeration and clustering effects. Industrial Parks Fuelling Economic Evolution : Economic efficiency - Industrial parks integrate scarce factors of production within defined geographic zones, generating higher productivity and operational efficiency. Employment and skills development - They create jobs, improve wages, and strengthen the local talent base. Capital and technology attraction - Parks draw investment and advanced technologies while enabling technology and managerial knowledge transfer. Industrial upgrading and competitiveness - Clustered industrial activity stimulates upgrading, enhances national competitiveness, and deepens global value chain integration. Policy incentives - Local, provincial, and national policies accelerate industrial growth and reinforce the gains generated by parks. Urban and regional development - Industrial parks act as catalysts for economic expansion and sustainable progress in host cities and regions. Planning and Establishment of Industrial Parks The incorporation of Industrial Parks is undertaken based on a business case that outlines the need for serviced industrial land and the anticipated economic and developmental benefits upon project completion. Following the preparation of the business case, pre-feasibility studies are carried out to evaluate potential sites for establishing an Industrial Park. These studies assess market suitability , connectivity to transport networks , availability of power and water , and overall cost viability . They also identify the sectoral opportunities likely to be attracted to the proposed park through an analysis of sector competitiveness , estimates of investment and industrial land demand , infrastructure and service requirements , and the expected scale of project costs and revenues . Subsequent assessments include financial analysis , policy analysis and stakeholder mapping , safeguards review , and economic impact projections . A final decision to establish and finance an Industrial Park is taken only after a comprehensive, site-specific feasibility study is completed, with conclusions that clearly support project viability. Government Initiatives Revitalizing the Industrial Parks' Ecosystem Several initiatives and platforms are shaping India’s industrial parks' growth and streamlining land access, accelerating industrial development, and supporting investor decision-making. Plug-And-Play Industrial Parks In the Union Budget 2025-26, Rs. 2,500 crores have been allocated for the development of plug-and-play industrial parks . By providing infrastructure that is precision-designed to industry needs, the plug-and-play parks enhance operational efficiency and sustainability. There are currently 306 plug-and-play industrial parks in India , and an additional 20 plug-and-play industrial parks and smart cities are being developed under the National Industrial Corridor Development Corporation (NICDC). Four projects have been completed, four are currently under construction, while the rest are advancing through different phases of bidding and tendering. India Industrial Land Bank (IILB): The Department for Promotion of Industry and Internal Trade (DPIIT) developed the India Industrial Land Bank (IILB) , a centralized Geographic Information System (GIS)-enabled platform that offers up-to-date, spatial and non-spatial information on industrial land across the country. Formerly known as the Industrial Information System, the IILB serves as a one-stop repository for 4,523 industrial parks , mapped across a total area of approximately 7.70 lakh hectares . Of this, nearly 1.35 lakh hectares of land is currently available for industrial development. These parks collectively comprise more than 6.45 lakh plots , with over 1.25 lakh plots currently vacant (as on 23rd December, 2025), presenting significant opportunities for new investments in manufacturing, logistics, and allied sectors. Overview of Industrial Parks and Associated Land Area Across Indian States and UTs (as on 23rd December, 2025): State No. of Industrial Parks Total Land Area (Hectares) Land Available (Hectares) Andaman & Nicobar 6 35 8 Andhra Pradesh 638 110595 10747 Arunachal Pradesh 18 741 248 Assam 56 43497 486 Bihar 82 4139 649 Chandigarh 7 352 32 Chhattisgarh 114 22972 2574 Dadra & Nagar Haveli 5 119 50 Daman & Diu 5 57 0 Delhi 68 7017 976 Goa 22 1699 102 Gujarat 285 193975 12605 Haryana 51 9597 11661 Himachal Pradesh 64 960 185 Jammu & Kashmir 137 2841 264 Jharkhand 158 8194 1734 Karnataka 384 35910 3568 Kerala 140 6658 1292 Ladakh UT 8 33 2 Lakshadweep 9 2 1 Madhya Pradesh 144 23217 2916 Maharashtra 523 81308 19658 Manipur 7 36 13 Meghalaya 9 235 5 Mizoram 8 381 240 Nagaland 6 282 19 Odisha 146 72600 2744 Puducherry 11 658 0 Punjab 100 6331 2008 Rajasthan 420 33578 11655 Sikkim 5 20 3 Tamil Nadu 372 30772 16291 Telangana 157 32033 30749 Tripura 20 1828 623 Uttar Pradesh 286 33327 1320 Uttarakhand 35 3814 332 West Bengal 17 490 61 Grand Total 4523 770303 135821 Source: India Industrial Land Bank (IILB), Department for Promotion of Industry and Internal Trade, Ministry of Commerce and Industry, Government of India Industrial Park Rating System (IPRS): The Industrial Park Rating System (IPRS) is a comprehensive framework for assessing the performance and quality of industrial parks and business districts in India. Built on four assessment pillars, it provides valuable insights to investors, developers, and policymakers while encouraging park authorities to improve services and infrastructure. By promoting continuous improvement, the IPRS drives innovation, efficiency, sustainability, and ease of doing business. Its feedback reports serve as actionable roadmaps for infrastructure upgrades and service enhancement, while its collaborative approach promotes knowledge sharing and sector-wide growth beyond conventional rankings. According to the IPRS 2.0 Top Rated Parks Report , a total of 41 industrial parks have been classified under the ‘Leaders’ category, representing high-performing parks with strong infrastructure, resilient industrial activity, and a well-established mix of sector-specific and multi-sector facilities. Further, 90 industrial parks have been identified as ‘Challengers’, representing parks that have shown substantial growth momentum. These parks display improving infrastructure and operational performance and are well-positioned to advance into the top tier with focused development initiatives. In addition, 185 industrial parks have been recognised as ‘Aspirers’, indicating parks that hold significant potential for future development. These parks are in earlier stages of growth and stand to benefit from targeted support to strengthen their infrastructure, services, and operational maturity. These rankings, based on key performance indicators, provide investors with transparent insights, promote healthy competition among States and Union Territories, and support evidence-based policymaking. In September 2025, the Industrial Park Rating System (IPRS) 3.0 was launched to further strengthen India’s industrial ecosystem and enhance the competitiveness of its infrastructure. Building on the pilot phase (2018) and IPRS 2.0 (2021), this edition features an expanded framework with new parameters such as sustainability, green infrastructure, logistics connectivity, digitalization, skill linkages, and tenant feedback. Ease of Doing Business Reforms: India has strengthened the ease of doing business by supporting domestic and international investors, with industrial parks becoming central to attracting investment and meeting large-scale employment needs, as improved internal infrastructure has raised occupancy rates and stimulated economic growth. Investors can remotely evaluate suitable land parcels using detailed information on infrastructure, connectivity, business support services, and environmental and safety standards, thereby enabling well-informed investment decisions. National Business Reforms Action Plan (BRAP), 2014 - Accelerated improvements across key reform areas, including Information Wizard, Single Window Systems, Online Building Permission System, Inspection Reforms, and Labour Reforms. One District One Product (ODOP) initiative - Promoted district-specific products and strengthened local enterprises across the country. Goods and Services Tax (GST) - Unified multiple indirect taxes, such as excise duty and service tax, into a streamlined and transparent national tax framework. Startup India - Under the Startup India initiative, eligible companies can obtain DPIIT recognition to access a host of benefits, including tax incentives, simplified compliance, and fast-tracking of Intellectual Property Rights (IPR)-related processes. Remission of Duties and Taxes on Exported Products (RoDTEP) scheme - Encouraged entrepreneurship and enhanced the attractiveness and competitiveness of Indian exports. Compliance and legal burden reduction - Decriminalised 3,700 legal provisions and reduced more than 42,000 compliances to build a predictable, transparent, and business-friendly regulatory landscape. Industrial Parks as Engines of FDI India ranks among the world’s top 5 destinations for international project finance deals and Greenfield Project Investments , according to the United Nations Conference on Trade and Development (UNCTAD) 2025 World Investment Report. Foreign Direct Investment (FDI) inflows have continued on a mounting trajectory. During the April-August 2025-26, total FDI inflows reached USD 43.76 billion (provisional), compared with USD 37.03 billion in the corresponding period of FY 2024-25. Industrial parks play a critical role in stimulating a country’s economic development by attracting FDIs and domestic capital, enhancing industrial performance, strengthening value chains, and expanding employment opportunities. They also support export-led growth and improve enterprise capabilities by enabling knowledge exchange and technology diffusion. Enhanced FDI strengthens the development of industrial parks that align with national strategies. Supported by comprehensive feasibility studies and enabling policies, these platforms are significantly enhancing the investment environment, deepening regional value chains, and attracting higher levels of foreign capital. Conclusion India’s evolving industrial policy landscape embodies a decisive transition towards industrial promotion , with industrial parks placed at the forefront of this evolution. Their planned design , shared infrastructure, and coordinated governance structure create afacilitating environment that strengthens productivity , technology transfer, and employment generation . To reinforce this accelerating trajectory, the Government of India has prioritised the development of plug-and-play industrial parks , enhanced digital land access systems through the India Industrial Land Bank (IILB), and institutionalised quality benchmarks through the Industrial Park Rating System (IPRS) , affirming a sustained commitment to industrial excellence . Complemented by wide-ranging ease of doing business reforms and a predictable regulatory climate , these initiatives have significantly motivated investor confidence and expanded opportunities for domestic and foreign investment . As India’s industrial parks increasingly align with global best practices and sustainability standards , they are expected to fortify regional value chains and integrate India more competitively into global manufacturing networks . At the same time, the Government recognises that the global industrial landscape is evolving with intensifying competition for FDI, and a worldwide shift toward a circular and green economy . Remaining relevant in this environment, India’s industrial parks are continuously upgrading their infrastructure , services, and market offerings . Through these concerted measures, the Government of India is carving an industrial ecosystem that is inclusive and globally recognised . The Government remains firmly committed to ensuring that industrial parks evolve in step with international standards , advocate sustainability-driven growth, and emerge as enduring engines of industrial prowess and economic strength . References Asian Development Bank https://www.adb.org/sites/default/files/publication/1036336/adb-brief-337-india-industrial-park-rating-system.pdf Department for Promotion of Industry and Internal Trade (DPIIT) https://master-dpiit.digifootprint.gov.in/static/uploads/2025/07/312ed7e5cf365de339c227c53f851591.pdf https://www.dpiit.gov.in/ministry/about-us/details/Title=Ease-of-Doing-Business-(EODB)-ITMwETMtQWa https://www.dpiit.gov.in/static/uploads/2025/06/9900260e5d2ed688900dce995ec501d9.pdf https://www.dpiit.gov.in/static/uploads/2025/06/3d9c9c2daeefb97bb9ce964370938b71.pdf Government of United Kingdom https://assets.publishing.service.gov.uk/media/5c6ac4d8e5274a72c19f7c85/322_Environmental_Safeguards_for_Industrial_Parks.pdf India Industrial Land Bank (IILB) https://indiaindustriallandbank.gov.in/secrpturl_pub?valid=+9K3K3E20706c75675f706c61793d2759657327&fld= https://indiaindustriallandbank.gov.in/exploreParkReport https://indiaindustriallandbank.gov.in/login1 https://indiaindustriallandbank.gov.in/IPRS20TopRatedParks https://indiaindustriallandbank.gov.in/userManual/Approved_Rapporteur_by__SIIT_1.pdf Invest India https://www.investindia.gov.in/blogs/business-friendly-reforms-indias-path-prosperity https://www.investindia.gov.in/team-india-blogs/industrial-park-rating-system-ipr-enhancing-industrial-competitiveness-and https://www.investindia.gov.in/blogs/smart-cities-smart-growth Ministry of Commerce & Industry https://sansad.in/getFile/loksabhaquestions/annex/184/AU2958_F5PrLx.pdf?source=pqals Ministry of Finance https://www.indiabudget.gov.in/budget2020-21/economicsurvey/doc/vol2chapter/echap08_vol2.pdf Press Information Bureau https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1761135&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2168994 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2108360 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2131716 Startup India https://www.startupindia.gov.in/ United Nations https://www.un.org/esa/sustdev/publications/industrial_development/3_1.pdf United Nations Conference on Trade and Development (UNCTAD) https://unctad.org/system/files/official-document/wir2025_en.pdf United Nations Development Programme (UNDP) https://www.undp.org/sites/g/files/zskgke326/files/2024-04/ethiopia_the_role_of_industry_parks_in_the_local_economy_final_2024.pdf United Nations Industrial Development Organization (UNIDO) https://www.unido.org/sites/default/files/files/2019-11/International_Guidelines_for_Industrial_Parks.pdf https://ipp.unido.org/industrial-parks-overview https://www.unido.org/sites/default/files/files/2020-11/EN_Experiences_and_Best_Practices_of_Industrial_Park_Development_in_China.pdf https://ipp.unido.org/sites/default/files/knowledge/2022-06/English_0.pdf https://www.unido.org/sites/default/files/files/2020-05/International_Guidelines_for_Industrial_Parks_EN.pdf https://www.unido.org/sites/default/files/unido-publications/2025-09/Financing%20Industries%20for%20Development_05Sept2025.pdf https://unido-virtualexhibition.org/wp-content/uploads/2019/10/Industrial-Parks-ENGLISH-digital.pdf World Bank https://documents1.worldbank.org/curated/en/099050625181538675/pdf/P179257-6da51be4-c3aa-4c36-820e-bede678ffd62.pdf https://openknowledge.worldbank.org/server/api/core/bitstreams/d38f8a76-27d5-58fc-a998-c86508b7612c/content https://documents1.worldbank.org/curated/en/747791476867738472/pdf/ACS8954-v2-REVISED-PUBLIC-TheCompetitiveAdvantageofSouthAsia.pdf Click here to see in PDF PIB Research (रिलीज़ आईडी: 2207690) आगंतुक पटल  : 56 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी PIB Headquarters Industrial Parks Facilitating Smarter Infrastructure and Stronger Industrial Growth प्रविष्टि तिथि:\r\n                        23 DEC 2025 2:50PM by PIB Delhi Key Takeaways India has 4500+ industrial parks mapped on the India Industrial Land Bank, spanning 7.70 lakh hectares , with 1.35 lakh hectares still available. 306 plug-and-play parks and 20 National Industrial Corridor Development Corporation Limited (NICDC)-led parks/smart cities. The Industrial Park Rating System (IPRS) 3.0 brings a sharper focus on sustainability, green infrastructure, logistics, digitalization, skill linkages, and tenant feedback. Introduction Industrial parks have emerged as a principal vehicle for accelerating the country’s industry and innovation agenda. Developed in partnership with state governments and the private sector, these parks are reinforcing India’s industrial base by promoting investment, progress-driven development, and economic ascendancy. They stimulate employment generation while also encouraging sustainable development. As the government increasingly adopts the role of facilitator rather than regulator, these parks are sculpting a globally competitive industrial economy in India. Industrial Parks Empowering Competitive and Viable Growth An industrial park refers to a planned tract of land that is subdivided and developed for industrial use, with or without ready-built factories, and supported by shared facilities for multiple industries. These parks form an essential institutional foundation and act as policy instruments that advance national economic development goals by increasing industrial output and strengthening the pace of economic progression. Industrial Parks balance economic growth with environmental and social responsibility . Park management ensures adherence to environmental laws , spreads awareness on standards, and rewards companies that follow eco-friendly practices. They support resource efficiency by guiding firms on improved technologies and conducting audits to identify savings. Emissions are regularly monitored to control air, noise, and light pollution, while strict oversight prevents soil and groundwater contamination . Biodiversity protection is built into planning to safeguard ecosystem services, manage climate risks, and use land efficiently. These parks also strengthen social well-being . They provide social infrastructure for employees and nearby communities, along with safe accommodation where necessary. Security systems protect workers and assets across the industrial area. Health and safety are promoted through medical checks, protective equipment, and monitoring of exposure levels. Gender-sensitive facilities and workplace inclusion ensure equitable participation. Openness to trade unions and civil society engagement helps improve labour conditions, transparency, and community trust. Building Blocks of a Successful Industrial Park: Special regulatory regime - Industrial parks operate under liberal and incentive-based rules for labour, land use, and foreign investment. Integrated infrastructure - They offer shared hard and soft facilities such as utilities, telecom networks, waste systems, laboratories, internal roads, one-stop clearances, training centres, security, and emergency services. Defined geography - Development takes place on clearly demarcated, master-planned land with uniform standards for buildings and facilities. Dedicated management - A single authority oversees firm entry, ensures regulatory compliance, and drives long-term park development. Multi-tenant clusters - Multiple firms operate within the park, collaborate, share resources, and enhance productivity through agglomeration and clustering effects. Industrial Parks Fuelling Economic Evolution : Economic efficiency - Industrial parks integrate scarce factors of production within defined geographic zones, generating higher productivity and operational efficiency. Employment and skills development - They create jobs, improve wages, and strengthen the local talent base. Capital and technology attraction - Parks draw investment and advanced technologies while enabling technology and managerial knowledge transfer. Industrial upgrading and competitiveness - Clustered industrial activity stimulates upgrading, enhances national competitiveness, and deepens global value chain integration. Policy incentives - Local, provincial, and national policies accelerate industrial growth and reinforce the gains generated by parks. Urban and regional development - Industrial parks act as catalysts for economic expansion and sustainable progress in host cities and regions. Planning and Establishment of Industrial Parks The incorporation of Industrial Parks is undertaken based on a business case that outlines the need for serviced industrial land and the anticipated economic and developmental benefits upon project completion. Following the preparation of the business case, pre-feasibility studies are carried out to evaluate potential sites for establishing an Industrial Park. These studies assess market suitability , connectivity to transport networks , availability of power and water , and overall cost viability . They also identify the sectoral opportunities likely to be attracted to the proposed park through an analysis of sector competitiveness , estimates of investment and industrial land demand , infrastructure and service requirements , and the expected scale of project costs and revenues . Subsequent assessments include financial analysis , policy analysis and stakeholder mapping , safeguards review , and economic impact projections . A final decision to establish and finance an Industrial Park is taken only after a comprehensive, site-specific feasibility study is completed, with conclusions that clearly support project viability. Government Initiatives Revitalizing the Industrial Parks' Ecosystem Several initiatives and platforms are shaping India’s industrial parks' growth and streamlining land access, accelerating industrial development, and supporting investor decision-making. Plug-And-Play Industrial Parks In the Union Budget 2025-26, Rs. 2,500 crores have been allocated for the development of plug-and-play industrial parks . By providing infrastructure that is precision-designed to industry needs, the plug-and-play parks enhance operational efficiency and sustainability. There are currently 306 plug-and-play industrial parks in India , and an additional 20 plug-and-play industrial parks and smart cities are being developed under the National Industrial Corridor Development Corporation (NICDC). Four projects have been completed, four are currently under construction, while the rest are advancing through different phases of bidding and tendering. India Industrial Land Bank (IILB): The Department for Promotion of Industry and Internal Trade (DPIIT) developed the India Industrial Land Bank (IILB) , a centralized Geographic Information System (GIS)-enabled platform that offers up-to-date, spatial and non-spatial information on industrial land across the country. Formerly known as the Industrial Information System, the IILB serves as a one-stop repository for 4,523 industrial parks , mapped across a total area of approximately 7.70 lakh hectares . Of this, nearly 1.35 lakh hectares of land is currently available for industrial development. These parks collectively comprise more than 6.45 lakh plots , with over 1.25 lakh plots currently vacant (as on 23rd December, 2025), presenting significant opportunities for new investments in manufacturing, logistics, and allied sectors. Overview of Industrial Parks and Associated Land Area Across Indian States and UTs (as on 23rd December, 2025): State No. of Industrial Parks Total Land Area (Hectares) Land Available (Hectares) Andaman & Nicobar 6 35 8 Andhra Pradesh 638 110595 10747 Arunachal Pradesh 18 741 248 Assam 56 43497 486 Bihar 82 4139 649 Chandigarh 7 352 32 Chhattisgarh 114 22972 2574 Dadra & Nagar Haveli 5 119 50 Daman & Diu 5 57 0 Delhi 68 7017 976 Goa 22 1699 102 Gujarat 285 193975 12605 Haryana 51 9597 11661 Himachal Pradesh 64 960 185 Jammu & Kashmir 137 2841 264 Jharkhand 158 8194 1734 Karnataka 384 35910 3568 Kerala 140 6658 1292 Ladakh UT 8 33 2 Lakshadweep 9 2 1 Madhya Pradesh 144 23217 2916 Maharashtra 523 81308 19658 Manipur 7 36 13 Meghalaya 9 235 5 Mizoram 8 381 240 Nagaland 6 282 19 Odisha 146 72600 2744 Puducherry 11 658 0 Punjab 100 6331 2008 Rajasthan 420 33578 11655 Sikkim 5 20 3 Tamil Nadu 372 30772 16291 Telangana 157 32033 30749 Tripura 20 1828 623 Uttar Pradesh 286 33327 1320 Uttarakhand 35 3814 332 West Bengal 17 490 61 Grand Total 4523 770303 135821 Source: India Industrial Land Bank (IILB), Department for Promotion of Industry and Internal Trade, Ministry of Commerce and Industry, Government of India Industrial Park Rating System (IPRS): The Industrial Park Rating System (IPRS) is a comprehensive framework for assessing the performance and quality of industrial parks and business districts in India. Built on four assessment pillars, it provides valuable insights to investors, developers, and policymakers while encouraging park authorities to improve services and infrastructure. By promoting continuous improvement, the IPRS drives innovation, efficiency, sustainability, and ease of doing business. Its feedback reports serve as actionable roadmaps for infrastructure upgrades and service enhancement, while its collaborative approach promotes knowledge sharing and sector-wide growth beyond conventional rankings. According to the IPRS 2.0 Top Rated Parks Report , a total of 41 industrial parks have been classified under the ‘Leaders’ category, representing high-performing parks with strong infrastructure, resilient industrial activity, and a well-established mix of sector-specific and multi-sector facilities. Further, 90 industrial parks have been identified as ‘Challengers’, representing parks that have shown substantial growth momentum. These parks display improving infrastructure and operational performance and are well-positioned to advance into the top tier with focused development initiatives. In addition, 185 industrial parks have been recognised as ‘Aspirers’, indicating parks that hold significant potential for future development. These parks are in earlier stages of growth and stand to benefit from targeted support to strengthen their infrastructure, services, and operational maturity. These rankings, based on key performance indicators, provide investors with transparent insights, promote healthy competition among States and Union Territories, and support evidence-based policymaking. In September 2025, the Industrial Park Rating System (IPRS) 3.0 was launched to further strengthen India’s industrial ecosystem and enhance the competitiveness of its infrastructure. Building on the pilot phase (2018) and IPRS 2.0 (2021), this edition features an expanded framework with new parameters such as sustainability, green infrastructure, logistics connectivity, digitalization, skill linkages, and tenant feedback. Ease of Doing Business Reforms: India has strengthened the ease of doing business by supporting domestic and international investors, with industrial parks becoming central to attracting investment and meeting large-scale employment needs, as improved internal infrastructure has raised occupancy rates and stimulated economic growth. Investors can remotely evaluate suitable land parcels using detailed information on infrastructure, connectivity, business support services, and environmental and safety standards, thereby enabling well-informed investment decisions. National Business Reforms Action Plan (BRAP), 2014 - Accelerated improvements across key reform areas, including Information Wizard, Single Window Systems, Online Building Permission System, Inspection Reforms, and Labour Reforms. One District One Product (ODOP) initiative - Promoted district-specific products and strengthened local enterprises across the country. Goods and Services Tax (GST) - Unified multiple indirect taxes, such as excise duty and service tax, into a streamlined and transparent national tax framework. Startup India - Under the Startup India initiative, eligible companies can obtain DPIIT recognition to access a host of benefits, including tax incentives, simplified compliance, and fast-tracking of Intellectual Property Rights (IPR)-related processes. Remission of Duties and Taxes on Exported Products (RoDTEP) scheme - Encouraged entrepreneurship and enhanced the attractiveness and competitiveness of Indian exports. Compliance and legal burden reduction - Decriminalised 3,700 legal provisions and reduced more than 42,000 compliances to build a predictable, transparent, and business-friendly regulatory landscape. Industrial Parks as Engines of FDI India ranks among the world’s top 5 destinations for international project finance deals and Greenfield Project Investments , according to the United Nations Conference on Trade and Development (UNCTAD) 2025 World Investment Report. Foreign Direct Investment (FDI) inflows have continued on a mounting trajectory. During the April-August 2025-26, total FDI inflows reached USD 43.76 billion (provisional), compared with USD 37.03 billion in the corresponding period of FY 2024-25. Industrial parks play a critical role in stimulating a country’s economic development by attracting FDIs and domestic capital, enhancing industrial performance, strengthening value chains, and expanding employment opportunities. They also support export-led growth and improve enterprise capabilities by enabling knowledge exchange and technology diffusion. Enhanced FDI strengthens the development of industrial parks that align with national strategies. Supported by comprehensive feasibility studies and enabling policies, these platforms are significantly enhancing the investment environment, deepening regional value chains, and attracting higher levels of foreign capital. Conclusion India’s evolving industrial policy landscape embodies a decisive transition towards industrial promotion , with industrial parks placed at the forefront of this evolution. Their planned design , shared infrastructure, and coordinated governance structure create afacilitating environment that strengthens productivity , technology transfer, and employment generation . To reinforce this accelerating trajectory, the Government of India has prioritised the development of plug-and-play industrial parks , enhanced digital land access systems through the India Industrial Land Bank (IILB), and institutionalised quality benchmarks through the Industrial Park Rating System (IPRS) , affirming a sustained commitment to industrial excellence . Complemented by wide-ranging ease of doing business reforms and a predictable regulatory climate , these initiatives have significantly motivated investor confidence and expanded opportunities for domestic and foreign investment . As India’s industrial parks increasingly align with global best practices and sustainability standards , they are expected to fortify regional value chains and integrate India more competitively into global manufacturing networks . At the same time, the Government recognises that the global industrial landscape is evolving with intensifying competition for FDI, and a worldwide shift toward a circular and green economy . Remaining relevant in this environment, India’s industrial parks are continuously upgrading their infrastructure , services, and market offerings . Through these concerted measures, the Government of India is carving an industrial ecosystem that is inclusive and globally recognised . The Government remains firmly committed to ensuring that industrial parks evolve in step with international standards , advocate sustainability-driven growth, and emerge as enduring engines of industrial prowess and economic strength . References Asian Development Bank https://www.adb.org/sites/default/files/publication/1036336/adb-brief-337-india-industrial-park-rating-system.pdf Department for Promotion of Industry and Internal Trade (DPIIT) https://master-dpiit.digifootprint.gov.in/static/uploads/2025/07/312ed7e5cf365de339c227c53f851591.pdf https://www.dpiit.gov.in/ministry/about-us/details/Title=Ease-of-Doing-Business-(EODB)-ITMwETMtQWa https://www.dpiit.gov.in/static/uploads/2025/06/9900260e5d2ed688900dce995ec501d9.pdf https://www.dpiit.gov.in/static/uploads/2025/06/3d9c9c2daeefb97bb9ce964370938b71.pdf Government of United Kingdom https://assets.publishing.service.gov.uk/media/5c6ac4d8e5274a72c19f7c85/322_Environmental_Safeguards_for_Industrial_Parks.pdf India Industrial Land Bank (IILB) https://indiaindustriallandbank.gov.in/secrpturl_pub?valid=+9K3K3E20706c75675f706c61793d2759657327&fld= https://indiaindustriallandbank.gov.in/exploreParkReport https://indiaindustriallandbank.gov.in/login1 https://indiaindustriallandbank.gov.in/IPRS20TopRatedParks https://indiaindustriallandbank.gov.in/userManual/Approved_Rapporteur_by__SIIT_1.pdf Invest India https://www.investindia.gov.in/blogs/business-friendly-reforms-indias-path-prosperity https://www.investindia.gov.in/team-india-blogs/industrial-park-rating-system-ipr-enhancing-industrial-competitiveness-and https://www.investindia.gov.in/blogs/smart-cities-smart-growth Ministry of Commerce & Industry https://sansad.in/getFile/loksabhaquestions/annex/184/AU2958_F5PrLx.pdf?source=pqals Ministry of Finance https://www.indiabudget.gov.in/budget2020-21/economicsurvey/doc/vol2chapter/echap08_vol2.pdf Press Information Bureau https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1761135&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2168994 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2108360 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2131716 Startup India https://www.startupindia.gov.in/ United Nations https://www.un.org/esa/sustdev/publications/industrial_development/3_1.pdf United Nations Conference on Trade and Development (UNCTAD) https://unctad.org/system/files/official-document/wir2025_en.pdf United Nations Development Programme (UNDP) https://www.undp.org/sites/g/files/zskgke326/files/2024-04/ethiopia_the_role_of_industry_parks_in_the_local_economy_final_2024.pdf United Nations Industrial Development Organization (UNIDO) https://www.unido.org/sites/default/files/files/2019-11/International_Guidelines_for_Industrial_Parks.pdf https://ipp.unido.org/industrial-parks-overview https://www.unido.org/sites/default/files/files/2020-11/EN_Experiences_and_Best_Practices_of_Industrial_Park_Development_in_China.pdf https://ipp.unido.org/sites/default/files/knowledge/2022-06/English_0.pdf https://www.unido.org/sites/default/files/files/2020-05/International_Guidelines_for_Industrial_Parks_EN.pdf https://www.unido.org/sites/default/files/unido-publications/2025-09/Financing%20Industries%20for%20Development_05Sept2025.pdf https://unido-virtualexhibition.org/wp-content/uploads/2019/10/Industrial-Parks-ENGLISH-digital.pdf World Bank https://documents1.worldbank.org/curated/en/099050625181538675/pdf/P179257-6da51be4-c3aa-4c36-820e-bede678ffd62.pdf https://openknowledge.worldbank.org/server/api/core/bitstreams/d38f8a76-27d5-58fc-a998-c86508b7612c/content https://documents1.worldbank.org/curated/en/747791476867738472/pdf/ACS8954-v2-REVISED-PUBLIC-TheCompetitiveAdvantageofSouthAsia.pdf Click here to see in PDF PIB Research (रिलीज़ आईडी: 2207690)",
    "scraped_at": "2025-12-23T09:47:59.149290"
  },
  {
    "id": "2207673",
    "ministry": "PIB Headquarters",
    "title": "National Consumer Day",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207673",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters National Consumer Day “Efficient and Speedy Disposal through Digital Justice” प्रविष्टि तिथि:\r\n                23 DEC 2025 1:35PM by PIB Delhi Introduction National Consumer Day is observed in India on 24 December each year to highlight the significance of consumer rights and the broader framework of consumer protection . It was on this day that the Consumer Protection Act, 1986 , received the President's assent, establishing a comprehensive set of rights for consumers. These include the right to be protected, the right to be informed, the right to be assured, the right to be heard, the right to seek redressal, and the right to consumer awareness. The observance aims to raise awareness and promote responsible practices among consumers and other stakeholders. In 2025 , National Consumer Day is guided by the theme “Efficient and Speedy Disposal through Digital Justice,” reflecting India’s continued focus on technology-enabled, accessible, and timely consumer grievance redressal. Reimagining Consumer Rights: Stronger Laws, Faster Redressal, and Better Outcomes The Consumer Protection Act, 2019, represents a significant reform in the safeguarding of consumer interests in India. Enacted on 20 July 2020 , it supersedes the Consumer Protection Act of 1986 and introduces a more contemporary framework for dispute resolution and marketplace accountability. The Act seeks to safeguard consumer welfare and promote fairness in commercial transactions by facilitating informed decision-making, ensuring uniform and equitable outcomes, and enabling prompt and effective grievance redressal. The law guarantees several key rights, including the right to be informed about the quality, quantity, potency, purity, and standards of goods or services , thereby safe guarding consumers against unfair trade practices. To operationalise its objectives, the Act establishes a three-tier adjudicatory structure for consumer dispute resolution: District Consumer Disputes Redressal Forum (District Forum) - the first tier, located at the district court, adjudicates complaints involving claims up to Rs. 50 lakhs. State Consumer Disputes Redressal Commission (State Commission) - the second-tier, state-level body deals with complaints exceeding Rs. 50 lakhs and up to Rs. 2 crore . National Consumer Disputes Redressal Commission (National Commission) - the apex tier, operating at the national level, addresses complaints involving complaints above Rs. 2 crore. In July 2025, 10 States , along with the National Consumer Disputes Redressal Commission (NCDRC) recorded a disposal rate of more than 100 percent. This indicates that the volume of cases resolved during the month surpassed the number of newly filed cases, demonstrating enhanced efficiency and a reinforced commitment to delivering timely consumer justice. The District Forum and State Commission are constituted by individual State Governments with the approval of the Central Government, whereas the National Commission is established directly by the Central Government. These adjudicatory bodies do not supersede the jurisdiction of civil courts, instead, they provide an alternative mechanism for resolving consumer grievances. Role and functions of the Central Consumer Protection Authority (CCPA) The Central Consumer Protection Authority (CCPA) , established on 24 July 2020 under the Consumer Protection Act, 2019 , serves as a regulatory body mandated to safeguard the interests of consumers as a collective.   It functions encompass: Protecting, promoting, and enforcing the rights of consumers Preventing the occurrence of unfair trade practices Ensuring goods and services are not sold in violation of the Act Monitoring and regulating advertisements to prevent false or misleading claims Initiating actions against manufacturers, endorsers, and publishers involved in disseminating misleading advertisements The CCPA is empowered to mandate the recall of unsafe goods and services, discontinue unfair trade practices, levy penalties, and initiate prosecution when required. Catalysing Consumer Protection Initiatives: The Consumer Welfare Fund The Consumer Welfare Fund aims to support initiatives that protect consumer interests and strengthen the consumer movement across the nation. Financial assistance is extended to States and Union Territories for the establishment of a Consumer Welfare Corpus Fund , with contributions structured on a 75:25 ratio, and on a 90:10 ratio for Special Category States and designated Union Territories. Programme activities are funded through the interest accrued on this corpus. During the financial year 2024-25 (as on 31.12.2024), an amount of Rs. 38.68 Crore has been released to the States/UTs. Building a Responsive and Reliable Consumer Redressal Framework A responsive and reliable consumer redressal system is crucial for providing individuals with timely and equitable solutions to grievances arising from the purchase of goods or services. Strengthening this system not only builds trust in the marketplace but also empowers consumers by ensuring that their concerns are recognised, addressed, and resolved in an efficient manner. e-Jagriti - Revolutionizing Consumer Justice in 2025 e-Jagriti , launched on 1 January 2025 , has rapidly emerged as a significant digital platform for consumer grievance redressal in India. It integrates earlier systems, including OCMS, e-Daakhil, NCDRC CMS, and CONFONET, into a single, streamlined interface, thereby enhancing accessibility and simplifying procedures. Now operational across the NCDRC and all States and Union Territories, the platform enables users to file complaints, make payments, participate in virtual hearings, and monitor case progress. Its multilingual support, chatbot assistance, voice-to-text features, and secure digital access ensure usability for all consumers, including senior citizens and persons with disabilities. Key Benefits of e-Jagriti Global Accessibility: The platform allows both non-resident Indians and domestic users to file and manage cases remotely, supported by secure end-to-end encryption and role-based secure access. Efficiency and Speed: Automated workflows, real-time SMS and email notifications, and virtual hearings have significantly improved the overall efficiency of the system. Notably, ten states and the NCDRC have recently recorded disposal rates exceeding 100 percent. Inclusivity: The platform offers multilingual interfaces and accessibility features, making it user-friendly for people from diverse linguistic and socio-economic backgrounds. Secure Transactions: Integration with Bharat Kosh and PayGov payment gateways ensures that fee payment processes are efficient, secure, and user-friendly. Justice Delivered for a Consumer in Tripura A consumer in West Tripura secured relief after enduring 8 years of issues with a Rs.85,000 LG Side by Side refrigerator that leaked water and failed to defrost despite repeated repairs. The case, filed as DC/272/CC/33/2025, was resolved within 5 months with the Commission holding LG India and the service centre liable for deficiency in service and unfair trade practices. The order awarded a full refund with 7.5 percent annual interest, along with Rs.12,000 towards repair expenses, Rs.50,000 for mental agony and Rs.20,000 for litigation, totalling more than Rs.1.67 Lakh, to be paid within 30 days . The outcome shows that e-Jagriti continues to empower consumers and hold brands accountable for long term service responsibilities. As of mid- November 2025 , the platform has facilitated the filing of over 1.35 lakh case filings and enabled the disposal of over 1.31 lakh cases , supported by a user base of over 2.81 lakh registered individuals, including 1,400 non-resident Indians (NRIs). A total of 466 complaints were filed by Non-Resident Indians from countries including the United States (146), the United Kingdom (52), the UAE (47), Canada (39), Australia (26), and Germany (18). In 2025 , e-Jagriti demonstrated a marked enhancement in case disposal efficiency. Between July and August , 27,545 cases were resolved, compared with 27,080 newly filed . During September and October, 24,504 cases were disposed of, against 21,592 newly filed . Both intervals show performance levels surpassing those of 2024 , reflecting faster clearance of pending cases and more effective grievance redressal. Additionally, the platform has issued over 2 lakh SMS alerts and more than 12 lakh email notifications , ensuring real-time communication and timely compliance. National Consumer Helpline 2.0 The Department of Consumer Affairs has upgraded the National Consumer Helpline (NCH) with the introduction of AI-enabled NCH 2.0 , offering multilingual assistance, chatbot-supported interactions, and expedited grievance resolution. The portal enables consumers to register complaints online, seek pre-litigation remedies, and access information regarding their rights. The National Consumer Helpline has substantially expanded its outreach and operational efficiency by integrating advanced technological solutions. The number of calls received by NCH has grown nearly tenfold, from 12,553 calls in December 2015 to 1,55,138 calls in December 2024 . This exponential growth reflects the rising confidence of consumers in the helpline. Similarly, the average number of complaints registered per month has surged from 37,062 in 2017 to 1,11,951 in 2024 . It now resolves over 12 lakh complaints annually, with many being addressed within 21 days , supported by 1,169 companies onboarded as partners and AI-based systems that ensure faster grievance resolution. Digital channels account for nearly 65 percent of grievance registrations, with a notable increase in WhatsApp-based submissions, rising from 3 percent in March 2023 to 20 percent in March 2025 . The National Consumer Helpline (NCH) has successfully facilitated a refund of Rs. 27.61 crore to consumers between 25th April 2025 and 31st October 2025. This significant redressal was achieved across 30 sectors , effectively addressing 49,333 consumer grievances related to refund claims. The National Consumer Helpline is available in 17 languages and enables consumers to submit grievances through the Integrated Grievance Redressal Mechanism via multiple channels, including WhatsApp, SMS, email, the NCH app, the web portal, and the Umang app. T he Department encourages consumers to utilize the toll-free number 1915 or the online portal to ensure that their concerns regarding goods or services are addressed promptly and effectively. Jago Grahak Jago Portal and Mobile App The Department of Consumer Affairs has implemented advanced digital tools to safeguard consumers from deceptive online practices. Developed as part of a real-time intelligent cyber-physical system on the Airawat AI Supercomputer, these tools analyse platform text and design to identify potential dark patterns . The Jago Grahak Jago App offers verified e-commerce information and alerts users to potentially unsafe websites , while the Jagriti App enables consumers to report suspicious URLs directly to the Central Consumer Protection Authority. The Jagriti Dashboard further supports monitoring by providing real-time assessments of platforms. Collectively, these tools enhance oversight, facilitate swift corrective action, and reinforce the protection of consumer rights. Dark patterns are design tactics used to mislead or pressure consumers into choices they may not intend to make. The CCPA has addressed this issue by issuing guidelines that curb practices such as drip pricing, disguised advertisements and false urgency, ensuring greater fairness and transparency in the digital marketplace. Bureau of Indian Standards (BIS) The Bureau of Indian Standards serves as India’s national standard body under the BIS Act, 2016 . It plays a central role in the formulation of standards, product certification, and quality assurance. Through its activities in standard development, certification, and testing, BIS contributes to the availability of safe and reliable products, mitigates health risks for consumers, supports export competitiveness and import substitution, and prevents unnecessary variation in product specifications across the market. Over 22,300 Indian Standards are in force, with 94 percent aligned with international norms established by the International Organization for Standardization (ISO) and International Electrotechnical Commission (IEC). Since 2014, the scope of mandatory certification has expanded significantly, from 106 products governed by 14 Quality Control Orders (QCOs) to 773 goods now regulated through 191 QCOs plus two horizontal QCOs. Hallmarking of Gold and Silver Jewellery- BIS Care App The BIS Care app enables consumers to easily verify hallmarked jewellery by simply entering the HUID number to check purity, product type, and details of the jeweller and hallmarking centre. Available free on both Android and iOS in 12 languages , it also allows users to verify ISI marks, check licence numbers, and register complaints about suspected non-compliant products . The app serves as a valuable tool for informed purchasing and supports BIS efforts to ensure the availability of safe products and fair-trade practices for consumers nationwide. National Test House The National Test House (NTH) functions under the administrative control of the Department of Consumer Affairs in the Ministry of Consumer Affairs, Food, and Public Distribution, and is one of India’s leading scientific institutions. Established in 1912 under the Railway Board, it has grown into a trusted laboratory for testing, calibration, evaluation, and quality control of a wide range of engineering materials and finished products . NTH issues test certificates that comply with national and international standards as well as customer-specific requirements, ensuring reliability and quality in assessment. The institution plays an important role across industry, trade, and standardisation, supporting the growth of indigenous manufacturing and acting as a vital link between industrial research and production. The National Test House is modernising its operations through the adoption of digital solutions. The Laboratory Data Automation System (LDAS) is being introduced to reduce manual errors, shorten turnaround times, and expedite the completion of quality tests, thereby enhancing overall capacity and efficiency. Additionally, a new mobile application will enable both industry and consumers to access laboratory services more easily, streamlining engagement and improving service delivery. The recent performance of NTH reflects its strong growth, with sample testing increasing by 60.36 percent to 45,926 samples in 2024-25 , and revenue rising by 49.89 percent to Rs. 44.45 crore , compared to Rs. 29.66 crore in the previous year with targeted revenue for FY 2025–26 being Rs.80 crore. The Legal Metrology Rules- Recent Amendments (2025) In October 2025 , the Department of Consumer Affairs notified the Legal Metrology (Packaged Commodities) Amendment Rules, 2025 , specifying that medical device packages will now adhere to the labeling requirements outlined in the Medical Devices Rules, 2017. In October 2025, the Legal Metrology (Government Approved Test Centre) Amendment Rules, 2025, were notified, expanding the scope of approved test centres by recognizing regional reference laboratories and national test houses. To support compliance following GST-linked price revisions , the government has allowed manufacturers and packers to use existing packaging until March 2026 . Under the 2025 relaxations, they may update MRPs without redesigning packages, ensuring regulatory adherence while easing business operations. In November 2025, the department issued the Draft Legal Metrology (Packaged Commodities) (Second) Amendment Rules, 2025 , proposing to make it mandatory fore-commerce platforms selling imported packaged goods to offer a searchable and sortable filter by ‘Country of Origin’ . In December 2025, a new amendment made it mandatory for all pan masala packages , regardless of size, to display the Retail Sale Price along with all other required declarations as of 1 February 2026 . Overall, these amendments streamline regulatory requirements, eliminate earlier ambiguities, and enhance clarity across various sectors, including medical device labeling, measurement verification, and the packaging of goods. By expanding the verification network, strengthening disclosure norms, and tightening pricing transparency, the reforms collectively enhance consistency, accountability, and consumer protection. Furthermore, they support a more reliable regulatory environment that empowers consumers to make informed choices and ensures fairer market practices. Conclusion National Consumer Day 2025 highlights India’s ongoing commitment to safeguarding consumer rights and promoting trust in the marketplace. The theme “Efficient and Speedy Disposal through Digital Justice” is evident in the continued expansion of digital grievance redressal platforms such as e-Jagriti and the upgraded National Consumer Helpline, which have improved access, transparency, and disposal efficiency across the country. The wide range of programme activities, including digital launches, institutional collaborations, awareness initiatives, and recognition of innovation, underscores a coordinated approach to consumer empowerment. The reforms and initiatives highlighted, including the Consumer Protection Act, 2019, the establishment of the Central Consumer Protection Authority, expansion of the Consumer Welfare Fund, and the advancement of accessible grievance redressal systems, reflect a shift towards a responsive and technology-driven consumer justice system. Progress through BIS, National Test House, and the Legal Metrology framework has further strengthened quality assurance, standardisation, and accuracy in trade. Collectively, these measures demonstrate steady progress towards a fair, transparent, and consumer-centric ecosystem, reinforcing the core message that informed and empowered consumers are central to a healthy and equitable economy. References Ministry of Consumer Affairs, Food & Public Distribution Department of Consumer Affairs https://consumeraffairs.gov.in/public/upload/files/1743657766_AR%202024-25_Eng_1744632582.pdf https://consumeraffairs.gov.in/ https://doca.gov.in/ccpa/ https://e-jagriti.gov.in/ https://jagograhakjago.gov.in/ https://www.bis.gov.in/the-bureau/about-bis/?lang=en https://consumeraffairs.gov.in/pages/legal-metrology-overview https://consumeraffairs.gov.in/pages/national-test-house PIB Press Releases https://www.pib.gov.in/PressReleasePage.aspx?PRID=2157241 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2190535&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2179780&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2087600&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2187416&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2088051&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2087245&reg=3&lang=2 https://www.pib.gov.in/PressReleseDetailm.aspx?PRID=2077618&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2178951&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2111506&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2198764&reg=3&lang=1 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2183777 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2184053 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2168208 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2188363 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2198215 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2165412&reg=3&lang=2 Click here to download PDF ***** PIB Research (रिलीज़ आईडी: 2207673) आगंतुक पटल  : 210 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी PIB Headquarters National Consumer Day “Efficient and Speedy Disposal through Digital Justice” प्रविष्टि तिथि:\r\n                        23 DEC 2025 1:35PM by PIB Delhi Introduction National Consumer Day is observed in India on 24 December each year to highlight the significance of consumer rights and the broader framework of consumer protection . It was on this day that the Consumer Protection Act, 1986 , received the President's assent, establishing a comprehensive set of rights for consumers. These include the right to be protected, the right to be informed, the right to be assured, the right to be heard, the right to seek redressal, and the right to consumer awareness. The observance aims to raise awareness and promote responsible practices among consumers and other stakeholders. In 2025 , National Consumer Day is guided by the theme “Efficient and Speedy Disposal through Digital Justice,” reflecting India’s continued focus on technology-enabled, accessible, and timely consumer grievance redressal. Reimagining Consumer Rights: Stronger Laws, Faster Redressal, and Better Outcomes The Consumer Protection Act, 2019, represents a significant reform in the safeguarding of consumer interests in India. Enacted on 20 July 2020 , it supersedes the Consumer Protection Act of 1986 and introduces a more contemporary framework for dispute resolution and marketplace accountability. The Act seeks to safeguard consumer welfare and promote fairness in commercial transactions by facilitating informed decision-making, ensuring uniform and equitable outcomes, and enabling prompt and effective grievance redressal. The law guarantees several key rights, including the right to be informed about the quality, quantity, potency, purity, and standards of goods or services , thereby safe guarding consumers against unfair trade practices. To operationalise its objectives, the Act establishes a three-tier adjudicatory structure for consumer dispute resolution: District Consumer Disputes Redressal Forum (District Forum) - the first tier, located at the district court, adjudicates complaints involving claims up to Rs. 50 lakhs. State Consumer Disputes Redressal Commission (State Commission) - the second-tier, state-level body deals with complaints exceeding Rs. 50 lakhs and up to Rs. 2 crore . National Consumer Disputes Redressal Commission (National Commission) - the apex tier, operating at the national level, addresses complaints involving complaints above Rs. 2 crore. In July 2025, 10 States , along with the National Consumer Disputes Redressal Commission (NCDRC) recorded a disposal rate of more than 100 percent. This indicates that the volume of cases resolved during the month surpassed the number of newly filed cases, demonstrating enhanced efficiency and a reinforced commitment to delivering timely consumer justice. The District Forum and State Commission are constituted by individual State Governments with the approval of the Central Government, whereas the National Commission is established directly by the Central Government. These adjudicatory bodies do not supersede the jurisdiction of civil courts, instead, they provide an alternative mechanism for resolving consumer grievances. Role and functions of the Central Consumer Protection Authority (CCPA) The Central Consumer Protection Authority (CCPA) , established on 24 July 2020 under the Consumer Protection Act, 2019 , serves as a regulatory body mandated to safeguard the interests of consumers as a collective.   It functions encompass: Protecting, promoting, and enforcing the rights of consumers Preventing the occurrence of unfair trade practices Ensuring goods and services are not sold in violation of the Act Monitoring and regulating advertisements to prevent false or misleading claims Initiating actions against manufacturers, endorsers, and publishers involved in disseminating misleading advertisements The CCPA is empowered to mandate the recall of unsafe goods and services, discontinue unfair trade practices, levy penalties, and initiate prosecution when required. Catalysing Consumer Protection Initiatives: The Consumer Welfare Fund The Consumer Welfare Fund aims to support initiatives that protect consumer interests and strengthen the consumer movement across the nation. Financial assistance is extended to States and Union Territories for the establishment of a Consumer Welfare Corpus Fund , with contributions structured on a 75:25 ratio, and on a 90:10 ratio for Special Category States and designated Union Territories. Programme activities are funded through the interest accrued on this corpus. During the financial year 2024-25 (as on 31.12.2024), an amount of Rs. 38.68 Crore has been released to the States/UTs. Building a Responsive and Reliable Consumer Redressal Framework A responsive and reliable consumer redressal system is crucial for providing individuals with timely and equitable solutions to grievances arising from the purchase of goods or services. Strengthening this system not only builds trust in the marketplace but also empowers consumers by ensuring that their concerns are recognised, addressed, and resolved in an efficient manner. e-Jagriti - Revolutionizing Consumer Justice in 2025 e-Jagriti , launched on 1 January 2025 , has rapidly emerged as a significant digital platform for consumer grievance redressal in India. It integrates earlier systems, including OCMS, e-Daakhil, NCDRC CMS, and CONFONET, into a single, streamlined interface, thereby enhancing accessibility and simplifying procedures. Now operational across the NCDRC and all States and Union Territories, the platform enables users to file complaints, make payments, participate in virtual hearings, and monitor case progress. Its multilingual support, chatbot assistance, voice-to-text features, and secure digital access ensure usability for all consumers, including senior citizens and persons with disabilities. Key Benefits of e-Jagriti Global Accessibility: The platform allows both non-resident Indians and domestic users to file and manage cases remotely, supported by secure end-to-end encryption and role-based secure access. Efficiency and Speed: Automated workflows, real-time SMS and email notifications, and virtual hearings have significantly improved the overall efficiency of the system. Notably, ten states and the NCDRC have recently recorded disposal rates exceeding 100 percent. Inclusivity: The platform offers multilingual interfaces and accessibility features, making it user-friendly for people from diverse linguistic and socio-economic backgrounds. Secure Transactions: Integration with Bharat Kosh and PayGov payment gateways ensures that fee payment processes are efficient, secure, and user-friendly. Justice Delivered for a Consumer in Tripura A consumer in West Tripura secured relief after enduring 8 years of issues with a Rs.85,000 LG Side by Side refrigerator that leaked water and failed to defrost despite repeated repairs. The case, filed as DC/272/CC/33/2025, was resolved within 5 months with the Commission holding LG India and the service centre liable for deficiency in service and unfair trade practices. The order awarded a full refund with 7.5 percent annual interest, along with Rs.12,000 towards repair expenses, Rs.50,000 for mental agony and Rs.20,000 for litigation, totalling more than Rs.1.67 Lakh, to be paid within 30 days . The outcome shows that e-Jagriti continues to empower consumers and hold brands accountable for long term service responsibilities. As of mid- November 2025 , the platform has facilitated the filing of over 1.35 lakh case filings and enabled the disposal of over 1.31 lakh cases , supported by a user base of over 2.81 lakh registered individuals, including 1,400 non-resident Indians (NRIs). A total of 466 complaints were filed by Non-Resident Indians from countries including the United States (146), the United Kingdom (52), the UAE (47), Canada (39), Australia (26), and Germany (18). In 2025 , e-Jagriti demonstrated a marked enhancement in case disposal efficiency. Between July and August , 27,545 cases were resolved, compared with 27,080 newly filed . During September and October, 24,504 cases were disposed of, against 21,592 newly filed . Both intervals show performance levels surpassing those of 2024 , reflecting faster clearance of pending cases and more effective grievance redressal. Additionally, the platform has issued over 2 lakh SMS alerts and more than 12 lakh email notifications , ensuring real-time communication and timely compliance. National Consumer Helpline 2.0 The Department of Consumer Affairs has upgraded the National Consumer Helpline (NCH) with the introduction of AI-enabled NCH 2.0 , offering multilingual assistance, chatbot-supported interactions, and expedited grievance resolution. The portal enables consumers to register complaints online, seek pre-litigation remedies, and access information regarding their rights. The National Consumer Helpline has substantially expanded its outreach and operational efficiency by integrating advanced technological solutions. The number of calls received by NCH has grown nearly tenfold, from 12,553 calls in December 2015 to 1,55,138 calls in December 2024 . This exponential growth reflects the rising confidence of consumers in the helpline. Similarly, the average number of complaints registered per month has surged from 37,062 in 2017 to 1,11,951 in 2024 . It now resolves over 12 lakh complaints annually, with many being addressed within 21 days , supported by 1,169 companies onboarded as partners and AI-based systems that ensure faster grievance resolution. Digital channels account for nearly 65 percent of grievance registrations, with a notable increase in WhatsApp-based submissions, rising from 3 percent in March 2023 to 20 percent in March 2025 . The National Consumer Helpline (NCH) has successfully facilitated a refund of Rs. 27.61 crore to consumers between 25th April 2025 and 31st October 2025. This significant redressal was achieved across 30 sectors , effectively addressing 49,333 consumer grievances related to refund claims. The National Consumer Helpline is available in 17 languages and enables consumers to submit grievances through the Integrated Grievance Redressal Mechanism via multiple channels, including WhatsApp, SMS, email, the NCH app, the web portal, and the Umang app. T he Department encourages consumers to utilize the toll-free number 1915 or the online portal to ensure that their concerns regarding goods or services are addressed promptly and effectively. Jago Grahak Jago Portal and Mobile App The Department of Consumer Affairs has implemented advanced digital tools to safeguard consumers from deceptive online practices. Developed as part of a real-time intelligent cyber-physical system on the Airawat AI Supercomputer, these tools analyse platform text and design to identify potential dark patterns . The Jago Grahak Jago App offers verified e-commerce information and alerts users to potentially unsafe websites , while the Jagriti App enables consumers to report suspicious URLs directly to the Central Consumer Protection Authority. The Jagriti Dashboard further supports monitoring by providing real-time assessments of platforms. Collectively, these tools enhance oversight, facilitate swift corrective action, and reinforce the protection of consumer rights. Dark patterns are design tactics used to mislead or pressure consumers into choices they may not intend to make. The CCPA has addressed this issue by issuing guidelines that curb practices such as drip pricing, disguised advertisements and false urgency, ensuring greater fairness and transparency in the digital marketplace. Bureau of Indian Standards (BIS) The Bureau of Indian Standards serves as India’s national standard body under the BIS Act, 2016 . It plays a central role in the formulation of standards, product certification, and quality assurance. Through its activities in standard development, certification, and testing, BIS contributes to the availability of safe and reliable products, mitigates health risks for consumers, supports export competitiveness and import substitution, and prevents unnecessary variation in product specifications across the market. Over 22,300 Indian Standards are in force, with 94 percent aligned with international norms established by the International Organization for Standardization (ISO) and International Electrotechnical Commission (IEC). Since 2014, the scope of mandatory certification has expanded significantly, from 106 products governed by 14 Quality Control Orders (QCOs) to 773 goods now regulated through 191 QCOs plus two horizontal QCOs. Hallmarking of Gold and Silver Jewellery- BIS Care App The BIS Care app enables consumers to easily verify hallmarked jewellery by simply entering the HUID number to check purity, product type, and details of the jeweller and hallmarking centre. Available free on both Android and iOS in 12 languages , it also allows users to verify ISI marks, check licence numbers, and register complaints about suspected non-compliant products . The app serves as a valuable tool for informed purchasing and supports BIS efforts to ensure the availability of safe products and fair-trade practices for consumers nationwide. National Test House The National Test House (NTH) functions under the administrative control of the Department of Consumer Affairs in the Ministry of Consumer Affairs, Food, and Public Distribution, and is one of India’s leading scientific institutions. Established in 1912 under the Railway Board, it has grown into a trusted laboratory for testing, calibration, evaluation, and quality control of a wide range of engineering materials and finished products . NTH issues test certificates that comply with national and international standards as well as customer-specific requirements, ensuring reliability and quality in assessment. The institution plays an important role across industry, trade, and standardisation, supporting the growth of indigenous manufacturing and acting as a vital link between industrial research and production. The National Test House is modernising its operations through the adoption of digital solutions. The Laboratory Data Automation System (LDAS) is being introduced to reduce manual errors, shorten turnaround times, and expedite the completion of quality tests, thereby enhancing overall capacity and efficiency. Additionally, a new mobile application will enable both industry and consumers to access laboratory services more easily, streamlining engagement and improving service delivery. The recent performance of NTH reflects its strong growth, with sample testing increasing by 60.36 percent to 45,926 samples in 2024-25 , and revenue rising by 49.89 percent to Rs. 44.45 crore , compared to Rs. 29.66 crore in the previous year with targeted revenue for FY 2025–26 being Rs.80 crore. The Legal Metrology Rules- Recent Amendments (2025) In October 2025 , the Department of Consumer Affairs notified the Legal Metrology (Packaged Commodities) Amendment Rules, 2025 , specifying that medical device packages will now adhere to the labeling requirements outlined in the Medical Devices Rules, 2017. In October 2025, the Legal Metrology (Government Approved Test Centre) Amendment Rules, 2025, were notified, expanding the scope of approved test centres by recognizing regional reference laboratories and national test houses. To support compliance following GST-linked price revisions , the government has allowed manufacturers and packers to use existing packaging until March 2026 . Under the 2025 relaxations, they may update MRPs without redesigning packages, ensuring regulatory adherence while easing business operations. In November 2025, the department issued the Draft Legal Metrology (Packaged Commodities) (Second) Amendment Rules, 2025 , proposing to make it mandatory fore-commerce platforms selling imported packaged goods to offer a searchable and sortable filter by ‘Country of Origin’ . In December 2025, a new amendment made it mandatory for all pan masala packages , regardless of size, to display the Retail Sale Price along with all other required declarations as of 1 February 2026 . Overall, these amendments streamline regulatory requirements, eliminate earlier ambiguities, and enhance clarity across various sectors, including medical device labeling, measurement verification, and the packaging of goods. By expanding the verification network, strengthening disclosure norms, and tightening pricing transparency, the reforms collectively enhance consistency, accountability, and consumer protection. Furthermore, they support a more reliable regulatory environment that empowers consumers to make informed choices and ensures fairer market practices. Conclusion National Consumer Day 2025 highlights India’s ongoing commitment to safeguarding consumer rights and promoting trust in the marketplace. The theme “Efficient and Speedy Disposal through Digital Justice” is evident in the continued expansion of digital grievance redressal platforms such as e-Jagriti and the upgraded National Consumer Helpline, which have improved access, transparency, and disposal efficiency across the country. The wide range of programme activities, including digital launches, institutional collaborations, awareness initiatives, and recognition of innovation, underscores a coordinated approach to consumer empowerment. The reforms and initiatives highlighted, including the Consumer Protection Act, 2019, the establishment of the Central Consumer Protection Authority, expansion of the Consumer Welfare Fund, and the advancement of accessible grievance redressal systems, reflect a shift towards a responsive and technology-driven consumer justice system. Progress through BIS, National Test House, and the Legal Metrology framework has further strengthened quality assurance, standardisation, and accuracy in trade. Collectively, these measures demonstrate steady progress towards a fair, transparent, and consumer-centric ecosystem, reinforcing the core message that informed and empowered consumers are central to a healthy and equitable economy. References Ministry of Consumer Affairs, Food & Public Distribution Department of Consumer Affairs https://consumeraffairs.gov.in/public/upload/files/1743657766_AR%202024-25_Eng_1744632582.pdf https://consumeraffairs.gov.in/ https://doca.gov.in/ccpa/ https://e-jagriti.gov.in/ https://jagograhakjago.gov.in/ https://www.bis.gov.in/the-bureau/about-bis/?lang=en https://consumeraffairs.gov.in/pages/legal-metrology-overview https://consumeraffairs.gov.in/pages/national-test-house PIB Press Releases https://www.pib.gov.in/PressReleasePage.aspx?PRID=2157241 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2190535&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2179780&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2087600&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2187416&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2088051&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2087245&reg=3&lang=2 https://www.pib.gov.in/PressReleseDetailm.aspx?PRID=2077618&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2178951&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2111506&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2198764&reg=3&lang=1 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2183777 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2184053 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2168208 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2188363 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2198215 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2165412&reg=3&lang=2 Click here to download PDF ***** PIB Research (रिलीज़ आईडी: 2207673)",
    "scraped_at": "2025-12-23T09:48:03.421774"
  }
]