[
  {
    "id": "2207208",
    "ministry": "Vice President's Secretariat",
    "title": "Vice-President Shri C P Radhakrishnan participates in Birth Centenary celebrations of Shri Atal Bihari Vajpayee in Indore",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207208",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Vice President's Secretariat Vice-President Shri C P Radhakrishnan participates in Birth Centenary celebrations of Shri Atal Bihari Vajpayee in Indore Vice-President hails Atal Bihari Vajpayee as architect of modern, confident India Shri Atal Bihari Vajpayee elevated public discourse with dignity and grace: Vice-President Leadership is about service and responsibility: Vice-President प्रविष्टि तिथि:\r\n                21 DEC 2025 5:37PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, today participated in the Birth Centenary celebrations of Bharat Ratna Atal Bihari Vajpayee at Indore, Madhya Pradesh. The event was organised by the Atal Foundation. Recalling a couplet from the Tamil classic Thirukkural, the Vice-President said that while all human beings are equal by birth, greatness is achieved through one’s actions. The Vice-President said that Shri Atal Bihari Vajpayee was no ordinary individual but a mission in himself, who always remained “Atal” in his commitment to principles and values. He observed that Shri Atal Bihari Vajpayee is remembered and honoured for his exemplary actions as a statesman, administrator, parliamentarian, poet, and above all, as a great human being. The Vice-President noted that Shri Vajpayee believed deeply in dialogue, inclusive development and strong yet humane governance. He said that Shri Atal Ji elevated public discourse with dignity and grace and demonstrated that politics can be principled and compassionate. He added that this is why Shri Vajpayee’s birth anniversary is observed as Good Governance Day. Sharing personal reminiscences, the Vice-President recalled that Shri Vajpayee was always accessible to Members of Parliament and open to suggestions for nation-building from all quarters. He referred to the creation of the States of Jharkhand, Chhattisgarh and Uttarakhand during Shri Vajpayee’s tenure as Prime Minister, describing it as a farsighted step aimed at improving governance and administration. Highlighting Shri Vajpayee’s contribution as a nation-builder, the Vice-President cited landmark initiatives such as the Pradhan Mantri Gram Sadak Yojana and the Golden Quadrilateral project. Referring to the Pokhran nuclear tests of 1998, the Vice-President said that Shri Vajpayee’s leadership firmly established India as a confident and self-reliant nation. He stated that Shri Vajpayee’s vision is being carried forward under the leadership of Prime Minister Narendra Modi, who is steering the nation towards the goal of Viksit Bharat @2047. The Vice-President also recalled Shri Vajpayee’s deep association with Tamil Nadu, noting his respect for linguistic diversity, cultural plurality and dialogue, which earned him admiration cutting across political and ideological lines. Describing Shri Atal Bihari Vajpayee as a towering personality who shaped modern India with integrity, intellect and an unwavering commitment to democratic values, the Vice-President said that his life reminds the nation that leadership is not merely about authority, but about service, responsibility and commitment to the people. The Vice President also unveiled the statue of Devi Ahilyabai Holkar at Daly college premises. The Vice-President said he felt honoured to be part of the inauguration of the statue of Ahilya Bai Holkar, describing her as a visionary ruler who selflessly dedicated her life to the welfare and prosperity of the people. He also congratulated Indore for consistently being ranked as the cleanest city in the country, calling it a reflection of collective civic responsibility. The Governor of Madhya Pradesh, Shri Mangubhai Patel, the Chief Minister of Madhya Pradesh, Dr Mohan Yadav, along with other dignitaries, were present at the event. *** PR/ASM (रिलीज़ आईडी: 2207208) आगंतुक पटल  : 314 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Gujarati , Tamil , Malayalam Vice President's Secretariat Vice-President Shri C P Radhakrishnan participates in Birth Centenary celebrations of Shri Atal Bihari Vajpayee in Indore Vice-President hails Atal Bihari Vajpayee as architect of modern, confident India Shri Atal Bihari Vajpayee elevated public discourse with dignity and grace: Vice-President Leadership is about service and responsibility: Vice-President प्रविष्टि तिथि:\r\n                        21 DEC 2025 5:37PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, today participated in the Birth Centenary celebrations of Bharat Ratna Atal Bihari Vajpayee at Indore, Madhya Pradesh. The event was organised by the Atal Foundation. Recalling a couplet from the Tamil classic Thirukkural, the Vice-President said that while all human beings are equal by birth, greatness is achieved through one’s actions. The Vice-President said that Shri Atal Bihari Vajpayee was no ordinary individual but a mission in himself, who always remained “Atal” in his commitment to principles and values. He observed that Shri Atal Bihari Vajpayee is remembered and honoured for his exemplary actions as a statesman, administrator, parliamentarian, poet, and above all, as a great human being. The Vice-President noted that Shri Vajpayee believed deeply in dialogue, inclusive development and strong yet humane governance. He said that Shri Atal Ji elevated public discourse with dignity and grace and demonstrated that politics can be principled and compassionate. He added that this is why Shri Vajpayee’s birth anniversary is observed as Good Governance Day. Sharing personal reminiscences, the Vice-President recalled that Shri Vajpayee was always accessible to Members of Parliament and open to suggestions for nation-building from all quarters. He referred to the creation of the States of Jharkhand, Chhattisgarh and Uttarakhand during Shri Vajpayee’s tenure as Prime Minister, describing it as a farsighted step aimed at improving governance and administration. Highlighting Shri Vajpayee’s contribution as a nation-builder, the Vice-President cited landmark initiatives such as the Pradhan Mantri Gram Sadak Yojana and the Golden Quadrilateral project. Referring to the Pokhran nuclear tests of 1998, the Vice-President said that Shri Vajpayee’s leadership firmly established India as a confident and self-reliant nation. He stated that Shri Vajpayee’s vision is being carried forward under the leadership of Prime Minister Narendra Modi, who is steering the nation towards the goal of Viksit Bharat @2047. The Vice-President also recalled Shri Vajpayee’s deep association with Tamil Nadu, noting his respect for linguistic diversity, cultural plurality and dialogue, which earned him admiration cutting across political and ideological lines. Describing Shri Atal Bihari Vajpayee as a towering personality who shaped modern India with integrity, intellect and an unwavering commitment to democratic values, the Vice-President said that his life reminds the nation that leadership is not merely about authority, but about service, responsibility and commitment to the people. The Vice President also unveiled the statue of Devi Ahilyabai Holkar at Daly college premises. The Vice-President said he felt honoured to be part of the inauguration of the statue of Ahilya Bai Holkar, describing her as a visionary ruler who selflessly dedicated her life to the welfare and prosperity of the people. He also congratulated Indore for consistently being ranked as the cleanest city in the country, calling it a reflection of collective civic responsibility. The Governor of Madhya Pradesh, Shri Mangubhai Patel, the Chief Minister of Madhya Pradesh, Dr Mohan Yadav, along with other dignitaries, were present at the event. *** PR/ASM (रिलीज़ आईडी: 2207208)",
    "scraped_at": "2025-12-21T17:35:15.851018"
  },
  {
    "id": "2207185",
    "ministry": "Prime Minister's Office",
    "title": "English rendering of PM’s address during Bhoomi Poojan of urea plant in Namrup, Assam",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207185",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office English rendering of PM’s address during Bhoomi Poojan of urea plant in Namrup, Assam प्रविष्टि तिथि:\r\n                21 DEC 2025 4:25PM by PIB Delhi उज्जनिर रायज केने आसे? आपुनालुकोलोई मुर अंतोरिक मोरोम आरु स्रद्धा जासिसु। Governor of Assam, Shri Lakshman Prasad Acharya ji, Chief Minister Himanta Biswa Sarma ji, my colleague in the central government and your representative here, former Chief Minister of Assam, Sarbananda Sonowal ji, ministers of the Assam government, Members of Parliament, Members of the Legislative Assembly, other dignitaries, and all my brothers and sisters who have come in such large numbers to bless us, I see even more people outside the pandal than inside. This land of heroes like Saulung Sukapha and Mahavir Lachit Borphukan, this land of Bhimber Deuri, Martyr Kusal Kuvar, Moran Raja Bodousa, Malati Mem, Indira Miri, Swargadeo Sarbananda Singh and warrior woman Sati Sadhni, I bow with reverence to this great soil of Ujani Assam. Friends, I can see that all of you in such large numbers, far and wide, are showering your enthusiasm, your excitement and your affection. And especially, my mothers and sisters, the love and blessings that you have brought in such huge numbers is our greatest strength, our greatest energy, a wonderful feeling. Many of my sisters are present here carrying the fragrance of the tea gardens of Assam. This aroma of tea evokes a very special feeling in my relationship with Assam. I salute all of you. I express my heartfelt gratitude to all of you for this love and affection. Friends, Today is a big day for Assam and the entire North East. The long-awaited dream of Namrup and Dibrugarh is finally coming true today, and a new chapter of industrial progress is beginning in this entire region. Just a while ago, I performed the Bhoomi Poojan of the Ammonia-Urea Fertilizer Plant here. Before coming to Dibrugarh, I also inaugurated an airport terminal in Guwahati. Today everyone is saying that Assam has picked up a new pace of development. I want to tell you, what you are seeing right now, what you are experiencing, this is just the beginning. We have to take Assam much further; we have to move forward taking all of you along with us. The strength and role that Assam had during the Ahom Kingdom; Assam will become an equally powerful land in developed India. With the launch of new industries, the construction of modern infrastructure, advancements in semiconductors and their manufacturing, new opportunities in the agricultural sector, the progress of tea gardens and their workers, and growing potential in tourism, Assam is moving forward in every field. I extend my best wishes to all of you and to all the farmer brothers and sisters of the country for this modern fertilizer plant. I also congratulate you for the new terminal at Guwahati Airport. Under the BJP's double-engine government, this synergy of industry and connectivity is fulfilling Assam's aspirations and also inspiring our youth to dream big. Friends, The farmers of our country, our Anna Data, play a crucial role in building a developed India. Therefore, our government is working day and night keeping the interests of farmers paramount. Here, all of you are receiving the benefits of farmer-friendly schemes. Amidst the agricultural welfare schemes, it is also important that our farmers continue to get a continuous supply of fertilizers. This urea plant will ensure this in the coming years. About Rs 11 thousand crore will be spent on this fertilizer project. More than 12 lakh metric tons of fertilizer will be produced here every year. When production takes place here, supply will be faster and logistics costs will decrease. Friends, This unit of Namrup will also create thousands of new employment and self-employment opportunities. Many people will get permanent jobs right here as soon as the plant starts operating. In addition, there will be a large amount of work associated with the plant, including maintenance, supply, and construction. In all these areas, local people, and especially our young people, will find employment. But brothers and sisters, Just think, why is it that work for the welfare of farmers is only happening after the BJP government came to power? Our Namrup has been a center for fertilizer production for decades. There was a time when the fertilizers produced here powered the fields of the Northeast, supporting the crops of the farmers. Even when the supply of fertilizers became a challenge in many parts of the country, Namrup remained a source of hope for the farmers. However, the technology of the old factories became outdated over time, and the Congress governments paid no attention to it. The result was that many units of Namrup plant were shut down due to this reason. Farmers across the entire Northeast region suffered, and farmers throughout the country also faced difficulties; their incomes were negatively impacted, and farming became increasingly challenging. However, the Congress party did nothing to resolve this problem; they remained indifferent. Today, our double-engine government is addressing these very problems created by the Congress party. Friends, Just like in Assam, many fertilizer factories had shut down in other states of the country as well. Do you remember the plight of the farmers back then? Farmers had to stand in long queues for urea. Police had to be deployed at urea shops. The police used to lathi charge the farmers. Brothers and sisters, Our government is making every effort to improve the conditions which were worsened by the Congress. And they did it so badly, so badly that, even after working hard for 11 years, I still have a much more to do. During the Congress regime, fertilizer factories were shutting down. Whereas our government has started many plants on places like Gorakhpur, Sindri, Barauni, Ramagundam. The private sector is also being encouraged in this field. Today, as a result of this, we are taking strong steps in the direction of becoming self-reliant in the field of urea in the near future. Friends, In 2014, only 225 lakh metric tons of urea were produced in the country. Do you remember that figure? Will you remember the figure? You gave me work 10-11 years ago, then the production was 225 lakh metric tons. Remember this figure. With hard work in the last 10-11 years, we have increased the production to about 306 lakh metric tons. But we must not stop here, because there is still much to be done. They did not do the work they were supposed to do back then, and that's why I have to put in a little extra effort now. And right now, we need about 380 lakh metric tons of urea every year. We have reached 306, we have to do 70-80 more. But I assure the countrymen, the way we are working hard, the way we are planning and the way my farmer brothers and sisters are blessing us, we will leave no stone unturned in filling this gap as soon as possible. That's why I have to work a little extra hard. And brothers and sisters, I want to tell you one more thing, our government is very sensitive towards your interests. Even the urea that we have to import from abroad at high prices, we do not let that burden fall on our farmers. The BJP government provides subsidies and bears that cost itself. Farmers in India get a bag of urea for just 300 rupees, but for that one bag, the Indian government has to pay other countries, from where we import it, approximately 3,000 rupees. Now think about it, we buy it for 3,000 rupees and sell it for 300 rupees. We do not let this entire burden fall on the farmers of the country. The government bears this entire cost itself, so that my farmer brothers and sisters don't have to bear the burden. But I would also like to tell my farmer brothers and sisters that you too have to help me, and that help is not just for me, but also for you, my farmer brothers and sisters, and that is to protect Mother Earth. If we don't protect Mother Earth, no matter how many bags of urea we use, she will give us nothing in return. Just as when we are sick, we have to take medicine in the right dosage – if we need two pills and take four, it harms our body instead of helping it – the same applies to Mother Earth. If we keep adding excessive amounts of fertilizer just because our neighbour is doing it, Mother Earth will turn against us. We have no right to kill Mother Earth by force-feeding her urea. She is our mother, and we must protect this mother too. Friends, Today, from seed to market, the BJP government stands with the farmers. Money is being transferred directly into farmers' accounts for agricultural work, so that farmers don't have to wander around looking for loans. So far, approximately 4 lakh crore rupees have been transferred to farmers' accounts under the PM Kisan Samman Nidhi scheme. Will you remember this figure? Or will you forget it? Rs 4 lakh crore has been deposited directly into the accounts of the farmers of my country. This year, two new schemes worth 35 thousand crore rupees have been launched to help farmers – 35 thousand crore rupees! The PM Dhan Dhanya Krishi Yojana and the Dalhan Atma Nirbharta (Pulses Self-Reliance) Mission will boost agriculture. Friends, We are working keeping in mind every need of the farmers. Farmers are receiving support through Fasal Bima Yojana in case of crop damage due to adverse weather conditions. Procurement systems have been improved to ensure farmers receive fair prices for their produce. Our government firmly believes that the country will progress only when our farmers are strong, and we are making every possible effort to achieve this. Friends, After our government came to power at the center, we extended the Kisan Credit Card facility to livestock farmers and fish farmers as well. Kisan Credit Card, KCC, after getting the facility of KCC, our livestock farmers, our fish farmers, all of them are getting a lot of benefits. Remember this figure also, more than Rs 10 lakh crore assistance has been given to farmers this year through KCC. 10 lakh crore rupees. Farmers have also benefited greatly from the reduction in GST on bio-fertilizers. The BJP government is also providing significant encouragement to Indian farmers for natural farming. And I would like that some tehsils should come up in Assam which do 100% natural farming. You see, Assam can show direction to India. The farmers of Assam can guide the country. We have launched the National Mission on Natural Farming, and today millions of farmers have joined it. In the last few years, 10 thousand Farmer Producer Organizations - FPOs have been formed in the country. Keeping the North East in special focus, our government has also launched a mission related to edible oils, specifically palm oil. This mission will not only make India self-reliant in terms of edible oil but will also increase the income of the farmers here. Friends, We also have a large number of tea garden workers in this region. It is the BJP government itself which opened Jan Dhan bank accounts for seven and a half lakh tea garden workers of Assam. Now, because they are connected to the banking system, these workers can receive direct payments into their bank accounts. Our government is increasing the facilities of schools, roads, electricity, water and hospitals in the tea garden areas. Friends, Our government is moving forward with the mantra of Sabka Saath Sabka Vikas. This vision of ours has brought about a significant transformation in the lives of the poor in our country. In the last 11 years, due to our efforts, schemes, implementation of schemes, 25 crore people, remember this figure also, 25 crore people have come out of poverty. A neo middle class has emerged in the country. This has happened because the standard of living of poor families in India has continuously improved over the years. Some recent figures have come to light, which are indicative of the changes taking place in India. Friends, And all these things are very useful in the media, so I urge you to remember what I am telling you and share it with others. Friends, Previously, in the poorest families in villages, not even one out of ten families owned a motorcycle. Not even 1 out of 10 had it. According to the recent surveys, almost half of the families living in the village now have a bike or a car. Not only this, mobile phones have reached almost every home. Things like refrigerators, which were once considered a “luxury”, are now being seen in our neo-middle-class homes as well. Today, it has even found a place in the kitchens of villages. New data shows that despite smartphones, the trend of having TVs in villages is also increasing. This change did not happen on its own. This transformation is a result of the empowerment of the poor in the country, and the fact that the benefits of development are now reaching even the poorest people living in remote areas. Friends, The BJP's double-engine government is a government for the poor, tribals, youth, and women. That is why, our government is working to end decades of violence in Assam and the North East. Our government has always given top priority to the identity and culture of Assam. The BJP government highlights the symbols of Assamese pride on every platform. So, we proudly build a 125 feet statue of Mahavir Lachit Borphukan, we celebrate the birth centenary year of Bhupen Hazarika, the pride of Assam. We are giving global recognition to Assam's art and crafts, and to Assam's Gamosa (traditional scarf). Just a few days ago, Russian President Mr. Putin visited India, and when he was in Delhi, I proudly gifted him Assamese black tea. We give priority to every work that enhances the honour and dignity of Assam. But brothers and sisters, When the BJP does these things, the Congress party is the one that suffers the most. You may remember, when our government gave Bharat Ratna to Bhupen Da, Congress had openly opposed it. The National President of Congress had said that Modi is giving Bharat Ratna to dancers and singers. Tell me, is this an insult to Bhupen da or not? Is it an insult to art and culture or not? Is it an insult to Assam or not? This is what Congress does day and night, insulting. When we established a semiconductor unit in Assam, the Congress opposed that too. Don't forget, it was the Congress government that denied land rights to our brothers and sisters from the tea community for so many decades! The BJP government gave them both land rights and a life of dignity. And I am a tea seller myself, if I don't do it, who will? This Congress is still promoting anti-national thinking. These people want to settle those Bangladeshi infiltrators on the forest lands of Assam. Due to which their vote bank gets strengthened, they do not care if you get ruined, they have to strengthen their vote bank. Brothers and sisters, The Congress party has no concern for Assam or the people of Assam, or your identity. They are only interested in power, government, and continuing the practices they engaged in before. That is why they like illegal Bangladeshi infiltrators more. It was Congress that settled the illegal infiltrators, and it is Congress that is protecting them. That is why, the Congress party is opposing the revision of the voter list. We must protect Assam from this poisonous policy of appeasement and vote-bank politics practiced by the Congress. Today I give you a guarantee, to protect the identity of Assam, and the honour of Assam, BJP is standing with you like steel. Friends, Your blessings are my strength in building a developed India. Your love is my greatest asset. And that is why I find joy in living every moment for you. The role of Eastern India, our North East, is continuously increasing in building a developed India. I have said earlier also that Eastern India will become the growth engine of India's development. This new unit in Namrup is an example of this transformation. The fertilizer produced here will not be limited to the fields of Assam only. It will reach Bihar, Jharkhand, West Bengal, and eastern Uttar Pradesh. This is no small matter. This is the contribution of North East in the fertilizer needs of the country. Projects like Namrup show that in the times to come, North East will emerge as a major centre of self-reliant India. It will truly become the \"Ashtalakshmi\" (eight forms of Goddess Lakshmi). I once again congratulate you all on this new fertilizer plant. Say with me: Bharat Mata ki Jai. Bharat Mata Ki Jai. And this year marks 150 years of Vande Mataram, a moment of great pride for us. Let us all say: Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. *** MJPS/VJ/AK/SS (रिलीज़ आईडी: 2207185) आगंतुक पटल  : 287 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Bengali , Gujarati Prime Minister's Office English rendering of PM’s address during Bhoomi Poojan of urea plant in Namrup, Assam प्रविष्टि तिथि:\r\n                        21 DEC 2025 4:25PM by PIB Delhi उज्जनिर रायज केने आसे? आपुनालुकोलोई मुर अंतोरिक मोरोम आरु स्रद्धा जासिसु। Governor of Assam, Shri Lakshman Prasad Acharya ji, Chief Minister Himanta Biswa Sarma ji, my colleague in the central government and your representative here, former Chief Minister of Assam, Sarbananda Sonowal ji, ministers of the Assam government, Members of Parliament, Members of the Legislative Assembly, other dignitaries, and all my brothers and sisters who have come in such large numbers to bless us, I see even more people outside the pandal than inside. This land of heroes like Saulung Sukapha and Mahavir Lachit Borphukan, this land of Bhimber Deuri, Martyr Kusal Kuvar, Moran Raja Bodousa, Malati Mem, Indira Miri, Swargadeo Sarbananda Singh and warrior woman Sati Sadhni, I bow with reverence to this great soil of Ujani Assam. Friends, I can see that all of you in such large numbers, far and wide, are showering your enthusiasm, your excitement and your affection. And especially, my mothers and sisters, the love and blessings that you have brought in such huge numbers is our greatest strength, our greatest energy, a wonderful feeling. Many of my sisters are present here carrying the fragrance of the tea gardens of Assam. This aroma of tea evokes a very special feeling in my relationship with Assam. I salute all of you. I express my heartfelt gratitude to all of you for this love and affection. Friends, Today is a big day for Assam and the entire North East. The long-awaited dream of Namrup and Dibrugarh is finally coming true today, and a new chapter of industrial progress is beginning in this entire region. Just a while ago, I performed the Bhoomi Poojan of the Ammonia-Urea Fertilizer Plant here. Before coming to Dibrugarh, I also inaugurated an airport terminal in Guwahati. Today everyone is saying that Assam has picked up a new pace of development. I want to tell you, what you are seeing right now, what you are experiencing, this is just the beginning. We have to take Assam much further; we have to move forward taking all of you along with us. The strength and role that Assam had during the Ahom Kingdom; Assam will become an equally powerful land in developed India. With the launch of new industries, the construction of modern infrastructure, advancements in semiconductors and their manufacturing, new opportunities in the agricultural sector, the progress of tea gardens and their workers, and growing potential in tourism, Assam is moving forward in every field. I extend my best wishes to all of you and to all the farmer brothers and sisters of the country for this modern fertilizer plant. I also congratulate you for the new terminal at Guwahati Airport. Under the BJP's double-engine government, this synergy of industry and connectivity is fulfilling Assam's aspirations and also inspiring our youth to dream big. Friends, The farmers of our country, our Anna Data, play a crucial role in building a developed India. Therefore, our government is working day and night keeping the interests of farmers paramount. Here, all of you are receiving the benefits of farmer-friendly schemes. Amidst the agricultural welfare schemes, it is also important that our farmers continue to get a continuous supply of fertilizers. This urea plant will ensure this in the coming years. About Rs 11 thousand crore will be spent on this fertilizer project. More than 12 lakh metric tons of fertilizer will be produced here every year. When production takes place here, supply will be faster and logistics costs will decrease. Friends, This unit of Namrup will also create thousands of new employment and self-employment opportunities. Many people will get permanent jobs right here as soon as the plant starts operating. In addition, there will be a large amount of work associated with the plant, including maintenance, supply, and construction. In all these areas, local people, and especially our young people, will find employment. But brothers and sisters, Just think, why is it that work for the welfare of farmers is only happening after the BJP government came to power? Our Namrup has been a center for fertilizer production for decades. There was a time when the fertilizers produced here powered the fields of the Northeast, supporting the crops of the farmers. Even when the supply of fertilizers became a challenge in many parts of the country, Namrup remained a source of hope for the farmers. However, the technology of the old factories became outdated over time, and the Congress governments paid no attention to it. The result was that many units of Namrup plant were shut down due to this reason. Farmers across the entire Northeast region suffered, and farmers throughout the country also faced difficulties; their incomes were negatively impacted, and farming became increasingly challenging. However, the Congress party did nothing to resolve this problem; they remained indifferent. Today, our double-engine government is addressing these very problems created by the Congress party. Friends, Just like in Assam, many fertilizer factories had shut down in other states of the country as well. Do you remember the plight of the farmers back then? Farmers had to stand in long queues for urea. Police had to be deployed at urea shops. The police used to lathi charge the farmers. Brothers and sisters, Our government is making every effort to improve the conditions which were worsened by the Congress. And they did it so badly, so badly that, even after working hard for 11 years, I still have a much more to do. During the Congress regime, fertilizer factories were shutting down. Whereas our government has started many plants on places like Gorakhpur, Sindri, Barauni, Ramagundam. The private sector is also being encouraged in this field. Today, as a result of this, we are taking strong steps in the direction of becoming self-reliant in the field of urea in the near future. Friends, In 2014, only 225 lakh metric tons of urea were produced in the country. Do you remember that figure? Will you remember the figure? You gave me work 10-11 years ago, then the production was 225 lakh metric tons. Remember this figure. With hard work in the last 10-11 years, we have increased the production to about 306 lakh metric tons. But we must not stop here, because there is still much to be done. They did not do the work they were supposed to do back then, and that's why I have to put in a little extra effort now. And right now, we need about 380 lakh metric tons of urea every year. We have reached 306, we have to do 70-80 more. But I assure the countrymen, the way we are working hard, the way we are planning and the way my farmer brothers and sisters are blessing us, we will leave no stone unturned in filling this gap as soon as possible. That's why I have to work a little extra hard. And brothers and sisters, I want to tell you one more thing, our government is very sensitive towards your interests. Even the urea that we have to import from abroad at high prices, we do not let that burden fall on our farmers. The BJP government provides subsidies and bears that cost itself. Farmers in India get a bag of urea for just 300 rupees, but for that one bag, the Indian government has to pay other countries, from where we import it, approximately 3,000 rupees. Now think about it, we buy it for 3,000 rupees and sell it for 300 rupees. We do not let this entire burden fall on the farmers of the country. The government bears this entire cost itself, so that my farmer brothers and sisters don't have to bear the burden. But I would also like to tell my farmer brothers and sisters that you too have to help me, and that help is not just for me, but also for you, my farmer brothers and sisters, and that is to protect Mother Earth. If we don't protect Mother Earth, no matter how many bags of urea we use, she will give us nothing in return. Just as when we are sick, we have to take medicine in the right dosage – if we need two pills and take four, it harms our body instead of helping it – the same applies to Mother Earth. If we keep adding excessive amounts of fertilizer just because our neighbour is doing it, Mother Earth will turn against us. We have no right to kill Mother Earth by force-feeding her urea. She is our mother, and we must protect this mother too. Friends, Today, from seed to market, the BJP government stands with the farmers. Money is being transferred directly into farmers' accounts for agricultural work, so that farmers don't have to wander around looking for loans. So far, approximately 4 lakh crore rupees have been transferred to farmers' accounts under the PM Kisan Samman Nidhi scheme. Will you remember this figure? Or will you forget it? Rs 4 lakh crore has been deposited directly into the accounts of the farmers of my country. This year, two new schemes worth 35 thousand crore rupees have been launched to help farmers – 35 thousand crore rupees! The PM Dhan Dhanya Krishi Yojana and the Dalhan Atma Nirbharta (Pulses Self-Reliance) Mission will boost agriculture. Friends, We are working keeping in mind every need of the farmers. Farmers are receiving support through Fasal Bima Yojana in case of crop damage due to adverse weather conditions. Procurement systems have been improved to ensure farmers receive fair prices for their produce. Our government firmly believes that the country will progress only when our farmers are strong, and we are making every possible effort to achieve this. Friends, After our government came to power at the center, we extended the Kisan Credit Card facility to livestock farmers and fish farmers as well. Kisan Credit Card, KCC, after getting the facility of KCC, our livestock farmers, our fish farmers, all of them are getting a lot of benefits. Remember this figure also, more than Rs 10 lakh crore assistance has been given to farmers this year through KCC. 10 lakh crore rupees. Farmers have also benefited greatly from the reduction in GST on bio-fertilizers. The BJP government is also providing significant encouragement to Indian farmers for natural farming. And I would like that some tehsils should come up in Assam which do 100% natural farming. You see, Assam can show direction to India. The farmers of Assam can guide the country. We have launched the National Mission on Natural Farming, and today millions of farmers have joined it. In the last few years, 10 thousand Farmer Producer Organizations - FPOs have been formed in the country. Keeping the North East in special focus, our government has also launched a mission related to edible oils, specifically palm oil. This mission will not only make India self-reliant in terms of edible oil but will also increase the income of the farmers here. Friends, We also have a large number of tea garden workers in this region. It is the BJP government itself which opened Jan Dhan bank accounts for seven and a half lakh tea garden workers of Assam. Now, because they are connected to the banking system, these workers can receive direct payments into their bank accounts. Our government is increasing the facilities of schools, roads, electricity, water and hospitals in the tea garden areas. Friends, Our government is moving forward with the mantra of Sabka Saath Sabka Vikas. This vision of ours has brought about a significant transformation in the lives of the poor in our country. In the last 11 years, due to our efforts, schemes, implementation of schemes, 25 crore people, remember this figure also, 25 crore people have come out of poverty. A neo middle class has emerged in the country. This has happened because the standard of living of poor families in India has continuously improved over the years. Some recent figures have come to light, which are indicative of the changes taking place in India. Friends, And all these things are very useful in the media, so I urge you to remember what I am telling you and share it with others. Friends, Previously, in the poorest families in villages, not even one out of ten families owned a motorcycle. Not even 1 out of 10 had it. According to the recent surveys, almost half of the families living in the village now have a bike or a car. Not only this, mobile phones have reached almost every home. Things like refrigerators, which were once considered a “luxury”, are now being seen in our neo-middle-class homes as well. Today, it has even found a place in the kitchens of villages. New data shows that despite smartphones, the trend of having TVs in villages is also increasing. This change did not happen on its own. This transformation is a result of the empowerment of the poor in the country, and the fact that the benefits of development are now reaching even the poorest people living in remote areas. Friends, The BJP's double-engine government is a government for the poor, tribals, youth, and women. That is why, our government is working to end decades of violence in Assam and the North East. Our government has always given top priority to the identity and culture of Assam. The BJP government highlights the symbols of Assamese pride on every platform. So, we proudly build a 125 feet statue of Mahavir Lachit Borphukan, we celebrate the birth centenary year of Bhupen Hazarika, the pride of Assam. We are giving global recognition to Assam's art and crafts, and to Assam's Gamosa (traditional scarf). Just a few days ago, Russian President Mr. Putin visited India, and when he was in Delhi, I proudly gifted him Assamese black tea. We give priority to every work that enhances the honour and dignity of Assam. But brothers and sisters, When the BJP does these things, the Congress party is the one that suffers the most. You may remember, when our government gave Bharat Ratna to Bhupen Da, Congress had openly opposed it. The National President of Congress had said that Modi is giving Bharat Ratna to dancers and singers. Tell me, is this an insult to Bhupen da or not? Is it an insult to art and culture or not? Is it an insult to Assam or not? This is what Congress does day and night, insulting. When we established a semiconductor unit in Assam, the Congress opposed that too. Don't forget, it was the Congress government that denied land rights to our brothers and sisters from the tea community for so many decades! The BJP government gave them both land rights and a life of dignity. And I am a tea seller myself, if I don't do it, who will? This Congress is still promoting anti-national thinking. These people want to settle those Bangladeshi infiltrators on the forest lands of Assam. Due to which their vote bank gets strengthened, they do not care if you get ruined, they have to strengthen their vote bank. Brothers and sisters, The Congress party has no concern for Assam or the people of Assam, or your identity. They are only interested in power, government, and continuing the practices they engaged in before. That is why they like illegal Bangladeshi infiltrators more. It was Congress that settled the illegal infiltrators, and it is Congress that is protecting them. That is why, the Congress party is opposing the revision of the voter list. We must protect Assam from this poisonous policy of appeasement and vote-bank politics practiced by the Congress. Today I give you a guarantee, to protect the identity of Assam, and the honour of Assam, BJP is standing with you like steel. Friends, Your blessings are my strength in building a developed India. Your love is my greatest asset. And that is why I find joy in living every moment for you. The role of Eastern India, our North East, is continuously increasing in building a developed India. I have said earlier also that Eastern India will become the growth engine of India's development. This new unit in Namrup is an example of this transformation. The fertilizer produced here will not be limited to the fields of Assam only. It will reach Bihar, Jharkhand, West Bengal, and eastern Uttar Pradesh. This is no small matter. This is the contribution of North East in the fertilizer needs of the country. Projects like Namrup show that in the times to come, North East will emerge as a major centre of self-reliant India. It will truly become the \"Ashtalakshmi\" (eight forms of Goddess Lakshmi). I once again congratulate you all on this new fertilizer plant. Say with me: Bharat Mata ki Jai. Bharat Mata Ki Jai. And this year marks 150 years of Vande Mataram, a moment of great pride for us. Let us all say: Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. Vande Mataram. *** MJPS/VJ/AK/SS (रिलीज़ आईडी: 2207185)",
    "scraped_at": "2025-12-21T17:35:18.743777"
  },
  {
    "id": "2207225",
    "ministry": "AYUSH",
    "title": "Morarji Desai National Institute of Yoga (MDNIY) celebrates World Meditation Day, Highlighting Scientific Role of Meditation in Stress Management",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207225",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau AYUSH Morarji Desai National Institute of Yoga (MDNIY) celebrates World Meditation Day, Highlighting Scientific Role of Meditation in Stress Management Meditation is a scientific tool for stress management and neuroplasticity: Experts at MDNIY प्रविष्टि तिथि:\r\n                21 DEC 2025 6:38PM by PIB Delhi The Morarji Desai National Institute of Yoga (MDNIY), under the Ministry of Ayush, celebrated World Meditation Day today by organizing specialized meditation sessions that brought together eminent scholars, Yoga practitioners, and enthusiasts. The event underscored the convergence of ancient Yogic wisdom and modern medical science in addressing the growing global burden of stress. Addressing the gathering, Prof. (Dr.) Kashinath Samagandi, Director, MDNIY, highlighted the clinical relevance of meditation in today’s competitive world. He noted that nearly 60–70 per cent of stress is occupational in nature and stressed the need to align body and mind through techniques prescribed in the Patanjala Yogasutra . Referring to contemporary research, he explained that neuroimaging studies show Om chanting reduces activity in the amygdala—the brain’s centre for fear and negative emotions—by activating the prefrontal cortex, which regulates emotional responses. An fMRI study has demonstrated significant deactivation of the amygdala during loud Om chanting compared to the resting state. He further cited findings from All India Institute of Medical Sciences (AIIMS), New Delhi, indicating that Yoga Nidra produces measurable changes in brain activity associated with deep relaxation and emotional regulation, thereby reducing stress and systemic inflammation. Representing the spiritual lineage of meditation, Swami Muktimayananda of the Ramakrishna Mission, New Delhi, encouraged participants to turn inward for lasting peace. He emphasized that calming mental fluctuations begins with self-understanding and recognition of one’s true nature— Sat Chit Anand Swaroop —grounded in love and compassion. He also stressed adherence to Yama and Niyama to overcome ego, jealousy, and unfulfilled desires that disturb inner harmony. The programme featured practical demonstrations of various meditation techniques, aimed at equipping participants with effective tools to enhance mental and emotional resilience. The event concluded with a collective pledge to incorporate meditation into daily life to promote the vision of a “Healthy Mind, Healthy India.” The event was attended by Shri Atul Chawla from Vishvas Meditation, New Delhi; Dr. I. N. Acharya, Programme Officer, MDNIY; and Md. Taiyab Alam, Communication & Documentation Officer, MDNIY. Around 700 participants, including Yoga enthusiasts, students, faculty members, and officials from various departments, took part in the programme. It may be noted that the United Nations General Assembly last year proclaimed 21 December as World Meditation Day, reaffirming the right of every individual to enjoy the highest attainable standard of physical and mental health. This initiative aligns with the Ministry of Ayush’s ongoing efforts to integrate traditional Indian wisdom with modern lifestyle practices for a healthier society. *** SR/GS/SG (रिलीज़ आईडी: 2207225) आगंतुक पटल  : 238 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati , Tamil , Telugu AYUSH Morarji Desai National Institute of Yoga (MDNIY) celebrates World Meditation Day, Highlighting Scientific Role of Meditation in Stress Management Meditation is a scientific tool for stress management and neuroplasticity: Experts at MDNIY प्रविष्टि तिथि:\r\n                        21 DEC 2025 6:38PM by PIB Delhi The Morarji Desai National Institute of Yoga (MDNIY), under the Ministry of Ayush, celebrated World Meditation Day today by organizing specialized meditation sessions that brought together eminent scholars, Yoga practitioners, and enthusiasts. The event underscored the convergence of ancient Yogic wisdom and modern medical science in addressing the growing global burden of stress. Addressing the gathering, Prof. (Dr.) Kashinath Samagandi, Director, MDNIY, highlighted the clinical relevance of meditation in today’s competitive world. He noted that nearly 60–70 per cent of stress is occupational in nature and stressed the need to align body and mind through techniques prescribed in the Patanjala Yogasutra . Referring to contemporary research, he explained that neuroimaging studies show Om chanting reduces activity in the amygdala—the brain’s centre for fear and negative emotions—by activating the prefrontal cortex, which regulates emotional responses. An fMRI study has demonstrated significant deactivation of the amygdala during loud Om chanting compared to the resting state. He further cited findings from All India Institute of Medical Sciences (AIIMS), New Delhi, indicating that Yoga Nidra produces measurable changes in brain activity associated with deep relaxation and emotional regulation, thereby reducing stress and systemic inflammation. Representing the spiritual lineage of meditation, Swami Muktimayananda of the Ramakrishna Mission, New Delhi, encouraged participants to turn inward for lasting peace. He emphasized that calming mental fluctuations begins with self-understanding and recognition of one’s true nature— Sat Chit Anand Swaroop —grounded in love and compassion. He also stressed adherence to Yama and Niyama to overcome ego, jealousy, and unfulfilled desires that disturb inner harmony. The programme featured practical demonstrations of various meditation techniques, aimed at equipping participants with effective tools to enhance mental and emotional resilience. The event concluded with a collective pledge to incorporate meditation into daily life to promote the vision of a “Healthy Mind, Healthy India.” The event was attended by Shri Atul Chawla from Vishvas Meditation, New Delhi; Dr. I. N. Acharya, Programme Officer, MDNIY; and Md. Taiyab Alam, Communication & Documentation Officer, MDNIY. Around 700 participants, including Yoga enthusiasts, students, faculty members, and officials from various departments, took part in the programme. It may be noted that the United Nations General Assembly last year proclaimed 21 December as World Meditation Day, reaffirming the right of every individual to enjoy the highest attainable standard of physical and mental health. This initiative aligns with the Ministry of Ayush’s ongoing efforts to integrate traditional Indian wisdom with modern lifestyle practices for a healthier society. *** SR/GS/SG (रिलीज़ आईडी: 2207225)",
    "scraped_at": "2025-12-21T17:35:21.031733"
  },
  {
    "id": "2207270",
    "ministry": "Ministry of Rural Development",
    "title": "“The ‘Viksit Bharat: G Ram G’ Yojana is a step beyond MGNREGA” – Union Minister for Rural Development Shri Shivraj Singh Chouhan",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207270",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Rural Development “The ‘Viksit Bharat: G Ram G’ Yojana is a step beyond MGNREGA” – Union Minister for Rural Development Shri Shivraj Singh Chouhan “My labourer brothers, now there is a legal guarantee of 125 days of work, not just 100,” said Shri Shivraj Singh Chouhan “Once again, there is a conspiracy to mislead the country in the name of MGNREGA,” Shri Chouhan added प्रविष्टि तिथि:\r\n                21 DEC 2025 8:26PM by PIB Delhi President Droupadi Murmu today gave her assent to the ‘Viksit Bharat: G Ram G’ Bill. With this, the Bill has now become an Act of law. Following the President’s approval, Union Minister for Rural Development, and Agriculture and Farmers’ Welfare, Shri Shivraj Singh Chouhan issued a statement explaining the details of the ‘Viksit Bharat: G Ram G Act’ and addressing the misconceptions being spread about it. The Union Minister said that a deliberate attempt is being made to mislead the nation once again in the name of MGNREGA. “Rumours are being spread, whereas the truth is that the ‘Viksit Bharat: G Ram G Yojana’ is a progressive step forward from MGNREGA,” he stated. According to Shri Chouhan, the new programme ensures a legal guarantee of 125 days of employment instead of the previous 100 days. The provision for unemployment allowance in case of non-availability of work has also been further strengthened. Additionally, if there is a delay in payment of wages, there is now a provision for additional compensation. Highlighting the government’s commitment, the Union Minister said that a massive allocation of over ₹1,51,282 crore has been proposed for this scheme in the current year. This ensures adequate funds to provide employment and promote holistic rural development. The objective is to build developed, self-reliant, and poverty-free villages that are rich in employment opportunities. Under this vision of ‘Viksit Bharat through Viksit Villages’, works related to water conservation, rural infrastructure, livelihood activities, and disaster mitigation will be prioritised. These works will create sustainable income sources while strengthening rural resilience and productivity. Shri Chouhan further stated, “Along with the guarantee of 125 days of employment, special provisions have been made for small and marginal farmers so that they do not face difficulties during crucial agricultural seasons. This law stands firmly in favour of the poor, in support of progress, and in complete guarantee of employment for the workers. It carries forward the pledge to build developed villages as the foundation of a developed India.” Explaining additional measures, the Union Minister said that another significant provision under this Act is the increase in the administrative expenditure cap from 6% to 9%. Out of the proposed ₹1,51,282 crore allocation, 9% amounts to about ₹13,000 crore. This increased administrative expenditure will ensure that those who facilitate the implementation of this scheme — including panchayat secretaries, employment assistants, and technical staff — receive timely and adequate remuneration. With assured financial support, these frontline teams will be better equipped to manage projects efficiently and ensure the highest quality of work delivery at the grassroots level. The ‘Viksit Bharat: G Ram G Act’, according to the Union Minister, reflects the government’s deep commitment to inclusive growth, rural rejuvenation, and empowerment of workers. It aims to transform every village into a centre of productivity, dignity, and sustainability through guaranteed employment, fair wages, and community-driven assets. “This law is for the rights of the poor and the prosperity of the nation,” Shri Chouhan affirmed. “It guarantees jobs to our workers and builds the foundation for a Developed India through empowered and prosperous villages.” Concluding his remarks, Shri Shivraj Singh Chouhan appealed to citizens and all stakeholders to help spread the truth about the Act among the people. “Let us ensure that accurate information reaches every household and that no one falls prey to misinformation. ‘Viksit Bharat: G Ram G’ is not a replacement, but a stronger and more forward-looking continuation of the vision set forth under MGNREGA — a vision now expanded to achieve the dream of a truly Developed India.” प्रिय बहनों और भाइयों, मनरेगा के नाम पर फिर एक बार देश को गुमराह करने की साजिश हो रही है। भ्रम फैलाए जा रहे हैं, जबकि सच्चाई यह है कि विकसित भारत: जी राम जी योजना मनरेगा के आगे का कदम है। मजदूर भाइयों, अब 100 नहीं, बल्कि 125 दिनों के काम की कानूनी गारंटी है। काम न मिलने की… pic.twitter.com/IAskUoXmMf — Shivraj Singh Chouhan (@ChouhanShivraj) December 21, 2025 *** RC/MS (रिलीज़ आईडी: 2207270) आगंतुक पटल  : 192 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Kannada , Marathi , हिन्दी , Gujarati Ministry of Rural Development “The ‘Viksit Bharat: G Ram G’ Yojana is a step beyond MGNREGA” – Union Minister for Rural Development Shri Shivraj Singh Chouhan “My labourer brothers, now there is a legal guarantee of 125 days of work, not just 100,” said Shri Shivraj Singh Chouhan “Once again, there is a conspiracy to mislead the country in the name of MGNREGA,” Shri Chouhan added प्रविष्टि तिथि:\r\n                        21 DEC 2025 8:26PM by PIB Delhi President Droupadi Murmu today gave her assent to the ‘Viksit Bharat: G Ram G’ Bill. With this, the Bill has now become an Act of law. Following the President’s approval, Union Minister for Rural Development, and Agriculture and Farmers’ Welfare, Shri Shivraj Singh Chouhan issued a statement explaining the details of the ‘Viksit Bharat: G Ram G Act’ and addressing the misconceptions being spread about it. The Union Minister said that a deliberate attempt is being made to mislead the nation once again in the name of MGNREGA. “Rumours are being spread, whereas the truth is that the ‘Viksit Bharat: G Ram G Yojana’ is a progressive step forward from MGNREGA,” he stated. According to Shri Chouhan, the new programme ensures a legal guarantee of 125 days of employment instead of the previous 100 days. The provision for unemployment allowance in case of non-availability of work has also been further strengthened. Additionally, if there is a delay in payment of wages, there is now a provision for additional compensation. Highlighting the government’s commitment, the Union Minister said that a massive allocation of over ₹1,51,282 crore has been proposed for this scheme in the current year. This ensures adequate funds to provide employment and promote holistic rural development. The objective is to build developed, self-reliant, and poverty-free villages that are rich in employment opportunities. Under this vision of ‘Viksit Bharat through Viksit Villages’, works related to water conservation, rural infrastructure, livelihood activities, and disaster mitigation will be prioritised. These works will create sustainable income sources while strengthening rural resilience and productivity. Shri Chouhan further stated, “Along with the guarantee of 125 days of employment, special provisions have been made for small and marginal farmers so that they do not face difficulties during crucial agricultural seasons. This law stands firmly in favour of the poor, in support of progress, and in complete guarantee of employment for the workers. It carries forward the pledge to build developed villages as the foundation of a developed India.” Explaining additional measures, the Union Minister said that another significant provision under this Act is the increase in the administrative expenditure cap from 6% to 9%. Out of the proposed ₹1,51,282 crore allocation, 9% amounts to about ₹13,000 crore. This increased administrative expenditure will ensure that those who facilitate the implementation of this scheme — including panchayat secretaries, employment assistants, and technical staff — receive timely and adequate remuneration. With assured financial support, these frontline teams will be better equipped to manage projects efficiently and ensure the highest quality of work delivery at the grassroots level. The ‘Viksit Bharat: G Ram G Act’, according to the Union Minister, reflects the government’s deep commitment to inclusive growth, rural rejuvenation, and empowerment of workers. It aims to transform every village into a centre of productivity, dignity, and sustainability through guaranteed employment, fair wages, and community-driven assets. “This law is for the rights of the poor and the prosperity of the nation,” Shri Chouhan affirmed. “It guarantees jobs to our workers and builds the foundation for a Developed India through empowered and prosperous villages.” Concluding his remarks, Shri Shivraj Singh Chouhan appealed to citizens and all stakeholders to help spread the truth about the Act among the people. “Let us ensure that accurate information reaches every household and that no one falls prey to misinformation. ‘Viksit Bharat: G Ram G’ is not a replacement, but a stronger and more forward-looking continuation of the vision set forth under MGNREGA — a vision now expanded to achieve the dream of a truly Developed India.” प्रिय बहनों और भाइयों, मनरेगा के नाम पर फिर एक बार देश को गुमराह करने की साजिश हो रही है। भ्रम फैलाए जा रहे हैं, जबकि सच्चाई यह है कि विकसित भारत: जी राम जी योजना मनरेगा के आगे का कदम है। मजदूर भाइयों, अब 100 नहीं, बल्कि 125 दिनों के काम की कानूनी गारंटी है। काम न मिलने की… pic.twitter.com/IAskUoXmMf — Shivraj Singh Chouhan (@ChouhanShivraj) December 21, 2025 *** RC/MS (रिलीज़ आईडी: 2207270)",
    "scraped_at": "2025-12-21T17:35:22.779768"
  },
  {
    "id": "2207187",
    "ministry": "Ministry of Rural Development",
    "title": "President gives assent to Viksit Bharat—Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB—G RAM G) Bill, 2025",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207187",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Rural Development President gives assent to Viksit Bharat—Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB—G RAM G) Bill, 2025 The Act Enhances Statutory Employment Guarantee to 125 Days Panchayats to lead the future –planning power to be with Gram Sabha and Panchayats Viksit Bharat-G RAM G aligned with the Vision of Viksit Bharat@2047 प्रविष्टि तिथि:\r\n                21 DEC 2025 4:30PM by PIB Delhi The President of India has given assent to the Viksit Bharat—Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB—G RAM G) Bill , 2025 marking a significant milestone in the transformation of rural employment policy. The Act enhances the statutory wage employment guarantee to 125 days per financial year for rural households and seeks to advance empowerment, inclusive growth, convergence of development initiatives and saturation-based delivery, thereby strengthening the foundation for a prosperous, resilient and self-reliant Rural Bharat. Earlier, Parliament passed the Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Bill, 2025 , marking a decisive reform in India’s rural employment and development framework. The Act replaces the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA), 2005 with a modern statutory framework that enhances livelihood security and is aligned with the national vision of Viksit Bharat @2047 . Anchored in the principles of empowerment, growth, convergence and saturation, the Act seeks to transform rural employment from a standalone welfare intervention into an integrated instrument of development. It strengthens income security for rural households, modernises governance and accountability, and links wage employment with the creation of durable and productive rural assets, thereby laying the foundation for a prosperous and resilient Rural Bharat. Salient Features of the Act Enhanced Statutory Employment Guarantee The Act provides a statutory guarantee of not less than 125 days of wage employment per rural household in each financial year to households whose adult members volunteer to undertake unskilled manual work (Section 5(1)). This enhancement over the earlier 100-day entitlement significantly strengthens livelihood security, predictability of work, and income stability for rural households, while also enabling them to contribute more effectively and meaningfully to national development. Balanced Provision for Agriculture and Rural Labour To facilitate adequate availability of agricultural labour during peak sowing and harvesting seasons, the Act empowers States to notify an aggregated pause period aggregating to sixty days in a financial year (Section 6). The full 125-day employment guarantee remains intact, to be provided during the remaining period, ensuring a calibrated balance that supports both agricultural productivity and worker security. Timely Wage Payments The Act mandates payment of wages on a weekly basis or, in any case, within fifteen days of completion of work (Section 5(3)). In cases of delay beyond the stipulated period, delay compensation shall be payable in accordance with the provisions laid down in Schedule II, reinforcing wage security and protecting workers from delays. Employment Linked with Productive Rural Infrastructure Wage employment under the Act is explicitly aligned with the creation of durable public assets across four priority thematic domains (Section 4(2) read with Schedule I): Water security and water-related works Core rural infrastructure Livelihood-related infrastructure Works to mitigate extreme weather events All works are planned through a bottom-up process, and all assets created are aggregated into the Viksit Bharat National Rural Infrastructure Stack, ensuring convergence of public investments, avoidance of fragmentation, and outcome-based planning aimed at saturation of critical rural infrastructure, based on varying local needs. Decentralised Planning with National Convergence All works originate from Viksit Gram Panchayat Plans (VGPPs), prepared at the Gram Panchayat level through participatory processes and approved by the Gram Sabha (Sections 4(1)–4(3)). These plans are digitally and spatially integrated with national platforms, including PM Gati Shakti, enabling whole-of-government convergence while fully retaining decentralised decision-making. This integrated planning framework will enable Ministries and Departments to plan and implement works more effectively, avoid duplication and wastage of public resources, and accelerate development through saturation-based outcomes. Reformed Financial Architecture The Act is implemented as a Centrally Sponsored Scheme, to be notified and operationalised by the State Governments in accordance with the provisions of the Act. The cost-sharing pattern is 60:40 between the Centre and States, 90:10 for North Eastern and Himalayan States, and 100% central funding for Union Territories without legislatures. Funding is provided through State-wise normative allocations based on objective parameters prescribed in the Rules (Sections 4(5) and 22(4)), ensuring predictability, fiscal discipline, and sound planning, while fully preserving statutory entitlements to employment and unemployment allowance. Strengthened Administrative Capacity The administrative expenditure ceiling has been enhanced from 6% to 9%, enabling improved staffing, training, technical capacity and field-level support, and strengthening the ability of institutions to deliver outcomes effectively. The Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025 represents a decisive step towards renewing and strengthening India’s rural employment framework in line with the vision of Viksit Bharat @2047 . By enhancing the statutory wage employment guarantee to 125 days per financial year , the Act reinforces the right to demand employment while deepening decentralised, participatory governance. It integrates transparent, rule-based funding, accountability mechanisms, technology-enabled inclusion and convergence-driven development to ensure that rural employment not only provides income security but also contributes to sustainable livelihoods, resilient assets and long-term rural prosperity. Employment Guarantee and Right to Demand The Act does not dilute the right to demand employment. On the contrary, Section 5(1) places a clear statutory obligation on the Government to provide not less than 125 days of guaranteed wage employment to eligible rural households. The expansion of guaranteed days, together with strengthened accountability and grievance redressal mechanisms, reinforces the enforceability of this right. Normative Funding and Employment Provision The shift to normative allocations pertains to budgeting and fund-flow mechanisms and does not affect the legal entitlement to employment. Sections 4(5) and 22(4) ensure rule-based, predictable allocations while retaining the statutory obligation to provide employment or unemployment allowance. Decentralisation and Role of Panchayats The Act does not centralise planning or execution. Sections 16 to 19 vest planning, implementation and monitoring authority in Panchayats, Programme Officers and District authorities at appropriate tiers. What is integrated at the national level is visibility, coordination and convergence, not local decision-making. Employment and Asset Creation The Act enshrines an enhanced statutory livelihood guarantee of 125 days, while ensuring that employment contributes to productive, durable and climate-resilient assets. Employment generation and asset creation are designed as mutually reinforcing objectives, supporting long-term rural growth and resilience (Section 4(2) and Schedule I). Technology and Inclusion Technology under the Act is intended as an enabling mechanism, not a barrier. Sections 23 and 24 provide for technology-enabled transparency through biometric authentication, geo-tagging and real-time dashboards, while Section 20 strengthens social audits by Gram Sabhas, ensuring community oversight, transparency and inclusion. Unemployment Allowance The Act removes earlier dis-entitlement provisions and restores unemployment allowance as a meaningful statutory safeguard. Where employment is not provided within the stipulated period, unemployment allowance becomes payable after fifteen days. Conclusion The passage of the Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025 represents a significant renewal of India’s rural employment guarantee. By expanding statutory employment to 125 days, embedding decentralised and participatory planning, strengthening accountability, and institutionalising convergence and saturation-based development, the Act repositions rural employment as a strategic instrument for empowerment, inclusive growth and the creation of a prosperous and resilient Rural Bharat, fully aligned with the vision of Viksit Bharat @2047. **** RC/MS (रिलीज़ आईडी: 2207187) आगंतुक पटल  : 1358 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Khasi , Urdu , हिन्दी , Nepali , Marathi , Bengali , Assamese , Punjabi , Gujarati , Odia , Tamil , Telugu , Kannada , Malayalam Ministry of Rural Development President gives assent to Viksit Bharat—Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB—G RAM G) Bill, 2025 The Act Enhances Statutory Employment Guarantee to 125 Days Panchayats to lead the future –planning power to be with Gram Sabha and Panchayats Viksit Bharat-G RAM G aligned with the Vision of Viksit Bharat@2047 प्रविष्टि तिथि:\r\n                        21 DEC 2025 4:30PM by PIB Delhi The President of India has given assent to the Viksit Bharat—Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB—G RAM G) Bill , 2025 marking a significant milestone in the transformation of rural employment policy. The Act enhances the statutory wage employment guarantee to 125 days per financial year for rural households and seeks to advance empowerment, inclusive growth, convergence of development initiatives and saturation-based delivery, thereby strengthening the foundation for a prosperous, resilient and self-reliant Rural Bharat. Earlier, Parliament passed the Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Bill, 2025 , marking a decisive reform in India’s rural employment and development framework. The Act replaces the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA), 2005 with a modern statutory framework that enhances livelihood security and is aligned with the national vision of Viksit Bharat @2047 . Anchored in the principles of empowerment, growth, convergence and saturation, the Act seeks to transform rural employment from a standalone welfare intervention into an integrated instrument of development. It strengthens income security for rural households, modernises governance and accountability, and links wage employment with the creation of durable and productive rural assets, thereby laying the foundation for a prosperous and resilient Rural Bharat. Salient Features of the Act Enhanced Statutory Employment Guarantee The Act provides a statutory guarantee of not less than 125 days of wage employment per rural household in each financial year to households whose adult members volunteer to undertake unskilled manual work (Section 5(1)). This enhancement over the earlier 100-day entitlement significantly strengthens livelihood security, predictability of work, and income stability for rural households, while also enabling them to contribute more effectively and meaningfully to national development. Balanced Provision for Agriculture and Rural Labour To facilitate adequate availability of agricultural labour during peak sowing and harvesting seasons, the Act empowers States to notify an aggregated pause period aggregating to sixty days in a financial year (Section 6). The full 125-day employment guarantee remains intact, to be provided during the remaining period, ensuring a calibrated balance that supports both agricultural productivity and worker security. Timely Wage Payments The Act mandates payment of wages on a weekly basis or, in any case, within fifteen days of completion of work (Section 5(3)). In cases of delay beyond the stipulated period, delay compensation shall be payable in accordance with the provisions laid down in Schedule II, reinforcing wage security and protecting workers from delays. Employment Linked with Productive Rural Infrastructure Wage employment under the Act is explicitly aligned with the creation of durable public assets across four priority thematic domains (Section 4(2) read with Schedule I): Water security and water-related works Core rural infrastructure Livelihood-related infrastructure Works to mitigate extreme weather events All works are planned through a bottom-up process, and all assets created are aggregated into the Viksit Bharat National Rural Infrastructure Stack, ensuring convergence of public investments, avoidance of fragmentation, and outcome-based planning aimed at saturation of critical rural infrastructure, based on varying local needs. Decentralised Planning with National Convergence All works originate from Viksit Gram Panchayat Plans (VGPPs), prepared at the Gram Panchayat level through participatory processes and approved by the Gram Sabha (Sections 4(1)–4(3)). These plans are digitally and spatially integrated with national platforms, including PM Gati Shakti, enabling whole-of-government convergence while fully retaining decentralised decision-making. This integrated planning framework will enable Ministries and Departments to plan and implement works more effectively, avoid duplication and wastage of public resources, and accelerate development through saturation-based outcomes. Reformed Financial Architecture The Act is implemented as a Centrally Sponsored Scheme, to be notified and operationalised by the State Governments in accordance with the provisions of the Act. The cost-sharing pattern is 60:40 between the Centre and States, 90:10 for North Eastern and Himalayan States, and 100% central funding for Union Territories without legislatures. Funding is provided through State-wise normative allocations based on objective parameters prescribed in the Rules (Sections 4(5) and 22(4)), ensuring predictability, fiscal discipline, and sound planning, while fully preserving statutory entitlements to employment and unemployment allowance. Strengthened Administrative Capacity The administrative expenditure ceiling has been enhanced from 6% to 9%, enabling improved staffing, training, technical capacity and field-level support, and strengthening the ability of institutions to deliver outcomes effectively. The Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025 represents a decisive step towards renewing and strengthening India’s rural employment framework in line with the vision of Viksit Bharat @2047 . By enhancing the statutory wage employment guarantee to 125 days per financial year , the Act reinforces the right to demand employment while deepening decentralised, participatory governance. It integrates transparent, rule-based funding, accountability mechanisms, technology-enabled inclusion and convergence-driven development to ensure that rural employment not only provides income security but also contributes to sustainable livelihoods, resilient assets and long-term rural prosperity. Employment Guarantee and Right to Demand The Act does not dilute the right to demand employment. On the contrary, Section 5(1) places a clear statutory obligation on the Government to provide not less than 125 days of guaranteed wage employment to eligible rural households. The expansion of guaranteed days, together with strengthened accountability and grievance redressal mechanisms, reinforces the enforceability of this right. Normative Funding and Employment Provision The shift to normative allocations pertains to budgeting and fund-flow mechanisms and does not affect the legal entitlement to employment. Sections 4(5) and 22(4) ensure rule-based, predictable allocations while retaining the statutory obligation to provide employment or unemployment allowance. Decentralisation and Role of Panchayats The Act does not centralise planning or execution. Sections 16 to 19 vest planning, implementation and monitoring authority in Panchayats, Programme Officers and District authorities at appropriate tiers. What is integrated at the national level is visibility, coordination and convergence, not local decision-making. Employment and Asset Creation The Act enshrines an enhanced statutory livelihood guarantee of 125 days, while ensuring that employment contributes to productive, durable and climate-resilient assets. Employment generation and asset creation are designed as mutually reinforcing objectives, supporting long-term rural growth and resilience (Section 4(2) and Schedule I). Technology and Inclusion Technology under the Act is intended as an enabling mechanism, not a barrier. Sections 23 and 24 provide for technology-enabled transparency through biometric authentication, geo-tagging and real-time dashboards, while Section 20 strengthens social audits by Gram Sabhas, ensuring community oversight, transparency and inclusion. Unemployment Allowance The Act removes earlier dis-entitlement provisions and restores unemployment allowance as a meaningful statutory safeguard. Where employment is not provided within the stipulated period, unemployment allowance becomes payable after fifteen days. Conclusion The passage of the Viksit Bharat – Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025 represents a significant renewal of India’s rural employment guarantee. By expanding statutory employment to 125 days, embedding decentralised and participatory planning, strengthening accountability, and institutionalising convergence and saturation-based development, the Act repositions rural employment as a strategic instrument for empowerment, inclusive growth and the creation of a prosperous and resilient Rural Bharat, fully aligned with the vision of Viksit Bharat @2047. **** RC/MS (रिलीज़ आईडी: 2207187)",
    "scraped_at": "2025-12-21T17:35:25.351275"
  },
  {
    "id": "2207184",
    "ministry": "Ministry of Science & Technology",
    "title": "From Environment Protection to Employment Creation, EVs Driving India’s Next Growth Story: Dr Jitendra Singh",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207184",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Science & Technology From Environment Protection to Employment Creation, EVs Driving India’s Next Growth Story: Dr Jitendra Singh Union Minister Dr. Jitendra Singh Visits EV Expo at Bharat Mandapam, Highlights PM Narendra Modi’s Vision for Clean Mobility and Youth Entrepreneurship Govt backed Ecosystem enables young entrepreneurs to start EV-related ventures with modest investments, but with Big Turnovers: Dr Jitendra Singh प्रविष्टि तिथि:\r\n                21 DEC 2025 4:12PM by PIB Delhi NEW DELHI, December 21 : During his visit today to the Electric Vehicle (EV) Expo at Bharat Mandapam here, Union Minister of State (Independent Charge) for Science & Technology, Earth Sciences and Minister of State in the PMO, Personnel, Public Grievances, Pensions, Atomic Energy and Space, Dr Jitendra Singh observed that from environment protection to employment creation, EVs are driving India’s next growth story. The Minister also interacted with exhibitors and reviewed a wide range of electric mobility solutions and Make in India EV products showcased by domestic companies. During his visit, the Minister toured multiple stalls at the exhibition and took note of the rapid advancements being made by Indian manufacturers in electric vehicles, components and clean mobility technologies. He appreciated the growing confidence and capability of indigenous EV companies, terming the sector a key pillar of India’s transition towards a cleaner, greener and more sustainable future. Addressing the media, Dr Jitendra Singh said that Prime Minister Narendra Modi has, right from the beginning, sought to create widespread public awareness about environmental protection and e-mobility, while highlighting the new technological options available globally. He said India is not only benefiting from these global innovations but is also emerging as an active participant in this transformative journey towards clean energy and sustainable transport. The Minister drew a parallel between reforms in the clean energy ecosystem and recent policy initiatives, noting that the passage of the SHANTI Bill, 2025, to promote private participation in nuclear energy reflects the Government’s holistic approach to strengthening clean and reliable energy sources. He said electric mobility similarly aligns with the global shift towards clean energy while meeting India’s developmental and environmental goals. Highlighting the user-friendly nature of electric vehicles, Dr Jitendra Singh said EVs offer significant ease of driving compared to conventional vehicles, with reduced physical effort and simplified operations. He underlined the versatility of EVs, noting their expanding use across segments such as ambulances, e-rickshaws, passenger vehicles and commercial applications, making them suitable for diverse mobility needs. The Minister emphasized that electric mobility is not only vital from the perspective of transportation, environment and clean energy, but is also emerging as a powerful engine of entrepreneurship, employment and livelihoods, particularly for the youth. He said the ecosystem created under Prime Minister Modi’s leadership has enabled young entrepreneurs to start EV-related ventures with modest investments, supported by technical and financial assistance from the Government, and scale them into high-turnover enterprises within a short span of time. Dr Jitendra Singh stressed the need for greater outreach and awareness among young people about opportunities in the EV sector, adding that electric mobility represents a promising pathway for innovation-driven growth, self-reliance and sustainable development. The EV Expo, being held at Bharat Mandapam, brings together leading electric vehicle manufacturers, startups, technology providers and policy stakeholders on a common platform to showcase innovations, exchange ideas and accelerate India’s journey towards clean and smart mobility, in line with the Make in India and Viksit Bharat vision. ****** NKR/AK (रिलीज़ आईडी: 2207184) आगंतुक पटल  : 268 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Science & Technology From Environment Protection to Employment Creation, EVs Driving India’s Next Growth Story: Dr Jitendra Singh Union Minister Dr. Jitendra Singh Visits EV Expo at Bharat Mandapam, Highlights PM Narendra Modi’s Vision for Clean Mobility and Youth Entrepreneurship Govt backed Ecosystem enables young entrepreneurs to start EV-related ventures with modest investments, but with Big Turnovers: Dr Jitendra Singh प्रविष्टि तिथि:\r\n                        21 DEC 2025 4:12PM by PIB Delhi NEW DELHI, December 21 : During his visit today to the Electric Vehicle (EV) Expo at Bharat Mandapam here, Union Minister of State (Independent Charge) for Science & Technology, Earth Sciences and Minister of State in the PMO, Personnel, Public Grievances, Pensions, Atomic Energy and Space, Dr Jitendra Singh observed that from environment protection to employment creation, EVs are driving India’s next growth story. The Minister also interacted with exhibitors and reviewed a wide range of electric mobility solutions and Make in India EV products showcased by domestic companies. During his visit, the Minister toured multiple stalls at the exhibition and took note of the rapid advancements being made by Indian manufacturers in electric vehicles, components and clean mobility technologies. He appreciated the growing confidence and capability of indigenous EV companies, terming the sector a key pillar of India’s transition towards a cleaner, greener and more sustainable future. Addressing the media, Dr Jitendra Singh said that Prime Minister Narendra Modi has, right from the beginning, sought to create widespread public awareness about environmental protection and e-mobility, while highlighting the new technological options available globally. He said India is not only benefiting from these global innovations but is also emerging as an active participant in this transformative journey towards clean energy and sustainable transport. The Minister drew a parallel between reforms in the clean energy ecosystem and recent policy initiatives, noting that the passage of the SHANTI Bill, 2025, to promote private participation in nuclear energy reflects the Government’s holistic approach to strengthening clean and reliable energy sources. He said electric mobility similarly aligns with the global shift towards clean energy while meeting India’s developmental and environmental goals. Highlighting the user-friendly nature of electric vehicles, Dr Jitendra Singh said EVs offer significant ease of driving compared to conventional vehicles, with reduced physical effort and simplified operations. He underlined the versatility of EVs, noting their expanding use across segments such as ambulances, e-rickshaws, passenger vehicles and commercial applications, making them suitable for diverse mobility needs. The Minister emphasized that electric mobility is not only vital from the perspective of transportation, environment and clean energy, but is also emerging as a powerful engine of entrepreneurship, employment and livelihoods, particularly for the youth. He said the ecosystem created under Prime Minister Modi’s leadership has enabled young entrepreneurs to start EV-related ventures with modest investments, supported by technical and financial assistance from the Government, and scale them into high-turnover enterprises within a short span of time. Dr Jitendra Singh stressed the need for greater outreach and awareness among young people about opportunities in the EV sector, adding that electric mobility represents a promising pathway for innovation-driven growth, self-reliance and sustainable development. The EV Expo, being held at Bharat Mandapam, brings together leading electric vehicle manufacturers, startups, technology providers and policy stakeholders on a common platform to showcase innovations, exchange ideas and accelerate India’s journey towards clean and smart mobility, in line with the Make in India and Viksit Bharat vision. ****** NKR/AK (रिलीज़ आईडी: 2207184)",
    "scraped_at": "2025-12-21T17:35:27.818784"
  },
  {
    "id": "2207272",
    "ministry": "Ministry of Social Justice & Empowerment",
    "title": "“Disability Does Not Limit Potential—Perspective Does”: Divya Kala Mela 2025 Concludes with a Powerful Message of Inclusion and Self-Reliance",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207272",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Social Justice & Empowerment “Disability Does Not Limit Potential—Perspective Does”: Divya Kala Mela 2025 Concludes with a Powerful Message of Inclusion and Self-Reliance प्रविष्टि तिथि:\r\n                21 DEC 2025 8:50PM by PIB Delhi Reinforcing the idea that persons with disabilities seek opportunity, not sympathy, the nine-day Divya Kala Mela organised by the Department of Empowerment of Persons with Disabilities (DEPwD), Ministry of Social Justice and Empowerment, Government of India, concluded successfully today at Kartavya Path, India Gate. Held from 13 to 21 December 2025, the mela emerged as a compelling national platform showcasing the entrepreneurial strength, creative excellence and economic contribution of Divyang artisans and entrepreneurs from across the country. The return of Divya Kala Mela to Kartavya Path marked its 28th edition since the initiative began at the same venue in December 2022, underscoring the evolution of the mela into a sustained movement for economic empowerment. Across 28 editions held nationwide, more than 2,362 Divyang participants have taken part, collectively generating business exceeding ₹23 crore. In the Delhi edition alone, around 100 Divyang artisans and entrepreneurs from 20 States displayed a diverse range of products, with home décor, organic food items and handicrafts witnessing strong consumer demand and sales crossing ₹2 crore—reflecting growing public confidence in Divyang-led enterprises. The mela also strengthened pathways to employment and financial inclusion. A special job fair organised on 16 December witnessed participation from 157 Divyang youth, of whom 99 were shortlisted and several received on-the-spot job offers from reputed companies. Further supporting entrepreneurship, the National Divyang Finance and Development Corporation (NDFDC) sanctioned loans exceeding ₹1.05 crore to Divyang entrepreneurs, while ALIMCO facilitated the distribution and registration of assistive devices, enhancing functional independence and productivity. A major highlight of the closing day was the “Divya Kala Shakti” cultural programme, where Divyang artists from the Delhi-NCR region captivated audiences with inspiring performances of dance and music, powerfully conveying that artistic expression transcends physical limitations. The Experience Zone, along with adaptive sports such as Blind Cricket and Boccia, offered visitors an immersive understanding of both the challenges and capabilities of persons with disabilities, fostering greater social sensitivity and inclusion. The Department of Empowerment of Persons with Disabilities and NDFDC expressed gratitude to the citizens of Delhi, the local administration and the authorities at Kartavya Path for their support in making the event a success. The Department reaffirmed its commitment to organising similar initiatives across the country, with the objective of building a truly inclusive, dignified and opportunity-driven society where Divyangjan are recognised as equal partners in India’s journey towards self-reliance. ***** KV (रिलीज़ आईडी: 2207272) आगंतुक पटल  : 128 Ministry of Social Justice & Empowerment “Disability Does Not Limit Potential—Perspective Does”: Divya Kala Mela 2025 Concludes with a Powerful Message of Inclusion and Self-Reliance प्रविष्टि तिथि:\r\n                        21 DEC 2025 8:50PM by PIB Delhi Reinforcing the idea that persons with disabilities seek opportunity, not sympathy, the nine-day Divya Kala Mela organised by the Department of Empowerment of Persons with Disabilities (DEPwD), Ministry of Social Justice and Empowerment, Government of India, concluded successfully today at Kartavya Path, India Gate. Held from 13 to 21 December 2025, the mela emerged as a compelling national platform showcasing the entrepreneurial strength, creative excellence and economic contribution of Divyang artisans and entrepreneurs from across the country. The return of Divya Kala Mela to Kartavya Path marked its 28th edition since the initiative began at the same venue in December 2022, underscoring the evolution of the mela into a sustained movement for economic empowerment. Across 28 editions held nationwide, more than 2,362 Divyang participants have taken part, collectively generating business exceeding ₹23 crore. In the Delhi edition alone, around 100 Divyang artisans and entrepreneurs from 20 States displayed a diverse range of products, with home décor, organic food items and handicrafts witnessing strong consumer demand and sales crossing ₹2 crore—reflecting growing public confidence in Divyang-led enterprises. The mela also strengthened pathways to employment and financial inclusion. A special job fair organised on 16 December witnessed participation from 157 Divyang youth, of whom 99 were shortlisted and several received on-the-spot job offers from reputed companies. Further supporting entrepreneurship, the National Divyang Finance and Development Corporation (NDFDC) sanctioned loans exceeding ₹1.05 crore to Divyang entrepreneurs, while ALIMCO facilitated the distribution and registration of assistive devices, enhancing functional independence and productivity. A major highlight of the closing day was the “Divya Kala Shakti” cultural programme, where Divyang artists from the Delhi-NCR region captivated audiences with inspiring performances of dance and music, powerfully conveying that artistic expression transcends physical limitations. The Experience Zone, along with adaptive sports such as Blind Cricket and Boccia, offered visitors an immersive understanding of both the challenges and capabilities of persons with disabilities, fostering greater social sensitivity and inclusion. The Department of Empowerment of Persons with Disabilities and NDFDC expressed gratitude to the citizens of Delhi, the local administration and the authorities at Kartavya Path for their support in making the event a success. The Department reaffirmed its commitment to organising similar initiatives across the country, with the objective of building a truly inclusive, dignified and opportunity-driven society where Divyangjan are recognised as equal partners in India’s journey towards self-reliance. ***** KV (रिलीज़ आईडी: 2207272)",
    "scraped_at": "2025-12-21T17:35:29.983871"
  },
  {
    "id": "2207176",
    "ministry": "PIB Headquarters",
    "title": "Aravalli Hills: Protecting Ecology and Ensuring Sustainable Development",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207176",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters Aravalli Hills: Protecting Ecology and Ensuring Sustainable Development प्रविष्टि तिथि:\r\n                21 DEC 2025 3:18PM by PIB Delhi Overview The Supreme Court of India, in its order dated November–December 2025, considered the recommendations of the Committee constituted by it vide order dated 9/5/24 and its further directions dated 12/8/2025 regarding uniform policy level definition of Aravali Hills and Ranges specifically in the context of regulating mining, and to incorporate the views of the concerned State Governments. Ministry of Environment, Forest and Climate Change (MoEFCC) led this Committee comprising Secretaries of departments of forest from UT of Delhi, Haryana, Rajasthan, Gujarat as well as representatives of Forest Survey of India, Central Empowered Committee and Geological Survey of India. The Court emphasized the ecological importance of the Aravalli range as a barrier against desertification, a groundwater recharge zone, and a biodiversity habitat Importance of Aravallis The Aravalli Hills and Ranges are among India’s oldest geological formations, stretching from Delhi through Haryana, Rajasthan, and into Gujarat. Historically, they have been recognized across 37 districts by state governments, with their ecological role noted as a natural barrier against northern desertification and a protector of biodiversity and water recharge. The Supreme Court has emphasized that uncontrolled mining here poses a “great threat to the ecology of the nation” and directed uniform criteria to safeguard them. Their conservation is thus vital for ecological stability, cultural heritage, and sustainable development. M/o EF&CC Committee Report Findings The Committee, constituted by MoEF&CC pursuant to Supreme Court directions had extensive consultation with State Governments  in which it emerged that only Rajasthan has a formally established definition for regulating mining in the Aravalli definition which was based on the 2002 Committee Report of the State Government relying on Richard Murphy landform classification which Identified all landforms rising 100 m above local relief as hills and based on that , prohibiting mining on both the hills and its supporting slopes. State of Rajasthan has been following this definition since 9th January, 2006. During deliberations, all States agreed to adopt the aforementioned uniform criterion of “100 metres above local relief” for regulating mining in the Aravalli region as had been in force in Rajasthan since 09.01.2006 while unanimously agreeing to make it more objective and transparent. All the landforms enclosed within the lowest binding contour encircling Hills of height 100 metre or more irrespective of their height and slopes are excluded for the purposes of grant of mining lease. Similarly, Aravali range has been explained as all the landforms which exists within 500 metres of two adjoining Hills of height 100 metre or more. All landforms existing within this 500 metre zone irrespective of their height and slopes are excluded for the purposes of grant of mining lease. It is, therefore, be wrong to conclude that mining is permitted in all landforms below 100 metre height. The Committee constituted by the Supreme Court proposed several improvements over the definition currently followed by Rajasthan to strengthen it and to make it more transparent, objective and conservation centric: A clear, objective, and scientifically robust criterion for determining local relief, enabling uniform application across all States and ensuring full protection of the entire hill landform up to its base. Explicit protection to ranges, which was absent in Rajasthan’s definition. The Committee recommended that hills within 500 metres of each other constitute a range and must be protected accordingly. Mandatory marking of Aravalli hills and ranges on Survey of India maps before any mining activity is considered. Clear identification of core/inviolate areas where mining is strictly prohibited. Detailed guidance for enabling sustainable mining and effective measures to prevent illegal mining. The aforesaid measures ensure a clear, map-verifiable operational definition of “Aravalli Hills” and “Aravalli Range,” and a regulatory framework that protects core/inviolate areas, restricts new mining, and hardens safeguards and enforcement against illegal mining. In its final judgment dated 20.11.2025 , the Hon’ble Supreme Court commended the Committee’s work including the assistance of the Technical Committee (para 33 of the Order) and also appreciated its recommendations regarding prevention of illegal mining and permitting only sustainable mining in Aravali Hills and Ranges (para 39 of the Order). The Supreme Court has accepted these recommendations and imposed an interim moratorium on new leases until a landscape-wide MPSM is prepared. Operational Definitions Aravalli Hills: Any landform located in the Aravalli districts, having an elevation of 100 metres or more from the local relief, shall be termed as Aravalli Hills. For this purpose, the local relief shall be determined with reference to the lowest contour line encircling the landform (as per the detailed procedure mentioned in the Report). The entire landform lying within the area enclosed by such lowest contour, whether actual or extended notionally, together with the Hill, its supporting slopes and associated landforms irrespective of their gradient , shall be deemed to constitute part of the Aravalli Hills. Aravalli Range: Two or more Aravalli Hills, as defined above, located within the proximity of 500m from each other, measured from the outermost point on the boundary of the lowest contour line on either side forms Aravalli Range. The area between the two Aravalli hills is determined by first creating buffers with a width equal to the minimum distance between the lowest contour lines of both hills. An intersection line is then generated between the two buffer polygons by joining the intersection of both buffer polygons. Finally, two lines, are drawn perpendicularly from both endpoints of the intersection line and extended till it intersects the lowest contour line of both hills. The entire area of landforms falling between the lowest contour lines of these Hills as explained, along with associated features such as Hills, Hillocks, supporting slopes, etc., shall also be included as part of Aravalli Range. These definitions are not just technical but they are ecological safeguards. By clearly identifying what counts as an Aravalli Hill or Range, they ensure that all critical landforms, slopes, and connecting habitats remain under statutory protection, thereby preventing ecological degradation. Comprehensive inclusion of landforms : By defining Aravalli Hills as any landform rising 100 metres or more above local relief , along with their supporting slopes , the entire ecological unit is protected. This prevents piecemeal exploitation of slopes or foothills that are vital for soil stability, water recharge, and vegetation cover. Cluster-based definition of ranges : Hills within 500 metres proximity are grouped into Aravalli Ranges. This ensures that valleys, intervening slopes, and smaller hillocks between major peaks are also safeguarded. Ecologically, this protects connectivity of habitats , wildlife corridors, and the integrity of the ridge system. Mapping on official toposheets : Using Survey of India maps to mark hills and ranges makes the boundaries objective and enforceable . This reduces ambiguity and strengthens regulatory enforcement against illegal mining or construction making it objective and transparent. Protection of core/inviolate areas : The definition is tied to ecological safeguards—Protected Areas, Tiger Reserves, Eco-Sensitive Zones around Protected Areas, wetlands, and CAMPA plantations are automatically included. This ensures that the most fragile and biodiversity-rich zones are off-limits to mining or development . Hon’ble Supreme Court in its order dated 20/11/2025 has inter-alia given the following directions: We accept the recommendations made by the Committee with regard to the definition of Aravali Hills and Ranges given by MoEF&CC; We further accept the recommendations with regard to the prohibition of mining in core/inviolate areas except in case of critical, strategic and atomic minerals (Atomic minerals notified in part B and Critical and Strategic minerals notified in Part D of the First Schedule of MMDR Act) and minerals listed in the Seventh Schedule of the MMDR Act 1957; We also accept the recommendations for sustainable mining in Aravali Hills and Ranges and the steps to be taken for preventing illegal mining in Aravali Hills and Ranges; We, however, direct the MoEF&CC to prepare a Management Plan for Sustainable Mining (MPSM) through Indian Council of Forestry Research and Education (ICFRE) for the entire Aravalis, i.e., understood as the continuous geological ridge extending from Gujarat to Delhi on the lines of the MPSM for Saranda and the MPSM must: Identify permissible areas for mining, ecologically sensitive, conservation-critical and restoration- priority areas within the Aravali landscape where mining shall be strictly prohibited or permitted only under exceptional and scientifically justified circumstances; Incorporate a thorough analysis of cumulative environmental impacts and the ecological carrying capacity of the region; and Include detailed post-mining restoration and rehabilitation measures. We further direct that till the MPSM is finalised by the MoEF&CC through ICFRE, no new mining leases should be granted; We further direct that upon the MPSM being finalised by MoEF&CC in consultation with the ICFRE, mining would be permitted as per the MPSM only in those areas wherein sustainable mining could be permitted; and In the meantime, the mining activities in the mines which are already in operation would be continued in strict compliance with the recommendations made by the Committee regarding sustainable mining in the report. Freeze on new mining leases : Because the definition is now operational, the Supreme Court has ordered no new mining leases until a Mining Plans for Sustainable Mining (MPSM) has been prepared by ICFRE on the lines of the one prepared by it for Saranda Forests in Jharkhand. This acts as a preventive shield against immediate ecological threats. Landscape-level conservation : By treating the Aravallis as a continuous geological ridge, the definition protects the entire landscape , not just isolated hills. This guards against fragmentation, which is one of the biggest ecological risks. Ecological functions preserved : Prevents desertification by maintaining the natural barrier against the Thar Desert. Safeguards groundwater recharge zones in foothills and valleys. Maintains biodiversity habitats across slopes, ridges, and intervening areas. Protects Delhi-NCR’s “green lungs” that regulate air quality and climate. How the Aravallis Are Protected The Committee’s findings, later upheld by the Supreme Court, provide a clear scientific basis for identifying the Aravalli Hills and Ranges. These findings, combined with strict mining regulations and monitoring, ensure that the ecology of the Aravallis remains safeguarded and free from imminent threat. Transparent, Objective and Scientific: Aravalli Hills are defined as landforms rising 100 metres or more above local relief, including their supporting slopes. This prevents loopholes and ensures all genuine hill areas are covered. Ranges mapped comprehensively: Hills within 500 metres proximity are clustered into Aravalli Ranges, so intervening valleys, slopes, and smaller hillocks are also protected. Core/inviolate zones safeguarded: Mining is absolutely prohibited in protected areas, eco-sensitive zones, tiger reserves, wetlands, and CAMPA plantation sites. No new mining leases: The Supreme Court has ordered a freeze on new mining leases until a detailed sustainable mining plan (MPSM) is prepared. Strict regulation of existing mines: Current operations must comply with environmental clearance, forest clearance, and continuous monitoring; violations can lead to suspension. Illegal mining prevention: Surveillance with drones, CCTV, weighbridges, and district task forces ensures strong enforcement against unauthorized activity. Landscape-level planning: The upcoming MPSM to be prepared by ICFRE will identify permissible and prohibited zones, assess ecological carrying capacity, and mandate post-mining restoration. Safeguards for Mining and Ecological Protection The findings upheld by the Supreme Court set out strict measures to ensure that mining does not compromise the ecological integrity of the Aravallis. These safeguards combine absolute prohibition in sensitive zones, sustainable mining practices, and strong enforcement against illegal operations. Regulation of Mining Protection of Core/inviolate Areas New leases (general minerals): No new mining leases in areas mapped as Aravalli Hills and Ranges under the prescribed procedure. Critical, strategic, and atomic minerals: A narrowly tailored exception applies to atomic minerals (First Schedule Part B), critical and strategic minerals (First Schedule Part D), and minerals in Schedule VII of the MMDR Act, given national security and economic imperatives; all other safeguards continue to apply. Existing/renewal leases: An expert team (Forest, Mining & Geology, Local Administration, SPCB, and domain experts) must inspect to verify compliance with EC/CTO conditions, prescribe additional safeguards, and ensure ongoing monitoring by SPCB. Absolute Prohibition Zones: Protected areas: Including tiger reserves and identified corridors. Eco-Sensitive Zones/Areas: Draft or final ESZ/ESA under EPA, 1986; where ESZ proposals are pending, apply Supreme Court’s default ESZ directions in T.N. Godavarman. Buffer Zone : No mining within 1.0 km of Protected Area boundary even if notified ESZ is smaller. Conservation investments: Areas with plantations raised via CAMPA, government funds, or international cooperation. Wetlands: 500 m from Ramsar/wetlands under the 2017 Rules. Sustainable Mining Safeguards Preventing Illegal Mining Forest land approvals: Forest clearance (Van Adhiniyam, 1980) in addition to EC; compensatory afforestation, Net Present Value, wildlife plans, safety-zone greenbelts, and soil-moisture conservation are mandatory. Environmental appraisal and EC: EAC/SEAC appraisal with ToR and standard EC conditions plus site-specific conditions; robust EIA/EMP addressing cumulative impacts as per the provisions of EIA Notification 2006, as amended . Compliance monitoring: Six-monthly reports; first-year joint inspections by MoEF&CC RO, SPCB, SEAC, DMG, Forest, and CGWB/SGWB; EC may be held in abeyance upon non-compliance. Audits and enforcement: Periodic checks by MoEF&CC RO and SPCBs, online monitoring, environmental auditors; repeated breaches can trigger EC/CTO revocation and penalties. Groundwater safeguards: NOCs for DARK zones or when operations meet groundwater; protect hydrogeology and recharge functions. Cultural heritage: NOC from ASI when near protected monuments (e.g., forts). Operational Controls: Regulated mining only: Permit with stringent conditions in designated areas; inviolate areas remain untouched. Surveillance: Drones, CCTV (including night-vision), high-tech weighbridges, trenches on access paths, and special anti-illegal mining patrols. Governance: District-level task forces (Revenue, Forest, Police, Mining), control rooms with toll-free complaint lines, and signage declaring prohibitions and penalties. Logistics oversight: E-challan matching for dispatches; SPCB-led teams for monitoring transport and storage; immediate closure of any illegal mines. Conclusion: The Aravalli Hills remain under robust protection through the Ministry of Environment, Forest and Climate Change and coordinated efforts with state governments. The Government reiterates its commitment to ecological preservation, sustainable development, and transparency. Contrary to alarmist claims, there is no imminent threat to the Aravallis’ ecology. Ongoing afforestation, eco-sensitive zone notifications, and strict monitoring of mining and urban activities ensure that the Aravallis continue to serve as a natural heritage and ecological shield for the nation. India’s resolve is clear: the Aravallis will be safeguarded for present and future generations while balancing conservation with responsible development. References: Ministry of Environment & Climate Change: Report of the Committee on Uniform definition of Aravalli Hills and Ranges Supreme Court of India: https://api.sci.gov.in/supremecourt/1995/2997/2997_1995_1_1502_66178_Order_20-Nov-2025.pdf Click here to see in PDF PIB RESEARCH (रिलीज़ आईडी: 2207176) आगंतुक पटल  : 2030 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी PIB Headquarters Aravalli Hills: Protecting Ecology and Ensuring Sustainable Development प्रविष्टि तिथि:\r\n                        21 DEC 2025 3:18PM by PIB Delhi Overview The Supreme Court of India, in its order dated November–December 2025, considered the recommendations of the Committee constituted by it vide order dated 9/5/24 and its further directions dated 12/8/2025 regarding uniform policy level definition of Aravali Hills and Ranges specifically in the context of regulating mining, and to incorporate the views of the concerned State Governments. Ministry of Environment, Forest and Climate Change (MoEFCC) led this Committee comprising Secretaries of departments of forest from UT of Delhi, Haryana, Rajasthan, Gujarat as well as representatives of Forest Survey of India, Central Empowered Committee and Geological Survey of India. The Court emphasized the ecological importance of the Aravalli range as a barrier against desertification, a groundwater recharge zone, and a biodiversity habitat Importance of Aravallis The Aravalli Hills and Ranges are among India’s oldest geological formations, stretching from Delhi through Haryana, Rajasthan, and into Gujarat. Historically, they have been recognized across 37 districts by state governments, with their ecological role noted as a natural barrier against northern desertification and a protector of biodiversity and water recharge. The Supreme Court has emphasized that uncontrolled mining here poses a “great threat to the ecology of the nation” and directed uniform criteria to safeguard them. Their conservation is thus vital for ecological stability, cultural heritage, and sustainable development. M/o EF&CC Committee Report Findings The Committee, constituted by MoEF&CC pursuant to Supreme Court directions had extensive consultation with State Governments  in which it emerged that only Rajasthan has a formally established definition for regulating mining in the Aravalli definition which was based on the 2002 Committee Report of the State Government relying on Richard Murphy landform classification which Identified all landforms rising 100 m above local relief as hills and based on that , prohibiting mining on both the hills and its supporting slopes. State of Rajasthan has been following this definition since 9th January, 2006. During deliberations, all States agreed to adopt the aforementioned uniform criterion of “100 metres above local relief” for regulating mining in the Aravalli region as had been in force in Rajasthan since 09.01.2006 while unanimously agreeing to make it more objective and transparent. All the landforms enclosed within the lowest binding contour encircling Hills of height 100 metre or more irrespective of their height and slopes are excluded for the purposes of grant of mining lease. Similarly, Aravali range has been explained as all the landforms which exists within 500 metres of two adjoining Hills of height 100 metre or more. All landforms existing within this 500 metre zone irrespective of their height and slopes are excluded for the purposes of grant of mining lease. It is, therefore, be wrong to conclude that mining is permitted in all landforms below 100 metre height. The Committee constituted by the Supreme Court proposed several improvements over the definition currently followed by Rajasthan to strengthen it and to make it more transparent, objective and conservation centric: A clear, objective, and scientifically robust criterion for determining local relief, enabling uniform application across all States and ensuring full protection of the entire hill landform up to its base. Explicit protection to ranges, which was absent in Rajasthan’s definition. The Committee recommended that hills within 500 metres of each other constitute a range and must be protected accordingly. Mandatory marking of Aravalli hills and ranges on Survey of India maps before any mining activity is considered. Clear identification of core/inviolate areas where mining is strictly prohibited. Detailed guidance for enabling sustainable mining and effective measures to prevent illegal mining. The aforesaid measures ensure a clear, map-verifiable operational definition of “Aravalli Hills” and “Aravalli Range,” and a regulatory framework that protects core/inviolate areas, restricts new mining, and hardens safeguards and enforcement against illegal mining. In its final judgment dated 20.11.2025 , the Hon’ble Supreme Court commended the Committee’s work including the assistance of the Technical Committee (para 33 of the Order) and also appreciated its recommendations regarding prevention of illegal mining and permitting only sustainable mining in Aravali Hills and Ranges (para 39 of the Order). The Supreme Court has accepted these recommendations and imposed an interim moratorium on new leases until a landscape-wide MPSM is prepared. Operational Definitions Aravalli Hills: Any landform located in the Aravalli districts, having an elevation of 100 metres or more from the local relief, shall be termed as Aravalli Hills. For this purpose, the local relief shall be determined with reference to the lowest contour line encircling the landform (as per the detailed procedure mentioned in the Report). The entire landform lying within the area enclosed by such lowest contour, whether actual or extended notionally, together with the Hill, its supporting slopes and associated landforms irrespective of their gradient , shall be deemed to constitute part of the Aravalli Hills. Aravalli Range: Two or more Aravalli Hills, as defined above, located within the proximity of 500m from each other, measured from the outermost point on the boundary of the lowest contour line on either side forms Aravalli Range. The area between the two Aravalli hills is determined by first creating buffers with a width equal to the minimum distance between the lowest contour lines of both hills. An intersection line is then generated between the two buffer polygons by joining the intersection of both buffer polygons. Finally, two lines, are drawn perpendicularly from both endpoints of the intersection line and extended till it intersects the lowest contour line of both hills. The entire area of landforms falling between the lowest contour lines of these Hills as explained, along with associated features such as Hills, Hillocks, supporting slopes, etc., shall also be included as part of Aravalli Range. These definitions are not just technical but they are ecological safeguards. By clearly identifying what counts as an Aravalli Hill or Range, they ensure that all critical landforms, slopes, and connecting habitats remain under statutory protection, thereby preventing ecological degradation. Comprehensive inclusion of landforms : By defining Aravalli Hills as any landform rising 100 metres or more above local relief , along with their supporting slopes , the entire ecological unit is protected. This prevents piecemeal exploitation of slopes or foothills that are vital for soil stability, water recharge, and vegetation cover. Cluster-based definition of ranges : Hills within 500 metres proximity are grouped into Aravalli Ranges. This ensures that valleys, intervening slopes, and smaller hillocks between major peaks are also safeguarded. Ecologically, this protects connectivity of habitats , wildlife corridors, and the integrity of the ridge system. Mapping on official toposheets : Using Survey of India maps to mark hills and ranges makes the boundaries objective and enforceable . This reduces ambiguity and strengthens regulatory enforcement against illegal mining or construction making it objective and transparent. Protection of core/inviolate areas : The definition is tied to ecological safeguards—Protected Areas, Tiger Reserves, Eco-Sensitive Zones around Protected Areas, wetlands, and CAMPA plantations are automatically included. This ensures that the most fragile and biodiversity-rich zones are off-limits to mining or development . Hon’ble Supreme Court in its order dated 20/11/2025 has inter-alia given the following directions: We accept the recommendations made by the Committee with regard to the definition of Aravali Hills and Ranges given by MoEF&CC; We further accept the recommendations with regard to the prohibition of mining in core/inviolate areas except in case of critical, strategic and atomic minerals (Atomic minerals notified in part B and Critical and Strategic minerals notified in Part D of the First Schedule of MMDR Act) and minerals listed in the Seventh Schedule of the MMDR Act 1957; We also accept the recommendations for sustainable mining in Aravali Hills and Ranges and the steps to be taken for preventing illegal mining in Aravali Hills and Ranges; We, however, direct the MoEF&CC to prepare a Management Plan for Sustainable Mining (MPSM) through Indian Council of Forestry Research and Education (ICFRE) for the entire Aravalis, i.e., understood as the continuous geological ridge extending from Gujarat to Delhi on the lines of the MPSM for Saranda and the MPSM must: Identify permissible areas for mining, ecologically sensitive, conservation-critical and restoration- priority areas within the Aravali landscape where mining shall be strictly prohibited or permitted only under exceptional and scientifically justified circumstances; Incorporate a thorough analysis of cumulative environmental impacts and the ecological carrying capacity of the region; and Include detailed post-mining restoration and rehabilitation measures. We further direct that till the MPSM is finalised by the MoEF&CC through ICFRE, no new mining leases should be granted; We further direct that upon the MPSM being finalised by MoEF&CC in consultation with the ICFRE, mining would be permitted as per the MPSM only in those areas wherein sustainable mining could be permitted; and In the meantime, the mining activities in the mines which are already in operation would be continued in strict compliance with the recommendations made by the Committee regarding sustainable mining in the report. Freeze on new mining leases : Because the definition is now operational, the Supreme Court has ordered no new mining leases until a Mining Plans for Sustainable Mining (MPSM) has been prepared by ICFRE on the lines of the one prepared by it for Saranda Forests in Jharkhand. This acts as a preventive shield against immediate ecological threats. Landscape-level conservation : By treating the Aravallis as a continuous geological ridge, the definition protects the entire landscape , not just isolated hills. This guards against fragmentation, which is one of the biggest ecological risks. Ecological functions preserved : Prevents desertification by maintaining the natural barrier against the Thar Desert. Safeguards groundwater recharge zones in foothills and valleys. Maintains biodiversity habitats across slopes, ridges, and intervening areas. Protects Delhi-NCR’s “green lungs” that regulate air quality and climate. How the Aravallis Are Protected The Committee’s findings, later upheld by the Supreme Court, provide a clear scientific basis for identifying the Aravalli Hills and Ranges. These findings, combined with strict mining regulations and monitoring, ensure that the ecology of the Aravallis remains safeguarded and free from imminent threat. Transparent, Objective and Scientific: Aravalli Hills are defined as landforms rising 100 metres or more above local relief, including their supporting slopes. This prevents loopholes and ensures all genuine hill areas are covered. Ranges mapped comprehensively: Hills within 500 metres proximity are clustered into Aravalli Ranges, so intervening valleys, slopes, and smaller hillocks are also protected. Core/inviolate zones safeguarded: Mining is absolutely prohibited in protected areas, eco-sensitive zones, tiger reserves, wetlands, and CAMPA plantation sites. No new mining leases: The Supreme Court has ordered a freeze on new mining leases until a detailed sustainable mining plan (MPSM) is prepared. Strict regulation of existing mines: Current operations must comply with environmental clearance, forest clearance, and continuous monitoring; violations can lead to suspension. Illegal mining prevention: Surveillance with drones, CCTV, weighbridges, and district task forces ensures strong enforcement against unauthorized activity. Landscape-level planning: The upcoming MPSM to be prepared by ICFRE will identify permissible and prohibited zones, assess ecological carrying capacity, and mandate post-mining restoration. Safeguards for Mining and Ecological Protection The findings upheld by the Supreme Court set out strict measures to ensure that mining does not compromise the ecological integrity of the Aravallis. These safeguards combine absolute prohibition in sensitive zones, sustainable mining practices, and strong enforcement against illegal operations. Regulation of Mining Protection of Core/inviolate Areas New leases (general minerals): No new mining leases in areas mapped as Aravalli Hills and Ranges under the prescribed procedure. Critical, strategic, and atomic minerals: A narrowly tailored exception applies to atomic minerals (First Schedule Part B), critical and strategic minerals (First Schedule Part D), and minerals in Schedule VII of the MMDR Act, given national security and economic imperatives; all other safeguards continue to apply. Existing/renewal leases: An expert team (Forest, Mining & Geology, Local Administration, SPCB, and domain experts) must inspect to verify compliance with EC/CTO conditions, prescribe additional safeguards, and ensure ongoing monitoring by SPCB. Absolute Prohibition Zones: Protected areas: Including tiger reserves and identified corridors. Eco-Sensitive Zones/Areas: Draft or final ESZ/ESA under EPA, 1986; where ESZ proposals are pending, apply Supreme Court’s default ESZ directions in T.N. Godavarman. Buffer Zone : No mining within 1.0 km of Protected Area boundary even if notified ESZ is smaller. Conservation investments: Areas with plantations raised via CAMPA, government funds, or international cooperation. Wetlands: 500 m from Ramsar/wetlands under the 2017 Rules. Sustainable Mining Safeguards Preventing Illegal Mining Forest land approvals: Forest clearance (Van Adhiniyam, 1980) in addition to EC; compensatory afforestation, Net Present Value, wildlife plans, safety-zone greenbelts, and soil-moisture conservation are mandatory. Environmental appraisal and EC: EAC/SEAC appraisal with ToR and standard EC conditions plus site-specific conditions; robust EIA/EMP addressing cumulative impacts as per the provisions of EIA Notification 2006, as amended . Compliance monitoring: Six-monthly reports; first-year joint inspections by MoEF&CC RO, SPCB, SEAC, DMG, Forest, and CGWB/SGWB; EC may be held in abeyance upon non-compliance. Audits and enforcement: Periodic checks by MoEF&CC RO and SPCBs, online monitoring, environmental auditors; repeated breaches can trigger EC/CTO revocation and penalties. Groundwater safeguards: NOCs for DARK zones or when operations meet groundwater; protect hydrogeology and recharge functions. Cultural heritage: NOC from ASI when near protected monuments (e.g., forts). Operational Controls: Regulated mining only: Permit with stringent conditions in designated areas; inviolate areas remain untouched. Surveillance: Drones, CCTV (including night-vision), high-tech weighbridges, trenches on access paths, and special anti-illegal mining patrols. Governance: District-level task forces (Revenue, Forest, Police, Mining), control rooms with toll-free complaint lines, and signage declaring prohibitions and penalties. Logistics oversight: E-challan matching for dispatches; SPCB-led teams for monitoring transport and storage; immediate closure of any illegal mines. Conclusion: The Aravalli Hills remain under robust protection through the Ministry of Environment, Forest and Climate Change and coordinated efforts with state governments. The Government reiterates its commitment to ecological preservation, sustainable development, and transparency. Contrary to alarmist claims, there is no imminent threat to the Aravallis’ ecology. Ongoing afforestation, eco-sensitive zone notifications, and strict monitoring of mining and urban activities ensure that the Aravallis continue to serve as a natural heritage and ecological shield for the nation. India’s resolve is clear: the Aravallis will be safeguarded for present and future generations while balancing conservation with responsible development. References: Ministry of Environment & Climate Change: Report of the Committee on Uniform definition of Aravalli Hills and Ranges Supreme Court of India: https://api.sci.gov.in/supremecourt/1995/2997/2997_1995_1_1502_66178_Order_20-Nov-2025.pdf Click here to see in PDF PIB RESEARCH (रिलीज़ आईडी: 2207176)",
    "scraped_at": "2025-12-21T17:35:31.923483"
  }
]