[
  {
    "id": "2207377",
    "ministry": "Prime Minister's Office",
    "title": "Chief Minister and Deputy Chief Minister of Bihar and Union Minister meet Prime Minister",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207377",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Chief Minister and Deputy Chief Minister of Bihar and Union Minister meet Prime Minister प्रविष्टि तिथि:\r\n                22 DEC 2025 3:33PM by PIB Delhi The Chief Minister of Bihar, Shri Nitish Kumar, Deputy Chief Minister of Bihar, Shri Samrat Choudhary and Union Minister, Shri Rajiv Ranjan Singh met the Prime Minister, Shri Narendra Modi in New Delhi today. The Prime Minister’s Office posted on X; “Chief Minister of Bihar, Shri @NitishKumar, Deputy CM, Shri @samrat4bjp and Union Minister, Shri @LalanSingh_1 met Prime Minister @narendramodi today.” Chief Minister of Bihar, Shri @NitishKumar , Deputy CM, Shri @samrat4bjp and Union Minister, Shri @LalanSingh_1 met Prime Minister @narendramodi today. pic.twitter.com/PUBfVW5llj — PMO India (@PMOIndia) December 22, 2025 *** MJPS/ST (रिलीज़ आईडी: 2207377) आगंतुक पटल  : 396 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Bengali , Punjabi , Gujarati , Tamil , Telugu , Kannada , Malayalam Prime Minister's Office Chief Minister and Deputy Chief Minister of Bihar and Union Minister meet Prime Minister प्रविष्टि तिथि:\r\n                        22 DEC 2025 3:33PM by PIB Delhi The Chief Minister of Bihar, Shri Nitish Kumar, Deputy Chief Minister of Bihar, Shri Samrat Choudhary and Union Minister, Shri Rajiv Ranjan Singh met the Prime Minister, Shri Narendra Modi in New Delhi today. The Prime Minister’s Office posted on X; “Chief Minister of Bihar, Shri @NitishKumar, Deputy CM, Shri @samrat4bjp and Union Minister, Shri @LalanSingh_1 met Prime Minister @narendramodi today.” Chief Minister of Bihar, Shri @NitishKumar , Deputy CM, Shri @samrat4bjp and Union Minister, Shri @LalanSingh_1 met Prime Minister @narendramodi today. pic.twitter.com/PUBfVW5llj — PMO India (@PMOIndia) December 22, 2025 *** MJPS/ST (रिलीज़ आईडी: 2207377)",
    "scraped_at": "2025-12-22T17:40:02.597314"
  },
  {
    "id": "2207398",
    "ministry": "AYUSH",
    "title": "WHO and AYUSH ministry hold key technical meeting in New Delhi to integrate Ayush Systems into Global Health Intervention Standards",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207398",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau AYUSH WHO and AYUSH ministry hold key technical meeting in New Delhi to integrate Ayush Systems into Global Health Intervention Standards प्रविष्टि तिथि:\r\n                22 DEC 2025 4:08PM by PIB Delhi In a major step toward the global integration of traditional healthcare, the World Health Organization (WHO) organized a two-day Technical Project Meeting on Traditional Medicine (TM) intervention code set development at the Hotel Imperial, New Delhi, on December 20–21, 2025. This initiative was fundamentally driven by the landmark Memorandum of Understanding (MoU) and Donor Agreement signed between the Ministry of Ayush and WHO on May 24, 2025. This agreement serves as the cornerstone for developing a dedicated Traditional Medicine module within the International Classification of Health Interventions (ICHI), the international global standard for classifying healthcare interventions, with India facilitating both the financial and technical frameworks necessary to bring Ayurveda, Siddha, and Unani (ASU) systems into the global healthcare mainstream. The facilitation of this meeting aligns with the vision of Prime Minister Shri Narendra Modi, who has emphasized that such initiatives help Ayush systems reach a maximum number of people globally in a scientific manner. During his Mann Ki Baat address, the Prime Minister noted that this standardized framework would enable Ayush systems to achieve global recognition and scientific credibility. Vaidya Rajesh Kotecha, Secretary, Ministry of Ayush, had previously observed that a dedicated ICHI module would facilitate global recognition of Ayush systems and support WHO’s efforts for inclusive, safe, and evidence-based healthcare. The technical sessions were chaired by Ms. Kavita Garg, Joint Secretary, Ministry of Ayush, who led the Indian team in the development of National Health Intervention Codes for Ayurveda, Siddha, and Unani medicine. Under her leadership, a distinguished team of experts contributed to the initiative, including Prof. Rabinarayan Acharya (Director General, CCRAS), Prof. N. J. Muthukumar (Director General, CCRS), and Dr. Zaheer Ahmad (Director General, CCRUM). The meeting saw extensive participation from all six WHO regions, including AFRO, AMRO, EMRO, EURO, SEARO, and WPRO, ensuring a comprehensive global perspective on traditional medicine. Key representatives from WHO Headquarters in Geneva, such as Robert Jakob, Nenad Kostanjsek, Stéphane Espinosa, and Dr. Pradeep Dua, led the classification discussions. They were joined by Dr. Geetha Krishnan from the WHO Global Traditional Medicine Centre (GTMC) in Jamnagar and Dr. Pawan Kumar Godatwar from the WHO SEARO office in Delhi. Member states including Bhutan, Brazil, India, Iran, Malaysia, Nepal, Mauritius, South Africa, Sri Lanka, Philippines, the UK, and the USA participated to appraise their country status and harmonize intervention descriptions. The integration of traditional medicine into ICHI is vital because intervention coding provides a common language for health procedures across different countries and medical systems. By standardizing these codes, healthcare providers can better document, report, and analyze the frequency and efficacy of traditional treatments. The project will be undertaken by the World Health Organization with strict timelines, adopting a scientific approach. It will not only aid in clinical research and policy support but also pave the way for scaling up traditional medicine within national health information systems globally. *** SR/GS/SG (रिलीज़ आईडी: 2207398) आगंतुक पटल  : 331 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Gujarati , Urdu , Marathi , हिन्दी , Tamil , Telugu AYUSH WHO and AYUSH ministry hold key technical meeting in New Delhi to integrate Ayush Systems into Global Health Intervention Standards प्रविष्टि तिथि:\r\n                        22 DEC 2025 4:08PM by PIB Delhi In a major step toward the global integration of traditional healthcare, the World Health Organization (WHO) organized a two-day Technical Project Meeting on Traditional Medicine (TM) intervention code set development at the Hotel Imperial, New Delhi, on December 20–21, 2025. This initiative was fundamentally driven by the landmark Memorandum of Understanding (MoU) and Donor Agreement signed between the Ministry of Ayush and WHO on May 24, 2025. This agreement serves as the cornerstone for developing a dedicated Traditional Medicine module within the International Classification of Health Interventions (ICHI), the international global standard for classifying healthcare interventions, with India facilitating both the financial and technical frameworks necessary to bring Ayurveda, Siddha, and Unani (ASU) systems into the global healthcare mainstream. The facilitation of this meeting aligns with the vision of Prime Minister Shri Narendra Modi, who has emphasized that such initiatives help Ayush systems reach a maximum number of people globally in a scientific manner. During his Mann Ki Baat address, the Prime Minister noted that this standardized framework would enable Ayush systems to achieve global recognition and scientific credibility. Vaidya Rajesh Kotecha, Secretary, Ministry of Ayush, had previously observed that a dedicated ICHI module would facilitate global recognition of Ayush systems and support WHO’s efforts for inclusive, safe, and evidence-based healthcare. The technical sessions were chaired by Ms. Kavita Garg, Joint Secretary, Ministry of Ayush, who led the Indian team in the development of National Health Intervention Codes for Ayurveda, Siddha, and Unani medicine. Under her leadership, a distinguished team of experts contributed to the initiative, including Prof. Rabinarayan Acharya (Director General, CCRAS), Prof. N. J. Muthukumar (Director General, CCRS), and Dr. Zaheer Ahmad (Director General, CCRUM). The meeting saw extensive participation from all six WHO regions, including AFRO, AMRO, EMRO, EURO, SEARO, and WPRO, ensuring a comprehensive global perspective on traditional medicine. Key representatives from WHO Headquarters in Geneva, such as Robert Jakob, Nenad Kostanjsek, Stéphane Espinosa, and Dr. Pradeep Dua, led the classification discussions. They were joined by Dr. Geetha Krishnan from the WHO Global Traditional Medicine Centre (GTMC) in Jamnagar and Dr. Pawan Kumar Godatwar from the WHO SEARO office in Delhi. Member states including Bhutan, Brazil, India, Iran, Malaysia, Nepal, Mauritius, South Africa, Sri Lanka, Philippines, the UK, and the USA participated to appraise their country status and harmonize intervention descriptions. The integration of traditional medicine into ICHI is vital because intervention coding provides a common language for health procedures across different countries and medical systems. By standardizing these codes, healthcare providers can better document, report, and analyze the frequency and efficacy of traditional treatments. The project will be undertaken by the World Health Organization with strict timelines, adopting a scientific approach. It will not only aid in clinical research and policy support but also pave the way for scaling up traditional medicine within national health information systems globally. *** SR/GS/SG (रिलीज़ आईडी: 2207398)",
    "scraped_at": "2025-12-22T17:40:05.517178"
  },
  {
    "id": "2207545",
    "ministry": "Ministry of Agriculture &\r\nFarmers Welfare",
    "title": "Rabi crop area coverage data as of 19 December 2025",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207545",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Agriculture &\r\nFarmers Welfare Rabi crop area coverage data as of 19 December 2025 Rabi sowing in 2025–26 records increase of over 8 lakh hectare compared to last year Total Rabi crop coverage up from previous year, reaches 580.70 lakh hectare Pulses coverage has increased by 3.72 lakh hectare, with gram recording a significant rise of 4.89 lakh hectare Oilseeds acreage, driven by rapeseed and mustard, rises to 93.33 lakh hectare प्रविष्टि तिथि:\r\n                22 DEC 2025 8:11PM by PIB Delhi Ministry of Agriculture & Farmers’ Welfare has released the progress of area coverage under Rabi crops as on 19th December 2025. Area: In lakh hectare S. No. Crops Normal Rabi Area (DES) Final Rabi Area 2024-25 Prograssive Area Sown Increase (+) / Decrease (-) over corrosponding period 2024-25 2025-26 Corrosponding period 2024-25 1 Wheat 312.35 328.04 301.63 300.34 1.29 2 Rice * 42.93 44.73 13.35 11.52 1.83 3 Pulses 140.42 134.08 126.74 123.02 3.72 a Gram 100.99 91.22 91.70 86.81 4.89 b Lentil 15.13 16.99 15.76 15.83 -0.08 c Fieldpea $ 6.50 - 7.92 8.27 -0.35 d Kulthi $ 1.98 - 1.73 1.99 -0.26 e Urdbean * 6.16 6.18 3.13 3.48 -0.34 f Moongbean * 1.41 1.36 0.42 0.43 -0.01 g Lathyrus $ 2.79 - 2.70 2.77 -0.07 h Other Pulses $ 5.46 18.33 3.37 3.44 -0.07 4 Shri Anna & Coarse cereals 55.33 59.05 45.66 45.05 0.61 a Jowar * 24.62 25.17 19.62 21.39 -1.78 b Bajra # 0.59 - 0.11 0.11 0.00 c Ragi # 0.72 - 0.68 0.48 0.21 d Small Millets # 0.16                    - 0.13 0.10 0.03 e Maize * 23.61 27.80 18.34 16.90 1.45 f Barley 5.63 6.08 6.78 6.08 0.70 5 Oilseeds 86.78 93.49 93.33 92.65 0.67 a Rapeseed & Mustard 79.17 86.57 87.80 86.57 1.23 b Groundnut * 3.69 3.37 2.36 2.83 -0.47 c Safflower 0.72 0.64 0.79 0.60 0.18 d Sunflower * 0.79 0.81 0.39 0.34 0.06 e Sesamum * 0.48 0.41 0.06 0.07 -0.01 f Linseed 1.93 1.69 1.61 2.00 -0.39 g Other Oilseeds 0.00 - 0.32 0.24 0.08 Total Crops 637.81 659.39 580.70 572.59 8.12 Note: *Average of 2022-23 to 2024-25, $ average (2016-17 to 2020-21) as per DES, # Average of (2018-19 to 2022-23) as per CWWG report. ***** RC/PU (रिलीज़ आईडी: 2207545) आगंतुक पटल  : 194 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Gujarati , Urdu , Marathi Ministry of Agriculture &\r\nFarmers Welfare Rabi crop area coverage data as of 19 December 2025 Rabi sowing in 2025–26 records increase of over 8 lakh hectare compared to last year Total Rabi crop coverage up from previous year, reaches 580.70 lakh hectare Pulses coverage has increased by 3.72 lakh hectare, with gram recording a significant rise of 4.89 lakh hectare Oilseeds acreage, driven by rapeseed and mustard, rises to 93.33 lakh hectare प्रविष्टि तिथि:\r\n                        22 DEC 2025 8:11PM by PIB Delhi Ministry of Agriculture & Farmers’ Welfare has released the progress of area coverage under Rabi crops as on 19th December 2025. Area: In lakh hectare S. No. Crops Normal Rabi Area (DES) Final Rabi Area 2024-25 Prograssive Area Sown Increase (+) / Decrease (-) over corrosponding period 2024-25 2025-26 Corrosponding period 2024-25 1 Wheat 312.35 328.04 301.63 300.34 1.29 2 Rice * 42.93 44.73 13.35 11.52 1.83 3 Pulses 140.42 134.08 126.74 123.02 3.72 a Gram 100.99 91.22 91.70 86.81 4.89 b Lentil 15.13 16.99 15.76 15.83 -0.08 c Fieldpea $ 6.50 - 7.92 8.27 -0.35 d Kulthi $ 1.98 - 1.73 1.99 -0.26 e Urdbean * 6.16 6.18 3.13 3.48 -0.34 f Moongbean * 1.41 1.36 0.42 0.43 -0.01 g Lathyrus $ 2.79 - 2.70 2.77 -0.07 h Other Pulses $ 5.46 18.33 3.37 3.44 -0.07 4 Shri Anna & Coarse cereals 55.33 59.05 45.66 45.05 0.61 a Jowar * 24.62 25.17 19.62 21.39 -1.78 b Bajra # 0.59 - 0.11 0.11 0.00 c Ragi # 0.72 - 0.68 0.48 0.21 d Small Millets # 0.16                    - 0.13 0.10 0.03 e Maize * 23.61 27.80 18.34 16.90 1.45 f Barley 5.63 6.08 6.78 6.08 0.70 5 Oilseeds 86.78 93.49 93.33 92.65 0.67 a Rapeseed & Mustard 79.17 86.57 87.80 86.57 1.23 b Groundnut * 3.69 3.37 2.36 2.83 -0.47 c Safflower 0.72 0.64 0.79 0.60 0.18 d Sunflower * 0.79 0.81 0.39 0.34 0.06 e Sesamum * 0.48 0.41 0.06 0.07 -0.01 f Linseed 1.93 1.69 1.61 2.00 -0.39 g Other Oilseeds 0.00 - 0.32 0.24 0.08 Total Crops 637.81 659.39 580.70 572.59 8.12 Note: *Average of 2022-23 to 2024-25, $ average (2016-17 to 2020-21) as per DES, # Average of (2018-19 to 2022-23) as per CWWG report. ***** RC/PU (रिलीज़ आईडी: 2207545)",
    "scraped_at": "2025-12-22T17:40:09.635513"
  },
  {
    "id": "2207581",
    "ministry": "Ministry of Commerce & Industry",
    "title": "Public Sector Banks Competing on Equal Footing with Private, Foreign Banks: Union Minister of Commerce and Industry Shri Piyush Goyal",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207581",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Commerce & Industry Public Sector Banks Competing on Equal Footing with Private, Foreign Banks: Union Minister of Commerce and Industry Shri Piyush Goyal India–New Zealand Pact Seventh FTA Under Prime Minister Narendra Modi, Reflects Shift Towards Developed Economy Partnerships: Shri Piyush Goyal India’s FTAs Go Beyond Market Access; New Zealand Commits USD 20 Billion FDI Under Binding Agreement: Shri Goyal Mudra and PM SVANidhi Schemes Expanded Credit Access for MSMEs; Banks Key to India’s Growth Story: Shri Goyal प्रविष्टि तिथि:\r\n                22 DEC 2025 10:04PM by PIB Delhi Union Minister of Commerce and Industry Shri Piyush Goyal today said it was encouraging to see public sector banks competing on equal footing with private and foreign banks while addressing the MSME Banking Excellence Awards in New Delhi today. He said that public sector banks have emerged as strong and competitive institutions, standing shoulder to shoulder with private and foreign banks in supporting India’s growth. Shri Goyal highlighted the critical role of the banking system in supporting micro, small and medium enterprises (MSMEs), noting that access to timely and adequate credit has been central to the growth of small entrepreneurs. He underlined that banks have played a key role in extending institutional finance to MSMEs, including small borrowers who earlier depended on informal sources of credit, thereby enabling them to start businesses, expand operations and improve their livelihoods. Referring to the announcement of the India–New Zealand Free Trade Agreement earlier in the day, the Minister said it was the seventh FTA concluded under the guidance of Prime Minister Shri Narendra Modi. He noted that India’s recent FTAs have been signed with developed economies, reflecting a shift towards partnerships with countries offering complementary strengths and significant business opportunities. Shri Goyal stated that India’s FTAs today are comprehensive in nature, encompassing not only market access for goods and services but also elements of technical collaboration to support innovators, farmers and entrepreneurs, thereby enhancing productivity and income. Referring specifically to the India–New Zealand FTA, he said New Zealand has made a binding commitment to invest USD 20 billion as foreign direct investment over the next 15 years. He added that this marked a significant shift compared to the USD 70 million invested by New Zealand in India over the past 25 years. The agreement, he said, includes provisions to claw back concessions if investment commitments are not met, making it a serious and enforceable commitment rather than a mere memorandum of understanding. The Minister noted that the agreement is expected to bring substantial investments in innovation, manufacturing and exports, with India emerging as a manufacturing base not only for New Zealand but also for other global markets. He emphasised that the MSME sector would be the biggest beneficiary of these developments. He called upon stakeholders to work together to rapidly realise the opportunities arising from the FTA and to aim at doubling, tripling and even quadrupling bilateral trade in goods and services. He also highlighted that the India–New Zealand FTA was negotiated by a team that was almost entirely women officers, making it the first such agreement finalised by women, and noted that India’s Ambassador is also a woman, underscoring the leadership role played by women in India’s growth journey. The Minister also noted that the day marked National Mathematics Day, commemorating the birth anniversary of Srinivasa Ramanujan, and linked it to the role of bankers in managing numbers that ultimately translate into economic opportunity for MSMEs. Congratulating the award winners, Shri Goyal expressed confidence that MSMEs, startups, incubators and young entrepreneurs would continue to receive strong support from the banking system, complemented by various government schemes. Recalling initiatives undertaken to ease credit access for small entrepreneurs, Shri Goyal referred to the launch of the Mudra loan scheme in the first year of the Prime Minister Narendra Modi’s government and the credit guarantee measures introduced during the COVID-19 pandemic, under which the government became the guarantor for MSME loans without additional collateral. He highlighted that nearly 70 per cent of Mudra loans have been extended to women entrepreneurs. He also referred to the PM SVANidhi scheme, noting how small loans of Rs 10,000, subsequently enhanced to Rs 20,000 and Rs 50,000 based on repayment performance, have helped street vendors avoid exploitative moneylenders and improve their livelihoods. Appreciating the efforts of banks in supporting small borrowers, Shri Goyal said such initiatives reflected the Prime Minister’s vision of “MSME” as “Maximum Support to Micro, Small and Medium Enterprises”. He observed that the world today views India as a trusted partner offering democracy, rule of law, national treatment to investors and decisive leadership. He attributed India’s transformation into the world’s fastest-growing large economy and a top five global economy to the collective effort of its people and institutions. The Minister noted that global expectations see India moving from a USD 4 trillion economy to USD 30–35 trillion by 2047, presenting an eight-fold growth opportunity. He pointed out that banks recorded profits of around Rs 3 lakh crore last year, demonstrating their capacity to lend to honest borrowers. He added that MSME credit has grown at a compound annual growth rate of about 14 per cent in recent years, with even greater opportunities ahead as India expands its international trade arrangements while safeguarding the interests of farmers, MSMEs, fishermen and the dairy sector. Calling upon banks to lend liberally and responsibly to support MSME growth, Shri Goyal said banks, now empowered and should continue to serve the nation with honesty and boldness. He encouraged speedy and transparent loan approvals and disbursements, adequate availability of capital for capex, opex and working capital, and proactive guidance to MSMEs to help them leverage government schemes and capital markets as they grow. Stating that many large corporates today began their journey as MSMEs, the Minister said the strength of the MSME sector would ultimately determine India’s future growth. He urged banks to be active partners in this journey, describing MSMEs and banks as inseparable twins whose combined growth would power India towards Viksit Bharat 2047. Congratulating the award winners once again, Shri Goyal extended his best wishes to all bankers and financial sector representatives for the year 2026, calling for faster, inclusive and sustainable growth during the Amrit Kaal. *** Abhishek Dayal/ Garima Singh/ Ishita Biswas (रिलीज़ आईडी: 2207581) आगंतुक पटल  : 73 Ministry of Commerce & Industry Public Sector Banks Competing on Equal Footing with Private, Foreign Banks: Union Minister of Commerce and Industry Shri Piyush Goyal India–New Zealand Pact Seventh FTA Under Prime Minister Narendra Modi, Reflects Shift Towards Developed Economy Partnerships: Shri Piyush Goyal India’s FTAs Go Beyond Market Access; New Zealand Commits USD 20 Billion FDI Under Binding Agreement: Shri Goyal Mudra and PM SVANidhi Schemes Expanded Credit Access for MSMEs; Banks Key to India’s Growth Story: Shri Goyal प्रविष्टि तिथि:\r\n                        22 DEC 2025 10:04PM by PIB Delhi Union Minister of Commerce and Industry Shri Piyush Goyal today said it was encouraging to see public sector banks competing on equal footing with private and foreign banks while addressing the MSME Banking Excellence Awards in New Delhi today. He said that public sector banks have emerged as strong and competitive institutions, standing shoulder to shoulder with private and foreign banks in supporting India’s growth. Shri Goyal highlighted the critical role of the banking system in supporting micro, small and medium enterprises (MSMEs), noting that access to timely and adequate credit has been central to the growth of small entrepreneurs. He underlined that banks have played a key role in extending institutional finance to MSMEs, including small borrowers who earlier depended on informal sources of credit, thereby enabling them to start businesses, expand operations and improve their livelihoods. Referring to the announcement of the India–New Zealand Free Trade Agreement earlier in the day, the Minister said it was the seventh FTA concluded under the guidance of Prime Minister Shri Narendra Modi. He noted that India’s recent FTAs have been signed with developed economies, reflecting a shift towards partnerships with countries offering complementary strengths and significant business opportunities. Shri Goyal stated that India’s FTAs today are comprehensive in nature, encompassing not only market access for goods and services but also elements of technical collaboration to support innovators, farmers and entrepreneurs, thereby enhancing productivity and income. Referring specifically to the India–New Zealand FTA, he said New Zealand has made a binding commitment to invest USD 20 billion as foreign direct investment over the next 15 years. He added that this marked a significant shift compared to the USD 70 million invested by New Zealand in India over the past 25 years. The agreement, he said, includes provisions to claw back concessions if investment commitments are not met, making it a serious and enforceable commitment rather than a mere memorandum of understanding. The Minister noted that the agreement is expected to bring substantial investments in innovation, manufacturing and exports, with India emerging as a manufacturing base not only for New Zealand but also for other global markets. He emphasised that the MSME sector would be the biggest beneficiary of these developments. He called upon stakeholders to work together to rapidly realise the opportunities arising from the FTA and to aim at doubling, tripling and even quadrupling bilateral trade in goods and services. He also highlighted that the India–New Zealand FTA was negotiated by a team that was almost entirely women officers, making it the first such agreement finalised by women, and noted that India’s Ambassador is also a woman, underscoring the leadership role played by women in India’s growth journey. The Minister also noted that the day marked National Mathematics Day, commemorating the birth anniversary of Srinivasa Ramanujan, and linked it to the role of bankers in managing numbers that ultimately translate into economic opportunity for MSMEs. Congratulating the award winners, Shri Goyal expressed confidence that MSMEs, startups, incubators and young entrepreneurs would continue to receive strong support from the banking system, complemented by various government schemes. Recalling initiatives undertaken to ease credit access for small entrepreneurs, Shri Goyal referred to the launch of the Mudra loan scheme in the first year of the Prime Minister Narendra Modi’s government and the credit guarantee measures introduced during the COVID-19 pandemic, under which the government became the guarantor for MSME loans without additional collateral. He highlighted that nearly 70 per cent of Mudra loans have been extended to women entrepreneurs. He also referred to the PM SVANidhi scheme, noting how small loans of Rs 10,000, subsequently enhanced to Rs 20,000 and Rs 50,000 based on repayment performance, have helped street vendors avoid exploitative moneylenders and improve their livelihoods. Appreciating the efforts of banks in supporting small borrowers, Shri Goyal said such initiatives reflected the Prime Minister’s vision of “MSME” as “Maximum Support to Micro, Small and Medium Enterprises”. He observed that the world today views India as a trusted partner offering democracy, rule of law, national treatment to investors and decisive leadership. He attributed India’s transformation into the world’s fastest-growing large economy and a top five global economy to the collective effort of its people and institutions. The Minister noted that global expectations see India moving from a USD 4 trillion economy to USD 30–35 trillion by 2047, presenting an eight-fold growth opportunity. He pointed out that banks recorded profits of around Rs 3 lakh crore last year, demonstrating their capacity to lend to honest borrowers. He added that MSME credit has grown at a compound annual growth rate of about 14 per cent in recent years, with even greater opportunities ahead as India expands its international trade arrangements while safeguarding the interests of farmers, MSMEs, fishermen and the dairy sector. Calling upon banks to lend liberally and responsibly to support MSME growth, Shri Goyal said banks, now empowered and should continue to serve the nation with honesty and boldness. He encouraged speedy and transparent loan approvals and disbursements, adequate availability of capital for capex, opex and working capital, and proactive guidance to MSMEs to help them leverage government schemes and capital markets as they grow. Stating that many large corporates today began their journey as MSMEs, the Minister said the strength of the MSME sector would ultimately determine India’s future growth. He urged banks to be active partners in this journey, describing MSMEs and banks as inseparable twins whose combined growth would power India towards Viksit Bharat 2047. Congratulating the award winners once again, Shri Goyal extended his best wishes to all bankers and financial sector representatives for the year 2026, calling for faster, inclusive and sustainable growth during the Amrit Kaal. *** Abhishek Dayal/ Garima Singh/ Ishita Biswas (रिलीज़ आईडी: 2207581)",
    "scraped_at": "2025-12-22T17:40:13.077700"
  },
  {
    "id": "2207434",
    "ministry": "Ministry of Commerce & Industry",
    "title": "INDEX OF EIGHT CORE INDUSTRIES (BASE YEAR: 2011-12=100) FOR NOVEMBER, 2025",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207434",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Commerce & Industry INDEX OF EIGHT CORE INDUSTRIES (BASE YEAR: 2011-12=100) FOR NOVEMBER, 2025 प्रविष्टि तिथि:\r\n                22 DEC 2025 5:00PM by PIB Delhi The combined Index of Eight Core Industries (ICI) increased by 1.8 per cent (provisional) in November, 2025 as compared to the Index in November, 2024. The production of Cement, Steel, Fertilizer and Coal recorded positive growth in November, 2025. The details of annual indices, monthly indices and growth rates are provided at Annex I and Annex II. The ICI measures the combined and individual performance of production of eight core industries viz. Coal, Crude Oil, Natural Gas, Refinery Products, Fertilizers, Steel, Cement and Electricity. The Eight Core Industries comprise 40.27 percent of the weight of items included in the Index of Industrial Production (IIP). The final growth rate of Index of Eight Core Industries for October 2025 was observed at (-) 0.1 per cent . The cumulative growth rate of ICI during April to November, 2025-26 is 2.4 per cent (provisional) as compared to the corresponding period of last year. The summary of the Index of Eight Core Industries is given below: Coal - Coal production (weight: 10.33 per cent) increased by 2.1 per cent in November, 2025 over November, 2024. Its cumulative index declined by 1.4 per cent during April to November, 2025-26 over corresponding period of the previous year. Crude Oil - Crude Oil production (weight: 8.98 per cent) declined by 3.2 per cent in November, 2025 over November, 2024. Its cumulative index declined by 1.3 per cent during April to November, 2025-26 over corresponding period of the previous year. Natural Gas - Natural Gas production (weight: 6.88 per cent) declined by 2.5 per cent in November, 2025 over November, 2024. Its cumulative index declined by 3.0 per cent during April to November, 2025-26 over corresponding period of the previous year. Petroleum Refinery Products - Petroleum Refinery production (weight: 28.04 per cent) declined by 0.9 per cent in November, 2025 over November, 2024. Its cumulative index increased by 0.2 per cent during April to November, 2025-26 over corresponding period of the previous year. Fertilizers - Fertilizer production (weight: 2.63 per cent) increased by 5.6 per cent in November, 2025 over November, 2024. Its cumulative index increased by 1.3 per cent during April to November, 2025-26 over corresponding period of the previous year. Steel - Steel production (weight: 17.92 per cent) increased by 6.1 per cent in November, 2025 over November, 2024. Its cumulative index increased by 9.7 per cent during April to November, 2025-26 over corresponding period of the previous year. Cement - Cement production (weight: 5.37 per cent) increased by 14.5 per cent in November, 2025 over November, 2024. Its cumulative index increased by 8.2 per cent during April to November, 2025-26 over corresponding period of the previous year. Electricity - Electricity generation (weight: 19.85 per cent) declined by 2.2 per cent in November, 2025 over November, 2024. Its cumulative index declined by 0.3 per cent during April to November, 2025-26 over corresponding period of the previous year. Note 1: Data for October, 2025 is Final. Data for November, 2025 is Provisional. Index numbers of Core Industries are revised/finalized as per updated data from source agencies. Note 2: Since April 2014, Electricity generation data from Renewable sources are also included. Note 3: The industry-wise weights indicated above are individual industry weights derived from IIP and blown up on pro rata basis to a combined weight of ICI equal to 100. Note 4: Since March 2019, a new steel product called Hot Rolled Pickled and Oiled (HRPO) under the item ‘Cold Rolled (CR) coils’ within the production of finished steel has also been included. Note 5: Release of the index for December, 2025 will be on Tuesday, 20 th January, 2026. Annex I Performance of Eight Core Industries Yearly Index & Growth Rate Ba s e Year: 2011-12=100 Index Sector Coal Crude Oil Natural Gas Refinery Products Fertilizers Steel Cement Electricity Overall Index Weight 10.33 8.98 6.88 28.04 2.63 17.92 5.37 19.85 100.00 2012-13 103.2 99.4 85.6 107.2 96.7 107.9 107.5 104.0 103.8 2013-14 104.2 99.2 74.5 108.6 98.1 115.8 111.5 110.3 106.5 2014-15 112.6 98.4 70.5 108.8 99.4 121.7 118.1 126.6 111.7 2015-16 118.0 97.0 67.2 114.1 106.4 120.2 123.5 133.8 115.1 2016-17 121.8 94.5 66.5 119.7 106.6 133.1 122.0 141.6 120.5 2017-18 124.9 93.7 68.4 125.2 106.6 140.5 129.7 149.2 125.7 2018-19 134.1 89.8 69.0 129.1 107.0 147.7 147.0 156.9 131.2 2019-20 133.6 84.5 65.1 129.4 109.8 152.6 145.7 158.4 131.6 2020-21 131.1 80.1 59.8 114.9 111.6 139.4 130.0 157.6 123.2 2021-22 142.3 77.9 71.3 125.1 112.4 163.0 156.9 170.1 136.1 2022-23 163.5 76.6 72.4 131.2 125.1 178.1 170.6 185.2 146.7 2023-24 182.7 77.1 76.8 135.9 129.8 200.4 185.7 198.3 157.8 2024-25 192.0 75.4 75.9 139.7 133.5 214.1 197.4 208.6 164.9 Apr-Nov 2024-25 172.9 75.2 76.9 137.4 134.0 207.9 184.5 211.9 161.2 Apr-Nov 2025-26* 170.5 74.2 74.6 137.7 135.8 228.0 199.7 211.3 165.1 *Provisional Growth Rates (on Y-o-Y basis in per cent) Sector Coal Crude Oil Natural Gas Refinery Products Fertilizers Steel Cement Electricity Overall Growth Weight 10.33 8.98 6.88 28.04 2.63 17.92 5.37 19.85 100.00 2012-13 3.2 -0.6 -14.4 7.2 -3.3 7.9 7.5 4.0 3.8 2013-14 1.0 -0.2 -12.9 1.4 1.5 7.3 3.7 6.1 2.6 2014-15 8.0 -0.9 -5.3 0.2 1.3 5.1 5.9 14.8 4.9 2015-16 4.8 -1.4 -4.7 4.9 7.0 -1.3 4.6 5.7 3.0 2016-17 3.2 -2.5 -1.0 4.9 0.2 10.7 -1.2 5.8 4.8 2017-18 2.6 -0.9 2.9 4.6 0.03 5.6 6.3 5.3 4.3 2018-19 7.4 -4.1 0.8 3.1 0.3 5.1 13.3 5.2 4.4 2019-20 -0.4 -5.9 -5.6 0.2 2.7 3.4 -0.9 0.9 0.4 2020-21 -1.9 -5.2 -8.2 -11.2 1.7 -8.7 -10.8 -0.5 -6.4 2021-22 8.5 -2.6 19.2 8.9 0.7 16.9 20.8 8.0 10.4 2022-23 14.8 -1.7 1.6 4.8 11.3 9.3 8.7 8.9 7.8 2023-24 11.8 0.6 6.1 3.6 3.7 12.5 8.9 7.1 7.6 2024-25 5.1 -2.2 -1.2 2.8 2.9 6.8 6.3 5.2 4.5 Apr-Nov 2024-25 6.4 -2.3 1.1 2.8 1.6 6.7 3.1 5.3 4.4 Apr-Nov 2025-26* -1.4 -1.3 -3.0 0.2 1.3 9.7 8.2 -0.3 2.4 *Provisional. Y-o-Y is calculated over the corresponding financial year of previous year Annex II Performance of Eight Core Industries Monthly Index & Growth Rate Base Year: 2011-12=100 Index Sector Coal Crude Oil Natural Gas Refinery Products Fertilizers Steel Cement Electricity Overall Index Weight 10.33 8.98 6.88 28.04 2.63 17.92 5.37 19.85 100.00 Nov-24 199.6 73.9 75.7 138.4 136.2 212.9 177.0 184.1 159.1 Dec-24 215.1 77.9 78.1 149.1 139.8 221.8 211.7 192.8 169.4 Jan-25 229.8 77.9 78.1 147.2 139.0 228.1 219.7 201.7 173.8 Feb-25 215.6 69.7 70.0 133.5 124.9 216.8 215.1 194.0 163.0 Mar-25 260.2 77.4 69.2 147.3 126.9 238.9 246.2 219.5 182.9 Apr-25 179.3 74.2 74.1 131.7 112.9 219.2 204.5 215.7 163.3 May-25 189.8 76.5 75.9 143.3 127.9 225.3 209.0 218.5 170.2 Jun-25 173.7 73.5 73.7 138.6 132.4 223.8 214.7 220.1 167.3 Jul-25 143.0 75.6 75.5 141.7 141.6 239.1 194.8 228.4 168.9 Aug-25 153.9 77.5 75.7 138.0 143.8 234.6 186.9 221.1 166.5 Sep-25 150.0 71.1 72.9 129.2 137.0 231.0 187.7 213.3 160.5 Oct-25 170.1 73.7 75.3 141.7 147.0 225.5 196.9 193.4 162.3 Nov-25* 203.8 71.5 73.8 137.1 143.8 225.8 202.7 180.1 161.9 *Provisional Growth Rates (on Y-o-Y basis in per cent) Sector Coal Crude Oil Natural Gas Refinery Products Fertilizers Steel Cement Electricity Overall Growth Weight 10.33 8.98 6.88 28.04 2.63 17.92 5.37 19.85 100.00 Nov-24 7.5 -2.1 -1.9 2.9 2.0 10.5 13.1 4.4 5.8 Dec-24 5.3 0.6 -1.8 2.8 1.7 7.3 10.3 6.2 5.1 Jan-25 4.6 -1.1 -1.5 8.3 3.0 4.7 14.3 2.3 5.1 Feb-25 1.7 -5.2 -6.0 0.8 10.2 6.9 10.7 3.6 3.4 Mar-25 1.6 -1.9 -12.7 0.2 8.8 8.7 12.2 7.5 4.5 Apr-25 3.5 -2.8 -0.9 -4.5 -4.2 4.4 6.3 1.7 1.0 May-25 2.8 -1.8 -3.6 1.1 -5.9 7.4 9.7 -4.7 1.2 Jun-25 -6.8 -1.2 -2.8 3.4 -1.2 9.7 8.2 -1.2 2.2 Jul-25 -12.3 -1.3 -3.2 -1.1 2.0 16.6 11.6 3.7 3.7 Aug-25 11.4 2.4 -2.2 3.0 4.6 13.6 5.4 4.1 6.5 Sep-25 -1.2 -1.3 -3.8 -3.7 1.6 14.4 5.0 3.1 3.3 Oct-25 -8.5 -1.2 -5.0 4.6 7.4 5.9 5.2 -6.9 -0.1 Nov-25* 2.1 -3.2 -2.5 -0.9 5.6 6.1 14.5 -2.2 1.8 *Provisional. Y-o-Y is calculated over the corresponding financial year of previous year *** Abhishek Dayal (रिलीज़ आईडी: 2207434) आगंतुक पटल  : 556 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Tamil Ministry of Commerce & Industry INDEX OF EIGHT CORE INDUSTRIES (BASE YEAR: 2011-12=100) FOR NOVEMBER, 2025 प्रविष्टि तिथि:\r\n                        22 DEC 2025 5:00PM by PIB Delhi The combined Index of Eight Core Industries (ICI) increased by 1.8 per cent (provisional) in November, 2025 as compared to the Index in November, 2024. The production of Cement, Steel, Fertilizer and Coal recorded positive growth in November, 2025. The details of annual indices, monthly indices and growth rates are provided at Annex I and Annex II. The ICI measures the combined and individual performance of production of eight core industries viz. Coal, Crude Oil, Natural Gas, Refinery Products, Fertilizers, Steel, Cement and Electricity. The Eight Core Industries comprise 40.27 percent of the weight of items included in the Index of Industrial Production (IIP). The final growth rate of Index of Eight Core Industries for October 2025 was observed at (-) 0.1 per cent . The cumulative growth rate of ICI during April to November, 2025-26 is 2.4 per cent (provisional) as compared to the corresponding period of last year. The summary of the Index of Eight Core Industries is given below: Coal - Coal production (weight: 10.33 per cent) increased by 2.1 per cent in November, 2025 over November, 2024. Its cumulative index declined by 1.4 per cent during April to November, 2025-26 over corresponding period of the previous year. Crude Oil - Crude Oil production (weight: 8.98 per cent) declined by 3.2 per cent in November, 2025 over November, 2024. Its cumulative index declined by 1.3 per cent during April to November, 2025-26 over corresponding period of the previous year. Natural Gas - Natural Gas production (weight: 6.88 per cent) declined by 2.5 per cent in November, 2025 over November, 2024. Its cumulative index declined by 3.0 per cent during April to November, 2025-26 over corresponding period of the previous year. Petroleum Refinery Products - Petroleum Refinery production (weight: 28.04 per cent) declined by 0.9 per cent in November, 2025 over November, 2024. Its cumulative index increased by 0.2 per cent during April to November, 2025-26 over corresponding period of the previous year. Fertilizers - Fertilizer production (weight: 2.63 per cent) increased by 5.6 per cent in November, 2025 over November, 2024. Its cumulative index increased by 1.3 per cent during April to November, 2025-26 over corresponding period of the previous year. Steel - Steel production (weight: 17.92 per cent) increased by 6.1 per cent in November, 2025 over November, 2024. Its cumulative index increased by 9.7 per cent during April to November, 2025-26 over corresponding period of the previous year. Cement - Cement production (weight: 5.37 per cent) increased by 14.5 per cent in November, 2025 over November, 2024. Its cumulative index increased by 8.2 per cent during April to November, 2025-26 over corresponding period of the previous year. Electricity - Electricity generation (weight: 19.85 per cent) declined by 2.2 per cent in November, 2025 over November, 2024. Its cumulative index declined by 0.3 per cent during April to November, 2025-26 over corresponding period of the previous year. Note 1: Data for October, 2025 is Final. Data for November, 2025 is Provisional. Index numbers of Core Industries are revised/finalized as per updated data from source agencies. Note 2: Since April 2014, Electricity generation data from Renewable sources are also included. Note 3: The industry-wise weights indicated above are individual industry weights derived from IIP and blown up on pro rata basis to a combined weight of ICI equal to 100. Note 4: Since March 2019, a new steel product called Hot Rolled Pickled and Oiled (HRPO) under the item ‘Cold Rolled (CR) coils’ within the production of finished steel has also been included. Note 5: Release of the index for December, 2025 will be on Tuesday, 20 th January, 2026. Annex I Performance of Eight Core Industries Yearly Index & Growth Rate Ba s e Year: 2011-12=100 Index Sector Coal Crude Oil Natural Gas Refinery Products Fertilizers Steel Cement Electricity Overall Index Weight 10.33 8.98 6.88 28.04 2.63 17.92 5.37 19.85 100.00 2012-13 103.2 99.4 85.6 107.2 96.7 107.9 107.5 104.0 103.8 2013-14 104.2 99.2 74.5 108.6 98.1 115.8 111.5 110.3 106.5 2014-15 112.6 98.4 70.5 108.8 99.4 121.7 118.1 126.6 111.7 2015-16 118.0 97.0 67.2 114.1 106.4 120.2 123.5 133.8 115.1 2016-17 121.8 94.5 66.5 119.7 106.6 133.1 122.0 141.6 120.5 2017-18 124.9 93.7 68.4 125.2 106.6 140.5 129.7 149.2 125.7 2018-19 134.1 89.8 69.0 129.1 107.0 147.7 147.0 156.9 131.2 2019-20 133.6 84.5 65.1 129.4 109.8 152.6 145.7 158.4 131.6 2020-21 131.1 80.1 59.8 114.9 111.6 139.4 130.0 157.6 123.2 2021-22 142.3 77.9 71.3 125.1 112.4 163.0 156.9 170.1 136.1 2022-23 163.5 76.6 72.4 131.2 125.1 178.1 170.6 185.2 146.7 2023-24 182.7 77.1 76.8 135.9 129.8 200.4 185.7 198.3 157.8 2024-25 192.0 75.4 75.9 139.7 133.5 214.1 197.4 208.6 164.9 Apr-Nov 2024-25 172.9 75.2 76.9 137.4 134.0 207.9 184.5 211.9 161.2 Apr-Nov 2025-26* 170.5 74.2 74.6 137.7 135.8 228.0 199.7 211.3 165.1 *Provisional Growth Rates (on Y-o-Y basis in per cent) Sector Coal Crude Oil Natural Gas Refinery Products Fertilizers Steel Cement Electricity Overall Growth Weight 10.33 8.98 6.88 28.04 2.63 17.92 5.37 19.85 100.00 2012-13 3.2 -0.6 -14.4 7.2 -3.3 7.9 7.5 4.0 3.8 2013-14 1.0 -0.2 -12.9 1.4 1.5 7.3 3.7 6.1 2.6 2014-15 8.0 -0.9 -5.3 0.2 1.3 5.1 5.9 14.8 4.9 2015-16 4.8 -1.4 -4.7 4.9 7.0 -1.3 4.6 5.7 3.0 2016-17 3.2 -2.5 -1.0 4.9 0.2 10.7 -1.2 5.8 4.8 2017-18 2.6 -0.9 2.9 4.6 0.03 5.6 6.3 5.3 4.3 2018-19 7.4 -4.1 0.8 3.1 0.3 5.1 13.3 5.2 4.4 2019-20 -0.4 -5.9 -5.6 0.2 2.7 3.4 -0.9 0.9 0.4 2020-21 -1.9 -5.2 -8.2 -11.2 1.7 -8.7 -10.8 -0.5 -6.4 2021-22 8.5 -2.6 19.2 8.9 0.7 16.9 20.8 8.0 10.4 2022-23 14.8 -1.7 1.6 4.8 11.3 9.3 8.7 8.9 7.8 2023-24 11.8 0.6 6.1 3.6 3.7 12.5 8.9 7.1 7.6 2024-25 5.1 -2.2 -1.2 2.8 2.9 6.8 6.3 5.2 4.5 Apr-Nov 2024-25 6.4 -2.3 1.1 2.8 1.6 6.7 3.1 5.3 4.4 Apr-Nov 2025-26* -1.4 -1.3 -3.0 0.2 1.3 9.7 8.2 -0.3 2.4 *Provisional. Y-o-Y is calculated over the corresponding financial year of previous year Annex II Performance of Eight Core Industries Monthly Index & Growth Rate Base Year: 2011-12=100 Index Sector Coal Crude Oil Natural Gas Refinery Products Fertilizers Steel Cement Electricity Overall Index Weight 10.33 8.98 6.88 28.04 2.63 17.92 5.37 19.85 100.00 Nov-24 199.6 73.9 75.7 138.4 136.2 212.9 177.0 184.1 159.1 Dec-24 215.1 77.9 78.1 149.1 139.8 221.8 211.7 192.8 169.4 Jan-25 229.8 77.9 78.1 147.2 139.0 228.1 219.7 201.7 173.8 Feb-25 215.6 69.7 70.0 133.5 124.9 216.8 215.1 194.0 163.0 Mar-25 260.2 77.4 69.2 147.3 126.9 238.9 246.2 219.5 182.9 Apr-25 179.3 74.2 74.1 131.7 112.9 219.2 204.5 215.7 163.3 May-25 189.8 76.5 75.9 143.3 127.9 225.3 209.0 218.5 170.2 Jun-25 173.7 73.5 73.7 138.6 132.4 223.8 214.7 220.1 167.3 Jul-25 143.0 75.6 75.5 141.7 141.6 239.1 194.8 228.4 168.9 Aug-25 153.9 77.5 75.7 138.0 143.8 234.6 186.9 221.1 166.5 Sep-25 150.0 71.1 72.9 129.2 137.0 231.0 187.7 213.3 160.5 Oct-25 170.1 73.7 75.3 141.7 147.0 225.5 196.9 193.4 162.3 Nov-25* 203.8 71.5 73.8 137.1 143.8 225.8 202.7 180.1 161.9 *Provisional Growth Rates (on Y-o-Y basis in per cent) Sector Coal Crude Oil Natural Gas Refinery Products Fertilizers Steel Cement Electricity Overall Growth Weight 10.33 8.98 6.88 28.04 2.63 17.92 5.37 19.85 100.00 Nov-24 7.5 -2.1 -1.9 2.9 2.0 10.5 13.1 4.4 5.8 Dec-24 5.3 0.6 -1.8 2.8 1.7 7.3 10.3 6.2 5.1 Jan-25 4.6 -1.1 -1.5 8.3 3.0 4.7 14.3 2.3 5.1 Feb-25 1.7 -5.2 -6.0 0.8 10.2 6.9 10.7 3.6 3.4 Mar-25 1.6 -1.9 -12.7 0.2 8.8 8.7 12.2 7.5 4.5 Apr-25 3.5 -2.8 -0.9 -4.5 -4.2 4.4 6.3 1.7 1.0 May-25 2.8 -1.8 -3.6 1.1 -5.9 7.4 9.7 -4.7 1.2 Jun-25 -6.8 -1.2 -2.8 3.4 -1.2 9.7 8.2 -1.2 2.2 Jul-25 -12.3 -1.3 -3.2 -1.1 2.0 16.6 11.6 3.7 3.7 Aug-25 11.4 2.4 -2.2 3.0 4.6 13.6 5.4 4.1 6.5 Sep-25 -1.2 -1.3 -3.8 -3.7 1.6 14.4 5.0 3.1 3.3 Oct-25 -8.5 -1.2 -5.0 4.6 7.4 5.9 5.2 -6.9 -0.1 Nov-25* 2.1 -3.2 -2.5 -0.9 5.6 6.1 14.5 -2.2 1.8 *Provisional. Y-o-Y is calculated over the corresponding financial year of previous year *** Abhishek Dayal (रिलीज़ आईडी: 2207434)",
    "scraped_at": "2025-12-22T17:40:23.442669"
  },
  {
    "id": "2207376",
    "ministry": "Ministry of Communications",
    "title": "1000+ banks, TPAPs and Financial Institutions On boarded on DoT’s Digital Intelligence Platform (DIP) to share information on prevention of misuse of Telecom Resources in cyber frauds",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207376",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Communications 1000+ banks, TPAPs and Financial Institutions On boarded on DoT’s Digital Intelligence Platform (DIP) to share information on prevention of misuse of Telecom Resources in cyber frauds Financial Fraud Risk Indicator (FRI) of DoT Helps Prevent ₹660 Crore Cyber Fraud Losses in Just 6 Months प्रविष्टि तिथि:\r\n                22 DEC 2025 3:23PM by PIB Delhi The Department of Telecommunications ( DoT ) is glad to share that the significant achievements of the Financial Fraud Risk Indicator ( FRI ) are driven by active support of the Reserve Bank of India ( RBI ) and the National Payments Corporation of India ( NPCI ), leading to large-scale onboarding of banks, financial institutions, and Third-Party Application Providers, ( TPAPs ) on the Digital Intelligence Platform ( DIP ). As on date, more than 1000 banks, TPAPs, and Payment System Operators ( PSOs ), have onboarded the DIP and started adopting FRI actively. DoT is also conducting regular knowledge-sharing sessions with stakeholders to enhance awareness and effective implementation of FRI, with 16 sessions held till date. With the help of Financial Fraud Risk Indicator (FRI) , ₹660 Crore Cyber Fraud Losses have been prevented in just 6 months since its rollout on 22 nd May, 2025. As reported by various Public Sector Banks, Private Sector Banks, Co-operative Banks, TPAPs and other financial institutions, a large number of suspicious transactions have been either declined or issued with alerts by leveraging the FRI available on DIP of DoT, thereby preventing potential financial losses of approximately ₹660 crore across the banking ecosystem. India’s cybercrime landscape has shifted dramatically in recent years, with fraudsters operating like well-organized digital cartels. From digital arrest scams to sophisticated SIM-box networks bypassing legal telecom routes, the threat is evolving faster than ever. Yet, amid this complexity, one factor has emerged as the most decisive force in combating cybercrime: Jan Bhagidari . Citizens, through Sanchar Saathi, which has emerged as India’s most powerful crowdsourced cyber-intelligence tool, are providing continuous inputs for Financial Fraud Risk Indicator. DoT acknowledges and appreciates the efforts of all vigilant citizens and Cyber Warriors who are actively leveraging the Sanchar Saathi platform ( available at www.sancharsaathi.gov.in and through mobile App on both Android and iOS ) to report Suspected Fraud Communications, report fraudulent connections obtained in their name, and lost/stolen mobile handsets. The recent trends in downloads and usage of the Sanchar Saathi mobile App reflects the trust reposed by citizens in the platform and their proactive role in preventing cyber frauds. This large-scale citizen engagement is significantly contributing in curtailing the misuse of telecom resources by fraudsters and creating a safer and more resilient digital ecosystem. The aware users already recognize many fraud calls and simply ignore or cut them, which protects themselves but does nothing to stop the same fraudster from targeting less-informed citizens.  By making it easy to report such suspected fraud communications in a few taps from the call log, Sanchar Saathi allows those who understand the risk to actively protect those who do not, enabling authorities and telecom operators to identify patterns, block offending numbers, disable fake connections and deter repeat offenders. DoT urges all the citizens to utilize Sanchar Saathi web portal and Mobile App for availing the citizen centric services. DoT reiterates its commitment to fostering a secure digital payments ecosystem through inter-agency collaboration, proactive fraud detection, and intelligence-driven policy interventions. The continued cooperation of RBI, NPCI, SEBI, PFRDA, all banks, financial institutions, payment operators and Jan Bhagidari remains crucial to safeguarding India’s rapidly expanding digital economy. About Sanchar Saathi Initiative Sanchar Saathi is a citizen centric initiative of Department of Telecommunications (DoT) to empower mobile subscribers, strengthen their security and increase awareness about citizen centric initiatives of the Government. Sanchar Saathi is available in form of Mobile App and web portal (www.sancharsaathi.gov.in). Sanchar Saathi provides various citizen centric services. Key Features of the Sanchar Saathi initiative: Chakshu – Report Suspected Fraud Communications: Instantly report suspicious calls and SMS, directly from the mobile phone logs. Know Mobile Connections in Your Name: View and manage all mobile numbers registered under your name, helping detect and remove unauthorized connections. Blocking Lost or Stolen Mobile Handsets: Block, trace, and recover your mobile device quickly in case it is lost or stolen. Know Mobile Handset Genuineness: Easily verify whether a handset is genuine before making a purchase Trusted Contact Details: Access verified contact information for banks and financial institutions The Sanchar Saathi Mobile App can be downloaded from: Android: https://play.google.com/store/apps/details?id=com.dot.app.sancharsaathi iOS: https://apps.apple.com/app/sanchar-saathi/id6739700695 About Financial Fraud Risk Indicator (FRI) FRI is a risk-based metric that classifies a suspected mobile number to have been associated with Medium, High, or Very High risk of financial fraud. This classification is an outcome of inputs obtained from various stakeholders including reporting on Indian Cybercrime Coordination Centre (I4C’s) National Cybercrime Reporting Portal (NCRP), DoT’s Chakshu platform, Intelligence shared by banks and financial institutions, TSPs, etc. It empowers stakeholders-especially banks, NBFCs, and UPI service providers to take additional customer protection measures in case a mobile number appear as part of the FRI. About Digital Intelligence Platform (DIP) Digital Intelligence Platform (DIP) has been developed by DoT as an online secure platform for sharing of information related to misuse of telecom resources among various stakeholders. It has about 1050+ organizations that include central security agencies, 36 State/UT Police, I4C, GSTN, banks, financial institutions, TSPs, Social media platforms like WhatsApp, CBDT, UIDAI, MORTH, PFMS, etc. Follow DoT Handles for more: - X - https://x.com/DoT_India Insta- https://www.instagram.com/department_of_telecom?igsh=MXUxbHFjd3llZTU0YQ == Fb - https://www.facebook.com/DoTIndia Youtube: https://youtube.com/@departmentoftelecom?si=DALnhYkt89U5jAaa **** MI/ARJ (रिलीज़ आईडी: 2207376) आगंतुक पटल  : 545 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Gujarati , Tamil Ministry of Communications 1000+ banks, TPAPs and Financial Institutions On boarded on DoT’s Digital Intelligence Platform (DIP) to share information on prevention of misuse of Telecom Resources in cyber frauds Financial Fraud Risk Indicator (FRI) of DoT Helps Prevent ₹660 Crore Cyber Fraud Losses in Just 6 Months प्रविष्टि तिथि:\r\n                        22 DEC 2025 3:23PM by PIB Delhi The Department of Telecommunications ( DoT ) is glad to share that the significant achievements of the Financial Fraud Risk Indicator ( FRI ) are driven by active support of the Reserve Bank of India ( RBI ) and the National Payments Corporation of India ( NPCI ), leading to large-scale onboarding of banks, financial institutions, and Third-Party Application Providers, ( TPAPs ) on the Digital Intelligence Platform ( DIP ). As on date, more than 1000 banks, TPAPs, and Payment System Operators ( PSOs ), have onboarded the DIP and started adopting FRI actively. DoT is also conducting regular knowledge-sharing sessions with stakeholders to enhance awareness and effective implementation of FRI, with 16 sessions held till date. With the help of Financial Fraud Risk Indicator (FRI) , ₹660 Crore Cyber Fraud Losses have been prevented in just 6 months since its rollout on 22 nd May, 2025. As reported by various Public Sector Banks, Private Sector Banks, Co-operative Banks, TPAPs and other financial institutions, a large number of suspicious transactions have been either declined or issued with alerts by leveraging the FRI available on DIP of DoT, thereby preventing potential financial losses of approximately ₹660 crore across the banking ecosystem. India’s cybercrime landscape has shifted dramatically in recent years, with fraudsters operating like well-organized digital cartels. From digital arrest scams to sophisticated SIM-box networks bypassing legal telecom routes, the threat is evolving faster than ever. Yet, amid this complexity, one factor has emerged as the most decisive force in combating cybercrime: Jan Bhagidari . Citizens, through Sanchar Saathi, which has emerged as India’s most powerful crowdsourced cyber-intelligence tool, are providing continuous inputs for Financial Fraud Risk Indicator. DoT acknowledges and appreciates the efforts of all vigilant citizens and Cyber Warriors who are actively leveraging the Sanchar Saathi platform ( available at www.sancharsaathi.gov.in and through mobile App on both Android and iOS ) to report Suspected Fraud Communications, report fraudulent connections obtained in their name, and lost/stolen mobile handsets. The recent trends in downloads and usage of the Sanchar Saathi mobile App reflects the trust reposed by citizens in the platform and their proactive role in preventing cyber frauds. This large-scale citizen engagement is significantly contributing in curtailing the misuse of telecom resources by fraudsters and creating a safer and more resilient digital ecosystem. The aware users already recognize many fraud calls and simply ignore or cut them, which protects themselves but does nothing to stop the same fraudster from targeting less-informed citizens.  By making it easy to report such suspected fraud communications in a few taps from the call log, Sanchar Saathi allows those who understand the risk to actively protect those who do not, enabling authorities and telecom operators to identify patterns, block offending numbers, disable fake connections and deter repeat offenders. DoT urges all the citizens to utilize Sanchar Saathi web portal and Mobile App for availing the citizen centric services. DoT reiterates its commitment to fostering a secure digital payments ecosystem through inter-agency collaboration, proactive fraud detection, and intelligence-driven policy interventions. The continued cooperation of RBI, NPCI, SEBI, PFRDA, all banks, financial institutions, payment operators and Jan Bhagidari remains crucial to safeguarding India’s rapidly expanding digital economy. About Sanchar Saathi Initiative Sanchar Saathi is a citizen centric initiative of Department of Telecommunications (DoT) to empower mobile subscribers, strengthen their security and increase awareness about citizen centric initiatives of the Government. Sanchar Saathi is available in form of Mobile App and web portal (www.sancharsaathi.gov.in). Sanchar Saathi provides various citizen centric services. Key Features of the Sanchar Saathi initiative: Chakshu – Report Suspected Fraud Communications: Instantly report suspicious calls and SMS, directly from the mobile phone logs. Know Mobile Connections in Your Name: View and manage all mobile numbers registered under your name, helping detect and remove unauthorized connections. Blocking Lost or Stolen Mobile Handsets: Block, trace, and recover your mobile device quickly in case it is lost or stolen. Know Mobile Handset Genuineness: Easily verify whether a handset is genuine before making a purchase Trusted Contact Details: Access verified contact information for banks and financial institutions The Sanchar Saathi Mobile App can be downloaded from: Android: https://play.google.com/store/apps/details?id=com.dot.app.sancharsaathi iOS: https://apps.apple.com/app/sanchar-saathi/id6739700695 About Financial Fraud Risk Indicator (FRI) FRI is a risk-based metric that classifies a suspected mobile number to have been associated with Medium, High, or Very High risk of financial fraud. This classification is an outcome of inputs obtained from various stakeholders including reporting on Indian Cybercrime Coordination Centre (I4C’s) National Cybercrime Reporting Portal (NCRP), DoT’s Chakshu platform, Intelligence shared by banks and financial institutions, TSPs, etc. It empowers stakeholders-especially banks, NBFCs, and UPI service providers to take additional customer protection measures in case a mobile number appear as part of the FRI. About Digital Intelligence Platform (DIP) Digital Intelligence Platform (DIP) has been developed by DoT as an online secure platform for sharing of information related to misuse of telecom resources among various stakeholders. It has about 1050+ organizations that include central security agencies, 36 State/UT Police, I4C, GSTN, banks, financial institutions, TSPs, Social media platforms like WhatsApp, CBDT, UIDAI, MORTH, PFMS, etc. Follow DoT Handles for more: - X - https://x.com/DoT_India Insta- https://www.instagram.com/department_of_telecom?igsh=MXUxbHFjd3llZTU0YQ == Fb - https://www.facebook.com/DoTIndia Youtube: https://youtube.com/@departmentoftelecom?si=DALnhYkt89U5jAaa **** MI/ARJ (रिलीज़ आईडी: 2207376)",
    "scraped_at": "2025-12-22T17:40:27.007784"
  },
  {
    "id": "2207446",
    "ministry": "Ministry of Defence",
    "title": "DELIVERY OF ‘ANJADIP’ - THIRD ANTI SUBMARINE WARFARE SHALLOW WATER CRAFT TO THE INDIAN NAVY",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207446",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Defence DELIVERY OF ‘ANJADIP’ - THIRD ANTI SUBMARINE WARFARE SHALLOW WATER CRAFT TO THE INDIAN NAVY प्रविष्टि तिथि:\r\n                22 DEC 2025 5:13PM by PIB Delhi ‘Anjadip’, the third of eight ASW SWC (Anti-Submarine Warfare Shallow Water Craft), indigenously designed and built by Garden Reach Shipbuilders and Engineers (GRSE), Kolkata , was delivered to the Indian Navy on 22 Dec 2025 at Chennai. The ASW SWC ships have been designed and constructed as per the Classification Rules of Indian Register of Shipping (IRS) under a Public-Private-Partnership (PPP) of GRSE with M/s L&T Shipyard, Kattupalli thus demonstrating the success of collaborative defence manufacturing. These ships at approx. 77m length, are the largest Indian Naval Warships propelled by Waterjets and are equipped with state of the art Lightweight Torpedoes, indigenously designed Anti-Submarine Rockets and shallow water SONAR , enabling effective detection and engagement of underwater threats. The ship will strengthen Navy’s Anti-Submarine, coastal surveillance and mine laying capabilities. The ship is a reincarnation of the erstwhile INS Anjadip, a Petya class Corvette decommissioned in 2003.The ship derives its name from Anjadip Island located off coast of Karwar, Karnataka , underscoring India’s commitment to safeguarding its expansive maritime domain. Anjadip’s delivery is yet another milestone in the Indian Navy’s quest for indigenous shipbuilding upholding the Government’s vision of ‘Aatmanirbhar Bharat’ with over 80% indigenous content. The ship stands as a testament to growing domestic defence manufacturing ecosystem and reducing dependency on imports. **** VM/SKY (रिलीज़ आईडी: 2207446) आगंतुक पटल  : 436 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Gujarati , Tamil Ministry of Defence DELIVERY OF ‘ANJADIP’ - THIRD ANTI SUBMARINE WARFARE SHALLOW WATER CRAFT TO THE INDIAN NAVY प्रविष्टि तिथि:\r\n                        22 DEC 2025 5:13PM by PIB Delhi ‘Anjadip’, the third of eight ASW SWC (Anti-Submarine Warfare Shallow Water Craft), indigenously designed and built by Garden Reach Shipbuilders and Engineers (GRSE), Kolkata , was delivered to the Indian Navy on 22 Dec 2025 at Chennai. The ASW SWC ships have been designed and constructed as per the Classification Rules of Indian Register of Shipping (IRS) under a Public-Private-Partnership (PPP) of GRSE with M/s L&T Shipyard, Kattupalli thus demonstrating the success of collaborative defence manufacturing. These ships at approx. 77m length, are the largest Indian Naval Warships propelled by Waterjets and are equipped with state of the art Lightweight Torpedoes, indigenously designed Anti-Submarine Rockets and shallow water SONAR , enabling effective detection and engagement of underwater threats. The ship will strengthen Navy’s Anti-Submarine, coastal surveillance and mine laying capabilities. The ship is a reincarnation of the erstwhile INS Anjadip, a Petya class Corvette decommissioned in 2003.The ship derives its name from Anjadip Island located off coast of Karwar, Karnataka , underscoring India’s commitment to safeguarding its expansive maritime domain. Anjadip’s delivery is yet another milestone in the Indian Navy’s quest for indigenous shipbuilding upholding the Government’s vision of ‘Aatmanirbhar Bharat’ with over 80% indigenous content. The ship stands as a testament to growing domestic defence manufacturing ecosystem and reducing dependency on imports. **** VM/SKY (रिलीज़ आईडी: 2207446)",
    "scraped_at": "2025-12-22T17:40:30.348337"
  },
  {
    "id": "2207389",
    "ministry": "Ministry of Defence",
    "title": "IOL signs collaboration agreement with SAFRAN to manufacture two high-precision, combat-proven systems in India",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207389",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Defence IOL signs collaboration agreement with SAFRAN to manufacture two high-precision, combat-proven systems in India Posted On:\r\n                22 DEC 2025 3:55PM by PIB Delhi In a major milestone in the Make-in-India program envisioned by Prime Minister Shri Narendra Modi, India Optel Limited (IOL), a Mini Navratna Defence Public Sector Undertaking, has signed a collaboration agreement with Safran Electronics & Defense for Transfer of Production of two high-precision, combat-proven systems, paving the way for their local manufacturing. The systems are: SIGMA 30N Digital Ring Laser Gyro Inertial Navigation System, used in artillery guns, air defence systems, missiles and radars; and CM3-MR Direct Firing Sight, designed for artillery guns and anti-drone systems. The agreement was signed by CMD, IOL Shri Tushar Tripathi and Head of the Defence Global Business Unit for Safran Electronics & Defense Mr Alexandre Ziegler in the presence of Secretary (Defence Production) Shri Sanjeev Kumar in New Delhi on December 22, 2025. Building on the MoU signed in January 2024, this new agreement confirms the commitment of both the partners to manufacture and support these advanced systems in India. Under the partnership, IOL will be responsible for manufacturing, final assembly, testing, quality control and full life-cycle support, ensuring the systems meet the operational needs of the Indian Army. By combining IOL’s industrial capabilities in India with Safran Electronics & Defense’s recognised expertise in high-end inertial navigation and fire-control technologies, the partnership contributes to strengthening India’s defence manufacturing ecosystem while enhancing the readiness and performance of its land forces. **** SR/Savvy (Release ID: 2207389) Visitor Counter : 2531 Read this release in: Urdu , हिन्दी , Tamil Ministry of Defence IOL signs collaboration agreement with SAFRAN to manufacture two high-precision, combat-proven systems in India Posted On:\r\n                        22 DEC 2025 3:55PM by PIB Delhi In a major milestone in the Make-in-India program envisioned by Prime Minister Shri Narendra Modi, India Optel Limited (IOL), a Mini Navratna Defence Public Sector Undertaking, has signed a collaboration agreement with Safran Electronics & Defense for Transfer of Production of two high-precision, combat-proven systems, paving the way for their local manufacturing. The systems are: SIGMA 30N Digital Ring Laser Gyro Inertial Navigation System, used in artillery guns, air defence systems, missiles and radars; and CM3-MR Direct Firing Sight, designed for artillery guns and anti-drone systems. The agreement was signed by CMD, IOL Shri Tushar Tripathi and Head of the Defence Global Business Unit for Safran Electronics & Defense Mr Alexandre Ziegler in the presence of Secretary (Defence Production) Shri Sanjeev Kumar in New Delhi on December 22, 2025. Building on the MoU signed in January 2024, this new agreement confirms the commitment of both the partners to manufacture and support these advanced systems in India. Under the partnership, IOL will be responsible for manufacturing, final assembly, testing, quality control and full life-cycle support, ensuring the systems meet the operational needs of the Indian Army. By combining IOL’s industrial capabilities in India with Safran Electronics & Defense’s recognised expertise in high-end inertial navigation and fire-control technologies, the partnership contributes to strengthening India’s defence manufacturing ecosystem while enhancing the readiness and performance of its land forces. **** SR/Savvy (Release ID: 2207389)",
    "scraped_at": "2025-12-22T17:40:32.076879"
  },
  {
    "id": "2207534",
    "ministry": "Ministry of Development of North-East Region",
    "title": "Chief Minister, Tripura chairs 3rd Meeting of High-Level Task Force on Infrastructure, Logistics Cost and Connectivity in NER",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207534",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Development of North-East Region Chief Minister, Tripura chairs 3rd Meeting of High-Level Task Force on Infrastructure, Logistics Cost and Connectivity in NER Union Minister Jyotiraditya Scindia Participates in High-Level Task Force Meet to Advance Infrastructure, Logistics and Connectivity across the Northeast Northeast Poised to Become India’s Engine of Growth and Gateway to Southeast Asia प्रविष्टि तिथि:\r\n                22 DEC 2025 7:49PM by PIB Delhi Chief Minister of Tripura, Prof. (Dr.) Manik Saha, chaired the 3 rd meeting of the High-Level Task Force (HLTF) on Infrastructure, Logistics Cost and Connectivity in the North Eastern Region (NER) on 22 nd December, 2025. Shri Jyotiraditya M. Scindia, Hon'ble Union Minister of MDoNER, participated in the meeting along with Shri Lalduhoma, Hon'ble Chief Minister of Mizoram; and senior officials from Central Ministries and other North Eastern States. The HLTF reviewed regional logistics and connectivity challenges, assessed short, medium and long-term infrastructure priorities and discussed institutional mechanisms and inter-ministerial coordination for effective implementation across the NER. Chief Minister, Tripura presented a comprehensive, phase-wise roadmap for strengthening logistics, multimodal connectivity, cross-border trade corridors, digital and power enablers, and institutional and financial mechanisms. Emphasising the need to treat the Northeast as a unified region, he underscored close coordination among key Central Ministries, including Roads & Highways; Railways; Civil Aviation; Port, Shipping and & Waterways; Power; IT & Telecom and Petroleum & Natural Gas. He also highlighted the need for proactive resolution of forest and environmental clearance challenges. The Chief Minister of Mizoram highlighted that Mizoram could act as a regional gateway to neighbouring countries under Act East Policy. He recommended for accelerated deliberations on key connectivity projects such as the Kaladan Multi Modal Transit Transport Project. He further emphasized the important role of Border Trade, Logistics and Institutional support towards achieving the desired objectives of the Task force. The Union Minister, MDoNER, appreciated the roadmap proposed by the Chief Minister, Tripura, in consultation with other members of the HLTF, as a comprehensive strategy for enhancing logistics and connectivity in the NER and observed that its effective execution would require active collaboration between Central Ministries and State Governments of NER. He suggested that, given the multi-sectoral nature of the framework proposed by the Task force, inputs of the concerned Line Ministries such as MoRTH, M/o Power, M/o Railways and the NITI Aayog may be sought before finalizing the report of the Task Force. Earlier this year, the MDoNER formed Eight High-Level Task Force, each headed by the Chief Ministers of one of the NE States, with Union Minister (MDoNER) and three Chief Ministers of other NE States as Members. The initiative stems from a consensus reached during the 72 nd Plenary Session of the North Eastern Council (NEC), held on December 21, 2024, in Agartala. Had a productive High Level Task Force meeting on infrastructure, logistics & connectivity chaired by Hon’ble CM of Tripura Shri @DrManikSaha2 ji today. Aligned with Hon’ble PM Shri @narendramodi ji’s vision of 'Act East, Act Fast and Act First', we laid down the strategic… pic.twitter.com/beDork468a — Jyotiraditya M. Scindia (@JM_Scindia) December 22, 2025 **** PS (रिलीज़ आईडी: 2207534) आगंतुक पटल  : 94 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Development of North-East Region Chief Minister, Tripura chairs 3rd Meeting of High-Level Task Force on Infrastructure, Logistics Cost and Connectivity in NER Union Minister Jyotiraditya Scindia Participates in High-Level Task Force Meet to Advance Infrastructure, Logistics and Connectivity across the Northeast Northeast Poised to Become India’s Engine of Growth and Gateway to Southeast Asia प्रविष्टि तिथि:\r\n                        22 DEC 2025 7:49PM by PIB Delhi Chief Minister of Tripura, Prof. (Dr.) Manik Saha, chaired the 3 rd meeting of the High-Level Task Force (HLTF) on Infrastructure, Logistics Cost and Connectivity in the North Eastern Region (NER) on 22 nd December, 2025. Shri Jyotiraditya M. Scindia, Hon'ble Union Minister of MDoNER, participated in the meeting along with Shri Lalduhoma, Hon'ble Chief Minister of Mizoram; and senior officials from Central Ministries and other North Eastern States. The HLTF reviewed regional logistics and connectivity challenges, assessed short, medium and long-term infrastructure priorities and discussed institutional mechanisms and inter-ministerial coordination for effective implementation across the NER. Chief Minister, Tripura presented a comprehensive, phase-wise roadmap for strengthening logistics, multimodal connectivity, cross-border trade corridors, digital and power enablers, and institutional and financial mechanisms. Emphasising the need to treat the Northeast as a unified region, he underscored close coordination among key Central Ministries, including Roads & Highways; Railways; Civil Aviation; Port, Shipping and & Waterways; Power; IT & Telecom and Petroleum & Natural Gas. He also highlighted the need for proactive resolution of forest and environmental clearance challenges. The Chief Minister of Mizoram highlighted that Mizoram could act as a regional gateway to neighbouring countries under Act East Policy. He recommended for accelerated deliberations on key connectivity projects such as the Kaladan Multi Modal Transit Transport Project. He further emphasized the important role of Border Trade, Logistics and Institutional support towards achieving the desired objectives of the Task force. The Union Minister, MDoNER, appreciated the roadmap proposed by the Chief Minister, Tripura, in consultation with other members of the HLTF, as a comprehensive strategy for enhancing logistics and connectivity in the NER and observed that its effective execution would require active collaboration between Central Ministries and State Governments of NER. He suggested that, given the multi-sectoral nature of the framework proposed by the Task force, inputs of the concerned Line Ministries such as MoRTH, M/o Power, M/o Railways and the NITI Aayog may be sought before finalizing the report of the Task Force. Earlier this year, the MDoNER formed Eight High-Level Task Force, each headed by the Chief Ministers of one of the NE States, with Union Minister (MDoNER) and three Chief Ministers of other NE States as Members. The initiative stems from a consensus reached during the 72 nd Plenary Session of the North Eastern Council (NEC), held on December 21, 2024, in Agartala. Had a productive High Level Task Force meeting on infrastructure, logistics & connectivity chaired by Hon’ble CM of Tripura Shri @DrManikSaha2 ji today. Aligned with Hon’ble PM Shri @narendramodi ji’s vision of 'Act East, Act Fast and Act First', we laid down the strategic… pic.twitter.com/beDork468a — Jyotiraditya M. Scindia (@JM_Scindia) December 22, 2025 **** PS (रिलीज़ आईडी: 2207534)",
    "scraped_at": "2025-12-22T17:40:34.544464"
  },
  {
    "id": "2207453",
    "ministry": "Ministry of Electronics & IT",
    "title": "Modern Technologies are playing a crucial role in generating employment: Union Minister of State Shri Jitin Prasada",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207453",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Electronics & IT Modern Technologies are playing a crucial role in generating employment: Union Minister of State Shri Jitin Prasada Shri Jitin Prasada addresses the “Technology and Skill Development Conference”, emphasizes NIELIT’s Role in taking advanced technical education and skill development to remote areas of the country प्रविष्टि तिथि:\r\n                22 DEC 2025 5:30PM by PIB Delhi Union Minister of State for Electronics and Information Technology and Commerce & Industry, Shri Jitin Prasada, said that emerging technologies such as drone technology, Internet of Things (IoT) and cybersecurity are playing a significant role in creating new employment opportunities. He was addressing the “Technology and Skill Development Conference” held at the Atal Bihari Vajpayee NIELIT Extension Centre campus in Pilibhit, Uttar Pradesh on 21 December 2025. Shri Jitin Prasada attended the conference as the Chief Guest. The objective of the conference was to promote technology-based skill development, innovation, and entrepreneurship among youth. Referring to the vision of Digital India and Atmanirbhar Bharat, the Minister of State said that institutions like NIELIT are acting as a bridge between policy formulation and implementation, and are playing a vital role in taking advanced technical education and skill development to remote and semi-urban areas of the country. He also emphasized that skill development aligned with industry requirements will lead India towards global leadership in technology. The conference was attended by Members of the Legislative Assembly, senior district and administrative officials, representatives from academia and industry, startup entrepreneurs, and officials of NIELIT. A large number of students, trainees, and local youth actively participated in the event. A key attraction of the conference was the technology exhibition by startup companies working in the field of Drone Technologies. These startups showcased innovative drone-based solutions for agriculture, crop monitoring, pesticide spraying, land surveying, mapping, disaster management, surveillance, and logistics. The exhibition provided participants with practical insights into real-world applications of drone technology and demonstrated the growing role of startups in driving technological innovation. On this occasion, the Minister also inaugurated a state-of-the-art Internet of Things (IoT) Laboratory at NIELIT Pilibhit. The newly established IoT Lab is aimed at providing hands-on, industry-oriented training to students from Pilibhit and surrounding regions. The laboratory will enable learners to gain practical exposure to smart sensors, embedded systems, automation, and real-time IoT applications, thereby enhancing their employability and technical competence. The IoT Laboratory is expected to play a significant role in bridging the gap between academia and industry, promoting innovation-led learning, and encouraging entrepreneurship among local youth. The initiative will also support startups and innovators by providing access to modern infrastructure and technical guidance. The conference also featured a special workshop on Cyber Security, wherein experts deliberated on topics such as cybercrime awareness, prevention of digital fraud, data privacy, safe use of the internet, and emerging cyber threats. The workshop proved highly informative and beneficial for students, teachers, government officials, and citizens, enhancing awareness about secure and responsible digital practices. In addition, technical sessions, interactive discussions, and awareness programs were organized to disseminate information on emerging technologies, government skill development initiatives, and opportunities in the electronics and IT sector. The Technology and Skill Development Conference concluded with a reaffirmation of NIELIT’s commitment to strengthening the digital and technological ecosystem in rural and semi-urban regions and empowering youth through skill development, innovation, and entrepreneurship. About NIELIT The National Institute of Electronics and Information Technology (NIELIT) is an autonomous scientific institution under the Ministry of Electronics and Information Technology, Government of India, playing a leading role in skill development and digital empowerment. With a wide presence through 56 NIELIT centres, over 750 accredited institutes, and more than 8,500 facilitation centres, NIELIT has imparted skills and certified millions of students in emerging technologies in the fields of Electronics and ICT. NIELIT has been accorded the status of a “Deemed to be University” under the distinct category by the Ministry of Education. Its main campus is located in Ropar (Punjab), with eleven constituent campuses at Aizawl, Agartala, Aurangabad, Calicut, Gorakhpur, Imphal, Itanagar, Ajmer (Kekri), Kohima, Patna, and Srinagar. The objective of NIELIT is to bring transformative changes in higher education in the field of Electronics and Information & Communication Technology through the use of digital technologies. *** MSZ (रिलीज़ आईडी: 2207453) आगंतुक पटल  : 232 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Electronics & IT Modern Technologies are playing a crucial role in generating employment: Union Minister of State Shri Jitin Prasada Shri Jitin Prasada addresses the “Technology and Skill Development Conference”, emphasizes NIELIT’s Role in taking advanced technical education and skill development to remote areas of the country प्रविष्टि तिथि:\r\n                        22 DEC 2025 5:30PM by PIB Delhi Union Minister of State for Electronics and Information Technology and Commerce & Industry, Shri Jitin Prasada, said that emerging technologies such as drone technology, Internet of Things (IoT) and cybersecurity are playing a significant role in creating new employment opportunities. He was addressing the “Technology and Skill Development Conference” held at the Atal Bihari Vajpayee NIELIT Extension Centre campus in Pilibhit, Uttar Pradesh on 21 December 2025. Shri Jitin Prasada attended the conference as the Chief Guest. The objective of the conference was to promote technology-based skill development, innovation, and entrepreneurship among youth. Referring to the vision of Digital India and Atmanirbhar Bharat, the Minister of State said that institutions like NIELIT are acting as a bridge between policy formulation and implementation, and are playing a vital role in taking advanced technical education and skill development to remote and semi-urban areas of the country. He also emphasized that skill development aligned with industry requirements will lead India towards global leadership in technology. The conference was attended by Members of the Legislative Assembly, senior district and administrative officials, representatives from academia and industry, startup entrepreneurs, and officials of NIELIT. A large number of students, trainees, and local youth actively participated in the event. A key attraction of the conference was the technology exhibition by startup companies working in the field of Drone Technologies. These startups showcased innovative drone-based solutions for agriculture, crop monitoring, pesticide spraying, land surveying, mapping, disaster management, surveillance, and logistics. The exhibition provided participants with practical insights into real-world applications of drone technology and demonstrated the growing role of startups in driving technological innovation. On this occasion, the Minister also inaugurated a state-of-the-art Internet of Things (IoT) Laboratory at NIELIT Pilibhit. The newly established IoT Lab is aimed at providing hands-on, industry-oriented training to students from Pilibhit and surrounding regions. The laboratory will enable learners to gain practical exposure to smart sensors, embedded systems, automation, and real-time IoT applications, thereby enhancing their employability and technical competence. The IoT Laboratory is expected to play a significant role in bridging the gap between academia and industry, promoting innovation-led learning, and encouraging entrepreneurship among local youth. The initiative will also support startups and innovators by providing access to modern infrastructure and technical guidance. The conference also featured a special workshop on Cyber Security, wherein experts deliberated on topics such as cybercrime awareness, prevention of digital fraud, data privacy, safe use of the internet, and emerging cyber threats. The workshop proved highly informative and beneficial for students, teachers, government officials, and citizens, enhancing awareness about secure and responsible digital practices. In addition, technical sessions, interactive discussions, and awareness programs were organized to disseminate information on emerging technologies, government skill development initiatives, and opportunities in the electronics and IT sector. The Technology and Skill Development Conference concluded with a reaffirmation of NIELIT’s commitment to strengthening the digital and technological ecosystem in rural and semi-urban regions and empowering youth through skill development, innovation, and entrepreneurship. About NIELIT The National Institute of Electronics and Information Technology (NIELIT) is an autonomous scientific institution under the Ministry of Electronics and Information Technology, Government of India, playing a leading role in skill development and digital empowerment. With a wide presence through 56 NIELIT centres, over 750 accredited institutes, and more than 8,500 facilitation centres, NIELIT has imparted skills and certified millions of students in emerging technologies in the fields of Electronics and ICT. NIELIT has been accorded the status of a “Deemed to be University” under the distinct category by the Ministry of Education. Its main campus is located in Ropar (Punjab), with eleven constituent campuses at Aizawl, Agartala, Aurangabad, Calicut, Gorakhpur, Imphal, Itanagar, Ajmer (Kekri), Kohima, Patna, and Srinagar. The objective of NIELIT is to bring transformative changes in higher education in the field of Electronics and Information & Communication Technology through the use of digital technologies. *** MSZ (रिलीज़ आईडी: 2207453)",
    "scraped_at": "2025-12-22T17:40:37.620018"
  },
  {
    "id": "2207584",
    "ministry": "Ministry of Environment, Forest and Climate Change",
    "title": "CAQM Reviews Air Pollution Control Measures, Ratifies Revised GRAP in 26th Commission Meeting",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207584",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Environment, Forest and Climate Change CAQM Reviews Air Pollution Control Measures, Ratifies Revised GRAP in 26th Commission Meeting प्रविष्टि तिथि:\r\n                22 DEC 2025 10:25PM by PIB Delhi CAQM Chairman, Shri Rajesh Verma chaired 26th meeting of the full Commission on 22.12.2025. In the meeting following Key agenda items was deliberated upon and reviewed in detail: Adoption of the Annual Report (2024–25) and Audited Annual Accounts (2024–25) of the Commission along with the Separate Audit Report and actionable points, appended to the Annual Report. Ratification of the revised Graded Response Action Plan (GRAP) dated 21.11.2025, modified in compliance with directions of the Hon’ble Supreme Court. The Commission reviewed the framework ensuring that measures under higher stages of GRAP subsume actions under preceding stages and further reviewed the implementation of GRAP during the current season, including actions taken under various stages and deliberations on additional measures under GRAP Stages-I and II, such as ensuring uninterrupted power supply, traffic decongestion, public advisories and augmentation of public transport services. Ratification of Office Order dated 10.12.2025 regarding constitution of an Expert Committee for abatement of air pollution caused by vehicular emissions, under the Chairmanship of Prof. Ashok Jhunjhunwala, IIT Madras, with defined Terms of Reference covering emission assessment, health impacts, clean mobility strategies, EV readiness and regulatory measures. Discussion held on amendment to Direction No. 94 dated 03.06.2025 to accelerate adoption of zero-emission vehicles by Motor Vehicle Aggregators, Delivery Service Providers and E-commerce entities. The Commission considered stakeholder representations and proposed transitional provisions permitting induction of BS-VI petrol 2-wheelers in existing fleets up to 31.12.2026, while maintaining restrictions on induction of conventional ICE vehicles in other specified categories w.e.f. 01.01.2026. Review of Status of Paddy Stubble Burning during 2025: The Commission noted significant reduction in incidents due to integrated monitoring and enforcement efforts, with approximately 92% overall reduction in NCR as compared to 2021. Further, the States of Punjab, Haryana and Uttar Pradesh were directed to prepare State Action Plans for monitoring and enforcement for wheat residue burning for the harvesting season of 2026, based on which Statutory Directions shall be issued. Review of enforcement actions including status of closures and resumptions of industrial units by the Enforcement Task Force (ETF) and status of filing of complaints/prosecution. Discussion on management of Construction & Demolition (C&D) waste: The Commission observed that dust emissions from C&D activities remain a major contributor to PM10 and PM2.5 levels in Delhi-NCR and noted need for improved compliance in dust abatement measures. The Commission emphasized strengthening supervision by Municipal Bodies and Development Authorities and they shall ensure establishment of collection points, storage and processing facilities for demolition waste, setting up of mechanism for verification of waste disposal prior to grant of construction permissions, and environmental management of C&D waste. Review of the issue of End-of-Life (EoL) vehicles in light of recent judicial pronouncements. The Commission noted that, pursuant to the Order of the Hon’ble Supreme Court dated 17.12.2025, protection against coercive action continues for BS-IV and later emission standard vehicles, while restrictions on taking action against highly polluting BS-III and lower emission standard vehicles have been lifted. Enforcement agencies were directed to ensure strict compliance with applicable orders. The Commission reiterated the need for continued strict vigilance, coordinated enforcement and effective implementation of Statutory Directions across all sectors, particularly during the winter season. All implementing agencies committed to regularly review air pollution control measures and to take strict and effective action across various sectors, including under GRAP. ***** VM/SK (रिलीज़ आईडी: 2207584) आगंतुक पटल  : 46 Ministry of Environment, Forest and Climate Change CAQM Reviews Air Pollution Control Measures, Ratifies Revised GRAP in 26th Commission Meeting प्रविष्टि तिथि:\r\n                        22 DEC 2025 10:25PM by PIB Delhi CAQM Chairman, Shri Rajesh Verma chaired 26th meeting of the full Commission on 22.12.2025. In the meeting following Key agenda items was deliberated upon and reviewed in detail: Adoption of the Annual Report (2024–25) and Audited Annual Accounts (2024–25) of the Commission along with the Separate Audit Report and actionable points, appended to the Annual Report. Ratification of the revised Graded Response Action Plan (GRAP) dated 21.11.2025, modified in compliance with directions of the Hon’ble Supreme Court. The Commission reviewed the framework ensuring that measures under higher stages of GRAP subsume actions under preceding stages and further reviewed the implementation of GRAP during the current season, including actions taken under various stages and deliberations on additional measures under GRAP Stages-I and II, such as ensuring uninterrupted power supply, traffic decongestion, public advisories and augmentation of public transport services. Ratification of Office Order dated 10.12.2025 regarding constitution of an Expert Committee for abatement of air pollution caused by vehicular emissions, under the Chairmanship of Prof. Ashok Jhunjhunwala, IIT Madras, with defined Terms of Reference covering emission assessment, health impacts, clean mobility strategies, EV readiness and regulatory measures. Discussion held on amendment to Direction No. 94 dated 03.06.2025 to accelerate adoption of zero-emission vehicles by Motor Vehicle Aggregators, Delivery Service Providers and E-commerce entities. The Commission considered stakeholder representations and proposed transitional provisions permitting induction of BS-VI petrol 2-wheelers in existing fleets up to 31.12.2026, while maintaining restrictions on induction of conventional ICE vehicles in other specified categories w.e.f. 01.01.2026. Review of Status of Paddy Stubble Burning during 2025: The Commission noted significant reduction in incidents due to integrated monitoring and enforcement efforts, with approximately 92% overall reduction in NCR as compared to 2021. Further, the States of Punjab, Haryana and Uttar Pradesh were directed to prepare State Action Plans for monitoring and enforcement for wheat residue burning for the harvesting season of 2026, based on which Statutory Directions shall be issued. Review of enforcement actions including status of closures and resumptions of industrial units by the Enforcement Task Force (ETF) and status of filing of complaints/prosecution. Discussion on management of Construction & Demolition (C&D) waste: The Commission observed that dust emissions from C&D activities remain a major contributor to PM10 and PM2.5 levels in Delhi-NCR and noted need for improved compliance in dust abatement measures. The Commission emphasized strengthening supervision by Municipal Bodies and Development Authorities and they shall ensure establishment of collection points, storage and processing facilities for demolition waste, setting up of mechanism for verification of waste disposal prior to grant of construction permissions, and environmental management of C&D waste. Review of the issue of End-of-Life (EoL) vehicles in light of recent judicial pronouncements. The Commission noted that, pursuant to the Order of the Hon’ble Supreme Court dated 17.12.2025, protection against coercive action continues for BS-IV and later emission standard vehicles, while restrictions on taking action against highly polluting BS-III and lower emission standard vehicles have been lifted. Enforcement agencies were directed to ensure strict compliance with applicable orders. The Commission reiterated the need for continued strict vigilance, coordinated enforcement and effective implementation of Statutory Directions across all sectors, particularly during the winter season. All implementing agencies committed to regularly review air pollution control measures and to take strict and effective action across various sectors, including under GRAP. ***** VM/SK (रिलीज़ आईडी: 2207584)",
    "scraped_at": "2025-12-22T17:40:39.339628"
  },
  {
    "id": "2207549",
    "ministry": "Ministry of Fisheries, Animal Husbandry & Dairying",
    "title": "Department of Animal Husbandry and Dairying (DAHD) Calls for Integrated Value Chains in Sheep and Goat Sector",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207549",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Fisheries, Animal Husbandry & Dairying Department of Animal Husbandry and Dairying (DAHD) Calls for Integrated Value Chains in Sheep and Goat Sector प्रविष्टि तिथि:\r\n                22 DEC 2025 8:29PM by PIB Delhi The Department of Animal Husbandry and Dairying (DAHD), Ministry of Fisheries, Animal Husbandry & Dairying, Government of India, in collaboration with ICAR-Central Sheep Wool Research Institute (ICAR-CSWRI), organized a sheep symposium on 22 nd December, 2025 at ICAR-CSWRI, Avikanagar, Rajasthan. The event was graced by Shri. Naresh Pal Gangwar, Secretary, DAHD, Dr Praveen Malik, Animal Husbandry Commissioner, Dr Muthukumarsamy B., Joint Secretary, DAHD, Shri Ritesh Chauhan, Secretary, Department of Animal Husbandry, Govt of Himachal Pradesh along with officials from Government and CSWRI. The event also witnessed countrywide participation from various State Animal Husbandry Departments, ICAR Institutes like ICAR-National Meat Research Institute, ICAR-National Institute of Natural Fibre Engineering and Technology, Central Wool Development Board, CCS-National Institute of Agricultural Marketing, National dairy Development Board, Industry groups, start-ups, Non-Government Organisations, experts, entrepreneurs and sheep farmers. Dr. Arun Kumar Tomar, Director, ICAR-CSWRI delivered the welcome address acknowledging the presence of dignitaries and participants. He briefed about the status of sheep, mutton and wool sector in the country. Dr. Muthukumarasamy B, Joint Secretary, Department of Animal Husbandry and Dairying (DAHD), stated that the Department is giving special emphasis to sheep breed improvement programmes under the National Livestock Mission (NLM). Under the Entrepreneurship Development Programme (EDP) of NLM, capital subsidy of up to 50% (maximum ₹50 lakh) is being provided for projects with a capacity of 500 sheep/or goats. The response to scheme is overwhelming. He added that under the Animal Husbandry Infrastructure Development Fund (AHIDF), DAHD is providing 3% interest subvention for activities such as waste-to-wealth initiatives, vaccine production units, and primary wool processing units. While highlighting the need for capacity building and skill development, he stressed upon the importance of private sector participation in training farmers and entrepreneurs. He highlighted the genetic improvement initiatives of the Government and   emphasized on need of reach of Artificial insemination services to rural households through mobile veterinary vans. Dr Praveen Malik, Animal Husbandry Commissioner, GOI emphsasized the need of recognizing the resources and make policies accordingly. Mr. Naresh Pal Gangwar, Secretary, Department of Animal Husbandry and Dairying (DAHD), Government of India, informed that the dairy and poultry sectors in the country have successfully developed robust value chains through cooperatives and private enterprises, ensuring remunerative prices for farmers. He highlighted that India contributes nearly 25% of global milk production and ranks second in egg production globally. Emphasising the untapped potential of the sheep and goat sector, he remarked that sheep and goats are often referred to as the “ATM of the poor”, underscoring their importance in rural livelihoods. He stressed the need to strengthen this sector through research-driven interventions, ensuring that outcomes of research reach farmers directly. He underlined the necessity of developing integrated value chains in the sheep sector, similar to those in the dairy sector. On disease control, he stated that states must strengthen veterinary services, with the Government of India supporting them through PPR vaccination programmes, which is crucial given the high export potential and growing domestic demand–supply gap. He emphasised the need to enhance productivity in meat and wool and to develop high-performing breeds, especially in view of declining wool demand due to synthetic alternatives. During the seminar, a newsletter on CSWRI at a Glance has also been released. The symposium consisted of technical sessions on wool, mutton, milk, sheep genetic resources and entrepreneurship in sheep husbandry wherein the farmers, entrepreneurs, industry and experts had a threadbare discussions on the issues relating to sheep sector. ****** JP (रिलीज़ आईडी: 2207549) आगंतुक पटल  : 146 Ministry of Fisheries, Animal Husbandry & Dairying Department of Animal Husbandry and Dairying (DAHD) Calls for Integrated Value Chains in Sheep and Goat Sector प्रविष्टि तिथि:\r\n                        22 DEC 2025 8:29PM by PIB Delhi The Department of Animal Husbandry and Dairying (DAHD), Ministry of Fisheries, Animal Husbandry & Dairying, Government of India, in collaboration with ICAR-Central Sheep Wool Research Institute (ICAR-CSWRI), organized a sheep symposium on 22 nd December, 2025 at ICAR-CSWRI, Avikanagar, Rajasthan. The event was graced by Shri. Naresh Pal Gangwar, Secretary, DAHD, Dr Praveen Malik, Animal Husbandry Commissioner, Dr Muthukumarsamy B., Joint Secretary, DAHD, Shri Ritesh Chauhan, Secretary, Department of Animal Husbandry, Govt of Himachal Pradesh along with officials from Government and CSWRI. The event also witnessed countrywide participation from various State Animal Husbandry Departments, ICAR Institutes like ICAR-National Meat Research Institute, ICAR-National Institute of Natural Fibre Engineering and Technology, Central Wool Development Board, CCS-National Institute of Agricultural Marketing, National dairy Development Board, Industry groups, start-ups, Non-Government Organisations, experts, entrepreneurs and sheep farmers. Dr. Arun Kumar Tomar, Director, ICAR-CSWRI delivered the welcome address acknowledging the presence of dignitaries and participants. He briefed about the status of sheep, mutton and wool sector in the country. Dr. Muthukumarasamy B, Joint Secretary, Department of Animal Husbandry and Dairying (DAHD), stated that the Department is giving special emphasis to sheep breed improvement programmes under the National Livestock Mission (NLM). Under the Entrepreneurship Development Programme (EDP) of NLM, capital subsidy of up to 50% (maximum ₹50 lakh) is being provided for projects with a capacity of 500 sheep/or goats. The response to scheme is overwhelming. He added that under the Animal Husbandry Infrastructure Development Fund (AHIDF), DAHD is providing 3% interest subvention for activities such as waste-to-wealth initiatives, vaccine production units, and primary wool processing units. While highlighting the need for capacity building and skill development, he stressed upon the importance of private sector participation in training farmers and entrepreneurs. He highlighted the genetic improvement initiatives of the Government and   emphasized on need of reach of Artificial insemination services to rural households through mobile veterinary vans. Dr Praveen Malik, Animal Husbandry Commissioner, GOI emphsasized the need of recognizing the resources and make policies accordingly. Mr. Naresh Pal Gangwar, Secretary, Department of Animal Husbandry and Dairying (DAHD), Government of India, informed that the dairy and poultry sectors in the country have successfully developed robust value chains through cooperatives and private enterprises, ensuring remunerative prices for farmers. He highlighted that India contributes nearly 25% of global milk production and ranks second in egg production globally. Emphasising the untapped potential of the sheep and goat sector, he remarked that sheep and goats are often referred to as the “ATM of the poor”, underscoring their importance in rural livelihoods. He stressed the need to strengthen this sector through research-driven interventions, ensuring that outcomes of research reach farmers directly. He underlined the necessity of developing integrated value chains in the sheep sector, similar to those in the dairy sector. On disease control, he stated that states must strengthen veterinary services, with the Government of India supporting them through PPR vaccination programmes, which is crucial given the high export potential and growing domestic demand–supply gap. He emphasised the need to enhance productivity in meat and wool and to develop high-performing breeds, especially in view of declining wool demand due to synthetic alternatives. During the seminar, a newsletter on CSWRI at a Glance has also been released. The symposium consisted of technical sessions on wool, mutton, milk, sheep genetic resources and entrepreneurship in sheep husbandry wherein the farmers, entrepreneurs, industry and experts had a threadbare discussions on the issues relating to sheep sector. ****** JP (रिलीज़ आईडी: 2207549)",
    "scraped_at": "2025-12-22T17:40:42.331695"
  },
  {
    "id": "2207479",
    "ministry": "Ministry of Health and Family Welfare",
    "title": "Union MoS for Health and Family Welfare, Smt. Anupriya Patel Addresses 7th Convocation of Vardhman Mahavir Medical College & Safdarjung Hospital, New Delhi",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207479",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Health and Family Welfare Union MoS for Health and Family Welfare, Smt. Anupriya Patel Addresses 7th Convocation of Vardhman Mahavir Medical College & Safdarjung Hospital, New Delhi Union Minister highlights transformation achieved in India’s Healthcare landscape in the last 11 years In the last 11 years, the number of medical colleges in the country has increased from 387 to 819; UG seats have risen from 51,000 to 1,28,000, and PG seats from 31,000 to around 82,000 today: Smt. Anupriya Patel More than 217 postgraduate students, 136 undergraduate students and 40 super-specialty students were awarded degrees 43 students awarded with medals in recognition of outstanding performance and dedication प्रविष्टि तिथि:\r\n                22 DEC 2025 6:04PM by PIB Delhi Union Minister of State for Health and Family Welfare, Smt. Anupriya Patel addressed the 7 th annual convocation ceremony of Vardhman Mahavir Medical College & Safdarjung Hospital, here today. Prof. (Dr.) Mahesh Verma, Vice Chancellor, GGSIPU and Dr Sunita Sharma, Director General of Health Services (DGHS) were also present. Addressing the gathering, Smt. Patel congratulated the graduating students and emphasized the pivotal role of public medical institutions in strengthening India’s healthcare system. “The degrees you that you will receive today are more than certificates of merit. They are the qualities and traits of compassion, dedication, perseverance that you will follow from now onwards in your medical profession.” She urged the young doctors to uphold ethical medical practice, compassion and a strong commitment to serving underserved and marginalized communities. Highlighting the progress achieved in India’s healthcare landscape in the last 11 years, Smt. Patel said that the government has transformed the entire pyramid of healthcare at the primary, secondary and tertiary levels. “At the primary level, there are more than 1.82 lakh Ayushman Arogya Mandirs operational in the country which are providing comprehensive primary care services to the people, the government is fixing up the critical gaps in secondary healthcare facilities like CHCs and district hospitals and we are also expanding the network of tertiary care facilities and reimagining medical education. The Union Minister stated that “in the last 11 years, the number of medical colleges in the country has increased from 387 to 819. The number of AIIMS has increased from 7 to 23. Undergraduate medical seats have risen from 51,000 to 1,28,000, and postgraduate seats from 31,000 to around 82,000 today.” She also informed that more than 62 crore people, accounting to over 40% of India’s population are being provided with free health coverage up to Rs 5 lakh under the Ayushman Bharat – PMJAY scheme, the largest health coverage scheme in the world. “There are also schemes like Pradhan Mantri Jan Aushadhi Pariyojana and Amrit Pharmacies which are providing medicines, medical devices and surgical implants at discounted rates”, she added. The Union Minister said that “today, India is at the forefront of digital health and innovative technologies because we want to fulfil the larger goal of universal healthcare”. She concluded her address by encouraging graduating students to actively contribute to academics and research. “As doctors you have entered into a social contract, so that touch of humanity should not go anywhere”, she added. On this occasion, more than 217 postgraduate students, 136 undergraduate students and 40 super-specialty students were awarded degrees, and 43 students were awarded with medals in recognition of their outstanding performance and dedication. Prof. (Dr.) Sandeep Bansal, Director, VMMC & Safdarjung Hospital; Prof. (Dr.) Geetika Khanna, Principal, VMMC & Safdarjung Hospital; Prof. (Dr.) Charu Bamba, Medical Superintendent, VMMC & Safdarjung Hospital and senior officials of the Union Health Ministry were present in the event. *** SR HFW- MoS VMMC Convocation Address/22 nd December 2025/1 (रिलीज़ आईडी: 2207479) आगंतुक पटल  : 184 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Health and Family Welfare Union MoS for Health and Family Welfare, Smt. Anupriya Patel Addresses 7th Convocation of Vardhman Mahavir Medical College & Safdarjung Hospital, New Delhi Union Minister highlights transformation achieved in India’s Healthcare landscape in the last 11 years In the last 11 years, the number of medical colleges in the country has increased from 387 to 819; UG seats have risen from 51,000 to 1,28,000, and PG seats from 31,000 to around 82,000 today: Smt. Anupriya Patel More than 217 postgraduate students, 136 undergraduate students and 40 super-specialty students were awarded degrees 43 students awarded with medals in recognition of outstanding performance and dedication प्रविष्टि तिथि:\r\n                        22 DEC 2025 6:04PM by PIB Delhi Union Minister of State for Health and Family Welfare, Smt. Anupriya Patel addressed the 7 th annual convocation ceremony of Vardhman Mahavir Medical College & Safdarjung Hospital, here today. Prof. (Dr.) Mahesh Verma, Vice Chancellor, GGSIPU and Dr Sunita Sharma, Director General of Health Services (DGHS) were also present. Addressing the gathering, Smt. Patel congratulated the graduating students and emphasized the pivotal role of public medical institutions in strengthening India’s healthcare system. “The degrees you that you will receive today are more than certificates of merit. They are the qualities and traits of compassion, dedication, perseverance that you will follow from now onwards in your medical profession.” She urged the young doctors to uphold ethical medical practice, compassion and a strong commitment to serving underserved and marginalized communities. Highlighting the progress achieved in India’s healthcare landscape in the last 11 years, Smt. Patel said that the government has transformed the entire pyramid of healthcare at the primary, secondary and tertiary levels. “At the primary level, there are more than 1.82 lakh Ayushman Arogya Mandirs operational in the country which are providing comprehensive primary care services to the people, the government is fixing up the critical gaps in secondary healthcare facilities like CHCs and district hospitals and we are also expanding the network of tertiary care facilities and reimagining medical education. The Union Minister stated that “in the last 11 years, the number of medical colleges in the country has increased from 387 to 819. The number of AIIMS has increased from 7 to 23. Undergraduate medical seats have risen from 51,000 to 1,28,000, and postgraduate seats from 31,000 to around 82,000 today.” She also informed that more than 62 crore people, accounting to over 40% of India’s population are being provided with free health coverage up to Rs 5 lakh under the Ayushman Bharat – PMJAY scheme, the largest health coverage scheme in the world. “There are also schemes like Pradhan Mantri Jan Aushadhi Pariyojana and Amrit Pharmacies which are providing medicines, medical devices and surgical implants at discounted rates”, she added. The Union Minister said that “today, India is at the forefront of digital health and innovative technologies because we want to fulfil the larger goal of universal healthcare”. She concluded her address by encouraging graduating students to actively contribute to academics and research. “As doctors you have entered into a social contract, so that touch of humanity should not go anywhere”, she added. On this occasion, more than 217 postgraduate students, 136 undergraduate students and 40 super-specialty students were awarded degrees, and 43 students were awarded with medals in recognition of their outstanding performance and dedication. Prof. (Dr.) Sandeep Bansal, Director, VMMC & Safdarjung Hospital; Prof. (Dr.) Geetika Khanna, Principal, VMMC & Safdarjung Hospital; Prof. (Dr.) Charu Bamba, Medical Superintendent, VMMC & Safdarjung Hospital and senior officials of the Union Health Ministry were present in the event. *** SR HFW- MoS VMMC Convocation Address/22 nd December 2025/1 (रिलीज़ आईडी: 2207479)",
    "scraped_at": "2025-12-22T17:40:45.683650"
  },
  {
    "id": "2207460",
    "ministry": "Ministry of Health and Family Welfare",
    "title": "Union Health Ministry Holds Two-Day Chintan Shivir to Strengthen Influenza Preparedness through Intersectoral Convergence",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207460",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Health and Family Welfare Union Health Ministry Holds Two-Day Chintan Shivir to Strengthen Influenza Preparedness through Intersectoral Convergence Preparedness, Surveillance and Surge Capacity Key to Upcoming Influenza Season: JP Nadda Centre, States and Multiple Sectors Unite to Enhance Influenza Preparedness and Response Influenza Preparedness Cannot Remain Siloed; Calls for Whole-of-Government Approach: Union Health Minister प्रविष्टि तिथि:\r\n                22 DEC 2025 5:40PM by PIB Delhi The National Centre for Disease Control (NCDC), Ministry of Health and Family Welfare (MoHFW), in collaboration with the World Health Organization (WHO) India, is organizing a two-day Chintan Shivir on “Strengthening Interministerial and Intersectoral Convergence for Influenza Preparedness and Response” from 22nd to 23rd December 2025 in New Delhi. The Chintan Shivir aims to provide a structured platform for deliberations among key stakeholders to strengthen preparedness and response mechanisms ahead of the upcoming influenza season in the country. Addressing the inaugural session virtually today, Union Minister for Health and Family Welfare, Shri Jagat Prakash Nadda, stated that the Chintan Shivir offers an important opportunity for all stakeholders to deliberate on various dimensions of preparedness for resilience against influenza. He emphasized that it is vital to ensure preparedness and response activities, including surge capacities, are well aligned for the forthcoming influenza season. The Union Health Minister further underlined the importance of the Integrated Disease Surveillance Programme (IDSP), stressing that coordinated and synergistic efforts by the Centre and States are essential to ensure robust and collaborative surveillance systems across India. The Chintan Shivir witnessed participation from around 110 representatives from a wide range of ministries, departments and institutions, reflecting strong multisectoral engagement. Participants included officials from the Ministry of Environment, Forest and Climate Change, Department of Animal Husbandry and Dairying, Directorate General of Health Services (DGHS) of the Ministry of Health & Family Welfare, Indian Council of Medical Research (ICMR), Indian Council of Agricultural Research (ICAR), National Institute of Virology (NIV), partner organizations, and States and Union Territories. Eleven States participated in person, while others joined virtually, enabling cross-learning through the sharing of best practices and experiences. Influenza continues to pose a significant public health challenge in India and globally, with periodic outbreaks resulting in substantial morbidity and mortality, particularly among vulnerable populations such as young children, older adults, pregnant women and individuals with chronic illnesses. Against this backdrop, the Chintan Shivir was convened at a critical juncture. The Union Health Ministry continues to closely monitor seasonal influenza trends across States and UTs in real time through the IDSP network. Deliberations emphasized that influenza preparedness cannot remain siloed and must be supported through convergence across sectors for surveillance, early warning, laboratory preparedness, clinical readiness and effective risk communication. A key outcome of the Chintan Shivir is the advancement of a more structured and actionable approach to preparedness review by States, UTs and institutions. This includes the development of a practical preparedness checklist to support readiness assessments, identify gaps and guide time-bound follow-up actions. The discussions reinforced the need for timely information sharing, clarity of roles and responsibilities, and coordinated action across departments. The Chintan Shivir marks an important step towards strengthening One Health–based preparedness by linking human, animal and environmental health systems. By fostering whole-of-government coordination through a One Health lens, the initiative contributes to strengthening India’s pandemic preparedness and response capabilities and advancing national and global health security, in the spirit of Vasudhaiva Kutumbakam. *** SR HFW/NCDC Influenza Chintan Shivir/22Dec2025/1 (रिलीज़ आईडी: 2207460) आगंतुक पटल  : 195 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Health and Family Welfare Union Health Ministry Holds Two-Day Chintan Shivir to Strengthen Influenza Preparedness through Intersectoral Convergence Preparedness, Surveillance and Surge Capacity Key to Upcoming Influenza Season: JP Nadda Centre, States and Multiple Sectors Unite to Enhance Influenza Preparedness and Response Influenza Preparedness Cannot Remain Siloed; Calls for Whole-of-Government Approach: Union Health Minister प्रविष्टि तिथि:\r\n                        22 DEC 2025 5:40PM by PIB Delhi The National Centre for Disease Control (NCDC), Ministry of Health and Family Welfare (MoHFW), in collaboration with the World Health Organization (WHO) India, is organizing a two-day Chintan Shivir on “Strengthening Interministerial and Intersectoral Convergence for Influenza Preparedness and Response” from 22nd to 23rd December 2025 in New Delhi. The Chintan Shivir aims to provide a structured platform for deliberations among key stakeholders to strengthen preparedness and response mechanisms ahead of the upcoming influenza season in the country. Addressing the inaugural session virtually today, Union Minister for Health and Family Welfare, Shri Jagat Prakash Nadda, stated that the Chintan Shivir offers an important opportunity for all stakeholders to deliberate on various dimensions of preparedness for resilience against influenza. He emphasized that it is vital to ensure preparedness and response activities, including surge capacities, are well aligned for the forthcoming influenza season. The Union Health Minister further underlined the importance of the Integrated Disease Surveillance Programme (IDSP), stressing that coordinated and synergistic efforts by the Centre and States are essential to ensure robust and collaborative surveillance systems across India. The Chintan Shivir witnessed participation from around 110 representatives from a wide range of ministries, departments and institutions, reflecting strong multisectoral engagement. Participants included officials from the Ministry of Environment, Forest and Climate Change, Department of Animal Husbandry and Dairying, Directorate General of Health Services (DGHS) of the Ministry of Health & Family Welfare, Indian Council of Medical Research (ICMR), Indian Council of Agricultural Research (ICAR), National Institute of Virology (NIV), partner organizations, and States and Union Territories. Eleven States participated in person, while others joined virtually, enabling cross-learning through the sharing of best practices and experiences. Influenza continues to pose a significant public health challenge in India and globally, with periodic outbreaks resulting in substantial morbidity and mortality, particularly among vulnerable populations such as young children, older adults, pregnant women and individuals with chronic illnesses. Against this backdrop, the Chintan Shivir was convened at a critical juncture. The Union Health Ministry continues to closely monitor seasonal influenza trends across States and UTs in real time through the IDSP network. Deliberations emphasized that influenza preparedness cannot remain siloed and must be supported through convergence across sectors for surveillance, early warning, laboratory preparedness, clinical readiness and effective risk communication. A key outcome of the Chintan Shivir is the advancement of a more structured and actionable approach to preparedness review by States, UTs and institutions. This includes the development of a practical preparedness checklist to support readiness assessments, identify gaps and guide time-bound follow-up actions. The discussions reinforced the need for timely information sharing, clarity of roles and responsibilities, and coordinated action across departments. The Chintan Shivir marks an important step towards strengthening One Health–based preparedness by linking human, animal and environmental health systems. By fostering whole-of-government coordination through a One Health lens, the initiative contributes to strengthening India’s pandemic preparedness and response capabilities and advancing national and global health security, in the spirit of Vasudhaiva Kutumbakam. *** SR HFW/NCDC Influenza Chintan Shivir/22Dec2025/1 (रिलीज़ आईडी: 2207460)",
    "scraped_at": "2025-12-22T17:40:49.906858"
  },
  {
    "id": "2207540",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister and Minister of Cooperation Shri Amit Shah hails India–New Zealand FTA, terming it Modi government’s trade diplomacy which is setting new milestone",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207540",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah hails India–New Zealand FTA, terming it Modi government’s trade diplomacy which is setting new milestone India–New Zealand FTA brings in $20 billion investment and offers lucrative opportunities for Indian innovators, entrepreneurs, farmers, MSMEs, students, and youth, will open new gateways to prosperity It is a textbook example of how, people-centric foreign policy is fulfilling the aspirations of citizens under PM Shri Narendra Modi Ji's leadership प्रविष्टि तिथि:\r\n                22 DEC 2025 7:58PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has hailed India–New Zealand FTA and termed it the Modi government’s trade diplomacy which is setting new milestone. In a post on ‘X’, Union Home Minister Shri Amit Shah said “Modi govt’s trade diplomacy sets new milestone. India–New Zealand FTA, that brings in $20 billion investment and offers lucrative opportunities for Indian innovators, entrepreneurs, farmers, MSMEs, students, and youth, will open new gateways to prosperity. It is a textbook example of how, people-centric foreign policy is fulfilling the aspirations of citizens under PM Shri Narendra Modi Ji's leadership.” Modi govt’s trade diplomacy sets new milestone. India–New Zealand FTA, that brings in $20 billion investment and offers lucrative opportunities for Indian innovators, entrepreneurs, farmers, MSMEs, students, and youth, will open new gateways to prosperity. It is a textbook… — Amit Shah (@AmitShah) December 22, 2025 *** RK / RR / PS (रिलीज़ आईडी: 2207540) आगंतुक पटल  : 139 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Marathi , हिन्दी , Gujarati , Tamil , Telugu , Kannada , Malayalam Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah hails India–New Zealand FTA, terming it Modi government’s trade diplomacy which is setting new milestone India–New Zealand FTA brings in $20 billion investment and offers lucrative opportunities for Indian innovators, entrepreneurs, farmers, MSMEs, students, and youth, will open new gateways to prosperity It is a textbook example of how, people-centric foreign policy is fulfilling the aspirations of citizens under PM Shri Narendra Modi Ji's leadership प्रविष्टि तिथि:\r\n                        22 DEC 2025 7:58PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has hailed India–New Zealand FTA and termed it the Modi government’s trade diplomacy which is setting new milestone. In a post on ‘X’, Union Home Minister Shri Amit Shah said “Modi govt’s trade diplomacy sets new milestone. India–New Zealand FTA, that brings in $20 billion investment and offers lucrative opportunities for Indian innovators, entrepreneurs, farmers, MSMEs, students, and youth, will open new gateways to prosperity. It is a textbook example of how, people-centric foreign policy is fulfilling the aspirations of citizens under PM Shri Narendra Modi Ji's leadership.” Modi govt’s trade diplomacy sets new milestone. India–New Zealand FTA, that brings in $20 billion investment and offers lucrative opportunities for Indian innovators, entrepreneurs, farmers, MSMEs, students, and youth, will open new gateways to prosperity. It is a textbook… — Amit Shah (@AmitShah) December 22, 2025 *** RK / RR / PS (रिलीज़ आईडी: 2207540)",
    "scraped_at": "2025-12-22T17:40:51.611201"
  },
  {
    "id": "2207470",
    "ministry": "Ministry of Personnel, Public Grievances & Pensions",
    "title": "33rd Webinar of the National Good Governance Webinar Series 2025-26 under the theme ‘Holistic Development of Districts’ held on 22nd December 2025 for dissemination and replication of best practices.",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207470",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Personnel, Public Grievances & Pensions 33rd Webinar of the National Good Governance Webinar Series 2025-26 under the theme ‘Holistic Development of Districts’ held on 22nd December 2025 for dissemination and replication of best practices. Presentations made on the Nalanda District initiative, Bihar by Shri Shashank Shubhankar and Barpeta District initiative, Assam by Shri Aayush Garg to national audience. प्रविष्टि तिथि:\r\n                22 DEC 2025 5:53PM by PIB Delhi The Prime Minister has directed Department of Administrative Reforms & Public Grievances (DARPG) to hold virtual conferences/ webinars with District Collectors and other officers in which past award winners of PM’s Awards for Excellence in Public Administration be invited to present their experiences with the objective of greater dissemination and replication. In pursuance of the Prime Minister’s directions, the DARPG has conducted 33 National Good Governance Webinars, one Webinar every month, since April, 2022 to encourage dissemination and replication of the award-winning nominations under the Scheme of Prime Minister’s Award for Excellence in Public Administration. Each webinar is attended by about 1000 officials from Line Departments, State Governments, District Collectors, State Administrative Training Institutes and Central Training Institutes. These webinars not only present the current status of institutionalisation/ sustainability of the initiative, but also provides insights into the status of its replication/expansion. The 33 rd Webinar was held on the 22 th December 2025 in which two initiatives, awarded with the PM’s Award for Excellence in Public Administration for the year 2023, under the theme ‘Holistic Development of Districts’, as per details below presented Power Point presentation on: Nalanda District initiative, Bihar by Shri Shashank Shubhankar, District Magistrate, Gaya, Bihar; and Barpeta District initiative, Assam by Shri Aayush Garg, Deputy Commissioner, Sivasagar, Assam. The Webinar was chaired by Shri Puneet Yadav, Additional Secretary, DARPG and was attended by senior officers of the Department. The Webinar was attended from more than 800 locations across India with Senior Officials of Administrative Reforms Departments of States/UTs, District Collectors, State and District officers, Officers of Central and State Administrative Training Institutes. ***** NKR/AK (रिलीज़ आईडी: 2207470) आगंतुक पटल  : 164 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Personnel, Public Grievances & Pensions 33rd Webinar of the National Good Governance Webinar Series 2025-26 under the theme ‘Holistic Development of Districts’ held on 22nd December 2025 for dissemination and replication of best practices. Presentations made on the Nalanda District initiative, Bihar by Shri Shashank Shubhankar and Barpeta District initiative, Assam by Shri Aayush Garg to national audience. प्रविष्टि तिथि:\r\n                        22 DEC 2025 5:53PM by PIB Delhi The Prime Minister has directed Department of Administrative Reforms & Public Grievances (DARPG) to hold virtual conferences/ webinars with District Collectors and other officers in which past award winners of PM’s Awards for Excellence in Public Administration be invited to present their experiences with the objective of greater dissemination and replication. In pursuance of the Prime Minister’s directions, the DARPG has conducted 33 National Good Governance Webinars, one Webinar every month, since April, 2022 to encourage dissemination and replication of the award-winning nominations under the Scheme of Prime Minister’s Award for Excellence in Public Administration. Each webinar is attended by about 1000 officials from Line Departments, State Governments, District Collectors, State Administrative Training Institutes and Central Training Institutes. These webinars not only present the current status of institutionalisation/ sustainability of the initiative, but also provides insights into the status of its replication/expansion. The 33 rd Webinar was held on the 22 th December 2025 in which two initiatives, awarded with the PM’s Award for Excellence in Public Administration for the year 2023, under the theme ‘Holistic Development of Districts’, as per details below presented Power Point presentation on: Nalanda District initiative, Bihar by Shri Shashank Shubhankar, District Magistrate, Gaya, Bihar; and Barpeta District initiative, Assam by Shri Aayush Garg, Deputy Commissioner, Sivasagar, Assam. The Webinar was chaired by Shri Puneet Yadav, Additional Secretary, DARPG and was attended by senior officers of the Department. The Webinar was attended from more than 800 locations across India with Senior Officials of Administrative Reforms Departments of States/UTs, District Collectors, State and District officers, Officers of Central and State Administrative Training Institutes. ***** NKR/AK (रिलीज़ आईडी: 2207470)",
    "scraped_at": "2025-12-22T17:40:54.612502"
  },
  {
    "id": "2207507",
    "ministry": "Ministry of Rural Development",
    "title": "Union Rural Development Minister Shri Shivraj Singh Chouhan meets Rozgar Sahayaks",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207507",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Rural Development Union Rural Development Minister Shri Shivraj Singh Chouhan meets Rozgar Sahayaks Rozgar Sahayaks thanks Centre for raising administrative expenditure from 6% to 9% “Administrative expenditure of employment assistants raised from 6% to 9%; there will now be no difficulty in payment of salaries”: Shri Shivraj Singh Chouhan “The delay in payment of salaries to staff was a major concern; salaries will now be paid first, followed by provision for other essential expenditure”: Shri Shivraj Singh Chouhan “Legal guarantee of 125 days of employment instead of 100 days; the village itself will decide its development”: Shri Shivraj Singh Chouhan “VB-G RAM G scheme made to be more practical and effective; Prime Minister Shri Narendra Modi’s vision is that development works must be visible on the ground”: Shri Shivraj Singh Chouhan प्रविष्टि तिथि:\r\n                22 DEC 2025 6:42PM by PIB Delhi Rozgar Sahayaks from different States met Union Minister for Rural Development Shri Shivraj Singh Chouhan in Bhopal on Monday and expressed their gratitude to him for increasing the administrative expenditure from 6% to 9%. On this occasion, Shri Shivraj Singh Chouhan said that the delay in timely payment of salaries to employment assistants, panchayat secretaries and technical staff had been a major concern, and that an important decision to increase administrative expenditure has been taken to address this. Union Minister Shri Shivraj Singh Chouhan said that earlier administrative expenditure was 6%, which has now been increased to 9%, that is, it has been raised by one and a half times. The direct benefit of this will be that, out of the total proposed budget of ₹1,51,282 crore, more than ₹13,000 crore will be earmarked for salaries of employees and administrative requirements. The Union Minister said this amount will be sufficient to meet salary payments of staff and it will be ensured that there is no wastage of any kind in administrative expenditure. Shri Shivraj Singh said strict monitoring will be done to prevent spending on jeeps, vehicles or other unnecessary heads. He said Rozgar Sahayaks had flagged problems of delayed and withheld salaries, after which provisions were made in the rules that salaries must be paid first and other essential expenses only thereafter. For this, necessary directions will be issued in coordination with the States. Union Minister for Rural Development Shri Shivraj Singh Chouhan said that unlike under MGNREGA, there is now a legal guarantee of 125 days of employment instead of 100 days. At the same time, keeping in view the agricultural peak season, state governments have been given the authority to issue notifications allowing workers to be deployed in agricultural work for up to 60 days during sowing and harvesting seasons, so that farmers do not have to face a shortage of labour. Shri Shivraj Singh Chouhan said that efforts have been made to make the VB-G RAM G scheme more practical and effective by removing old shortcomings. By increasing administrative expenditure, a concrete step has been taken to reduce the difficulties of colleagues working at the grassroots. Shri Shivraj Singh also told the employment assistants that this message must be properly communicated down the line and assured them that, after discussing their suggestions with the State Governments, further improvements will continue to be made so that staff working at the panchyat level. The Minister said that the ‘Viksit Bharat-G RAM G’ is a historic scheme, which has now moved beyond being a bill and has become an Act after the President’s assent. Shri Shivraj Singh Chouhan said that some people are trying to create confusion about this scheme, but it is important to understand the truth and ensure that correct information reaches every village. Shri Shivraj Singh Chouhan said that under MGNREGA, there was earlier a guarantee of 100 days of employment, which has been increased to 125 days under the ‘Viksit Bharat Rozgar Yojana’. He said this is not just an increase in days, but a further strengthening of the guarantee of employment. If for any reason employment is not provided, the provision of unemployment allowance has been made much more robust than before. He said strict provisions have also been made regarding payment of wages. If wages are not paid within 15 days and the amount remains pending, the worker will be paid additional compensation. It will no longer be acceptable for wages to remain stuck for months. Timely payment of wages has been ensured. The current wage rates will continue and wages will increase every year. The Union Minister said that under this scheme, four types of works will be undertaken. The first category includes works related to water conservation and saving water, such as ponds, check dams and other structures. The second category includes works to basic village infrastructure such as schools, hospitals, Anganwadi centres, roads, drains and other facilities will be carried out. Necessary infrastructure for women associated with the livelihood mission and for FPOs will also be included. The third category of works will be livelihood-based activities that help in expanding employment, while the fourth will include works related to protection from natural disasters, such as retaining walls, drainage systems and structures linked to rivers and streams. Shri Shivraj Singh Chouhan said that it is the Prime Minister Narendra Modi’s vision that development works should be visible on the ground. Under the Viksit Gram Panchayat Yojana, all plans will be prepared through collective deliberation and the village itself will decide the course of its development. *** PK/KC/MK (रिलीज़ आईडी: 2207507) आगंतुक पटल  : 138 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati , Tamil Ministry of Rural Development Union Rural Development Minister Shri Shivraj Singh Chouhan meets Rozgar Sahayaks Rozgar Sahayaks thanks Centre for raising administrative expenditure from 6% to 9% “Administrative expenditure of employment assistants raised from 6% to 9%; there will now be no difficulty in payment of salaries”: Shri Shivraj Singh Chouhan “The delay in payment of salaries to staff was a major concern; salaries will now be paid first, followed by provision for other essential expenditure”: Shri Shivraj Singh Chouhan “Legal guarantee of 125 days of employment instead of 100 days; the village itself will decide its development”: Shri Shivraj Singh Chouhan “VB-G RAM G scheme made to be more practical and effective; Prime Minister Shri Narendra Modi’s vision is that development works must be visible on the ground”: Shri Shivraj Singh Chouhan प्रविष्टि तिथि:\r\n                        22 DEC 2025 6:42PM by PIB Delhi Rozgar Sahayaks from different States met Union Minister for Rural Development Shri Shivraj Singh Chouhan in Bhopal on Monday and expressed their gratitude to him for increasing the administrative expenditure from 6% to 9%. On this occasion, Shri Shivraj Singh Chouhan said that the delay in timely payment of salaries to employment assistants, panchayat secretaries and technical staff had been a major concern, and that an important decision to increase administrative expenditure has been taken to address this. Union Minister Shri Shivraj Singh Chouhan said that earlier administrative expenditure was 6%, which has now been increased to 9%, that is, it has been raised by one and a half times. The direct benefit of this will be that, out of the total proposed budget of ₹1,51,282 crore, more than ₹13,000 crore will be earmarked for salaries of employees and administrative requirements. The Union Minister said this amount will be sufficient to meet salary payments of staff and it will be ensured that there is no wastage of any kind in administrative expenditure. Shri Shivraj Singh said strict monitoring will be done to prevent spending on jeeps, vehicles or other unnecessary heads. He said Rozgar Sahayaks had flagged problems of delayed and withheld salaries, after which provisions were made in the rules that salaries must be paid first and other essential expenses only thereafter. For this, necessary directions will be issued in coordination with the States. Union Minister for Rural Development Shri Shivraj Singh Chouhan said that unlike under MGNREGA, there is now a legal guarantee of 125 days of employment instead of 100 days. At the same time, keeping in view the agricultural peak season, state governments have been given the authority to issue notifications allowing workers to be deployed in agricultural work for up to 60 days during sowing and harvesting seasons, so that farmers do not have to face a shortage of labour. Shri Shivraj Singh Chouhan said that efforts have been made to make the VB-G RAM G scheme more practical and effective by removing old shortcomings. By increasing administrative expenditure, a concrete step has been taken to reduce the difficulties of colleagues working at the grassroots. Shri Shivraj Singh also told the employment assistants that this message must be properly communicated down the line and assured them that, after discussing their suggestions with the State Governments, further improvements will continue to be made so that staff working at the panchyat level. The Minister said that the ‘Viksit Bharat-G RAM G’ is a historic scheme, which has now moved beyond being a bill and has become an Act after the President’s assent. Shri Shivraj Singh Chouhan said that some people are trying to create confusion about this scheme, but it is important to understand the truth and ensure that correct information reaches every village. Shri Shivraj Singh Chouhan said that under MGNREGA, there was earlier a guarantee of 100 days of employment, which has been increased to 125 days under the ‘Viksit Bharat Rozgar Yojana’. He said this is not just an increase in days, but a further strengthening of the guarantee of employment. If for any reason employment is not provided, the provision of unemployment allowance has been made much more robust than before. He said strict provisions have also been made regarding payment of wages. If wages are not paid within 15 days and the amount remains pending, the worker will be paid additional compensation. It will no longer be acceptable for wages to remain stuck for months. Timely payment of wages has been ensured. The current wage rates will continue and wages will increase every year. The Union Minister said that under this scheme, four types of works will be undertaken. The first category includes works related to water conservation and saving water, such as ponds, check dams and other structures. The second category includes works to basic village infrastructure such as schools, hospitals, Anganwadi centres, roads, drains and other facilities will be carried out. Necessary infrastructure for women associated with the livelihood mission and for FPOs will also be included. The third category of works will be livelihood-based activities that help in expanding employment, while the fourth will include works related to protection from natural disasters, such as retaining walls, drainage systems and structures linked to rivers and streams. Shri Shivraj Singh Chouhan said that it is the Prime Minister Narendra Modi’s vision that development works should be visible on the ground. Under the Viksit Gram Panchayat Yojana, all plans will be prepared through collective deliberation and the village itself will decide the course of its development. *** PK/KC/MK (रिलीज़ आईडी: 2207507)",
    "scraped_at": "2025-12-22T17:40:57.428254"
  },
  {
    "id": "2207454",
    "ministry": "Ministry of Science & Technology",
    "title": "LoI signed to establish Centre of Excellence for CRISPR Innovation and Translation (CoE-CIT)",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207454",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Science & Technology LoI signed to establish Centre of Excellence for CRISPR Innovation and Translation (CoE-CIT) प्रविष्टि तिथि:\r\n                22 DEC 2025 5:31PM by PIB Delhi A new Letter of Intent (LoI) has been signed to establish a new Centre of Excellence for CRISPR Innovation and Translation (CoE-CIT) as a dedicated hub to harness cutting-edge CRISPR technologies to facilitate translation of scientific discoveries in a laboratory into real-world clinical applications. The Jawaharlal Nehru Centre for Advanced Scientific Research (JNCASR), Bengaluru an autonomous institute of Department of Science and Technology (DST) and CRISPRBITS Private Limited (CrisprBits) based in Delhi, focused on Biotechnology using CRISPR gene-editing technology for developing affordable diagnostics, has announced the signing of a Letter of Intent (LOI) to jointly establish the CoE-CIT, in a landmark public–private partnership between academia and industry which is among the first of its kind in India. The CoE-CIT is envisioned to bridge the bench to bed gap leading and have therapeutic impact by combining JNCASR’s strengths in fundamental biomedical sciences with CrisprBits’ expertise in applied gene-editing and translational platforms. Demonstrating how Indian scientific innovation can be effectively translated into societal and clinical benefit, the CoE will serve as a replicable national model for academic–industry partnerships to strengthen India’s biotechnology and innovation ecosystem. “It is an exciting landmark event for JNCASR to plan this CoE on its campus partnering with CRISPRBITS, known for building intelligent molecular platforms for development of scalable, affordable innovative solutions in health sciences. Synergizing the mutual strengths in genetics, molecular and chemical biology, and computational biology, this unique partnership will open a new route to impact society and national missions,” says Umesh Waghmare, President of JNCASR. Fig 1: Prof. Umesh V Waghmare, President, JNCASR and Dr. Vijay Chandru, Co-Founder & CEO, CRISPRBITS Pvt. Ltd. soon after the signing and exchange of the Expression of Interest document Fig 2: Group photo of the members of the JNCASR and CRISPRBITS Pvt. Ltd. team, after signing the Partnership  document. **** NKR/AK (रिलीज़ आईडी: 2207454) आगंतुक पटल  : 251 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Science & Technology LoI signed to establish Centre of Excellence for CRISPR Innovation and Translation (CoE-CIT) प्रविष्टि तिथि:\r\n                        22 DEC 2025 5:31PM by PIB Delhi A new Letter of Intent (LoI) has been signed to establish a new Centre of Excellence for CRISPR Innovation and Translation (CoE-CIT) as a dedicated hub to harness cutting-edge CRISPR technologies to facilitate translation of scientific discoveries in a laboratory into real-world clinical applications. The Jawaharlal Nehru Centre for Advanced Scientific Research (JNCASR), Bengaluru an autonomous institute of Department of Science and Technology (DST) and CRISPRBITS Private Limited (CrisprBits) based in Delhi, focused on Biotechnology using CRISPR gene-editing technology for developing affordable diagnostics, has announced the signing of a Letter of Intent (LOI) to jointly establish the CoE-CIT, in a landmark public–private partnership between academia and industry which is among the first of its kind in India. The CoE-CIT is envisioned to bridge the bench to bed gap leading and have therapeutic impact by combining JNCASR’s strengths in fundamental biomedical sciences with CrisprBits’ expertise in applied gene-editing and translational platforms. Demonstrating how Indian scientific innovation can be effectively translated into societal and clinical benefit, the CoE will serve as a replicable national model for academic–industry partnerships to strengthen India’s biotechnology and innovation ecosystem. “It is an exciting landmark event for JNCASR to plan this CoE on its campus partnering with CRISPRBITS, known for building intelligent molecular platforms for development of scalable, affordable innovative solutions in health sciences. Synergizing the mutual strengths in genetics, molecular and chemical biology, and computational biology, this unique partnership will open a new route to impact society and national missions,” says Umesh Waghmare, President of JNCASR. Fig 1: Prof. Umesh V Waghmare, President, JNCASR and Dr. Vijay Chandru, Co-Founder & CEO, CRISPRBITS Pvt. Ltd. soon after the signing and exchange of the Expression of Interest document Fig 2: Group photo of the members of the JNCASR and CRISPRBITS Pvt. Ltd. team, after signing the Partnership  document. **** NKR/AK (रिलीज़ आईडी: 2207454)",
    "scraped_at": "2025-12-22T17:40:59.492750"
  },
  {
    "id": "2207538",
    "ministry": "Ministry of Ports, Shipping and Waterways",
    "title": "Union Minister Sarbananda Sonowal Calls for Integration of Modern Education and Spiritual Values at Krishna Guru Spiritual University Convocation",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207538",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Ports, Shipping and Waterways Union Minister Sarbananda Sonowal Calls for Integration of Modern Education and Spiritual Values at Krishna Guru Spiritual University Convocation Satriya exponent Padma Bhushan Jatin Goswami conferred honorary doctorate for lifetime contribution to Indian classical dance Governor of Assam Laxman Prasad Acharya attended the event as the Chief Guest Posted On:\r\n                22 DEC 2025 7:55PM by PIB Delhi The Union Minister of Ports, Shipping & Waterways (MoPSW), Sarbananda Sonowal urged students to pursue spiritual education alongside quality modern learning, saying such a balanced approach is essential for building a developed, self-reliant and value-driven India during the Amrit Kaal. Sarbananda Sonowal was speaking at the first convocation ceremony of Krishna Guru Spiritual University held at Na-Satra in Barpeta district of Assam. The Governor of Assam, Laxman Prasad Acharya graced the occasion as the chief guest. Degrees including doctorates, postgraduate degrees and other academic qualifications were conferred on students from various disciplines. Gold medals were also awarded for outstanding academic performance. During the ceremony, eminent Satriya dance exponent and Padma Bhushan awardee Jatin Goswami was conferred an honorary doctorate (Honoris Causa) in recognition of his lifelong contribution to Indian classical dance, culture and spiritual aesthetics. The award drew prolonged applause from the audience, acknowledging Goswami’s role in preserving and promoting Assam’s rich cultural heritage. Addressing the gathering, Sarbananda Sonowal said India is a youth-dominated nation and the responsibility of shaping the country’s future rests largely on students. He emphasised that education must not be limited to degrees and technical competence but should also nurture inner strength, ethical values and social responsibility. “Along with quality modern education, students must illuminate themselves through spiritual learning. Only then can we build a strong society and a developed India,” Sarbananda Sonowal said. Recalling his own life experiences, the Union minister said he had learnt invaluable lessons from Param Guru Krishna Guru. “Whatever public service I have been able to render in my life, I have done by remembering my Guru. His teachings on humanity, compassion, harmony with nature and service to society continue to guide me at every step,”Sonowal said. Sonowal said institutions like Krishna Guru Spiritual University give a new dimension to the vision of holistic education by blending spirituality with academic excellence. He noted that when Krishna Guru Sevashram was established, the Na-Satra region was flood-prone and underdeveloped, and building a strong civilisationalcentre there was a formidable challenge. “Today, that vision has blossomed into an institution that spreads light and values in society,” he said. Calling upon students to shoulder greater responsibility, Sonowal said graduates from such institutions must reflect their training through their character, conduct and commitment wherever they serve. He urged students to use time wisely in an intensely competitive world and to continuously upgrade their skills in the era of smart classrooms, smart teachers and smart cities. Sonowal also highlighted the importance of yoga for holistic development, noting that under the leadership of Prime Minister Narendra Modi, yoga has gained global recognition as a means of strengthening the body, mind and soul. Referring to India’s demographic advantage, Sonowal said while many countries such as China, Japan and South Korea face the challenge of aging populations, India’s youthful population has the potential to transform the nation into a global power. He called upon students to understand and contribute to the ambitious youth-centric initiatives launched by the central government. In his address, Governor Acharya underscored the central role of spirituality in social and national reform. “Spirituality is about values and संस्कार (sanskar). To reform society and the nation, one must first reform oneself,” he said, expressing confidence that the graduating students would internalise this principle. The governor said that historically, India’s educational institutions were global centres of intellectual and spiritual thought. Beyond formal curricula, they emphasised character building, ethical conduct, compassion and holistic development. He said preserving and revitalising this tradition is crucial for building a strong and prosperous Assam and India. Praising the felicitation of Jatin Goswami, Acharya said that witnessing the 93-year-old maestro’s energy and discipline was deeply inspiring. “By honouring such a personality, it is not just the individual who is honoured—the institution itself becomes honoured,”he said. Acharya also lauded Sonowal’s address, saying it reflected simplicity, depth of knowledge and sincerity rather than conventional political rhetoric. The convocation ceremony was attended by spiritual leader Guru Krishna Shri Shri Premananda Prabhu , Bhaktimata and Chairperson of the Krishna Guru Foundation Trust, Kuntala Patowary Goswami , Vice-Chancellor Prof. Mohan Chandra Kalita , senior academicians, trustees, students and their families, along with other distinguished guests. **** PN/IY (Release ID: 2207538) Visitor Counter : 59 Read this release in: Urdu Ministry of Ports, Shipping and Waterways Union Minister Sarbananda Sonowal Calls for Integration of Modern Education and Spiritual Values at Krishna Guru Spiritual University Convocation Satriya exponent Padma Bhushan Jatin Goswami conferred honorary doctorate for lifetime contribution to Indian classical dance Governor of Assam Laxman Prasad Acharya attended the event as the Chief Guest Posted On:\r\n                        22 DEC 2025 7:55PM by PIB Delhi The Union Minister of Ports, Shipping & Waterways (MoPSW), Sarbananda Sonowal urged students to pursue spiritual education alongside quality modern learning, saying such a balanced approach is essential for building a developed, self-reliant and value-driven India during the Amrit Kaal. Sarbananda Sonowal was speaking at the first convocation ceremony of Krishna Guru Spiritual University held at Na-Satra in Barpeta district of Assam. The Governor of Assam, Laxman Prasad Acharya graced the occasion as the chief guest. Degrees including doctorates, postgraduate degrees and other academic qualifications were conferred on students from various disciplines. Gold medals were also awarded for outstanding academic performance. During the ceremony, eminent Satriya dance exponent and Padma Bhushan awardee Jatin Goswami was conferred an honorary doctorate (Honoris Causa) in recognition of his lifelong contribution to Indian classical dance, culture and spiritual aesthetics. The award drew prolonged applause from the audience, acknowledging Goswami’s role in preserving and promoting Assam’s rich cultural heritage. Addressing the gathering, Sarbananda Sonowal said India is a youth-dominated nation and the responsibility of shaping the country’s future rests largely on students. He emphasised that education must not be limited to degrees and technical competence but should also nurture inner strength, ethical values and social responsibility. “Along with quality modern education, students must illuminate themselves through spiritual learning. Only then can we build a strong society and a developed India,” Sarbananda Sonowal said. Recalling his own life experiences, the Union minister said he had learnt invaluable lessons from Param Guru Krishna Guru. “Whatever public service I have been able to render in my life, I have done by remembering my Guru. His teachings on humanity, compassion, harmony with nature and service to society continue to guide me at every step,”Sonowal said. Sonowal said institutions like Krishna Guru Spiritual University give a new dimension to the vision of holistic education by blending spirituality with academic excellence. He noted that when Krishna Guru Sevashram was established, the Na-Satra region was flood-prone and underdeveloped, and building a strong civilisationalcentre there was a formidable challenge. “Today, that vision has blossomed into an institution that spreads light and values in society,” he said. Calling upon students to shoulder greater responsibility, Sonowal said graduates from such institutions must reflect their training through their character, conduct and commitment wherever they serve. He urged students to use time wisely in an intensely competitive world and to continuously upgrade their skills in the era of smart classrooms, smart teachers and smart cities. Sonowal also highlighted the importance of yoga for holistic development, noting that under the leadership of Prime Minister Narendra Modi, yoga has gained global recognition as a means of strengthening the body, mind and soul. Referring to India’s demographic advantage, Sonowal said while many countries such as China, Japan and South Korea face the challenge of aging populations, India’s youthful population has the potential to transform the nation into a global power. He called upon students to understand and contribute to the ambitious youth-centric initiatives launched by the central government. In his address, Governor Acharya underscored the central role of spirituality in social and national reform. “Spirituality is about values and संस्कार (sanskar). To reform society and the nation, one must first reform oneself,” he said, expressing confidence that the graduating students would internalise this principle. The governor said that historically, India’s educational institutions were global centres of intellectual and spiritual thought. Beyond formal curricula, they emphasised character building, ethical conduct, compassion and holistic development. He said preserving and revitalising this tradition is crucial for building a strong and prosperous Assam and India. Praising the felicitation of Jatin Goswami, Acharya said that witnessing the 93-year-old maestro’s energy and discipline was deeply inspiring. “By honouring such a personality, it is not just the individual who is honoured—the institution itself becomes honoured,”he said. Acharya also lauded Sonowal’s address, saying it reflected simplicity, depth of knowledge and sincerity rather than conventional political rhetoric. The convocation ceremony was attended by spiritual leader Guru Krishna Shri Shri Premananda Prabhu , Bhaktimata and Chairperson of the Krishna Guru Foundation Trust, Kuntala Patowary Goswami , Vice-Chancellor Prof. Mohan Chandra Kalita , senior academicians, trustees, students and their families, along with other distinguished guests. **** PN/IY (Release ID: 2207538)",
    "scraped_at": "2025-12-22T17:41:01.214749"
  },
  {
    "id": "2207539",
    "ministry": "Ministry of Social Justice & Empowerment",
    "title": "“Celebration of Intergenerational Bonds” For Strengthening Emotional,",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207539",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Social Justice & Empowerment “Celebration of Intergenerational Bonds” For Strengthening Emotional, Social, and Cultural Bonding Between Different Generations प्रविष्टि तिथि:\r\n                22 DEC 2025 7:58PM by PIB Delhi The Department of Social Justice & Empowerment, Government of India, organized a programme “Celebration of Intergenerational Bonds” on 20 December 2025 at Progressive Heights School, Biaora, District Rajgarh, Madhya Pradesh, with the objective of strengthening emotional, social, and cultural bonding between different generations and promoting active and dignified ageing. The event was graced by Shri Virendra Kumar, Hon’ble Union Minister for Social Justice & Empowerment; Shri Narayan Singh Panwar, Hon’ble Minister of State (Independent Charge) for Fishermen Welfare and Fisheries Development, Government of Madhya Pradesh; Shri Gautam Tetwal , Minister of State for Skill Development and Employment (Independent Charge) and Shri Rodmal Nagar, Hon’ble Member of Parliament, Rajgarh. Senior government officers, representatives of social organizations, and a large number of students, and family members, including grandparents of the children, were also present. The programme aimed to further strengthen the spirit of affection, dialogue, cooperation, and mutual respect between generations. Such initiatives play a vital role in connecting society, carrying forward values and traditions, and strengthening collective social consciousness. The event reaffirmed the Government of India’s commitment to building an inclusive and elder-friendly society by encouraging intergenerational engagement, community participation, and active ageing. It highlighted how the experiences, wisdom, and values of senior citizens, when combined with the energy, creativity, and curiosity of children and youth, contribute to the creation of a balanced, sensitive, and progressive society. The programme at Progressive Heights School featured a wide range of activities designed to promote intergenerational harmony and social cohesion: Cultural performances by students , including dance, music, and artistic presentations, conveying strong messages on the importance of intergenerational bonding, respect for elders, and the continuity of values. Interactive session with senior citizens , providing a platform for them to share their experiences, reflections, and feedback on the initiative, thereby fostering meaningful dialogue between generations. Collective pledge-taking programme, a pledge was administered by Honble Minister, Dr. Virendra Kumar to the attendees, across all age groups for upholding respect, love, and care towards senior citizens. The pledge taking reinforced a shared sense of responsibility and commitment towards the dignity, and well-being of senior citizens. A Walkathon led by the Hon’ble Union Minister for Social Justice & Empowerment , symbolizing the shared commitment of children, youth, and senior citizens towards health, unity, and an active lifestyle. The walkathon presented a powerful visual of social harmony and community participation. In his address, Shri Virendra Kumar, Hon’ble Union Minister of Social Justice & Empowerment, emphasized that senior citizens are the custodians of experience, tradition, and values, and are an invaluable strength of the nation. He underlined the importance of promoting active, healthy, and dignified ageing through community-based initiatives and intergenerational engagement. The Hon’ble Minister highlighted several key initiatives of the Ministry, including, Rashtriya Vayoshri Yojana (RVY), under which assistive devices related to mobility, vision, and hearing are provided to senior citizens, enabling them to lead independent and confident lives with dignity. He informed that over 7.28 lakh senior citizens across the country have benefited from the scheme so far. Strengthening of Elderline 14567, which has received more than 27 lakh calls, providing support, guidance, and emergency assistance to senior citizens. Promotion of intergenerational bonding through cultural, community, and outreach programmes across the country, and the provision of celebration of grandparents’ day at school. Dr. Virendra Kumar, Honble Minister, SJ&E also interacted personally with senior citizens during the programme, listening to their experiences and feedback. The Celebration of this programme successfully brought together senior citizens, children, youth, and the community on a shared platform of respect, participation, and cooperation. Through cultural expression, dialogue, physical activity, and collective commitment, the event reinforced the message that intergenerational harmony is essential for building a healthy, inclusive, and compassionate society. Aligned with the vision of Viksit Bharat@2047, the programme underscored the pivotal role of senior citizens as mentors and role models, while encouraging the younger generation to learn from their experiences and contribute actively to nation-building. The event marked another meaningful step in advancing the national agenda on senior citizen welfare and fostering a harmonious, empowered, and inclusive India. **** KV (रिलीज़ आईडी: 2207539) आगंतुक पटल  : 108 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Social Justice & Empowerment “Celebration of Intergenerational Bonds” For Strengthening Emotional, Social, and Cultural Bonding Between Different Generations प्रविष्टि तिथि:\r\n                        22 DEC 2025 7:58PM by PIB Delhi The Department of Social Justice & Empowerment, Government of India, organized a programme “Celebration of Intergenerational Bonds” on 20 December 2025 at Progressive Heights School, Biaora, District Rajgarh, Madhya Pradesh, with the objective of strengthening emotional, social, and cultural bonding between different generations and promoting active and dignified ageing. The event was graced by Shri Virendra Kumar, Hon’ble Union Minister for Social Justice & Empowerment; Shri Narayan Singh Panwar, Hon’ble Minister of State (Independent Charge) for Fishermen Welfare and Fisheries Development, Government of Madhya Pradesh; Shri Gautam Tetwal , Minister of State for Skill Development and Employment (Independent Charge) and Shri Rodmal Nagar, Hon’ble Member of Parliament, Rajgarh. Senior government officers, representatives of social organizations, and a large number of students, and family members, including grandparents of the children, were also present. The programme aimed to further strengthen the spirit of affection, dialogue, cooperation, and mutual respect between generations. Such initiatives play a vital role in connecting society, carrying forward values and traditions, and strengthening collective social consciousness. The event reaffirmed the Government of India’s commitment to building an inclusive and elder-friendly society by encouraging intergenerational engagement, community participation, and active ageing. It highlighted how the experiences, wisdom, and values of senior citizens, when combined with the energy, creativity, and curiosity of children and youth, contribute to the creation of a balanced, sensitive, and progressive society. The programme at Progressive Heights School featured a wide range of activities designed to promote intergenerational harmony and social cohesion: Cultural performances by students , including dance, music, and artistic presentations, conveying strong messages on the importance of intergenerational bonding, respect for elders, and the continuity of values. Interactive session with senior citizens , providing a platform for them to share their experiences, reflections, and feedback on the initiative, thereby fostering meaningful dialogue between generations. Collective pledge-taking programme, a pledge was administered by Honble Minister, Dr. Virendra Kumar to the attendees, across all age groups for upholding respect, love, and care towards senior citizens. The pledge taking reinforced a shared sense of responsibility and commitment towards the dignity, and well-being of senior citizens. A Walkathon led by the Hon’ble Union Minister for Social Justice & Empowerment , symbolizing the shared commitment of children, youth, and senior citizens towards health, unity, and an active lifestyle. The walkathon presented a powerful visual of social harmony and community participation. In his address, Shri Virendra Kumar, Hon’ble Union Minister of Social Justice & Empowerment, emphasized that senior citizens are the custodians of experience, tradition, and values, and are an invaluable strength of the nation. He underlined the importance of promoting active, healthy, and dignified ageing through community-based initiatives and intergenerational engagement. The Hon’ble Minister highlighted several key initiatives of the Ministry, including, Rashtriya Vayoshri Yojana (RVY), under which assistive devices related to mobility, vision, and hearing are provided to senior citizens, enabling them to lead independent and confident lives with dignity. He informed that over 7.28 lakh senior citizens across the country have benefited from the scheme so far. Strengthening of Elderline 14567, which has received more than 27 lakh calls, providing support, guidance, and emergency assistance to senior citizens. Promotion of intergenerational bonding through cultural, community, and outreach programmes across the country, and the provision of celebration of grandparents’ day at school. Dr. Virendra Kumar, Honble Minister, SJ&E also interacted personally with senior citizens during the programme, listening to their experiences and feedback. The Celebration of this programme successfully brought together senior citizens, children, youth, and the community on a shared platform of respect, participation, and cooperation. Through cultural expression, dialogue, physical activity, and collective commitment, the event reinforced the message that intergenerational harmony is essential for building a healthy, inclusive, and compassionate society. Aligned with the vision of Viksit Bharat@2047, the programme underscored the pivotal role of senior citizens as mentors and role models, while encouraging the younger generation to learn from their experiences and contribute actively to nation-building. The event marked another meaningful step in advancing the national agenda on senior citizen welfare and fostering a harmonious, empowered, and inclusive India. **** KV (रिलीज़ आईडी: 2207539)",
    "scraped_at": "2025-12-22T17:41:04.632558"
  },
  {
    "id": "2207524",
    "ministry": "Ministry of Youth Affairs and Sports",
    "title": "SAI Governing Body Approves Multiple Infrastructure Development and Upgradation Projects as Union Sports Minister Stresses Athlete-Centric Decisions to Support the Young Sports Ecosystem",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207524",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Youth Affairs and Sports SAI Governing Body Approves Multiple Infrastructure Development and Upgradation Projects as Union Sports Minister Stresses Athlete-Centric Decisions to Support the Young Sports Ecosystem Indian sports ecosystem is now in its youth, and it is the need of the hour to strengthen it in every possible way so that it has a bright future: Dr Mansukh Mandaviya KSSR to get new laser shooting targets, new hockey turf for NSSC Bengaluru, synthetic track in SAI, Bhopal, among several projects approved Posted On:\r\n                22 DEC 2025 7:32PM by PIB Delhi The Governing Body (GB) of the Sports Authority of India (SAI), chaired by Union Minister of Youth Affairs and Sports Dr. Mansukh Mandaviya, approved a wide range of infrastructure development and upgradation projects across the country at a meeting held in New Delhi today. \"The Indian sports ecosystem is now in its youth, and it is the need of the hour to strengthen it in every possible way so that it has a bright future. The decisions we are taking today are athlete-centric and aimed at ensuring that players have the best infrastructure that they need so that the medal counts that we have in mind for CWG and Olympics are met,\" Dr. Mandaviya said in his address to the SAI Governing Body. One of the key projects recommended by the GB is the procurement of Poligras Paris GT Zero hockey turf for SAI NSSC, Bengaluru, which serves as the training hub for the Indian men’s and women’s national and ‘A’ hockey teams. The Governing Body also agreed to replace the existing electronic shooting targets with laser target systems at the Karni Singh Shooting Range (KSSR), the training ground of India's elite and emerging shooters. In addition to these key decisions, the Governing Body also approved the construction of three multipurpose halls at SAI NCOE Chhatrapati Sambhajinagar (formerly SAI Aurangabad), SAI NSNIS Patiala, and SAI LNCPE Trivandrum to facilitate intensive training and comprehensive athlete development. The facility at SAI NCEO Chatrapati Sambhajinagar will house a dedicated weather-proof boxing training zone, strength & conditioning area and designated indoor spaces for volleyball and badminton, whereas the indoor training hall at SAI NSNIS Patiala is expected to enhance the indoor training capacity of the facility and provide a modern, integrated ecosystem for sports performance, sports science support, conditioning and recovery. India's premier academic institution and high-performance training centre, LNCPE Trivandrum, has also been given a new multipurpose hall to ensure uninterrupted year-round training and academic activities. The GB also approved the construction of a 400-metre, 8-lane synthetic athletics track at SAI STC Jalpaiguri in West Bengal. The committee noted that SAI STC Jalpaiguri has emerged as a key centre for athletics training and, despite limited infrastructure, has consistently delivered commendable performances at both regional and national levels. Besides SAI STC Jalpaiguri, the committee also approved the laying of a new synthetic track in SAI CRC, Bhopal. The centre, which has athletes of multiple sporting disciplines training in it, has consistently produced international-level athletes, including two Olympians. **** Ayushman Kumar (Release ID: 2207524) Visitor Counter : 184 Read this release in: Gujarati , Urdu , Kannada Ministry of Youth Affairs and Sports SAI Governing Body Approves Multiple Infrastructure Development and Upgradation Projects as Union Sports Minister Stresses Athlete-Centric Decisions to Support the Young Sports Ecosystem Indian sports ecosystem is now in its youth, and it is the need of the hour to strengthen it in every possible way so that it has a bright future: Dr Mansukh Mandaviya KSSR to get new laser shooting targets, new hockey turf for NSSC Bengaluru, synthetic track in SAI, Bhopal, among several projects approved Posted On:\r\n                        22 DEC 2025 7:32PM by PIB Delhi The Governing Body (GB) of the Sports Authority of India (SAI), chaired by Union Minister of Youth Affairs and Sports Dr. Mansukh Mandaviya, approved a wide range of infrastructure development and upgradation projects across the country at a meeting held in New Delhi today. \"The Indian sports ecosystem is now in its youth, and it is the need of the hour to strengthen it in every possible way so that it has a bright future. The decisions we are taking today are athlete-centric and aimed at ensuring that players have the best infrastructure that they need so that the medal counts that we have in mind for CWG and Olympics are met,\" Dr. Mandaviya said in his address to the SAI Governing Body. One of the key projects recommended by the GB is the procurement of Poligras Paris GT Zero hockey turf for SAI NSSC, Bengaluru, which serves as the training hub for the Indian men’s and women’s national and ‘A’ hockey teams. The Governing Body also agreed to replace the existing electronic shooting targets with laser target systems at the Karni Singh Shooting Range (KSSR), the training ground of India's elite and emerging shooters. In addition to these key decisions, the Governing Body also approved the construction of three multipurpose halls at SAI NCOE Chhatrapati Sambhajinagar (formerly SAI Aurangabad), SAI NSNIS Patiala, and SAI LNCPE Trivandrum to facilitate intensive training and comprehensive athlete development. The facility at SAI NCEO Chatrapati Sambhajinagar will house a dedicated weather-proof boxing training zone, strength & conditioning area and designated indoor spaces for volleyball and badminton, whereas the indoor training hall at SAI NSNIS Patiala is expected to enhance the indoor training capacity of the facility and provide a modern, integrated ecosystem for sports performance, sports science support, conditioning and recovery. India's premier academic institution and high-performance training centre, LNCPE Trivandrum, has also been given a new multipurpose hall to ensure uninterrupted year-round training and academic activities. The GB also approved the construction of a 400-metre, 8-lane synthetic athletics track at SAI STC Jalpaiguri in West Bengal. The committee noted that SAI STC Jalpaiguri has emerged as a key centre for athletics training and, despite limited infrastructure, has consistently delivered commendable performances at both regional and national levels. Besides SAI STC Jalpaiguri, the committee also approved the laying of a new synthetic track in SAI CRC, Bhopal. The centre, which has athletes of multiple sporting disciplines training in it, has consistently produced international-level athletes, including two Olympians. **** Ayushman Kumar (Release ID: 2207524)",
    "scraped_at": "2025-12-22T17:41:06.324878"
  },
  {
    "id": "2207555",
    "ministry": "NITI Aayog",
    "title": "NITI Aayog Releases Report on ‘Internationalisation of Higher Education in India’",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207555",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau NITI Aayog NITI Aayog Releases Report on ‘Internationalisation of Higher Education in India’ प्रविष्टि तिथि:\r\n                22 DEC 2025 8:44PM by PIB Delhi NITI Aayog today launched a comprehensive policy report titled ‘ Internationalisation of Higher Education in India: Prospects, Potential, and Policy Recommendations’ . The report was released by the senior leadership of NITI Aayog including Shri Suman Bery, Vice Chairman, Dr. V.K.Paul, Member (Education), Dr. Arvind Virmani, Member, and Shri B.V.R.Subrahmanyam, CEO. Dr. Vineet Joshi, Secretary, Department of Higher Education, and Prof. Sitharam, Chairman, AICTE also participated in the report launch. The report, an outcome of a collaborative endeavour between NITI Aayog and an IIT Madras led consortium of knowledge partners, is a pioneering publication in the Global South. It focuses on ‘internationalisation at home’ as envisioned in NEP 2020. It examines approaches to internationalisation at the global, national, and institutional levels, along with temporal trends in academic mobility over the last 20 years. The report explores opportunities for enhanced student and faculty mobility, greater international academic and research collaborations, and the potential of establishing international branch campuses in India and campuses of Indian public and private universities overseas. The report draws on extensive qualitative and quantitative analysis, including responses from 160 Indian HEIs across 24 States to a comprehensive survey comprising 100+ questions, and perspectives, ideas, and experiences from 140 national and international participants at a National Workshop organised at IIT Madras earlier this year. Key Informant Interviews were also conducted with experts from 30 international institutions across 16 countries, providing global perspectives. Speaking on the occasion, Shri Suman Bery said that there is a business case and a diplomatic case for promoting internationalisation of higher education in India, especially as an instrument of soft power. Dr. Paul positioned the report in the context of NEP implementation and India's vision for Viksit Bharat 2047. He envisaged that India must target to host 1 lakh international students across Central and State Universities by 2030. Dr. Virmani observed that international students who have benefitted from the Indian system can contribute to the growth of India and the world. He emphasised the need to strengthen India’s doctoral programmes through greater international collaborations. Shri B.V.R.Subrahmanyam highlighted the many positive outcomes of internationalising the higher education system of the world’s 4th largest economy. It can improve the quality of courses and curriculum within Indian universities, have a positive effect in reducing forex outflow, and provide greater opportunities for research partnerships. He underscored the role of private universities in furthering internationalisation, the opportunity to leverage the 3.5 crore strong Indian diaspora, and the need for the government to play a catalytic role through ease of regulation. Dr. Vineet Joshi said that for India to be a global hub of higher education, public and private universities need to work in tandem. Initiatives under NEP are the starting point, and UGC Regulations have been facilitators in attracting nearly 13 international universities to India. He expressed immense appreciation for the quality of the report and said that the 76 action pathways stated therein provide a robust roadmap to achieve the internationalisation targets of 2047. AICTE Chairman Prof. Sitharam observed that India must become a talent magnet and attract more students from the Global South to its high quality programmes in engineering, technology, and management. The Report presents 22 Policy Recommendations, 76 Action Pathways, 125 Performance Success Indicators, along with nearly 30 Indian and Global Practices currently pursued. The recommendations are aimed at improving 5 thematic areas including Strategy, Regulation, Finance, Branding, Communication & Outreach, and Curriculum & Culture for making India the global hub of higher education and research by 2047. The policy report can be accessed at: https://niti.gov.in/sites/default/files/2025-12/Internationalisation_of_Higher_Education_in_India_Report.pdf The policy brief can be accessed at: https://niti.gov.in/sites/default/files/2025-12/Internationalisation_of_Higher_Education_in_India_Policy_Brief.pdf **** MJPS/SR (रिलीज़ आईडी: 2207555) आगंतुक पटल  : 282 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Marathi , Gujarati NITI Aayog NITI Aayog Releases Report on ‘Internationalisation of Higher Education in India’ प्रविष्टि तिथि:\r\n                        22 DEC 2025 8:44PM by PIB Delhi NITI Aayog today launched a comprehensive policy report titled ‘ Internationalisation of Higher Education in India: Prospects, Potential, and Policy Recommendations’ . The report was released by the senior leadership of NITI Aayog including Shri Suman Bery, Vice Chairman, Dr. V.K.Paul, Member (Education), Dr. Arvind Virmani, Member, and Shri B.V.R.Subrahmanyam, CEO. Dr. Vineet Joshi, Secretary, Department of Higher Education, and Prof. Sitharam, Chairman, AICTE also participated in the report launch. The report, an outcome of a collaborative endeavour between NITI Aayog and an IIT Madras led consortium of knowledge partners, is a pioneering publication in the Global South. It focuses on ‘internationalisation at home’ as envisioned in NEP 2020. It examines approaches to internationalisation at the global, national, and institutional levels, along with temporal trends in academic mobility over the last 20 years. The report explores opportunities for enhanced student and faculty mobility, greater international academic and research collaborations, and the potential of establishing international branch campuses in India and campuses of Indian public and private universities overseas. The report draws on extensive qualitative and quantitative analysis, including responses from 160 Indian HEIs across 24 States to a comprehensive survey comprising 100+ questions, and perspectives, ideas, and experiences from 140 national and international participants at a National Workshop organised at IIT Madras earlier this year. Key Informant Interviews were also conducted with experts from 30 international institutions across 16 countries, providing global perspectives. Speaking on the occasion, Shri Suman Bery said that there is a business case and a diplomatic case for promoting internationalisation of higher education in India, especially as an instrument of soft power. Dr. Paul positioned the report in the context of NEP implementation and India's vision for Viksit Bharat 2047. He envisaged that India must target to host 1 lakh international students across Central and State Universities by 2030. Dr. Virmani observed that international students who have benefitted from the Indian system can contribute to the growth of India and the world. He emphasised the need to strengthen India’s doctoral programmes through greater international collaborations. Shri B.V.R.Subrahmanyam highlighted the many positive outcomes of internationalising the higher education system of the world’s 4th largest economy. It can improve the quality of courses and curriculum within Indian universities, have a positive effect in reducing forex outflow, and provide greater opportunities for research partnerships. He underscored the role of private universities in furthering internationalisation, the opportunity to leverage the 3.5 crore strong Indian diaspora, and the need for the government to play a catalytic role through ease of regulation. Dr. Vineet Joshi said that for India to be a global hub of higher education, public and private universities need to work in tandem. Initiatives under NEP are the starting point, and UGC Regulations have been facilitators in attracting nearly 13 international universities to India. He expressed immense appreciation for the quality of the report and said that the 76 action pathways stated therein provide a robust roadmap to achieve the internationalisation targets of 2047. AICTE Chairman Prof. Sitharam observed that India must become a talent magnet and attract more students from the Global South to its high quality programmes in engineering, technology, and management. The Report presents 22 Policy Recommendations, 76 Action Pathways, 125 Performance Success Indicators, along with nearly 30 Indian and Global Practices currently pursued. The recommendations are aimed at improving 5 thematic areas including Strategy, Regulation, Finance, Branding, Communication & Outreach, and Curriculum & Culture for making India the global hub of higher education and research by 2047. The policy report can be accessed at: https://niti.gov.in/sites/default/files/2025-12/Internationalisation_of_Higher_Education_in_India_Report.pdf The policy brief can be accessed at: https://niti.gov.in/sites/default/files/2025-12/Internationalisation_of_Higher_Education_in_India_Policy_Brief.pdf **** MJPS/SR (रिलीज़ आईडी: 2207555)",
    "scraped_at": "2025-12-22T17:41:09.388061"
  },
  {
    "id": "2207481",
    "ministry": "UPSC",
    "title": "COMBINED MEDICAL SERVICES EXAMINATION, 2025",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207481",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau UPSC COMBINED MEDICAL SERVICES EXAMINATION, 2025 प्रविष्टि तिथि:\r\n                22 DEC 2025 6:06PM by PIB Delhi Based on the result of the Written Examination (Part–I) of the Combined Medical Services EXAMINATION, 2025 held by the UNION PUBLIC SERVICE COMMISSION on 20 th July, 2025 followed by Personality Test (Part – II) held from October to December, 2025 , the following lists of the candidates who have been recommended for appointment to the services/posts under two categories are appended: Category-I Medical Officers Grade in General Duty Medical Officers Sub-cadre of Central Health Service; Category-II (a)             Assistant Divisional Medical Officer in the Railways; (b)            General Duty Medical Officer in New Delhi Municipal Council; and (c)             General Duty Medical Officer Gr-II in Municipal Corporation of    Delhi. 2.  The number of vacancies reported by the Government to be filled are as under: Category-I: GENERAL OBC SC ST EWS Total 224 28 54 22 37 365 * * Including 08 PwBD-1 and 07 PwBD-4&5 vacancies Category – II: GENERAL OBC SC ST EWS Total 212 119 71 27 50 479 # # Including 18 PwBD-1 vacancies 3(a). A total of 363 candidates has been recommended for appointment in Category-I as under: Category Number of candidates recommended General 162 (including 09 PwBD candidates) Economically Weaker Sections (EWS) 43 Other Backward Classes (OBC) 77 (including 02 PwBD candidates) Scheduled Caste (SC) 58 (including 01 PwBD candidate) Scheduled Tribe (ST) 23 (including 02 PwBD candidates) TOTAL 363 (including 14 PwBD candidates) 3(b). A total of 449 candidates have been recommended for appointment in Category-II as under: Category Number of candidates recommended General 182 (including 10 PwBD candidates) Economically Weaker Sections (EWS) 50 (including 01 PwBD candidate) Other Backward Classes (OBC) 119 (including 06 PwBD candidates) Scheduled Castes (SC) 71 (including 01 PwBD candidate) Scheduled Tribes (ST) 27 TOTAL 449 (including 18 PwBD candidates) 4.  For category-II, the Commission has maintained a consolidated Reserve List of candidates in accordance with Rules 13 (4) and (5) of the Combined Medical Services EXAMINATION, 2025 as under: GENERAL OBC EWS SC TOTAL 30 27 02 01 60 5. Appointments to the above said services/posts will be made according to the number of vacancies available and subject to the candidates fulfilling all the prescribed eligibility conditions and all pre-appointment formalities/ verifications, wherever due, being completed satisfactorily. Allotment of candidates to the services/posts shall be made according to ranks obtained and preference of services/posts expressed by them. 6. The candidature of 376 recommended candidates with following Roll Nos. is provisional: 100106 100118 100289 100376 100565 100713 100997 101006 101084 101158 101329 101365 101507 101551 101556 101761 101795 101796 101804 102086 102100 102172 102202 102425 200147 200348 200666 200842 300271 300606 300644 300690 300696 301188 301200 301311 301342 301515 301575 301600 301635 301889 302336 302433 302578 302643 400277 400411 400847 401130 401276 401291 401638 401736 402178 402333 402381 402455 402588 500025 500086 500674 500937 501059 501479 501573 501596 501751 502077 502225 502467 502501 502514 600098 600428 600550 600758 600954 601107 601382 601723 602282 603004 700568 800415 800776 800907 801041 801494 801735 802094 802214 802395 802642 803119 803295 803307 803347 803592 805080 805131 805159 805503 805523 805616 805775 806076 806498 806784 806808 807174 807621 807949 808278 808584 808585 808896 809012 809173 809248 809393 809867 810111 810120 810907 811264 811273 811767 811801 811860 812316 812385 812617 812665 812881 812998 813620 814019 814445 814504 816220 816323 816710 816874 816918 816933 817068 817072 817352 817626 817651 900017 900064 900307 1000077 1000447 1000721 1000768 1001040 1001633 1001760 1003016 1003022 1003250 1003462 1003514 1003797 1003965 1004001 1004069 1004075 1004262 1004272 1004453 1004598 1100313 1100367 1100436 1100477 1100518 1100899 1100958 1100966 1101046 1101708 1101911 1102317 1102373 1102386 1102488 1102563 1102744 1102778 1102808 1102902 1103126 1103212 1103493 1103682 1104016 1104051 1104053 1104240 1104295 1104642 1104747 1200179 1200284 1200286 1200294 1200371 1200494 1200671 1200686 1200947 1201086 1201106 1201258 1201324 1201466 1201986 1202127 1202246 1202266 1203027 1203165 1203367 1203401 1203481 1203558 1203809 1204292 1204316 1204319 1300017 1300075 1300132 1300314 1300358 1300362 1300529 1300800 1300992 1300999 1301005 1301221 1301276 1301315 1301318 1301320 1301402 1301569 1301581 1301642 1301681 1301832 1302070 1302071 1302095 1400095 1400387 1400460 1400946 1500009 1500456 1500721 1500774 1501026 1501074 1501204 1502262 1600048 1700083 1700247 1700300 1700307 1700314 1700412 1700447 1700572 1700580 1700640 1900198 1900274 1900355 1900356 1901195 1901249 1901751 2400046 2400684 2401319 2401374 2401379 2401408 2401628 2401678 2401852 2402379 2402805 2403520 2403663 2403921 2404197 2600138 2600247 2600591 2600901 2600979 2601032 2601534 2601788 2602052 2602197 2602232 2602322 2602442 2603084 3400065 3400181 3400304 3400331 3400374 3400461 3500047 3500119 3500405 3500431 3501214 3900206 3900236 3900421 3900496 3900670 3900758 4000056 4000059 4000132 4000261 4000370 4000486 4000565 4000580 4000600 4000636 4000645 4000704 4000747 4000910 4000915 4000971 4001055 4100195 4100836 4400228 4500188 5000020 5000237 5000264 5000436 5000850 5000980 5100227 5100584 5100897 5100911 5200238 5200335 5200459 5200496 5200510 5201227 5201306 5400134 5400144 5400276 7. The final result of Shri Yogesh Kumar (Roll No. 0816710) is withheld in view of W.P. 4910/2025, pending before the Hon’ble High Court of Rajasthan. 8. The offer of appointment to the above listed provisional candidates will not be issued till the Commission verifies the original documents awaited from such candidates. The provisionally of these candidates will remain valid only for a period of six months from the date of declaration of Final result. In case the provisional candidate fails to submit the requisite documents, in original, as required by the Commission within this period, his/her candidature will be cancelled and no further correspondence would be entertained in this regard. 9. Union Public Service Commission has a ‘Facilitation Counter’ near Examination Hall Building in its Campus. Candidates may obtain any information/clarification relating to this Examination on working days between 10:00 A.M. and 05:00 P.M. in person or over Telephone Nos. 011-23385271 and 011-23381125 from this Counter. The result will also be available on Website of the Commission [i.e. www.upsc.gov.in ]. The mark sheet is expected to be available on the website www.upsc.gov.in within fifteen days from the date of publication of result. Click here to see the result: **** NKR/AK (रिलीज़ आईडी: 2207481) आगंतुक पटल  : 279 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Tamil UPSC COMBINED MEDICAL SERVICES EXAMINATION, 2025 प्रविष्टि तिथि:\r\n                        22 DEC 2025 6:06PM by PIB Delhi Based on the result of the Written Examination (Part–I) of the Combined Medical Services EXAMINATION, 2025 held by the UNION PUBLIC SERVICE COMMISSION on 20 th July, 2025 followed by Personality Test (Part – II) held from October to December, 2025 , the following lists of the candidates who have been recommended for appointment to the services/posts under two categories are appended: Category-I Medical Officers Grade in General Duty Medical Officers Sub-cadre of Central Health Service; Category-II (a)             Assistant Divisional Medical Officer in the Railways; (b)            General Duty Medical Officer in New Delhi Municipal Council; and (c)             General Duty Medical Officer Gr-II in Municipal Corporation of    Delhi. 2.  The number of vacancies reported by the Government to be filled are as under: Category-I: GENERAL OBC SC ST EWS Total 224 28 54 22 37 365 * * Including 08 PwBD-1 and 07 PwBD-4&5 vacancies Category – II: GENERAL OBC SC ST EWS Total 212 119 71 27 50 479 # # Including 18 PwBD-1 vacancies 3(a). A total of 363 candidates has been recommended for appointment in Category-I as under: Category Number of candidates recommended General 162 (including 09 PwBD candidates) Economically Weaker Sections (EWS) 43 Other Backward Classes (OBC) 77 (including 02 PwBD candidates) Scheduled Caste (SC) 58 (including 01 PwBD candidate) Scheduled Tribe (ST) 23 (including 02 PwBD candidates) TOTAL 363 (including 14 PwBD candidates) 3(b). A total of 449 candidates have been recommended for appointment in Category-II as under: Category Number of candidates recommended General 182 (including 10 PwBD candidates) Economically Weaker Sections (EWS) 50 (including 01 PwBD candidate) Other Backward Classes (OBC) 119 (including 06 PwBD candidates) Scheduled Castes (SC) 71 (including 01 PwBD candidate) Scheduled Tribes (ST) 27 TOTAL 449 (including 18 PwBD candidates) 4.  For category-II, the Commission has maintained a consolidated Reserve List of candidates in accordance with Rules 13 (4) and (5) of the Combined Medical Services EXAMINATION, 2025 as under: GENERAL OBC EWS SC TOTAL 30 27 02 01 60 5. Appointments to the above said services/posts will be made according to the number of vacancies available and subject to the candidates fulfilling all the prescribed eligibility conditions and all pre-appointment formalities/ verifications, wherever due, being completed satisfactorily. Allotment of candidates to the services/posts shall be made according to ranks obtained and preference of services/posts expressed by them. 6. The candidature of 376 recommended candidates with following Roll Nos. is provisional: 100106 100118 100289 100376 100565 100713 100997 101006 101084 101158 101329 101365 101507 101551 101556 101761 101795 101796 101804 102086 102100 102172 102202 102425 200147 200348 200666 200842 300271 300606 300644 300690 300696 301188 301200 301311 301342 301515 301575 301600 301635 301889 302336 302433 302578 302643 400277 400411 400847 401130 401276 401291 401638 401736 402178 402333 402381 402455 402588 500025 500086 500674 500937 501059 501479 501573 501596 501751 502077 502225 502467 502501 502514 600098 600428 600550 600758 600954 601107 601382 601723 602282 603004 700568 800415 800776 800907 801041 801494 801735 802094 802214 802395 802642 803119 803295 803307 803347 803592 805080 805131 805159 805503 805523 805616 805775 806076 806498 806784 806808 807174 807621 807949 808278 808584 808585 808896 809012 809173 809248 809393 809867 810111 810120 810907 811264 811273 811767 811801 811860 812316 812385 812617 812665 812881 812998 813620 814019 814445 814504 816220 816323 816710 816874 816918 816933 817068 817072 817352 817626 817651 900017 900064 900307 1000077 1000447 1000721 1000768 1001040 1001633 1001760 1003016 1003022 1003250 1003462 1003514 1003797 1003965 1004001 1004069 1004075 1004262 1004272 1004453 1004598 1100313 1100367 1100436 1100477 1100518 1100899 1100958 1100966 1101046 1101708 1101911 1102317 1102373 1102386 1102488 1102563 1102744 1102778 1102808 1102902 1103126 1103212 1103493 1103682 1104016 1104051 1104053 1104240 1104295 1104642 1104747 1200179 1200284 1200286 1200294 1200371 1200494 1200671 1200686 1200947 1201086 1201106 1201258 1201324 1201466 1201986 1202127 1202246 1202266 1203027 1203165 1203367 1203401 1203481 1203558 1203809 1204292 1204316 1204319 1300017 1300075 1300132 1300314 1300358 1300362 1300529 1300800 1300992 1300999 1301005 1301221 1301276 1301315 1301318 1301320 1301402 1301569 1301581 1301642 1301681 1301832 1302070 1302071 1302095 1400095 1400387 1400460 1400946 1500009 1500456 1500721 1500774 1501026 1501074 1501204 1502262 1600048 1700083 1700247 1700300 1700307 1700314 1700412 1700447 1700572 1700580 1700640 1900198 1900274 1900355 1900356 1901195 1901249 1901751 2400046 2400684 2401319 2401374 2401379 2401408 2401628 2401678 2401852 2402379 2402805 2403520 2403663 2403921 2404197 2600138 2600247 2600591 2600901 2600979 2601032 2601534 2601788 2602052 2602197 2602232 2602322 2602442 2603084 3400065 3400181 3400304 3400331 3400374 3400461 3500047 3500119 3500405 3500431 3501214 3900206 3900236 3900421 3900496 3900670 3900758 4000056 4000059 4000132 4000261 4000370 4000486 4000565 4000580 4000600 4000636 4000645 4000704 4000747 4000910 4000915 4000971 4001055 4100195 4100836 4400228 4500188 5000020 5000237 5000264 5000436 5000850 5000980 5100227 5100584 5100897 5100911 5200238 5200335 5200459 5200496 5200510 5201227 5201306 5400134 5400144 5400276 7. The final result of Shri Yogesh Kumar (Roll No. 0816710) is withheld in view of W.P. 4910/2025, pending before the Hon’ble High Court of Rajasthan. 8. The offer of appointment to the above listed provisional candidates will not be issued till the Commission verifies the original documents awaited from such candidates. The provisionally of these candidates will remain valid only for a period of six months from the date of declaration of Final result. In case the provisional candidate fails to submit the requisite documents, in original, as required by the Commission within this period, his/her candidature will be cancelled and no further correspondence would be entertained in this regard. 9. Union Public Service Commission has a ‘Facilitation Counter’ near Examination Hall Building in its Campus. Candidates may obtain any information/clarification relating to this Examination on working days between 10:00 A.M. and 05:00 P.M. in person or over Telephone Nos. 011-23385271 and 011-23381125 from this Counter. The result will also be available on Website of the Commission [i.e. www.upsc.gov.in ]. The mark sheet is expected to be available on the website www.upsc.gov.in within fifteen days from the date of publication of result. Click here to see the result: **** NKR/AK (रिलीज़ आईडी: 2207481)",
    "scraped_at": "2025-12-22T17:41:15.149245"
  },
  {
    "id": "2207583",
    "ministry": "PIB Headquarters",
    "title": "India – New Zealand Free Trade Agreement",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207583",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters India – New Zealand Free Trade Agreement One of India’s fastest-concluded FTAs प्रविष्टि तिथि:\r\n                22 DEC 2025 10:20PM by PIB Delhi Key Takeaways India- New Zealand FTA eliminates duty on 100% of Indian Exports USD 20 billion investment commitment over 15 years, strengthening long-term economic and strategic cooperation. India protects its key interests in dairy and agriculture ; Huge win for labour intensive sectors like textile and leather. New Zealand signs Annex on Health and Traditional Medicine Services for the first time. Student Mobility and Post Study Work Visa for STEM Graduates, Skilled Professionals ; opens new visa pathway for 5,000 skilled occupations. Introduction India has steadily expanded its global trade partnerships to strengthen economic growth, create jobs, and enhance its global standing. After signing six Free Trade Agreements in the last five years, the latest being with Oman this month, India and New Zealand have just concluded negotiations for a forward-looking FTA,  marking a historic milestone in bilateral economic relations. The Agreement delivers unprecedented duty-free access for Indian exports to New Zealand while safeguarding India’s sensitive sectors, strengthening economic resilience, and promoting inclusive growth aligned with India’s national priorities. India and New Zealand announced negotiations for a Free Trade Agreement (FTA) In March 2025. Following several rounds of negotiations, the India-New Zealand FTA was concluded in December 2025, becoming one of India’s fastest-concluded FTAs . This FTA enhances market access and tariff preferences for Indian exports to New Zealand, while serving as a gateway to the wider Oceania and Pacific Island markets . The agreement opens opportunities for India to emerge as a key supplier of skilled workforce, alongside prospects for future cooperation in areas such as AYUSH and services such as Yoga Instructors, Indian Chefs, and Music Teachers, and services under sector of interests like IT, Engineering, Healthcare, Education, and Construction. Overall, the agreement establishes establishes a predictable, transparent framework that expands market access, enhances trade in services, creates mobility pathways, encourages long-term investment, and builds agriculture productivity. India – New Zealand: Bilateral Trade Ties India’s partnership with New Zealand is shaped by both economic realities and strong people-to-people ties. Currently, New Zealand is India’s second-largest trading partner in Oceania . At USD 49,380, New Zealand is among the higher-income economies in Oceania. In 2024, New Zealand’s imports stood at USD 47 billion, while exports were USD 42 billion. New Zealand invests nearly 8% of its GDP annually overseas, with total overseas investment valued at USD 422.6 billion as of March 2025. Around 300,000 persons of Indian origin and NRIs live in New Zealand, making up nearly 5% of its population. This diaspora acts as a cultural and economic bridge, supporting stronger bilateral ties and demand for Indian goods and services. This FTA builds on the socio-economic foundation aimed at creating new opportunities. Merchandise Trade : Grew from USD 873 million in 2023–24 to USD 1.3 billion in 2024–25, registering a 49% growth. Merchandise Exports to New Zealand : Rose to USD 711 million in 2024–25, showing a positive trend of 32%. Services Trade : India’s services exports to New Zealand grew by 13% in 2024, reaching USD 634 million. Major sectors include travel, IT, and business services. India and New Zealand merchandise bilateral trade increased from USD 855 Million in 2015-2016 to USD 1298 Million in 2024-2025. The exports increased by 130% whereas imports only increased by 7.21% in 10 years. In 2024-25, the exports from India to New Zealand was higher than imports from New Zealand, maintaining positive trade balance with the country. Salient Features of the FTA The FTA eliminates duty on 100% of Indian Exports A USD 20 billion investment commitment over 15 years strengthens long-term economic and strategic cooperation. Through Agricultural Productivity Partnership , the FTA collaborates with farmers to boost productivity and integrate them in the global value chains. The FTA boosts MSMEs and Jobs through Zero-duty access for labour-intensive sectors including textiles, apparel, leather, footwear, gems & jewellery, engineering goods and processed foods. India has offered market access in 70.03% of the tariff lines while keeping 29.97 % tariff lines in exclusion. Immediate Elimination (EIF) on 30%, Rest is phased. Certain products are kept in exclusion such as Dairy (milk, cream, whey, yoghurt, cheese etc.), animal products (other than sheep meat), vegetable products (onions, chana, peas, corn, almonds etc.), sugar, artificial honey, Animal, vegetable or microbial fats and oils, Arms and Ammunition, Gems and Jewellery, Copper and Articles (Cathodes, Cartridges, Rods, Bars, Coils etc.), Aluminium and articles thereof (Ingots, billets, wire bars) among others. 30.00% of tariff lines will have immediate duty elimination , covering wood, wool, sheep meat, leather-raw hides etc 35.60% of tariffs are subject to phased elimination over 3, 5, 7, and 10 years,including petroleum oil, malt extract, vegetable oils, and selected electrical and mechanical machinery, peptones etc. 4.37% of products face tariff reductions, such as wine, pharmaceutical drugs, polymers, aluminium, iron and steel articles etc 0.06% fall under tariff rate quotas, including honey, apples, kiwi fruit, and albumins including milk albumin. Enhanced Market Access for Indian Goods Gains to India from FTA New Zealand’s market access offer covers immediate elimination of duties (zero duty) on 100% of tariff lines of New Zealand (8,284 tariff lines), from Entry into Force. New Zealand maintained tariffs around 10% in around 450 lines of key Indian exports in products including textile/apparel products, leather and headgear, ceramics, carpets, ⁠automobiles and auto components. Additionally, the average applied tariff at 2.2% in 2025 will become zero from EIF. The offer extends gains to several products and sectors o Labour intensive sectors like textiles and clothing, leather and footwear; Emerging and advanced engineering sectors like transport/auto, pharmaceuticals, plastic & rubber, electrical & electronic machinery, mechanical machinery, chemicals and; o Agri Products like fruits and vegetables, coffee, spices, cereals, processed foods Gains from import to support domestic industries: wooden logs, coking coal, waste and scrap of ferrous, non-ferrous metals Gains for Agriculture, Technology Cooperation, and Farmer Income Growth New Zealand have agreed on focused Action Plans for kiwifruit, apples, and honey to improve productivity, quality, and sectoral capabilities of these fruits growers in India The cooperation includes the establishment of Centres of Excellence , improved planting material, capacity building for growers, technical support for orchard management, post-harvest practices, supply chains and food safety. Projects for premium apple cultivators and sustainable beekeeping practices will enhance production and quality standards . This is Paired with Market access for the selected agricultural products (Apples, Kiwifruit, Manuka Honey) from New Zealand in India. This access will be managed through a Tariff Rate Quota (TRQ) system with Minimum Import Price and seasonal imports , ensuring consumer choice while protecting domestic farmers. All TRQs are linked to Agri-technology Action Plans and monitored by a Joint Agriculture Productivity Council , balancing market access with protection of sensitive domestic agricultural sectors. Enhanced Opportunities Beyond Goods Services Best-Ever Offer by New Zealand : Commitment across 118 services sectors, with Most-Favoured Nation (MFN) treatment in 139 sectors. Health & Traditional Medicine Annex : For the first time, New Zealand has signed an annex to facilitate trade in Ayurveda, yoga, and other traditional medicine services with India. This landmark provision promotes the global recognition of India’s AYUSH systems,supports medical value travel, encourages collaboration in wellness services, and reinforces India’s position as a global hub for health, wellness, and traditional medicine services. It gives centre stage to India’s AYUSH disciplines (Ayurveda, Yoga & Naturopathy, Unani, Sowa-Rigpa, Siddha, and Homeopathy) alongside Maori Health practices Mobility & Education Student Mobility : New Zealand signed Annex on Student Mobility and Post Study Work Visa for the first time with any country. Indian students can work up to 20 hours per week while studying, even if there are policy changes in future, with extended post-study work visas (STEM Bachelor: 3 yrs; Master’s: up to 3 yrs; Doctorate: up to 4 yrs). Professional Pathways : A quota of 5,000 visas for skilled Indians for stay upto 3 years in the sectors of interest to India which include Indian iconic occupations (AYUSH practitioners, Yoga Instructors, Indian Chefs, and Music Teachers) and Other sectors of interest - IT, Engineering, Healthcare, Education, and Construction Working Holiday Visa : 1,000 young Indians annually can avail multiple entry in New Zealand for a period of 12 months. These provisions create unprecedented opportunities for Indian youth and professionals to gain global exposure. Investment and Economic Co-operation FDI Commitment : New Zealand will invest USD 20 billion in India over 15 years , strengthening long-term economic ties. Organic Primary Products: Mutual recognition of organic certification to be agreed between the two sides. MSME Cooperation : Institutional linkages to help small businesses access trade-related information and global markets. Technical Assistance : Cooperation has been agreed in AYUSH, audio visual industries, tourism, sports and traditional knowledge systems. The FTA promotes India’s AYUSH systems internationally, encourages medical value travel, and positions India as a global wellness hub. Cultural & Traditional Knowledge Dedicated cooperation in Ayush and Indian traditional knowledge has been agreed. Engagement with New Zealand’s indigenous Maori communities to promote cultural exchange and mutual respect. This strengthens India’s soft power and global recognition of its heritage. Regulatory & Institutional Provisions Pharmaceuticals & Medical Devices : Annexes for expedited regulatory pathways and recognition of inspections from trusted regulators (US, EU, UK, Canada). Intellectual Property Rights : Binding commitment by New Zealand to amend its laws within 18 months to provide EU-level protection for India’s Geographical Indications (GIs). Customs & Trade Facilitation : Advance rulings, electronic documentation, and faster clearance times (within 48 hours, 24 hours for perishables). Rules of Origin (ROO) : Robust framework to prevent circumvention and ensure integrity of preferential access. Way Forward Subject to mutual agreement and in the interest of transparency, the negotiated texts may be published on an agreed date following the formal joint announcement. The Agreement will be signed upon completion of domestic processes in both countries and is expected to enter into force after ratification, with the timeline envisaged for next year. Sectoral Highlights The India–New Zealand FTA secures duty free or preferential access across a wide range of sectors. These gains are expected to boost India’s exports, create jobs, and strengthen the competitiveness of Indian industries in the Oceania region. Sector India’s Exports Tariff Coverage Impact & Opportunity Agriculture USD 51.8 billion in 2024–25 , up from USD 48.3 billion in 2023–24, 7.3% growth. 1,379 tariff lines, accounting for 17% of all product tariff lines Elimination of tariffs at peak 5% (with tea already at zero duty) Fruits and Vegetables: enhances access for fresh produce and horticultural exports. Coffee, Tea, Cocoa, and Spices: supports exports of niche, premium, and value-added agri-products. Cereals: improves the global competitiveness of Indian grain exports. Processed Foods: benefits exports of ready-to-eat and processed food products, strengthening India’s food processing sector. Marine USD 7.0 billion in FY25, up from USD 6.8 billion in FY24. Exports to New Zealand rose from USD 15.35 million to USD 15.89 million in the same period. Marine sector covered across 363 tariff lines (4.4% of total) . Pre-FTA peaks up to 5% , now reduced to zero New Zealand’s marine imports from the world averaged USD 0.26 billion. Zero-duty access under the FTA supports higher market access and export growth. Textiles & Clothing USD 36.9 billion in 2024–25, up from USD 34.8 billion in 2023–24, 6.1% growth. Exports to New Zealand rose from USD 98.14 million to USD 103.14 million for the same period. 1,057 tariff lines, representing 13% of total tariff lines. Pre-FTA peak tariffs were up to 10%, now fully eliminated, to ensure Zero-duty market access New Zealand’s imports of textiles and clothing from the world averaged USD 1.90 billion over the last three years. The move enhances India’s competitiveness and supports higher export growth in the New Zealand market. Engineering Sector USD 77.5 billion in FY25; up from USD 64.4 billion in FY24, 20.3% growth. Exports to New Zealand rose from USD 47.76 million to USD 68.26 million for the same period. Across 1,396 tariff lines (16.9% of total) . Pre-FTA average duty peaks up to 10% , now eliminated . New Zealand’s engineering imports from the world averaged USD 11 billion in the last three years. Zero-duty access under the FTA supports higher market access and export growth. Leather & Footwear USD 5.5 billion in 2024–25, up from 5.3 billion in 2023–24. Exports to New Zealand stood at USD 8.52 million in 2024–25 Removal of tariffs across 181 tariff lines covering footwear, leather goods, and accessories; Pre-FTA peak tariffs up to 10%, now reduced to zero. New Zealand’s imports of leather, footwear, and related products from the world averaged USD 0.51 billion over the last three years; The move enhances India’s market access and supports higher exports in mid- to high-value segments, including leather footwear, finished leather, bags, belts, wallets, and fashion accessories Pharmaceuticals USD 24.5 billion in 2024–25, up from USD 22.1 billion in 2023-24, 10.8% growth. Exports to New Zealand stands at USD 57.52 million in 2024–25. Across 90 tariff lines; pre-FTA peaks up to 5%, now reduced to zero. New Zealand’s pharmaceutical imports from the world averaged USD 1.4 billion in the last three years. The move expands market access and boosts export growth. Plastic & Rubber USD 13 billion in FY25, up from USD 12 billion in FY24. Exports to New Zealand rose from USD 18.87 million to USD 23.66 million during the same period. Across 397 tariff lines (4.8% of total tariff lines) Pre-FTA average duty peaks up to 10%, now eliminated. New Zealand’s plastics and rubber imports from the world averaged USD 2.05 billion in the last three years. Zero-duty access under the FTA supports higher market access and export growth. India’s Global Trade Networks Free Trade Agreements are designed to open new opportunities for Indian businesses, farmers, students, and professionals, while also strengthening India’s role in global value chains. It is an agreement between two or more countries where the countries agree on certain obligations that affect trade in goods and services, and protections for investors and intellectual property rights, among other topics. India’s FTA with other countries enhances competitiveness by reducing or eliminating tariffs and by improving market access for goods and services. They strengthen intellectual property protection , enable participation in standards setting and government procurement , and ensure fair treatment for investors . Overall, FTAs create a more predictable and level playing field for businesses operating across borders. With the continued expansion of its global economic footprint, India has increasingly emerged as a preferred partner for enhanced trade and economic cooperation . India -Oman Comprehensive Economic Partnership Agreement (CEPA), 2025 India -UK Comprehensive Economic and Trade Agreement (CETA), 2025 India- EFTA Trade & Economic Partnership Agreement (TEPA) with Switzerland, Norway, Iceland, and Liechtenstein, 2024 India- United Arab Emirates Comprehensive Economic Partnership Agreement (CEPA), 2022 India- Australia Economic Cooperation and Trade Agreement (ECTA), 2022 India – Mauritius Comprehensive Economic Cooperation and Partnership (CECPA), 2021 Conclusion The India–New Zealand Free Trade Agreement reflects a defining moment in India’s trade diplomacy , opening new avenues for comprehensive economic cooperation. By securing improved market access for Indian goods, expanding opportunities in services and mobility, and deepening collaboration in agriculture, investment and emerging sectors, the Agreement delivers tangible and wide-ranging benefits across the economy. From farmers and MSMEs to students and skilled professionals, the gains from this Agreement are expected to be broad-based, reinforcing India’s position as a trusted, forward-looking global partner and advancing the vision of a globally integrated Viksit Bharat 2047 . References Ministry of Commerce and Industry https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207300&lang=2&reg=3 International Trade Administration https://www.trade.gov/free-trade-agreement-overview PIB Achieves https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206194&reg=3&lang=1 Click here to see in PDF PIB Research (रिलीज़ आईडी: 2207583) आगंतुक पटल  : 80 PIB Headquarters India – New Zealand Free Trade Agreement One of India’s fastest-concluded FTAs प्रविष्टि तिथि:\r\n                        22 DEC 2025 10:20PM by PIB Delhi Key Takeaways India- New Zealand FTA eliminates duty on 100% of Indian Exports USD 20 billion investment commitment over 15 years, strengthening long-term economic and strategic cooperation. India protects its key interests in dairy and agriculture ; Huge win for labour intensive sectors like textile and leather. New Zealand signs Annex on Health and Traditional Medicine Services for the first time. Student Mobility and Post Study Work Visa for STEM Graduates, Skilled Professionals ; opens new visa pathway for 5,000 skilled occupations. Introduction India has steadily expanded its global trade partnerships to strengthen economic growth, create jobs, and enhance its global standing. After signing six Free Trade Agreements in the last five years, the latest being with Oman this month, India and New Zealand have just concluded negotiations for a forward-looking FTA,  marking a historic milestone in bilateral economic relations. The Agreement delivers unprecedented duty-free access for Indian exports to New Zealand while safeguarding India’s sensitive sectors, strengthening economic resilience, and promoting inclusive growth aligned with India’s national priorities. India and New Zealand announced negotiations for a Free Trade Agreement (FTA) In March 2025. Following several rounds of negotiations, the India-New Zealand FTA was concluded in December 2025, becoming one of India’s fastest-concluded FTAs . This FTA enhances market access and tariff preferences for Indian exports to New Zealand, while serving as a gateway to the wider Oceania and Pacific Island markets . The agreement opens opportunities for India to emerge as a key supplier of skilled workforce, alongside prospects for future cooperation in areas such as AYUSH and services such as Yoga Instructors, Indian Chefs, and Music Teachers, and services under sector of interests like IT, Engineering, Healthcare, Education, and Construction. Overall, the agreement establishes establishes a predictable, transparent framework that expands market access, enhances trade in services, creates mobility pathways, encourages long-term investment, and builds agriculture productivity. India – New Zealand: Bilateral Trade Ties India’s partnership with New Zealand is shaped by both economic realities and strong people-to-people ties. Currently, New Zealand is India’s second-largest trading partner in Oceania . At USD 49,380, New Zealand is among the higher-income economies in Oceania. In 2024, New Zealand’s imports stood at USD 47 billion, while exports were USD 42 billion. New Zealand invests nearly 8% of its GDP annually overseas, with total overseas investment valued at USD 422.6 billion as of March 2025. Around 300,000 persons of Indian origin and NRIs live in New Zealand, making up nearly 5% of its population. This diaspora acts as a cultural and economic bridge, supporting stronger bilateral ties and demand for Indian goods and services. This FTA builds on the socio-economic foundation aimed at creating new opportunities. Merchandise Trade : Grew from USD 873 million in 2023–24 to USD 1.3 billion in 2024–25, registering a 49% growth. Merchandise Exports to New Zealand : Rose to USD 711 million in 2024–25, showing a positive trend of 32%. Services Trade : India’s services exports to New Zealand grew by 13% in 2024, reaching USD 634 million. Major sectors include travel, IT, and business services. India and New Zealand merchandise bilateral trade increased from USD 855 Million in 2015-2016 to USD 1298 Million in 2024-2025. The exports increased by 130% whereas imports only increased by 7.21% in 10 years. In 2024-25, the exports from India to New Zealand was higher than imports from New Zealand, maintaining positive trade balance with the country. Salient Features of the FTA The FTA eliminates duty on 100% of Indian Exports A USD 20 billion investment commitment over 15 years strengthens long-term economic and strategic cooperation. Through Agricultural Productivity Partnership , the FTA collaborates with farmers to boost productivity and integrate them in the global value chains. The FTA boosts MSMEs and Jobs through Zero-duty access for labour-intensive sectors including textiles, apparel, leather, footwear, gems & jewellery, engineering goods and processed foods. India has offered market access in 70.03% of the tariff lines while keeping 29.97 % tariff lines in exclusion. Immediate Elimination (EIF) on 30%, Rest is phased. Certain products are kept in exclusion such as Dairy (milk, cream, whey, yoghurt, cheese etc.), animal products (other than sheep meat), vegetable products (onions, chana, peas, corn, almonds etc.), sugar, artificial honey, Animal, vegetable or microbial fats and oils, Arms and Ammunition, Gems and Jewellery, Copper and Articles (Cathodes, Cartridges, Rods, Bars, Coils etc.), Aluminium and articles thereof (Ingots, billets, wire bars) among others. 30.00% of tariff lines will have immediate duty elimination , covering wood, wool, sheep meat, leather-raw hides etc 35.60% of tariffs are subject to phased elimination over 3, 5, 7, and 10 years,including petroleum oil, malt extract, vegetable oils, and selected electrical and mechanical machinery, peptones etc. 4.37% of products face tariff reductions, such as wine, pharmaceutical drugs, polymers, aluminium, iron and steel articles etc 0.06% fall under tariff rate quotas, including honey, apples, kiwi fruit, and albumins including milk albumin. Enhanced Market Access for Indian Goods Gains to India from FTA New Zealand’s market access offer covers immediate elimination of duties (zero duty) on 100% of tariff lines of New Zealand (8,284 tariff lines), from Entry into Force. New Zealand maintained tariffs around 10% in around 450 lines of key Indian exports in products including textile/apparel products, leather and headgear, ceramics, carpets, ⁠automobiles and auto components. Additionally, the average applied tariff at 2.2% in 2025 will become zero from EIF. The offer extends gains to several products and sectors o Labour intensive sectors like textiles and clothing, leather and footwear; Emerging and advanced engineering sectors like transport/auto, pharmaceuticals, plastic & rubber, electrical & electronic machinery, mechanical machinery, chemicals and; o Agri Products like fruits and vegetables, coffee, spices, cereals, processed foods Gains from import to support domestic industries: wooden logs, coking coal, waste and scrap of ferrous, non-ferrous metals Gains for Agriculture, Technology Cooperation, and Farmer Income Growth New Zealand have agreed on focused Action Plans for kiwifruit, apples, and honey to improve productivity, quality, and sectoral capabilities of these fruits growers in India The cooperation includes the establishment of Centres of Excellence , improved planting material, capacity building for growers, technical support for orchard management, post-harvest practices, supply chains and food safety. Projects for premium apple cultivators and sustainable beekeeping practices will enhance production and quality standards . This is Paired with Market access for the selected agricultural products (Apples, Kiwifruit, Manuka Honey) from New Zealand in India. This access will be managed through a Tariff Rate Quota (TRQ) system with Minimum Import Price and seasonal imports , ensuring consumer choice while protecting domestic farmers. All TRQs are linked to Agri-technology Action Plans and monitored by a Joint Agriculture Productivity Council , balancing market access with protection of sensitive domestic agricultural sectors. Enhanced Opportunities Beyond Goods Services Best-Ever Offer by New Zealand : Commitment across 118 services sectors, with Most-Favoured Nation (MFN) treatment in 139 sectors. Health & Traditional Medicine Annex : For the first time, New Zealand has signed an annex to facilitate trade in Ayurveda, yoga, and other traditional medicine services with India. This landmark provision promotes the global recognition of India’s AYUSH systems,supports medical value travel, encourages collaboration in wellness services, and reinforces India’s position as a global hub for health, wellness, and traditional medicine services. It gives centre stage to India’s AYUSH disciplines (Ayurveda, Yoga & Naturopathy, Unani, Sowa-Rigpa, Siddha, and Homeopathy) alongside Maori Health practices Mobility & Education Student Mobility : New Zealand signed Annex on Student Mobility and Post Study Work Visa for the first time with any country. Indian students can work up to 20 hours per week while studying, even if there are policy changes in future, with extended post-study work visas (STEM Bachelor: 3 yrs; Master’s: up to 3 yrs; Doctorate: up to 4 yrs). Professional Pathways : A quota of 5,000 visas for skilled Indians for stay upto 3 years in the sectors of interest to India which include Indian iconic occupations (AYUSH practitioners, Yoga Instructors, Indian Chefs, and Music Teachers) and Other sectors of interest - IT, Engineering, Healthcare, Education, and Construction Working Holiday Visa : 1,000 young Indians annually can avail multiple entry in New Zealand for a period of 12 months. These provisions create unprecedented opportunities for Indian youth and professionals to gain global exposure. Investment and Economic Co-operation FDI Commitment : New Zealand will invest USD 20 billion in India over 15 years , strengthening long-term economic ties. Organic Primary Products: Mutual recognition of organic certification to be agreed between the two sides. MSME Cooperation : Institutional linkages to help small businesses access trade-related information and global markets. Technical Assistance : Cooperation has been agreed in AYUSH, audio visual industries, tourism, sports and traditional knowledge systems. The FTA promotes India’s AYUSH systems internationally, encourages medical value travel, and positions India as a global wellness hub. Cultural & Traditional Knowledge Dedicated cooperation in Ayush and Indian traditional knowledge has been agreed. Engagement with New Zealand’s indigenous Maori communities to promote cultural exchange and mutual respect. This strengthens India’s soft power and global recognition of its heritage. Regulatory & Institutional Provisions Pharmaceuticals & Medical Devices : Annexes for expedited regulatory pathways and recognition of inspections from trusted regulators (US, EU, UK, Canada). Intellectual Property Rights : Binding commitment by New Zealand to amend its laws within 18 months to provide EU-level protection for India’s Geographical Indications (GIs). Customs & Trade Facilitation : Advance rulings, electronic documentation, and faster clearance times (within 48 hours, 24 hours for perishables). Rules of Origin (ROO) : Robust framework to prevent circumvention and ensure integrity of preferential access. Way Forward Subject to mutual agreement and in the interest of transparency, the negotiated texts may be published on an agreed date following the formal joint announcement. The Agreement will be signed upon completion of domestic processes in both countries and is expected to enter into force after ratification, with the timeline envisaged for next year. Sectoral Highlights The India–New Zealand FTA secures duty free or preferential access across a wide range of sectors. These gains are expected to boost India’s exports, create jobs, and strengthen the competitiveness of Indian industries in the Oceania region. Sector India’s Exports Tariff Coverage Impact & Opportunity Agriculture USD 51.8 billion in 2024–25 , up from USD 48.3 billion in 2023–24, 7.3% growth. 1,379 tariff lines, accounting for 17% of all product tariff lines Elimination of tariffs at peak 5% (with tea already at zero duty) Fruits and Vegetables: enhances access for fresh produce and horticultural exports. Coffee, Tea, Cocoa, and Spices: supports exports of niche, premium, and value-added agri-products. Cereals: improves the global competitiveness of Indian grain exports. Processed Foods: benefits exports of ready-to-eat and processed food products, strengthening India’s food processing sector. Marine USD 7.0 billion in FY25, up from USD 6.8 billion in FY24. Exports to New Zealand rose from USD 15.35 million to USD 15.89 million in the same period. Marine sector covered across 363 tariff lines (4.4% of total) . Pre-FTA peaks up to 5% , now reduced to zero New Zealand’s marine imports from the world averaged USD 0.26 billion. Zero-duty access under the FTA supports higher market access and export growth. Textiles & Clothing USD 36.9 billion in 2024–25, up from USD 34.8 billion in 2023–24, 6.1% growth. Exports to New Zealand rose from USD 98.14 million to USD 103.14 million for the same period. 1,057 tariff lines, representing 13% of total tariff lines. Pre-FTA peak tariffs were up to 10%, now fully eliminated, to ensure Zero-duty market access New Zealand’s imports of textiles and clothing from the world averaged USD 1.90 billion over the last three years. The move enhances India’s competitiveness and supports higher export growth in the New Zealand market. Engineering Sector USD 77.5 billion in FY25; up from USD 64.4 billion in FY24, 20.3% growth. Exports to New Zealand rose from USD 47.76 million to USD 68.26 million for the same period. Across 1,396 tariff lines (16.9% of total) . Pre-FTA average duty peaks up to 10% , now eliminated . New Zealand’s engineering imports from the world averaged USD 11 billion in the last three years. Zero-duty access under the FTA supports higher market access and export growth. Leather & Footwear USD 5.5 billion in 2024–25, up from 5.3 billion in 2023–24. Exports to New Zealand stood at USD 8.52 million in 2024–25 Removal of tariffs across 181 tariff lines covering footwear, leather goods, and accessories; Pre-FTA peak tariffs up to 10%, now reduced to zero. New Zealand’s imports of leather, footwear, and related products from the world averaged USD 0.51 billion over the last three years; The move enhances India’s market access and supports higher exports in mid- to high-value segments, including leather footwear, finished leather, bags, belts, wallets, and fashion accessories Pharmaceuticals USD 24.5 billion in 2024–25, up from USD 22.1 billion in 2023-24, 10.8% growth. Exports to New Zealand stands at USD 57.52 million in 2024–25. Across 90 tariff lines; pre-FTA peaks up to 5%, now reduced to zero. New Zealand’s pharmaceutical imports from the world averaged USD 1.4 billion in the last three years. The move expands market access and boosts export growth. Plastic & Rubber USD 13 billion in FY25, up from USD 12 billion in FY24. Exports to New Zealand rose from USD 18.87 million to USD 23.66 million during the same period. Across 397 tariff lines (4.8% of total tariff lines) Pre-FTA average duty peaks up to 10%, now eliminated. New Zealand’s plastics and rubber imports from the world averaged USD 2.05 billion in the last three years. Zero-duty access under the FTA supports higher market access and export growth. India’s Global Trade Networks Free Trade Agreements are designed to open new opportunities for Indian businesses, farmers, students, and professionals, while also strengthening India’s role in global value chains. It is an agreement between two or more countries where the countries agree on certain obligations that affect trade in goods and services, and protections for investors and intellectual property rights, among other topics. India’s FTA with other countries enhances competitiveness by reducing or eliminating tariffs and by improving market access for goods and services. They strengthen intellectual property protection , enable participation in standards setting and government procurement , and ensure fair treatment for investors . Overall, FTAs create a more predictable and level playing field for businesses operating across borders. With the continued expansion of its global economic footprint, India has increasingly emerged as a preferred partner for enhanced trade and economic cooperation . India -Oman Comprehensive Economic Partnership Agreement (CEPA), 2025 India -UK Comprehensive Economic and Trade Agreement (CETA), 2025 India- EFTA Trade & Economic Partnership Agreement (TEPA) with Switzerland, Norway, Iceland, and Liechtenstein, 2024 India- United Arab Emirates Comprehensive Economic Partnership Agreement (CEPA), 2022 India- Australia Economic Cooperation and Trade Agreement (ECTA), 2022 India – Mauritius Comprehensive Economic Cooperation and Partnership (CECPA), 2021 Conclusion The India–New Zealand Free Trade Agreement reflects a defining moment in India’s trade diplomacy , opening new avenues for comprehensive economic cooperation. By securing improved market access for Indian goods, expanding opportunities in services and mobility, and deepening collaboration in agriculture, investment and emerging sectors, the Agreement delivers tangible and wide-ranging benefits across the economy. From farmers and MSMEs to students and skilled professionals, the gains from this Agreement are expected to be broad-based, reinforcing India’s position as a trusted, forward-looking global partner and advancing the vision of a globally integrated Viksit Bharat 2047 . References Ministry of Commerce and Industry https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207300&lang=2&reg=3 International Trade Administration https://www.trade.gov/free-trade-agreement-overview PIB Achieves https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206194&reg=3&lang=1 Click here to see in PDF PIB Research (रिलीज़ आईडी: 2207583)",
    "scraped_at": "2025-12-22T17:41:18.220131"
  },
  {
    "id": "2207416",
    "ministry": "Office of Principal Scientific Advisor to GoI",
    "title": "Office of Principal Scientific Adviser Convenes High-Level Roundtable on Techno-Legal Regulation for Responsible, Innovation-Aligned AI Governance",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207416",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Office of Principal Scientific Advisor to GoI Office of Principal Scientific Adviser Convenes High-Level Roundtable on Techno-Legal Regulation for Responsible, Innovation-Aligned AI Governance प्रविष्टि तिथि:\r\n                22 DEC 2025 4:34PM by PIB Delhi The Office of the Principal Scientific Adviser (OPSA) to the Government of India, in collaboration with the iSPIRT Foundation and the Centre for Responsible AI (IIT Madras), convened a high-level roundtable on “Techno-Legal Regulation for Responsible, Innovation-Aligned AI Governance” on 22 December 2025. The roundtable was organised as an official pre-summit event ahead of the India AI Impact Summit 2026 and was chaired by Prof. Ajay Kumar Sood, Principal Scientific Adviser (PSA) to the Government of India. The roundtable was joined by Dr. Preeti Banzal, Adviser/ Scientist ‘G’, Office of PSA; Ms. Kavita Bhatia, Scientist ‘G’ and Group Coordinator, Ministry of Electronics and Information Technology, Government of India; Mr. Hari Subramanian, Volunteer, iSPIRT Foundation, and Co-founder & CEO, Niti AI; Prof. Balaraman Ravindran, Head, Centre for Responsible AI, IIT Madras; Prof. Mayank Vatsa, Professor, IIT Jodhpur; Ms. Jhalak Kakkar, Director, Centre for Communication Governance, National Law University, Delhi; and Mr. Abilash Soundararajan, Founder & CEO, PrivaSapien, among other senior stakeholders and subject-matter experts. Setting the context, Dr. Banzal spoke about India’s approach to techno-legal regulation, emphasising the importance of having a practical implementation mechanism and setting exemplary pathways to AI Governance, enabling policy mechanisms, capacity building, and global cooperation. In his keynote address, Prof. Sood talked about India’s readiness to adopt a techno-legal approach to AI governance, highlighting the need to embed legal and regulatory principles directly into AI systems to ensure accountability, transparency, data privacy, and cybersecurity by design. Prof. Sood encouraged participants to evaluate all plausible ways for creating a techno-legal governance framework. The co-moderators, Mr. Subramanian and Prof. Ravindran, discussed key challenges and metrics, including data protection, leakage risks, differential privacy, accuracy, and throughput, noting the trade-offs between privacy and system performance. They underlined the importance of equity in access, data sovereignty, and broader economic and strategic considerations. The experts highlighted the need for robust data privacy and consent mechanisms across AI training, inference, and deployment, convergence with the DEPA framework, and the adoption of compliance-by-design architectures to support the global scalability of Indian AI governance models. The discussions also addressed regulatory responses to non-deterministic AI systems and AI-generated content, including copyright concerns, while underscoring the challenges of operationalising techno-legal frameworks for AI governance. Participants emphasised that AI model robustness must be balanced against technical and socio-economic trade-offs, and that emerging solutions should be practical, accessible, and consumable at the end-user level. The discussions underscored the need to develop a standardised evaluation framework for responsible AI across the full lifecycle of AI systems, translate these insights into effective policy levers, and embed safety and governance measures directly into AI technology stacks to mitigate risks and promote equitable access. The roundtable concluded with a vote of thanks by Dr. Banzal, who noted that the insights derived from the roundtable will contribute to the Safe and Trusted AI Chakra of the India AI Impact Summit 2026, supporting the development of a pro-innovation, trustworthy AI ecosystem and strengthening India’s role in global AI governance. The Office of PSA will also be releasing an explanatory white paper on Techno-Legal Regulation for AI Governance incorporating all the suggestions and recommendations made in the roundtable. *** MJPS/ST (रिलीज़ आईडी: 2207416) आगंतुक पटल  : 410 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Office of Principal Scientific Advisor to GoI Office of Principal Scientific Adviser Convenes High-Level Roundtable on Techno-Legal Regulation for Responsible, Innovation-Aligned AI Governance प्रविष्टि तिथि:\r\n                        22 DEC 2025 4:34PM by PIB Delhi The Office of the Principal Scientific Adviser (OPSA) to the Government of India, in collaboration with the iSPIRT Foundation and the Centre for Responsible AI (IIT Madras), convened a high-level roundtable on “Techno-Legal Regulation for Responsible, Innovation-Aligned AI Governance” on 22 December 2025. The roundtable was organised as an official pre-summit event ahead of the India AI Impact Summit 2026 and was chaired by Prof. Ajay Kumar Sood, Principal Scientific Adviser (PSA) to the Government of India. The roundtable was joined by Dr. Preeti Banzal, Adviser/ Scientist ‘G’, Office of PSA; Ms. Kavita Bhatia, Scientist ‘G’ and Group Coordinator, Ministry of Electronics and Information Technology, Government of India; Mr. Hari Subramanian, Volunteer, iSPIRT Foundation, and Co-founder & CEO, Niti AI; Prof. Balaraman Ravindran, Head, Centre for Responsible AI, IIT Madras; Prof. Mayank Vatsa, Professor, IIT Jodhpur; Ms. Jhalak Kakkar, Director, Centre for Communication Governance, National Law University, Delhi; and Mr. Abilash Soundararajan, Founder & CEO, PrivaSapien, among other senior stakeholders and subject-matter experts. Setting the context, Dr. Banzal spoke about India’s approach to techno-legal regulation, emphasising the importance of having a practical implementation mechanism and setting exemplary pathways to AI Governance, enabling policy mechanisms, capacity building, and global cooperation. In his keynote address, Prof. Sood talked about India’s readiness to adopt a techno-legal approach to AI governance, highlighting the need to embed legal and regulatory principles directly into AI systems to ensure accountability, transparency, data privacy, and cybersecurity by design. Prof. Sood encouraged participants to evaluate all plausible ways for creating a techno-legal governance framework. The co-moderators, Mr. Subramanian and Prof. Ravindran, discussed key challenges and metrics, including data protection, leakage risks, differential privacy, accuracy, and throughput, noting the trade-offs between privacy and system performance. They underlined the importance of equity in access, data sovereignty, and broader economic and strategic considerations. The experts highlighted the need for robust data privacy and consent mechanisms across AI training, inference, and deployment, convergence with the DEPA framework, and the adoption of compliance-by-design architectures to support the global scalability of Indian AI governance models. The discussions also addressed regulatory responses to non-deterministic AI systems and AI-generated content, including copyright concerns, while underscoring the challenges of operationalising techno-legal frameworks for AI governance. Participants emphasised that AI model robustness must be balanced against technical and socio-economic trade-offs, and that emerging solutions should be practical, accessible, and consumable at the end-user level. The discussions underscored the need to develop a standardised evaluation framework for responsible AI across the full lifecycle of AI systems, translate these insights into effective policy levers, and embed safety and governance measures directly into AI technology stacks to mitigate risks and promote equitable access. The roundtable concluded with a vote of thanks by Dr. Banzal, who noted that the insights derived from the roundtable will contribute to the Safe and Trusted AI Chakra of the India AI Impact Summit 2026, supporting the development of a pro-innovation, trustworthy AI ecosystem and strengthening India’s role in global AI governance. The Office of PSA will also be releasing an explanatory white paper on Techno-Legal Regulation for AI Governance incorporating all the suggestions and recommendations made in the roundtable. *** MJPS/ST (रिलीज़ आईडी: 2207416)",
    "scraped_at": "2025-12-22T17:41:21.098808"
  }
]