[
  {
    "id": "2207836",
    "ministry": "President's Secretariat",
    "title": "PRESIDENT OF INDIA PRESENTS RASHTRIYA VIGYAN PURASKAR – 2025",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207836",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau President's Secretariat PRESIDENT OF INDIA PRESENTS RASHTRIYA VIGYAN PURASKAR – 2025 प्रविष्टि तिथि:\r\n                23 DEC 2025 6:25PM by PIB Delhi The President of India, Smt. Droupadi Murmu presented the Rashtriya Vigyan Puraskar- 2025 at an award ceremony held at Gantantra Mandap, Rashtrapati Bhavan today (December 23, 2025). In the second edition of the Rashtriya Vigyan Puraskar, 24 awards were presented to distinguished scientists in four categories - Vigyan Ratna, Vigyan Shri, Vigyan Yuva, and Vigyan Team. The objective of the Rashtriya Vigyan Puraskar is to recognise the notable and inspiring contributions made by the scientists, technologists and innovators individually or in teams in various fields of science, technology and technology-led innovation. Rashtri ya Vigyan Puraskar awardees list *** MJPS/SR (रिलीज़ आईडी: 2207836) आगंतुक पटल  : 531 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Telugu , Malayalam , Urdu , हिन्दी , Marathi , Gujarati , Tamil President's Secretariat PRESIDENT OF INDIA PRESENTS RASHTRIYA VIGYAN PURASKAR – 2025 प्रविष्टि तिथि:\r\n                        23 DEC 2025 6:25PM by PIB Delhi The President of India, Smt. Droupadi Murmu presented the Rashtriya Vigyan Puraskar- 2025 at an award ceremony held at Gantantra Mandap, Rashtrapati Bhavan today (December 23, 2025). In the second edition of the Rashtriya Vigyan Puraskar, 24 awards were presented to distinguished scientists in four categories - Vigyan Ratna, Vigyan Shri, Vigyan Yuva, and Vigyan Team. The objective of the Rashtriya Vigyan Puraskar is to recognise the notable and inspiring contributions made by the scientists, technologists and innovators individually or in teams in various fields of science, technology and technology-led innovation. Rashtri ya Vigyan Puraskar awardees list *** MJPS/SR (रिलीज़ आईडी: 2207836)",
    "scraped_at": "2025-12-23T17:42:30.861048"
  },
  {
    "id": "2207851",
    "ministry": "Vice President's Secretariat",
    "title": "Vice-President releases book ‘Sanatan Sanskriti Ki Atal Drishti’",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207851",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Vice President's Secretariat Vice-President releases book ‘Sanatan Sanskriti Ki Atal Drishti’ Atal Bihari Vajpayee was an institution, not merely an individual: Vice-President Pokhran nuclear tests under Vajpayee showcased a confident and resurgent India: Vice-President Atal Bihari Vajpayee’s legacy of good governance continues to inspire India’s development path प्रविष्टि तिथि:\r\n                23 DEC 2025 7:13PM by PIB Delhi The Vice-President of India, Shri C.P.Radhakrishnan today released the book Sanatan Sanskriti Ki Atal Drishti, authored by Shri Vasudev Devnani, Speaker of the Rajasthan Legislative Assembly, at the Vice-President’s Enclave in New Delhi. The Vice-President congratulated Shri Devnani for authoring the book and described it as a timely and significant contribution, especially as the nation commemorates the centenary birth anniversary of former Prime Minister Bharat Ratna Shri Atal Bihari Vajpayee. The Vice-President said that Shri Atal Bihari Vajpayee was not merely an individual but an institution in himself, whose life and leadership embodied an unwavering commitment to principles and values. Recalling his personal association with Shri Vajpayee, the Vice-President said that he had the privilege of learning from him as a Member of the 12th and 13th Lok Sabhas during his tenure as Prime Minister. He shared fond memories from the Jan Sangh days, including organising a large public meeting for Shri Vajpayee in Coimbatore before the Emergency, an experience that left a deep and lasting impression on him. Highlighting Shri Vajpayee’s contributions to nation-building, the Vice-President said that Shri Vajpayee’s visionary leadership transformed India in multiple domains. Referring to the successful nuclear tests at Pokhran in May 1998 under Operation Shakti, he noted that Shri Vajpayee’s decisive leadership demonstrated India’s confidence and resolve on the global stage. He also recalled Atalji’s inspiring slogan, “Jai Jawan, Jai Kisan, Jai Vigyan,” which reflected his holistic vision for national strength. The Vice-President also underlined Shri Vajpayee’s foresight in the creation of the states of Chhattisgarh, Uttarakhand and Jharkhand, driven by his deep understanding of regional aspirations and the need for decentralised and responsive governance. He noted that the establishment of the Ministry of Tribal Affairs further reflected Shri Vajpayee’s commitment to inclusive growth and justice for the most isolated. Sharing his own experience as Governor of Jharkhand two decades later, the Vice-President said he could see first-hand the far-reaching impact of these visionary decisions. The Vice-President said that Shri Vajpayee always laid emphasis on good governance, which is why his birth anniversary is observed as Good Governance Day. He referred to landmark initiatives such as the Pradhan Mantri Gram Sadak Yojana, the Golden Quadrilateral Project and reforms in the power sector, which laid strong foundations for India’s development. Union Minister for Road Transport and Highways Shri Nitin Gadkari, Union Minister of State for Agriculture and Farmers’ Welfare Shri Bhagirath Choudhary, Shri Vasudev Devnani, Speaker of the Rajasthan Legislative Assembly and author of the book, along with other dignitaries, were present at the event. **** PR/ASM (रिलीज़ आईडी: 2207851) आगंतुक पटल  : 218 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Telugu , Urdu , हिन्दी , Gujarati , Malayalam Vice President's Secretariat Vice-President releases book ‘Sanatan Sanskriti Ki Atal Drishti’ Atal Bihari Vajpayee was an institution, not merely an individual: Vice-President Pokhran nuclear tests under Vajpayee showcased a confident and resurgent India: Vice-President Atal Bihari Vajpayee’s legacy of good governance continues to inspire India’s development path प्रविष्टि तिथि:\r\n                        23 DEC 2025 7:13PM by PIB Delhi The Vice-President of India, Shri C.P.Radhakrishnan today released the book Sanatan Sanskriti Ki Atal Drishti, authored by Shri Vasudev Devnani, Speaker of the Rajasthan Legislative Assembly, at the Vice-President’s Enclave in New Delhi. The Vice-President congratulated Shri Devnani for authoring the book and described it as a timely and significant contribution, especially as the nation commemorates the centenary birth anniversary of former Prime Minister Bharat Ratna Shri Atal Bihari Vajpayee. The Vice-President said that Shri Atal Bihari Vajpayee was not merely an individual but an institution in himself, whose life and leadership embodied an unwavering commitment to principles and values. Recalling his personal association with Shri Vajpayee, the Vice-President said that he had the privilege of learning from him as a Member of the 12th and 13th Lok Sabhas during his tenure as Prime Minister. He shared fond memories from the Jan Sangh days, including organising a large public meeting for Shri Vajpayee in Coimbatore before the Emergency, an experience that left a deep and lasting impression on him. Highlighting Shri Vajpayee’s contributions to nation-building, the Vice-President said that Shri Vajpayee’s visionary leadership transformed India in multiple domains. Referring to the successful nuclear tests at Pokhran in May 1998 under Operation Shakti, he noted that Shri Vajpayee’s decisive leadership demonstrated India’s confidence and resolve on the global stage. He also recalled Atalji’s inspiring slogan, “Jai Jawan, Jai Kisan, Jai Vigyan,” which reflected his holistic vision for national strength. The Vice-President also underlined Shri Vajpayee’s foresight in the creation of the states of Chhattisgarh, Uttarakhand and Jharkhand, driven by his deep understanding of regional aspirations and the need for decentralised and responsive governance. He noted that the establishment of the Ministry of Tribal Affairs further reflected Shri Vajpayee’s commitment to inclusive growth and justice for the most isolated. Sharing his own experience as Governor of Jharkhand two decades later, the Vice-President said he could see first-hand the far-reaching impact of these visionary decisions. The Vice-President said that Shri Vajpayee always laid emphasis on good governance, which is why his birth anniversary is observed as Good Governance Day. He referred to landmark initiatives such as the Pradhan Mantri Gram Sadak Yojana, the Golden Quadrilateral Project and reforms in the power sector, which laid strong foundations for India’s development. Union Minister for Road Transport and Highways Shri Nitin Gadkari, Union Minister of State for Agriculture and Farmers’ Welfare Shri Bhagirath Choudhary, Shri Vasudev Devnani, Speaker of the Rajasthan Legislative Assembly and author of the book, along with other dignitaries, were present at the event. **** PR/ASM (रिलीज़ आईडी: 2207851)",
    "scraped_at": "2025-12-23T17:42:33.090876"
  },
  {
    "id": "2207743",
    "ministry": "Vice President's Secretariat",
    "title": "Vice-President Addresses the Flagship National Conclave on AI Evolution – The Mahakumbh of AI in New Delhi",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207743",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Vice President's Secretariat Vice-President Addresses the Flagship National Conclave on AI Evolution – The Mahakumbh of AI in New Delhi AI Must Be Used Positively and Ethically for Human Welfare, Stresses Vice-President Vice-President Releases AI Curricula; Says AI Should Be Part of School and College Curriculum Educational Institutions Must Evolve as AI Knowledge Hubs: Vice-President India Will Guide the World in Responsible AI Development: Vice-President प्रविष्टि तिथि:\r\n                23 DEC 2025 4:19PM by PIB Delhi The Vice-President of India Shri C.P.Radhakrishnan today participated in the Flagship National Conclave on “AI Evolution – The Mahakumbh of AI”, organised by Guru Gobind Singh Indraprastha University in collaboration with the All India Council for Technical Education (AICTE) and Outlook magazine, at Dr Ambedkar International Centre, New Delhi. Addressing the gathering, the Vice-President highlighted that Artificial Intelligence is no longer a concept of the future but a reality of the present, influencing diverse sectors including healthcare diagnostics, climate modelling, governance, education, finance and national security, and reshaping how societies grow and how individuals live and work. The Vice-President said that there is no need to be pessimistic about modern scientific and technological developments. Drawing a parallel with the advent of computers, which initially faced resistance but went on to reshape the world, he observed that every technological advancement brings both positive and negative aspects. He stressed that the responsibility lies in finding ways to harness technology in a positive and constructive manner. The Vice-President said that India has emerged among the leading nations in Artificial Intelligence. Emphasising that the world is changing rapidly, he cautioned against stagnation and urged that India must not miss the race to keep pace with well-developed countries in the field of Artificial Intelligence. The Vice-President also expressed satisfaction at launching the AI curricula on the occasion. He underlined that Artificial Intelligence should be an integral part of the curriculum in schools and colleges, adding that early exposure to AI would equip students with critical thinking, problem-solving skills and future-ready competencies essential for a technology-driven world. He further stressed that educational institutions must evolve continuously to keep pace with rapid technological changes and emerge as centres of excellence and innovation. Highlighting India’s demographic advantage, the Vice-President noted that about 65 per cent of the population is under the age of 35. He said that this demographic dividend, if properly harnessed, can help India emerge as the world’s leading nation in Artificial Intelligence. He stated that Artificial Intelligence has a crucial role to play in India’s journey towards a self-reliant, inclusive and technologically empowered Aatma Nirbhar and Viksit Bharat @ 2047. Stressing the importance of responsible and ethical AI, the Vice-President said that no scientific advancement should harm humanity and that technology must ultimately help people live happier, more prosperous and dignified lives. He emphasised that Artificial Intelligence must augment human intelligence and be guided by ethical principles to advance social welfare and the public good. Concluding his address, the Vice-President expressed confidence that India, with its talent, vision and values, will not only adopt Artificial Intelligence responsibly but also guide the world in shaping its future. Shri Ashish Sood, Education Minister, Government of Delhi; Prof. (Dr.) Mahesh Verma, Vice-Chancellor, Guru Gobind Singh Indraprastha University; Prof. T. G. Sitaraman, AICTE; Shri Sandeep Ghosh from Outlook magazine, along with scientists, researchers, academicians and students, participated in the conclave. *** PR/ASM (रिलीज़ आईडी: 2207743) आगंतुक पटल  : 373 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Gujarati , Malayalam Vice President's Secretariat Vice-President Addresses the Flagship National Conclave on AI Evolution – The Mahakumbh of AI in New Delhi AI Must Be Used Positively and Ethically for Human Welfare, Stresses Vice-President Vice-President Releases AI Curricula; Says AI Should Be Part of School and College Curriculum Educational Institutions Must Evolve as AI Knowledge Hubs: Vice-President India Will Guide the World in Responsible AI Development: Vice-President प्रविष्टि तिथि:\r\n                        23 DEC 2025 4:19PM by PIB Delhi The Vice-President of India Shri C.P.Radhakrishnan today participated in the Flagship National Conclave on “AI Evolution – The Mahakumbh of AI”, organised by Guru Gobind Singh Indraprastha University in collaboration with the All India Council for Technical Education (AICTE) and Outlook magazine, at Dr Ambedkar International Centre, New Delhi. Addressing the gathering, the Vice-President highlighted that Artificial Intelligence is no longer a concept of the future but a reality of the present, influencing diverse sectors including healthcare diagnostics, climate modelling, governance, education, finance and national security, and reshaping how societies grow and how individuals live and work. The Vice-President said that there is no need to be pessimistic about modern scientific and technological developments. Drawing a parallel with the advent of computers, which initially faced resistance but went on to reshape the world, he observed that every technological advancement brings both positive and negative aspects. He stressed that the responsibility lies in finding ways to harness technology in a positive and constructive manner. The Vice-President said that India has emerged among the leading nations in Artificial Intelligence. Emphasising that the world is changing rapidly, he cautioned against stagnation and urged that India must not miss the race to keep pace with well-developed countries in the field of Artificial Intelligence. The Vice-President also expressed satisfaction at launching the AI curricula on the occasion. He underlined that Artificial Intelligence should be an integral part of the curriculum in schools and colleges, adding that early exposure to AI would equip students with critical thinking, problem-solving skills and future-ready competencies essential for a technology-driven world. He further stressed that educational institutions must evolve continuously to keep pace with rapid technological changes and emerge as centres of excellence and innovation. Highlighting India’s demographic advantage, the Vice-President noted that about 65 per cent of the population is under the age of 35. He said that this demographic dividend, if properly harnessed, can help India emerge as the world’s leading nation in Artificial Intelligence. He stated that Artificial Intelligence has a crucial role to play in India’s journey towards a self-reliant, inclusive and technologically empowered Aatma Nirbhar and Viksit Bharat @ 2047. Stressing the importance of responsible and ethical AI, the Vice-President said that no scientific advancement should harm humanity and that technology must ultimately help people live happier, more prosperous and dignified lives. He emphasised that Artificial Intelligence must augment human intelligence and be guided by ethical principles to advance social welfare and the public good. Concluding his address, the Vice-President expressed confidence that India, with its talent, vision and values, will not only adopt Artificial Intelligence responsibly but also guide the world in shaping its future. Shri Ashish Sood, Education Minister, Government of Delhi; Prof. (Dr.) Mahesh Verma, Vice-Chancellor, Guru Gobind Singh Indraprastha University; Prof. T. G. Sitaraman, AICTE; Shri Sandeep Ghosh from Outlook magazine, along with scientists, researchers, academicians and students, participated in the conclave. *** PR/ASM (रिलीज़ आईडी: 2207743)",
    "scraped_at": "2025-12-23T17:42:35.036241"
  },
  {
    "id": "2207856",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister condoles passing of renowned writer Vinod Kumar Shukla ji",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207856",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister condoles passing of renowned writer Vinod Kumar Shukla ji प्रविष्टि तिथि:\r\n                23 DEC 2025 7:24PM by PIB Delhi The Prime Minister, Shri Narendra Modi has condoled passing of renowned writer and Jnanpith Awardee Vinod Kumar Shukla ji. Shri Modi stated that he will always be remembered for his invaluable contribution to the world of Hindi literature. The Prime Minister posted on X: \"ज्ञानपीठ पुरस्कार से सम्मानित प्रख्यात लेखक विनोद कुमार शुक्ल जी के निधन से अत्यंत दुख हुआ है। हिन्दी साहित्य जगत में अपने अमूल्य योगदान के लिए वे हमेशा स्मरणीय रहेंगे। शोक की इस घड़ी में मेरी संवेदनाएं उनके परिजनों और प्रशंसकों के साथ हैं। ओम शांति।\" ज्ञानपीठ पुरस्कार से सम्मानित प्रख्यात लेखक विनोद कुमार शुक्ल जी के निधन से अत्यंत दुख हुआ है। हिन्दी साहित्य जगत में अपने अमूल्य योगदान के लिए वे हमेशा स्मरणीय रहेंगे। शोक की इस घड़ी में मेरी संवेदनाएं उनके परिजनों और प्रशंसकों के साथ हैं। ओम शांति। — Narendra Modi (@narendramodi) December 23, 2025 **** MJPS/VJ (रिलीज़ आईडी: 2207856) आगंतुक पटल  : 221 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Gujarati , Tamil , Telugu , Kannada , Malayalam Prime Minister's Office Prime Minister condoles passing of renowned writer Vinod Kumar Shukla ji प्रविष्टि तिथि:\r\n                        23 DEC 2025 7:24PM by PIB Delhi The Prime Minister, Shri Narendra Modi has condoled passing of renowned writer and Jnanpith Awardee Vinod Kumar Shukla ji. Shri Modi stated that he will always be remembered for his invaluable contribution to the world of Hindi literature. The Prime Minister posted on X: \"ज्ञानपीठ पुरस्कार से सम्मानित प्रख्यात लेखक विनोद कुमार शुक्ल जी के निधन से अत्यंत दुख हुआ है। हिन्दी साहित्य जगत में अपने अमूल्य योगदान के लिए वे हमेशा स्मरणीय रहेंगे। शोक की इस घड़ी में मेरी संवेदनाएं उनके परिजनों और प्रशंसकों के साथ हैं। ओम शांति।\" ज्ञानपीठ पुरस्कार से सम्मानित प्रख्यात लेखक विनोद कुमार शुक्ल जी के निधन से अत्यंत दुख हुआ है। हिन्दी साहित्य जगत में अपने अमूल्य योगदान के लिए वे हमेशा स्मरणीय रहेंगे। शोक की इस घड़ी में मेरी संवेदनाएं उनके परिजनों और प्रशंसकों के साथ हैं। ओम शांति। — Narendra Modi (@narendramodi) December 23, 2025 **** MJPS/VJ (रिलीज़ आईडी: 2207856)",
    "scraped_at": "2025-12-23T17:42:37.150093"
  },
  {
    "id": "2207834",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister extends compliments for highlighting India’s cultural and linguistic diversity on the floor of the Parliament",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207834",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister extends compliments for highlighting India’s cultural and linguistic diversity on the floor of the Parliament प्रविष्टि तिथि:\r\n                23 DEC 2025 6:19PM by PIB Delhi The Prime Minister, Shri Narendra Modi has extended compliments to Speaker Om Birla Ji and MPs across Party lines for highlighting India’s cultural and linguistic diversity on the floor of the Parliament as regional-languages take precedence in Lok-Sabha addresses. The Prime Minister posted on X: \"This is gladdening to see. India’s cultural and linguistic diversity is our pride. Compliments to Speaker Om Birla Ji and MPs across Party lines for highlighting this vibrancy on the floor of the Parliament.\" https://hindustantimes.com/india-news/regional-languages-take-precedence-in-lok-sabha-addresses-101 @ombirlakota This is gladdening to see. India’s cultural and linguistic diversity is our pride. Compliments to Speaker Om Birla Ji and MPs across Party lines for highlighting this vibrancy on the floor of the Parliament. https://t.co/J3FvbziK5b @ombirlakota — Narendra Modi (@narendramodi) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207834) आगंतुक पटल  : 260 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Gujarati , Tamil , Telugu , Kannada , Malayalam Prime Minister's Office Prime Minister extends compliments for highlighting India’s cultural and linguistic diversity on the floor of the Parliament प्रविष्टि तिथि:\r\n                        23 DEC 2025 6:19PM by PIB Delhi The Prime Minister, Shri Narendra Modi has extended compliments to Speaker Om Birla Ji and MPs across Party lines for highlighting India’s cultural and linguistic diversity on the floor of the Parliament as regional-languages take precedence in Lok-Sabha addresses. The Prime Minister posted on X: \"This is gladdening to see. India’s cultural and linguistic diversity is our pride. Compliments to Speaker Om Birla Ji and MPs across Party lines for highlighting this vibrancy on the floor of the Parliament.\" https://hindustantimes.com/india-news/regional-languages-take-precedence-in-lok-sabha-addresses-101 @ombirlakota This is gladdening to see. India’s cultural and linguistic diversity is our pride. Compliments to Speaker Om Birla Ji and MPs across Party lines for highlighting this vibrancy on the floor of the Parliament. https://t.co/J3FvbziK5b @ombirlakota — Narendra Modi (@narendramodi) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207834)",
    "scraped_at": "2025-12-23T17:42:38.987388"
  },
  {
    "id": "2207727",
    "ministry": "Prime Minister's Office",
    "title": "Neeraj Chopra meets the Prime Minister",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207727",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Neeraj Chopra meets the Prime Minister प्रविष्टि तिथि:\r\n                23 DEC 2025 3:53PM by PIB Delhi Neeraj Chopra and his wife, Himani Mor met the Prime Minister, Shri Narendra Modi at 7, Lok Kalyan Marg, New Delhi, today. \"We had a great interaction on various issues including sports of course!\", Shri Modi stated. The Prime Minister posted on X: \"Met Neeraj Chopra and his wife, Himani Mor at 7, Lok Kalyan Marg earlier today. We had a great interaction on various issues including sports of course!\" @Neeraj_chopra1 Met Neeraj Chopra and his wife, Himani Mor at 7, Lok Kalyan Marg earlier today. We had a great interaction on various issues including sports of course! @Neeraj_chopra1 pic.twitter.com/YYQjV324aV — Narendra Modi (@narendramodi) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207727) आगंतुक पटल  : 414 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Punjabi , Urdu , हिन्दी , Marathi , Assamese , Bengali , Gujarati , Tamil , Telugu , Kannada , Malayalam Prime Minister's Office Neeraj Chopra meets the Prime Minister प्रविष्टि तिथि:\r\n                        23 DEC 2025 3:53PM by PIB Delhi Neeraj Chopra and his wife, Himani Mor met the Prime Minister, Shri Narendra Modi at 7, Lok Kalyan Marg, New Delhi, today. \"We had a great interaction on various issues including sports of course!\", Shri Modi stated. The Prime Minister posted on X: \"Met Neeraj Chopra and his wife, Himani Mor at 7, Lok Kalyan Marg earlier today. We had a great interaction on various issues including sports of course!\" @Neeraj_chopra1 Met Neeraj Chopra and his wife, Himani Mor at 7, Lok Kalyan Marg earlier today. We had a great interaction on various issues including sports of course! @Neeraj_chopra1 pic.twitter.com/YYQjV324aV — Narendra Modi (@narendramodi) December 23, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2207727)",
    "scraped_at": "2025-12-23T17:42:41.114655"
  },
  {
    "id": "2207840",
    "ministry": "Ministry of Agriculture &\r\nFarmers Welfare",
    "title": "Union Agriculture Minister Shri Shivraj Singh Chouhan participates in Farmers’ Conference at Nagaur, Rajasthan",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207840",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Agriculture &\r\nFarmers Welfare Union Agriculture Minister Shri Shivraj Singh Chouhan participates in Farmers’ Conference at Nagaur, Rajasthan “Viksit Bharat – G Ram G will transform India’s villages” — Shri Chouhan Union Minister Shri Chouhan says conspiracy is being hatched to intimidate workers and spread misinformation Union Minister Shri Shivraj Singh hands over sanction letter of over ₹2,000 crore under Pradhan Mantri Gram Sadak Yojana to Rajasthan Chief Minister Shri Bhajanlal Sharma Allocation of ₹100 crore to 18,500 beneficiaries under Pradhan Mantri Awas Yojana (Gramin) Over ₹187 crore transferred through DBT into bank accounts of 35,800 farmers of Rajasthan Over ₹617 crore of agricultural input subsidy transferred directly into bank accounts of more than 5 lakh farmers for disaster management and civil security ₹151 crore transferred into bank accounts of 5 lakh milk producers of the state Financial assistance of ₹1.20 lakh provided to low-income and economically weaker rural families for construction of permanent houses and basic amenities प्रविष्टि तिथि:\r\n                23 DEC 2025 6:39PM by PIB Delhi Union Minister for Agriculture and Farmers’ Welfare, and Rural Development, Shri Shivraj Singh Chouhan today transferred financial assistance under various schemes into the bank accounts of farmers during a massive Farmers’ Conference held at Merta City in Nagaur district of Rajasthan. On the occasion, Rajasthan Chief Minister Shri Bhajanlal Sharma, Rajasthan Agriculture Minister Dr. Kirodi Lal Meena, Social Justice and Empowerment Minister Shri Avinash, Minister of State for Revenue Shri Vijay Singh, Chairman of the Farmers’ Commission Shri C. R. Chaudhary, Member of Parliament Ms. Mahima Kumari, and MLA Shri Laxman Ram Ji Kalaru were also present. Addressing the conference, the Union Agriculture Minister said that Rajasthan has created a new history of development over the past two years. He said that an amount of ₹2,089 crore has been released today for the construction of 12,600 roads in the state. Under the leadership of Prime Minister Shri Narendra Modi, a new India is emerging. He said that the nation is moving rapidly towards building a glorious, prosperous, wealthy, strong, developed and self-reliant India (Atmanirbhar Bharat). Shri Chouhan said that the agricultural sector in Rajasthan is witnessing rapid development. High-yielding, climate-resilient new varieties of seeds have been developed at a fast pace in the state. At the same time, significant progress has also been made in reducing the cost of production. Praising the efforts of the state government, the Union Minister said that under the Pradhan Mantri Fasal Bima Yojana, the state government has provided an additional amount of ₹3,000 along with ₹6,000. Farmers have benefited from this total assistance of ₹9,000, which has helped reduce the cost of agricultural production. Shri Shivraj Singh said that over the past two years, under the leadership of Prime Minister Shri Narendra Modi, Rajasthan has received ₹29,000 crore under the Pradhan Mantri Fasal Bima Yojana. He said efforts have also been made to remove shortcomings in the crop insurance scheme. A provision has been made to ensure that if insurance companies delay claim settlements, they will have to pay 12 per cent interest directly into farmers’ bank accounts. The Union Agriculture Minister also referred to the Minimum Support Price (MSP) and said that under the leadership of the Prime Minister, MSP has been doubled. This year, the central government has approved the procurement of approximately 3.05 lakh metric tonnes of moong worth nearly ₹2,680 crore from Rajasthan. He said that procurement of 5.54 lakh metric tonnes of groundnut will also be undertaken, and procurement of 2.65 lakh metric tonnes of soybean is currently underway. He assured that whenever required, the central government will ensure fair prices for farmers and will not allow any shortfall in MSP procurement. Union Minister Shri Chouhan also spoke about the newly enacted ‘Viksit Bharat – G Ram G’ law and said that the opposition is indulging in baseless criticism of it. He said the reality is that this law will transform India’s villages. Under the leadership of the Prime Minister, an excellent scheme has been formulated, giving equal importance to the welfare of workers and the well-being of farmers. He said that under the new law, the number of employment days has been increased from 100 to 125 days. Shri Chouhan said that a conspiracy is being hatched to intimidate workers and spread confusion. He stated that during the earlier UPA period, more than ₹40,000 crore allocated for MGNREGA remained unspent, whereas under the leadership of Prime Minister Shri Narendra Modi, expenditure under MGNREGA has reached up to ₹1.11 lakh crore annually. For the current year, the proposed budget allocation for the scheme is approximately ₹1,51,282 crore. The Union Minister said that Gram Panchayats have been given a major role under the new law, which is why the term ‘Viksit Bharat’ has been added to its name. Gram Panchayats will now prepare development plans for their villages. Under this scheme, villages will be developed as poverty-free and employment-oriented. The people of the villages themselves will decide the development roadmap. Over a period of five years, around ₹7.5 lakh will be spent per village under this scheme. He said that water conservation works have been given priority under this scheme. An important provision has also been included to ensure that if workers are not paid their wages on time, interest will also have to be paid. Administrative expenditure has been increased from 6 per cent to 9 per cent to ensure timely payment of salaries to employment assistants, panchayat secretaries, technical assistants and other staff. An amount of ₹13,000 crore will be spent annually under this head. The Union Minister said that the scheme has also been designed keeping in mind labour requirements during harvesting, sowing and peak agricultural seasons. Union Agriculture Minister Shri Shivraj Singh Chouhan further said that there are plans to introduce two more important Bills in the next session of Parliament, including a Seed Act and a Bill to prevent the use of fake fertilisers and spurious manure. He also said that stringent penalties will be imposed on those who dupe farmers. ***** RC/AR (रिलीज़ आईडी: 2207840) आगंतुक पटल  : 206 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati , Odia Ministry of Agriculture &\r\nFarmers Welfare Union Agriculture Minister Shri Shivraj Singh Chouhan participates in Farmers’ Conference at Nagaur, Rajasthan “Viksit Bharat – G Ram G will transform India’s villages” — Shri Chouhan Union Minister Shri Chouhan says conspiracy is being hatched to intimidate workers and spread misinformation Union Minister Shri Shivraj Singh hands over sanction letter of over ₹2,000 crore under Pradhan Mantri Gram Sadak Yojana to Rajasthan Chief Minister Shri Bhajanlal Sharma Allocation of ₹100 crore to 18,500 beneficiaries under Pradhan Mantri Awas Yojana (Gramin) Over ₹187 crore transferred through DBT into bank accounts of 35,800 farmers of Rajasthan Over ₹617 crore of agricultural input subsidy transferred directly into bank accounts of more than 5 lakh farmers for disaster management and civil security ₹151 crore transferred into bank accounts of 5 lakh milk producers of the state Financial assistance of ₹1.20 lakh provided to low-income and economically weaker rural families for construction of permanent houses and basic amenities प्रविष्टि तिथि:\r\n                        23 DEC 2025 6:39PM by PIB Delhi Union Minister for Agriculture and Farmers’ Welfare, and Rural Development, Shri Shivraj Singh Chouhan today transferred financial assistance under various schemes into the bank accounts of farmers during a massive Farmers’ Conference held at Merta City in Nagaur district of Rajasthan. On the occasion, Rajasthan Chief Minister Shri Bhajanlal Sharma, Rajasthan Agriculture Minister Dr. Kirodi Lal Meena, Social Justice and Empowerment Minister Shri Avinash, Minister of State for Revenue Shri Vijay Singh, Chairman of the Farmers’ Commission Shri C. R. Chaudhary, Member of Parliament Ms. Mahima Kumari, and MLA Shri Laxman Ram Ji Kalaru were also present. Addressing the conference, the Union Agriculture Minister said that Rajasthan has created a new history of development over the past two years. He said that an amount of ₹2,089 crore has been released today for the construction of 12,600 roads in the state. Under the leadership of Prime Minister Shri Narendra Modi, a new India is emerging. He said that the nation is moving rapidly towards building a glorious, prosperous, wealthy, strong, developed and self-reliant India (Atmanirbhar Bharat). Shri Chouhan said that the agricultural sector in Rajasthan is witnessing rapid development. High-yielding, climate-resilient new varieties of seeds have been developed at a fast pace in the state. At the same time, significant progress has also been made in reducing the cost of production. Praising the efforts of the state government, the Union Minister said that under the Pradhan Mantri Fasal Bima Yojana, the state government has provided an additional amount of ₹3,000 along with ₹6,000. Farmers have benefited from this total assistance of ₹9,000, which has helped reduce the cost of agricultural production. Shri Shivraj Singh said that over the past two years, under the leadership of Prime Minister Shri Narendra Modi, Rajasthan has received ₹29,000 crore under the Pradhan Mantri Fasal Bima Yojana. He said efforts have also been made to remove shortcomings in the crop insurance scheme. A provision has been made to ensure that if insurance companies delay claim settlements, they will have to pay 12 per cent interest directly into farmers’ bank accounts. The Union Agriculture Minister also referred to the Minimum Support Price (MSP) and said that under the leadership of the Prime Minister, MSP has been doubled. This year, the central government has approved the procurement of approximately 3.05 lakh metric tonnes of moong worth nearly ₹2,680 crore from Rajasthan. He said that procurement of 5.54 lakh metric tonnes of groundnut will also be undertaken, and procurement of 2.65 lakh metric tonnes of soybean is currently underway. He assured that whenever required, the central government will ensure fair prices for farmers and will not allow any shortfall in MSP procurement. Union Minister Shri Chouhan also spoke about the newly enacted ‘Viksit Bharat – G Ram G’ law and said that the opposition is indulging in baseless criticism of it. He said the reality is that this law will transform India’s villages. Under the leadership of the Prime Minister, an excellent scheme has been formulated, giving equal importance to the welfare of workers and the well-being of farmers. He said that under the new law, the number of employment days has been increased from 100 to 125 days. Shri Chouhan said that a conspiracy is being hatched to intimidate workers and spread confusion. He stated that during the earlier UPA period, more than ₹40,000 crore allocated for MGNREGA remained unspent, whereas under the leadership of Prime Minister Shri Narendra Modi, expenditure under MGNREGA has reached up to ₹1.11 lakh crore annually. For the current year, the proposed budget allocation for the scheme is approximately ₹1,51,282 crore. The Union Minister said that Gram Panchayats have been given a major role under the new law, which is why the term ‘Viksit Bharat’ has been added to its name. Gram Panchayats will now prepare development plans for their villages. Under this scheme, villages will be developed as poverty-free and employment-oriented. The people of the villages themselves will decide the development roadmap. Over a period of five years, around ₹7.5 lakh will be spent per village under this scheme. He said that water conservation works have been given priority under this scheme. An important provision has also been included to ensure that if workers are not paid their wages on time, interest will also have to be paid. Administrative expenditure has been increased from 6 per cent to 9 per cent to ensure timely payment of salaries to employment assistants, panchayat secretaries, technical assistants and other staff. An amount of ₹13,000 crore will be spent annually under this head. The Union Minister said that the scheme has also been designed keeping in mind labour requirements during harvesting, sowing and peak agricultural seasons. Union Agriculture Minister Shri Shivraj Singh Chouhan further said that there are plans to introduce two more important Bills in the next session of Parliament, including a Seed Act and a Bill to prevent the use of fake fertilisers and spurious manure. He also said that stringent penalties will be imposed on those who dupe farmers. ***** RC/AR (रिलीज़ आईडी: 2207840)",
    "scraped_at": "2025-12-23T17:42:42.854801"
  },
  {
    "id": "2207948",
    "ministry": "Ministry of Coal",
    "title": "Union Minister G Kishan Reddy Inaugurates, Center of Excellence and Virtual Reality Mine Simulator at IIT (ISM) Dhanbad",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207948",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Coal Union Minister G Kishan Reddy Inaugurates, Center of Excellence and Virtual Reality Mine Simulator at IIT (ISM) Dhanbad Minister Interacts with Students of IIT (ISM) Dhanbad; Discusses Innovation and Sustainability प्रविष्टि तिथि:\r\n                23 DEC 2025 9:33PM by PIB Delhi Union Minister of Coal and Mines Shri G Kishan Reddy, who is on a two day visit to Jharkhand, today inaugurated the Center of Excellence under National Critical Minerals Mission hosted in IIT (ISM) Dhanbad. Minister Shri Reddy also inaugurated the Virtual Reality Mine Simulator (VRMS). Shri Reddy interacted with the students of IIT (ISM) Dhanbad, which turned into a candid exchange of ideas. The CoE inaugurated by the minister will act as a national anchor for research and industry scale solutions in critical minerals, focusing in areas of exploration, extraction, processing, recycling, reuse and waste-to-wealth for critical minerals. The CoE will partner with industry leaders and international universities such as University of Cambridge & St Petersburg University and will receive infrastructure support from IIT Gandhinagar, IIT BHU and CPI(UK). Developed by IIT (ISM) Dhanbad, in collaboration with Coal India Limited and its subsidiaries Northern Coalfields Limited and Eastern Coalfields Limited, VRMS is India’s first VR based mine simulator for coal mining safety and productivity. Equipped with a 360-degree immersive virtual reality theatre, the VRMS uses real mine data and provides more than 20 training modules covering heavy equipment operation and critical safety SOPs. The VRMS will provide scenario based assessment and certification for all levels of employees, from operators to senior managers and is expected to cut training time by half, while ensuring improved safety preparedness. In a warm and informal interaction, the Minister spent time with students and young researchers of IIT (ISM) Dhanbad at RD Chowk, a popular and age-old meeting point for students that has long been part of campus life and culture. Over a cup of tea, the interaction moved beyond formalities, creating an open environment for candid conversations and free exchange of ideas. Students shared their academic journeys, research interests and career aspirations, while discussions touched upon the evolving role of technology and innovation in mining, opportunities in critical minerals, sustainability and clean energy, and the need for research-driven, indigenous solutions. The Minister encouraged students to think beyond conventional roles and view themselves as contributors to national development and problem-solvers for the mining and energy sectors. Emphasising the importance of staying connected with young minds, the Minister reiterated that India’s future in strategic sectors will be shaped by curious, confident and innovation-driven youth. The interaction symbolised a leadership approach rooted in accessibility, dialogue and trust, reinforcing the belief that meaningful progress emerges when governance engages directly with the aspirations of the next generation. Earlier in his address, Shri G Kishan Reddy underscored the institution’s pivotal role in shaping India’s mining future through knowledge creation, research, and innovation. He stated that Indian School of Mines (ISM) is not only a premier institute for producing skilled mining professionals but also a cradle of innovation and new technological vision for the sector. Shri Reddy, further stated that the mining sector is presently at a historic juncture, where technology, critical minerals, sustainability and national security are collectively driving the vision of Aatmanirbhar Bharat. He noted that under the visionary leadership of Prime Minister Shri Narendra Modi, every sector of the economy is witnessing a strong push towards information technology, innovation and research-driven growth. Highlighting the Central Government’s emphasis on research and development, he pointed out that India has significantly increased its national R&D investment, emerged as the world’s sixth-highest country in patent filings, and witnessed rapid expansion of its deep-tech and innovation ecosystem. The Minister highlighted the  initiatives like Coal SETU, the Koyla Shakti Dashboard and Integrated Command & Control Systems, which are leveraging information technology to enable real-time monitoring, improve efficiency, and strengthen transparency and safety in the mining sector. ***** Shuhaib T (रिलीज़ आईडी: 2207948) आगंतुक पटल  : 111 Ministry of Coal Union Minister G Kishan Reddy Inaugurates, Center of Excellence and Virtual Reality Mine Simulator at IIT (ISM) Dhanbad Minister Interacts with Students of IIT (ISM) Dhanbad; Discusses Innovation and Sustainability प्रविष्टि तिथि:\r\n                        23 DEC 2025 9:33PM by PIB Delhi Union Minister of Coal and Mines Shri G Kishan Reddy, who is on a two day visit to Jharkhand, today inaugurated the Center of Excellence under National Critical Minerals Mission hosted in IIT (ISM) Dhanbad. Minister Shri Reddy also inaugurated the Virtual Reality Mine Simulator (VRMS). Shri Reddy interacted with the students of IIT (ISM) Dhanbad, which turned into a candid exchange of ideas. The CoE inaugurated by the minister will act as a national anchor for research and industry scale solutions in critical minerals, focusing in areas of exploration, extraction, processing, recycling, reuse and waste-to-wealth for critical minerals. The CoE will partner with industry leaders and international universities such as University of Cambridge & St Petersburg University and will receive infrastructure support from IIT Gandhinagar, IIT BHU and CPI(UK). Developed by IIT (ISM) Dhanbad, in collaboration with Coal India Limited and its subsidiaries Northern Coalfields Limited and Eastern Coalfields Limited, VRMS is India’s first VR based mine simulator for coal mining safety and productivity. Equipped with a 360-degree immersive virtual reality theatre, the VRMS uses real mine data and provides more than 20 training modules covering heavy equipment operation and critical safety SOPs. The VRMS will provide scenario based assessment and certification for all levels of employees, from operators to senior managers and is expected to cut training time by half, while ensuring improved safety preparedness. In a warm and informal interaction, the Minister spent time with students and young researchers of IIT (ISM) Dhanbad at RD Chowk, a popular and age-old meeting point for students that has long been part of campus life and culture. Over a cup of tea, the interaction moved beyond formalities, creating an open environment for candid conversations and free exchange of ideas. Students shared their academic journeys, research interests and career aspirations, while discussions touched upon the evolving role of technology and innovation in mining, opportunities in critical minerals, sustainability and clean energy, and the need for research-driven, indigenous solutions. The Minister encouraged students to think beyond conventional roles and view themselves as contributors to national development and problem-solvers for the mining and energy sectors. Emphasising the importance of staying connected with young minds, the Minister reiterated that India’s future in strategic sectors will be shaped by curious, confident and innovation-driven youth. The interaction symbolised a leadership approach rooted in accessibility, dialogue and trust, reinforcing the belief that meaningful progress emerges when governance engages directly with the aspirations of the next generation. Earlier in his address, Shri G Kishan Reddy underscored the institution’s pivotal role in shaping India’s mining future through knowledge creation, research, and innovation. He stated that Indian School of Mines (ISM) is not only a premier institute for producing skilled mining professionals but also a cradle of innovation and new technological vision for the sector. Shri Reddy, further stated that the mining sector is presently at a historic juncture, where technology, critical minerals, sustainability and national security are collectively driving the vision of Aatmanirbhar Bharat. He noted that under the visionary leadership of Prime Minister Shri Narendra Modi, every sector of the economy is witnessing a strong push towards information technology, innovation and research-driven growth. Highlighting the Central Government’s emphasis on research and development, he pointed out that India has significantly increased its national R&D investment, emerged as the world’s sixth-highest country in patent filings, and witnessed rapid expansion of its deep-tech and innovation ecosystem. The Minister highlighted the  initiatives like Coal SETU, the Koyla Shakti Dashboard and Integrated Command & Control Systems, which are leveraging information technology to enable real-time monitoring, improve efficiency, and strengthen transparency and safety in the mining sector. ***** Shuhaib T (रिलीज़ आईडी: 2207948)",
    "scraped_at": "2025-12-23T17:42:44.933606"
  },
  {
    "id": "2207831",
    "ministry": "Ministry of Coal",
    "title": "Encouraging Participation witnessed in 14th Round of Commercial Coal Blocks Auction; 49 bids received for 24 Coal Blocks",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207831",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Coal Encouraging Participation witnessed in 14th Round of Commercial Coal Blocks Auction; 49 bids received for 24 Coal Blocks प्रविष्टि तिथि:\r\n                23 DEC 2025 6:14PM by PIB Delhi The Nominated Authority, Ministry of Coal, today opened the bids for the 14th round of Commercial Coal Blocks’ Auction, witnessing encouraging participation from industry stakeholders. Bids were received for 24 coal blocks out of the 41 blocks offered in this round, reflecting sustained industry interest in India’s commercial coal mining framework. The online bids were decrypted and opened electronically in the presence of the bidders. Subsequently, sealed envelopes containing offline bid documents were also opened in the presence of bidders.  The Entire process was displayed lived on the screen for the bidders, ensuring complete transparency. Under this round, 49 bids have been received against 24 coal blocks out of 41 coal blocks. A total of 11 companies participated in the auction process, including five new entrants bidding for the first time under the commercial coal mining regime. The participation of new companies in commercial coal block auctions highlights growing confidence in the policy framework and the expanding opportunities within India’s coal sector. The coal sector remains a key driver of economic momentum as India advances towards becoming the world’s third-largest economy. The bids will now be evaluated by a multi-disciplinary Technical Evaluation Committee. Technically Qualified Bidders will be shortlisted for participation in the electronic auction to be conducted on the MSTC portal. The continued response to commercial coal block auctions underscores the coal sector’s pivotal role in supporting industrial growth, strengthening energy security, and contributing to India’s journey towards becoming the world’s third-largest economy. **** Shuhaib T (रिलीज़ आईडी: 2207831) आगंतुक पटल  : 190 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati Ministry of Coal Encouraging Participation witnessed in 14th Round of Commercial Coal Blocks Auction; 49 bids received for 24 Coal Blocks प्रविष्टि तिथि:\r\n                        23 DEC 2025 6:14PM by PIB Delhi The Nominated Authority, Ministry of Coal, today opened the bids for the 14th round of Commercial Coal Blocks’ Auction, witnessing encouraging participation from industry stakeholders. Bids were received for 24 coal blocks out of the 41 blocks offered in this round, reflecting sustained industry interest in India’s commercial coal mining framework. The online bids were decrypted and opened electronically in the presence of the bidders. Subsequently, sealed envelopes containing offline bid documents were also opened in the presence of bidders.  The Entire process was displayed lived on the screen for the bidders, ensuring complete transparency. Under this round, 49 bids have been received against 24 coal blocks out of 41 coal blocks. A total of 11 companies participated in the auction process, including five new entrants bidding for the first time under the commercial coal mining regime. The participation of new companies in commercial coal block auctions highlights growing confidence in the policy framework and the expanding opportunities within India’s coal sector. The coal sector remains a key driver of economic momentum as India advances towards becoming the world’s third-largest economy. The bids will now be evaluated by a multi-disciplinary Technical Evaluation Committee. Technically Qualified Bidders will be shortlisted for participation in the electronic auction to be conducted on the MSTC portal. The continued response to commercial coal block auctions underscores the coal sector’s pivotal role in supporting industrial growth, strengthening energy security, and contributing to India’s journey towards becoming the world’s third-largest economy. **** Shuhaib T (रिलीज़ आईडी: 2207831)",
    "scraped_at": "2025-12-23T17:42:46.995849"
  },
  {
    "id": "2207801",
    "ministry": "Ministry of Communications",
    "title": "Carrying Faith Across the Nation, the Department of Posts Transports a Priceless Thanjavur Masterpiece of The Divine Shri Ram from Bengaluru to Ayodhya",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207801",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Communications Carrying Faith Across the Nation, the Department of Posts Transports a Priceless Thanjavur Masterpiece of The Divine Shri Ram from Bengaluru to Ayodhya प्रविष्टि तिथि:\r\n                23 DEC 2025 5:45PM by PIB Delhi In a remarkable demonstration of specialized and precision logistics, Department of Posts successfully undertook the transmission of a priceless Thanjavur art of the divine Shri Ram from Bengaluru to Ayodhya using its Logistics Post service. Installation of Thanjavur art at Shri Ram Janmabhoomi Teerath Kshetra, Ayodhya. The painting, created in the traditional Thanjavur art style with a gold base embedded with precious and semi-precious stones, is a priceless cultural artefact of exceptional artistic and heritage value. The sacred artwork was donated by Smt. Jayashree Phaneesh of Bengaluru to Shri Ram Janmabhoomi Teerth Kshetra, Ayodhya. The large-format painting, measuring 12 feet by 8 feet and weighing nearly 800 kilograms, was professionally packed in a specially designed wooden crate with multi-layer bubble wrapping to ensure maximum protection. The consignment was transported under continuous supervision, with departmental officials escorting the vehicle throughout the journey. The vehicle carrying the artwork departed from Bengaluru on 17 December 2025 and, after covering approximately 1,900 kilometers, safely reached Ayodhya on 22 December 2025. Loading and unloading operations were executed with extreme care using cranes and specialized restraints. This mission marks a first-of-its-kind high-value Logistics Post consignment, executed through close coordination among multiple postal circles, including Karnataka, Telangana, Maharashtra, Madhya Pradesh, and Uttar Pradesh. Divisional Heads and senior postal officers closely monitored the movement along the route—Bengaluru–Hyderabad–Nagpur–Jabalpur–Rewa–Prayagraj–Ayodhya. Despite dense fog conditions during the final leg of the journey, the consignment was handled with utmost care and delivered safely and seamlessly. Upon arrival, the painting was formally handed over and installed at Shri Ram Janmabhoomi Teerth Kshetra in the presence of Shri Champat Rai, General Secretary. This successful operation underscores India Post’s growing capabilities in handling specialised, high-value logistics, reaffirming its commitment to reliability, security, and service excellence in support of national heritage and cultural preservation. https://www.instagram.com/reel/DSmn5lxkhPW/?igsh=YzdoZjVhbnJhbGFu ***** MI/ARJ (रिलीज़ आईडी: 2207801) आगंतुक पटल  : 262 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Communications Carrying Faith Across the Nation, the Department of Posts Transports a Priceless Thanjavur Masterpiece of The Divine Shri Ram from Bengaluru to Ayodhya प्रविष्टि तिथि:\r\n                        23 DEC 2025 5:45PM by PIB Delhi In a remarkable demonstration of specialized and precision logistics, Department of Posts successfully undertook the transmission of a priceless Thanjavur art of the divine Shri Ram from Bengaluru to Ayodhya using its Logistics Post service. Installation of Thanjavur art at Shri Ram Janmabhoomi Teerath Kshetra, Ayodhya. The painting, created in the traditional Thanjavur art style with a gold base embedded with precious and semi-precious stones, is a priceless cultural artefact of exceptional artistic and heritage value. The sacred artwork was donated by Smt. Jayashree Phaneesh of Bengaluru to Shri Ram Janmabhoomi Teerth Kshetra, Ayodhya. The large-format painting, measuring 12 feet by 8 feet and weighing nearly 800 kilograms, was professionally packed in a specially designed wooden crate with multi-layer bubble wrapping to ensure maximum protection. The consignment was transported under continuous supervision, with departmental officials escorting the vehicle throughout the journey. The vehicle carrying the artwork departed from Bengaluru on 17 December 2025 and, after covering approximately 1,900 kilometers, safely reached Ayodhya on 22 December 2025. Loading and unloading operations were executed with extreme care using cranes and specialized restraints. This mission marks a first-of-its-kind high-value Logistics Post consignment, executed through close coordination among multiple postal circles, including Karnataka, Telangana, Maharashtra, Madhya Pradesh, and Uttar Pradesh. Divisional Heads and senior postal officers closely monitored the movement along the route—Bengaluru–Hyderabad–Nagpur–Jabalpur–Rewa–Prayagraj–Ayodhya. Despite dense fog conditions during the final leg of the journey, the consignment was handled with utmost care and delivered safely and seamlessly. Upon arrival, the painting was formally handed over and installed at Shri Ram Janmabhoomi Teerth Kshetra in the presence of Shri Champat Rai, General Secretary. This successful operation underscores India Post’s growing capabilities in handling specialised, high-value logistics, reaffirming its commitment to reliability, security, and service excellence in support of national heritage and cultural preservation. https://www.instagram.com/reel/DSmn5lxkhPW/?igsh=YzdoZjVhbnJhbGFu ***** MI/ARJ (रिलीज़ आईडी: 2207801)",
    "scraped_at": "2025-12-23T17:42:49.290904"
  },
  {
    "id": "2207783",
    "ministry": "Ministry of Communications",
    "title": "Minister of State for Communications Dr Pemmasani Chandra Sekhar Reviews Performance of all Postal Circles to Drive Modernisation",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207783",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Communications Minister of State for Communications Dr Pemmasani Chandra Sekhar Reviews Performance of all Postal Circles to Drive Modernisation Advises DoP to Focus on Delivery, Financial Inclusion and Revenue Discipline Citizen Service and Revenue Sustainability Must Go Hand in Hand: MoS Dr. Pemmasani Chandra Sekhar Advises India Post to Drive Strategic Business Growth and Strengthen Regional Outreach Monthly Review of Postal Circles Focuses on Efficiency, Financial Inclusion, and Tech-Driven Reforms India Post’s Network to Serve 1.4 Billion Citizens with Optimised Resources and Future-Ready Services प्रविष्टि तिथि:\r\n                23 DEC 2025 5:17PM by PIB Delhi Dr. Pemmasani Chandra Sekhar, Minister of State for Communications and Rural Development, has directed India Post to adopt a proactive and strategic approach to business growth, including reaching out to businesses and entities contributing high GST. He also advocated establishing Dedicated Marketing Executive teams in every Circle to monitor leads, conversions, and revenue daily, and called on Circle heads to leverage regional strengths—aligned with local geography, industry presence, and business potential—to implement customized growth strategies. The Minister of State has been holding monthly review meetings to closely track the performance of major Postal Circles. These meetings, part of the quarterly monitoring framework laid down by Communications Minister Shri Jyotiraditya Scindia are personally led by Dr. Chandra Sekhar each month to ensure more frequent oversight. The reviews aim to identify issues early, enable quick course corrections, and ensure India Post consistently meets its service and performance goals. Covering all 24 Postal Circles, the discussions focused on operational efficiency, financial inclusion, logistics expansion, and tech-driven reforms aligned with Prime Minister Shri Narendra Modi vision of Viksit Bharat. Highlighting India Post’s unmatched network, the Minister of State called for optimal utilisation of resources to strengthen delivery services and expand savings and insurance coverage, supporting the nation’s logistics needs. He also directed that all performance metrics—mail and parcel operations, savings, and insurance—must balance public welfare and financial prudence. The Minister of State commended Karnataka Circle for strong grassroots performance and successful acquisition of new customers and markets. He also lauded the Northeastern Circle for opening 1.54 lakh new savings accounts, mobilizing ₹276 crore under PLI/RPLI, and implementing structured MSME outreach. Dr. Pemmasani reiterated that serving over 1.4 billion citizens through the postal network is both a responsibility and an opportunity, emphasizing that efficient services, digital integrity, and financial prudence are central to making India Post a self-reliant, future-ready institution. **** MI/ ARJ (रिलीज़ आईडी: 2207783) आगंतुक पटल  : 188 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Tamil Ministry of Communications Minister of State for Communications Dr Pemmasani Chandra Sekhar Reviews Performance of all Postal Circles to Drive Modernisation Advises DoP to Focus on Delivery, Financial Inclusion and Revenue Discipline Citizen Service and Revenue Sustainability Must Go Hand in Hand: MoS Dr. Pemmasani Chandra Sekhar Advises India Post to Drive Strategic Business Growth and Strengthen Regional Outreach Monthly Review of Postal Circles Focuses on Efficiency, Financial Inclusion, and Tech-Driven Reforms India Post’s Network to Serve 1.4 Billion Citizens with Optimised Resources and Future-Ready Services प्रविष्टि तिथि:\r\n                        23 DEC 2025 5:17PM by PIB Delhi Dr. Pemmasani Chandra Sekhar, Minister of State for Communications and Rural Development, has directed India Post to adopt a proactive and strategic approach to business growth, including reaching out to businesses and entities contributing high GST. He also advocated establishing Dedicated Marketing Executive teams in every Circle to monitor leads, conversions, and revenue daily, and called on Circle heads to leverage regional strengths—aligned with local geography, industry presence, and business potential—to implement customized growth strategies. The Minister of State has been holding monthly review meetings to closely track the performance of major Postal Circles. These meetings, part of the quarterly monitoring framework laid down by Communications Minister Shri Jyotiraditya Scindia are personally led by Dr. Chandra Sekhar each month to ensure more frequent oversight. The reviews aim to identify issues early, enable quick course corrections, and ensure India Post consistently meets its service and performance goals. Covering all 24 Postal Circles, the discussions focused on operational efficiency, financial inclusion, logistics expansion, and tech-driven reforms aligned with Prime Minister Shri Narendra Modi vision of Viksit Bharat. Highlighting India Post’s unmatched network, the Minister of State called for optimal utilisation of resources to strengthen delivery services and expand savings and insurance coverage, supporting the nation’s logistics needs. He also directed that all performance metrics—mail and parcel operations, savings, and insurance—must balance public welfare and financial prudence. The Minister of State commended Karnataka Circle for strong grassroots performance and successful acquisition of new customers and markets. He also lauded the Northeastern Circle for opening 1.54 lakh new savings accounts, mobilizing ₹276 crore under PLI/RPLI, and implementing structured MSME outreach. Dr. Pemmasani reiterated that serving over 1.4 billion citizens through the postal network is both a responsibility and an opportunity, emphasizing that efficient services, digital integrity, and financial prudence are central to making India Post a self-reliant, future-ready institution. **** MI/ ARJ (रिलीज़ आईडी: 2207783)",
    "scraped_at": "2025-12-23T17:42:51.111161"
  },
  {
    "id": "2207769",
    "ministry": "Ministry of Cooperation",
    "title": "Union Minister of Home Affairs and Cooperation Shri Amit Shah to address the National Cooperative Conference organized by KRIBHCO in Panchkula",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207769",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Cooperation Union Minister of Home Affairs and Cooperation Shri Amit Shah to address the National Cooperative Conference organized by KRIBHCO in Panchkula National deliberations on “Prosperity through Cooperation – Role of Cooperatives in Sustainable Agriculture” Deliberations to be held on sustainable agriculture, expansion of the role of PACS, income stability of small and marginal farmers, and climate change challenges for cooperative-based agricultural models E-inauguration of Milk Cooling Centre, Salempur (Bhiwani) Plant and HAFED Atta Mill at Jatusana (Rewari) प्रविष्टि तिथि:\r\n                23 DEC 2025 5:07PM by PIB Delhi Krishak Bharati Cooperative Limited (KRIBHCO) is organizing a National Cooperative Conference titled “Prosperity through Cooperation – Role of Cooperatives in Sustainable Agriculture” on 24 December 2025 at the Indradhanush Auditorium, Panchkula, Haryana, to deliberate on policy and implementation-related aspects with a view to promoting sustainable agriculture, expanding the role of Primary Agricultural Credit Societies (PACS), ensuring income stability of small and marginal farmers, and strengthening cooperative-based agricultural models in line with the challenges posed by climate change. Union Minister of Home Affairs and Cooperation Shri Amit Shah will be the Chief Guest of the conference. The conference is a significant initiative towards realizing the visionary concept of “Prosperity through Cooperation” of Hon’ble Prime Minister Shri Narendra Modi and, under the leadership of Hon’ble Union Minister of Home Affairs and Cooperation Shri Amit Shah, strengthening the cooperative model at the grassroots level to ensure prosperity of farmers. The Chief Minister of Haryana, Shri Nayab Singh Saini, will participate in the conference as a Special Guest. In addition, Union Ministers of State (Ministry of Cooperation) Shri Krishan Pal Gurjar and Shri Murlidhar Mohol, Haryana Minister of Cooperation Dr. Arvind Kumar Sharma, and Minister for Agriculture and Farmers’ Welfare Shri Shyam Singh Rana will also attend the conference. On this occasion, Union Minister of Home Affairs and Cooperation Shri Amit Shah will e-inaugurate the Milk Cooling Centre, Salempur (Bhiwani) Plant and the HAFED Atta Mill at Jatusana (Rewari). Union Minister will also distribute RuPay Platinum Debit Cards to beneficiaries of cooperative banks of the State of Haryana and will also distribute registration certificates to the Presidents of M-PACS established by Haryana KRIBHCO on this occasion. On this occasion, the Union Minister of Home Affairs and Cooperation will also inaugurate a portal showcasing various activities being undertaken during the International Year of Cooperatives (IYC). The conference will lay special emphasis on the exchange of advanced agricultural knowledge, availability of affordable credit, adoption of modern technologies, and delivery of organic and climate-resilient agricultural practices to farmers through the cooperative framework. The recent policy initiatives of the Ministry of Cooperation, strengthening of PACS, and the role of national cooperative institutions like KRIBHCO will also be discussed in detail during this conference. Senior officials from the Union Ministry of Cooperation, KRIBHCO, and the Government of Haryana, representatives of national and state-level cooperative institutions, Primary Agricultural Credit Societies (PACS), farmer organizations, and other key stakeholders will participate in the conference. KRIBHCO has, over the years, benefited millions of farmers across the country through fertilizer supply, agricultural advisory services, and farmer-centric initiatives. The National Conference being organized in Panchkula will prove to be an important step towards providing a new direction to the cooperative movement under the International Year of Cooperatives – 2025. **** AK (रिलीज़ आईडी: 2207769) आगंतुक पटल  : 277 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Punjabi , Gujarati , Kannada Ministry of Cooperation Union Minister of Home Affairs and Cooperation Shri Amit Shah to address the National Cooperative Conference organized by KRIBHCO in Panchkula National deliberations on “Prosperity through Cooperation – Role of Cooperatives in Sustainable Agriculture” Deliberations to be held on sustainable agriculture, expansion of the role of PACS, income stability of small and marginal farmers, and climate change challenges for cooperative-based agricultural models E-inauguration of Milk Cooling Centre, Salempur (Bhiwani) Plant and HAFED Atta Mill at Jatusana (Rewari) प्रविष्टि तिथि:\r\n                        23 DEC 2025 5:07PM by PIB Delhi Krishak Bharati Cooperative Limited (KRIBHCO) is organizing a National Cooperative Conference titled “Prosperity through Cooperation – Role of Cooperatives in Sustainable Agriculture” on 24 December 2025 at the Indradhanush Auditorium, Panchkula, Haryana, to deliberate on policy and implementation-related aspects with a view to promoting sustainable agriculture, expanding the role of Primary Agricultural Credit Societies (PACS), ensuring income stability of small and marginal farmers, and strengthening cooperative-based agricultural models in line with the challenges posed by climate change. Union Minister of Home Affairs and Cooperation Shri Amit Shah will be the Chief Guest of the conference. The conference is a significant initiative towards realizing the visionary concept of “Prosperity through Cooperation” of Hon’ble Prime Minister Shri Narendra Modi and, under the leadership of Hon’ble Union Minister of Home Affairs and Cooperation Shri Amit Shah, strengthening the cooperative model at the grassroots level to ensure prosperity of farmers. The Chief Minister of Haryana, Shri Nayab Singh Saini, will participate in the conference as a Special Guest. In addition, Union Ministers of State (Ministry of Cooperation) Shri Krishan Pal Gurjar and Shri Murlidhar Mohol, Haryana Minister of Cooperation Dr. Arvind Kumar Sharma, and Minister for Agriculture and Farmers’ Welfare Shri Shyam Singh Rana will also attend the conference. On this occasion, Union Minister of Home Affairs and Cooperation Shri Amit Shah will e-inaugurate the Milk Cooling Centre, Salempur (Bhiwani) Plant and the HAFED Atta Mill at Jatusana (Rewari). Union Minister will also distribute RuPay Platinum Debit Cards to beneficiaries of cooperative banks of the State of Haryana and will also distribute registration certificates to the Presidents of M-PACS established by Haryana KRIBHCO on this occasion. On this occasion, the Union Minister of Home Affairs and Cooperation will also inaugurate a portal showcasing various activities being undertaken during the International Year of Cooperatives (IYC). The conference will lay special emphasis on the exchange of advanced agricultural knowledge, availability of affordable credit, adoption of modern technologies, and delivery of organic and climate-resilient agricultural practices to farmers through the cooperative framework. The recent policy initiatives of the Ministry of Cooperation, strengthening of PACS, and the role of national cooperative institutions like KRIBHCO will also be discussed in detail during this conference. Senior officials from the Union Ministry of Cooperation, KRIBHCO, and the Government of Haryana, representatives of national and state-level cooperative institutions, Primary Agricultural Credit Societies (PACS), farmer organizations, and other key stakeholders will participate in the conference. KRIBHCO has, over the years, benefited millions of farmers across the country through fertilizer supply, agricultural advisory services, and farmer-centric initiatives. The National Conference being organized in Panchkula will prove to be an important step towards providing a new direction to the cooperative movement under the International Year of Cooperatives – 2025. **** AK (रिलीज़ आईडी: 2207769)",
    "scraped_at": "2025-12-23T17:42:52.916670"
  },
  {
    "id": "2207878",
    "ministry": "Ministry of Earth Sciences",
    "title": "Year-End Review",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207878",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Earth Sciences Year-End Review Exploring Extremes: A Landmark Year of Discoveries by India’s Ministry of Earth Sciences प्रविष्टि तिथि:\r\n                23 DEC 2025 7:51PM by PIB Delhi It has been a year of \"firsts\" for Indian science. From the successful trial of a deep-sea mining system at a staggering depth of 5,270 meters to the launch of a revolutionary weather mission, the Ministry of Earth Sciences (MoES) has spent 2025 turning ambitious blueprints into reality. As the year draws to a close, the Ministry’s latest report shows more than just technical milestones—it highlights a direct impact on the lives of millions. The Human Impact: Science that Pays Back For the first time, a third-party audit has quantified the value of India's meteorological investments. While the government spent roughly ₹1,000 crore on the Monsoon Mission and high-performance computing, the return has been a massive ₹50,000 crore in economic benefits. These gains directly supported nearly 11 million families living below the poverty line, specifically small-scale farmers and fisherfolk who rely on the Ministry’s daily weather and ocean alerts to protect their livelihoods. Breaking Records in the Deep & Dark India’s quest for resource self-reliance reached the ocean floor this year. Deep Sea Mining: India became a global leader in deep-sea technology by successfully testing a mining system at 5,270 meters—the deepest such test ever recorded. The \"Samudrayaan\" Mission: The human submersible MATSYA cpassed its comfort and stability tests with flying colors. In a separate historic dive, Indian scientists reached depths of 5,002 meters during a collaborative mission in the Atlantic, a new benchmark for Indian oceanography. Protecting Our Coasts and Islands The Ministry isn't just looking at the horizon; it’s looking at our shores. Clean Water for Lakshadweep: Three new eco-friendly desalination plants were commissioned, bringing fresh drinking water to the islands. Coastal Guardians: Two new research vessels, Sagar Tara and Sagar Anveshika, were built right here in India under the ‘Make in India’ initiative to monitor our ocean health. Safety First: The Tsunami Early Warning Centre monitored 32 major earthquakes this year, ensuring that not a single threat to Indian shores went unnoticed. A Vision for the Next Century On January 14, Prime Minister Sri Narendra Modi set the tone for the future by launching Mission Mausam and the IMD Vision 2047. To support these goals, the Ministry boosted its supercomputing power to 21 PFlops, making India’s weather forecasts among the most high-resolution in the world. Protecting Our Coasts, Powering Our Future We’re bringing science out of the lab and straight to our 7,500km coastline! Here’s how: Fresh Water: 3 new eco-friendly desalination plants in Lakshadweep are providing safe drinking water using local energy. Homegrown Tech: Our new 'Make in India' vessels, Sagar Tara and Sagar Anveshika, are officially on the move, monitoring ocean health. 24/7 Safety: Our Tsunami Early Warning Centre tracked 32 major earthquakes this year to keep coastal communities safe. The Future is Here: Under #MissionMausam and #IMDVision2047, we’ve boosted our supercomputing power to 21 PFlops.This means faster, more accurate weather updates for every citizen, powered by world-class Indian research. \"2025 was the year we proved that high-end science isn't just for textbooks—it's for the people,\" said Dr. M. Ravichandran, Secretary, MoES. \"Whether it’s a farmer in Vidarbha checking a rain alert or a researcher studying the Arctic ice, our work is about making India more resilient and self-reliant” Some Important Events, Inventions & Schemes of  MoES in 2025 Hon'ble Vice President inaugurated a 1.5 lakh litre Low-Temperature Thermal Desalination (LTTD) plant set up by NIOT at Chetlat (Lakshadweep) on January 17, 2025. Hon'ble Minister of Earth Sciences Dr. Jitendra Singh, dedicated the Acoustic Test Facility as a designated Laboratory in Underwater Acoustics in India on April 12, 2025. · Hon’ble Minister of Earth Sciences Dr. Jitendra Singh released the platform SAHAV ,developed by NCCR during the United Nations (UN) Ocean Conference-3, where it was presented as a global model for technology-enabled ocean governance. · Hon’ble Minister of Earth Sciences (HMoES) Dr. Jitendra Singh inaugurated Doppler Weather Radars (DWR) at Raipur and Mangalore, on 27th November 2025. Hon’ble Minister of Earth Sciences Dr. Jitendra Singh inaugurated NCPOR’s new state-of-the-art facilities—Polar Bhavan, Science on Sphere (SOS), and Sagar Bhavan—in the presence of Secretary, MoES. Polar Bhavan (11,378 sqm; ₹55 Cr) houses advanced labs, a dynamic Earth-visualization system (an educational tool) forming Phase-I of South Asia’s first Polar and Ocean Museum; Sagar Bhavan (1,772 sqm; ₹13 Cr) includes specialized ice labs and cleanroom facilities on 22 May 2025. · Secretary MoES Dr.M.Ravichandran, inaugurated the Moored Buoy Sensor Calibration Test Facility on February 11, 2025, at NIOT, which is the first institute to establish a conductivity and temperature sensor calibration facility in India. · Secretary MoES Dr. M.Ravichandran, launched the sea trial demonstration of a 10m diameter open sea submerged cage with a sub-sea feeder system and an Artificial Intelligence / Machine Learning (AI/ML) based fish biomass system, along with a surveillance system, and deployed it at the North Bay of Andaman on April 17, 2025. · Secretary, MoES, Dr.M.Ravichandran, inaugurated the Quadrupole Inductively Coupled Plasma Mass Spectrometer (Q-ICP-MS) Laboratory at NCESS on October 30, 2025. The facility enables precise geochemical and elemental analysis of geological samples. Secretary MoES, Dr. M. Ravichandran, inaugurated Open Science Sessions in the4 th National Conference on Polar Science in September 2025, organised by NCPOR, engaging 265 participants across eight themes, including 160 young researchers, keynote sessions, and awards, reaffirming India’s growing leadership in polar science. MoES co-organized India International Science Festival (IISF) during 6-9 th December,2025 at Panchkula, Haryana. MoES, in collaboration with the Directorate General of Hydrocarbons, conducted multi-channel seismic data acquisition through Oil and Natural Gas Corporation (ONGC) in the northern Western Offshore Region. ONGC completed initial data processing to support India’s revised Extended Continental Shelf submissions. · MOES developed Heat Action Plans in collaboration with NDMA and state governments to reduce heat-related mortality and morbidity in the country. · The High-Performance Computing (HPC) facility was augmented to about 21 PFlops to provide world class weather and climate services, by high resolution weather and coupled climate modelling. Urban Environment-Science to Society(UES25) a product  is  launched by the Secretary of MoES Dr M.Ravichandran & Sri M.Krishan, Secretary, Ministry of Electronics & Information Technology) Meity, on 15 th December 2025, at the Ministry of Earth sciences, which is developed under the (National Supercomputing Mission) NSM urban Modelling project, that is funded by Meity, Govt.of India. This platform serves as an integrated framework for weather, air quality and urban flood information, empowering operational agencies, Municipal Corporations, researchers and disaster management authorities. 4 th Deep Ocean Council meeting,  under the Deep Ocean Mission  has inaugurated & conducted by the Secretary of MoES, Dr M.Ravichandran on 17 th December 2025 at the Ministry of Earth sciences, in the meeting several verticals of the mission were discussed like that-Deep sea mining & manned submersible, ocean climate change advisory services, exploration & conservation of deep sea bio-diversity, deep ocean survey and exploration, energy and fresh water from the ocean and advanced marine station for ocean biology. The Earth  System Science Organisation(ESSO) Review meeting has hosted by the Ministry of earth Sciences, at Shillong, Meghalay on 19 th December 2025 under the chairmanship of the Secretary of MoES, Dr.M.Ravichandran. In the program DG of Meteorology  Dr. Mrutunjay Mohapatra and Heads and Directors of MoES institutions  were attended. In the meeting several focused points were discussed- like strengthening inter institutional collaboration, identifying scientific & technological gaps & aligning ESSO’s roadmap with India’s Vision 2047 across weather, climate, ocean and Earth System Sciences . 9 th National Lighting conference has been organised at the Ministry of Earth Sciences, on 22 nd December 2025, this was hosted by the jointly by these aligned institutions MOES-NDMA-IMD-CROPC. In the event the focal theme was --“challenge of building resilience of vulnerable communities against rising surge in atmospheric electricity, its relation to extreme weather events and citizen science”. In the program Secretary of MoES, Dr.M Ravichandran & D.G of IMD Dr Mrutunjay Mohapatra and other dignitaries were also present there. *** NKR/JKP (रिलीज़ आईडी: 2207878) आगंतुक पटल  : 274 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Gujarati Ministry of Earth Sciences Year-End Review Exploring Extremes: A Landmark Year of Discoveries by India’s Ministry of Earth Sciences प्रविष्टि तिथि:\r\n                        23 DEC 2025 7:51PM by PIB Delhi It has been a year of \"firsts\" for Indian science. From the successful trial of a deep-sea mining system at a staggering depth of 5,270 meters to the launch of a revolutionary weather mission, the Ministry of Earth Sciences (MoES) has spent 2025 turning ambitious blueprints into reality. As the year draws to a close, the Ministry’s latest report shows more than just technical milestones—it highlights a direct impact on the lives of millions. The Human Impact: Science that Pays Back For the first time, a third-party audit has quantified the value of India's meteorological investments. While the government spent roughly ₹1,000 crore on the Monsoon Mission and high-performance computing, the return has been a massive ₹50,000 crore in economic benefits. These gains directly supported nearly 11 million families living below the poverty line, specifically small-scale farmers and fisherfolk who rely on the Ministry’s daily weather and ocean alerts to protect their livelihoods. Breaking Records in the Deep & Dark India’s quest for resource self-reliance reached the ocean floor this year. Deep Sea Mining: India became a global leader in deep-sea technology by successfully testing a mining system at 5,270 meters—the deepest such test ever recorded. The \"Samudrayaan\" Mission: The human submersible MATSYA cpassed its comfort and stability tests with flying colors. In a separate historic dive, Indian scientists reached depths of 5,002 meters during a collaborative mission in the Atlantic, a new benchmark for Indian oceanography. Protecting Our Coasts and Islands The Ministry isn't just looking at the horizon; it’s looking at our shores. Clean Water for Lakshadweep: Three new eco-friendly desalination plants were commissioned, bringing fresh drinking water to the islands. Coastal Guardians: Two new research vessels, Sagar Tara and Sagar Anveshika, were built right here in India under the ‘Make in India’ initiative to monitor our ocean health. Safety First: The Tsunami Early Warning Centre monitored 32 major earthquakes this year, ensuring that not a single threat to Indian shores went unnoticed. A Vision for the Next Century On January 14, Prime Minister Sri Narendra Modi set the tone for the future by launching Mission Mausam and the IMD Vision 2047. To support these goals, the Ministry boosted its supercomputing power to 21 PFlops, making India’s weather forecasts among the most high-resolution in the world. Protecting Our Coasts, Powering Our Future We’re bringing science out of the lab and straight to our 7,500km coastline! Here’s how: Fresh Water: 3 new eco-friendly desalination plants in Lakshadweep are providing safe drinking water using local energy. Homegrown Tech: Our new 'Make in India' vessels, Sagar Tara and Sagar Anveshika, are officially on the move, monitoring ocean health. 24/7 Safety: Our Tsunami Early Warning Centre tracked 32 major earthquakes this year to keep coastal communities safe. The Future is Here: Under #MissionMausam and #IMDVision2047, we’ve boosted our supercomputing power to 21 PFlops.This means faster, more accurate weather updates for every citizen, powered by world-class Indian research. \"2025 was the year we proved that high-end science isn't just for textbooks—it's for the people,\" said Dr. M. Ravichandran, Secretary, MoES. \"Whether it’s a farmer in Vidarbha checking a rain alert or a researcher studying the Arctic ice, our work is about making India more resilient and self-reliant” Some Important Events, Inventions & Schemes of  MoES in 2025 Hon'ble Vice President inaugurated a 1.5 lakh litre Low-Temperature Thermal Desalination (LTTD) plant set up by NIOT at Chetlat (Lakshadweep) on January 17, 2025. Hon'ble Minister of Earth Sciences Dr. Jitendra Singh, dedicated the Acoustic Test Facility as a designated Laboratory in Underwater Acoustics in India on April 12, 2025. · Hon’ble Minister of Earth Sciences Dr. Jitendra Singh released the platform SAHAV ,developed by NCCR during the United Nations (UN) Ocean Conference-3, where it was presented as a global model for technology-enabled ocean governance. · Hon’ble Minister of Earth Sciences (HMoES) Dr. Jitendra Singh inaugurated Doppler Weather Radars (DWR) at Raipur and Mangalore, on 27th November 2025. Hon’ble Minister of Earth Sciences Dr. Jitendra Singh inaugurated NCPOR’s new state-of-the-art facilities—Polar Bhavan, Science on Sphere (SOS), and Sagar Bhavan—in the presence of Secretary, MoES. Polar Bhavan (11,378 sqm; ₹55 Cr) houses advanced labs, a dynamic Earth-visualization system (an educational tool) forming Phase-I of South Asia’s first Polar and Ocean Museum; Sagar Bhavan (1,772 sqm; ₹13 Cr) includes specialized ice labs and cleanroom facilities on 22 May 2025. · Secretary MoES Dr.M.Ravichandran, inaugurated the Moored Buoy Sensor Calibration Test Facility on February 11, 2025, at NIOT, which is the first institute to establish a conductivity and temperature sensor calibration facility in India. · Secretary MoES Dr. M.Ravichandran, launched the sea trial demonstration of a 10m diameter open sea submerged cage with a sub-sea feeder system and an Artificial Intelligence / Machine Learning (AI/ML) based fish biomass system, along with a surveillance system, and deployed it at the North Bay of Andaman on April 17, 2025. · Secretary, MoES, Dr.M.Ravichandran, inaugurated the Quadrupole Inductively Coupled Plasma Mass Spectrometer (Q-ICP-MS) Laboratory at NCESS on October 30, 2025. The facility enables precise geochemical and elemental analysis of geological samples. Secretary MoES, Dr. M. Ravichandran, inaugurated Open Science Sessions in the4 th National Conference on Polar Science in September 2025, organised by NCPOR, engaging 265 participants across eight themes, including 160 young researchers, keynote sessions, and awards, reaffirming India’s growing leadership in polar science. MoES co-organized India International Science Festival (IISF) during 6-9 th December,2025 at Panchkula, Haryana. MoES, in collaboration with the Directorate General of Hydrocarbons, conducted multi-channel seismic data acquisition through Oil and Natural Gas Corporation (ONGC) in the northern Western Offshore Region. ONGC completed initial data processing to support India’s revised Extended Continental Shelf submissions. · MOES developed Heat Action Plans in collaboration with NDMA and state governments to reduce heat-related mortality and morbidity in the country. · The High-Performance Computing (HPC) facility was augmented to about 21 PFlops to provide world class weather and climate services, by high resolution weather and coupled climate modelling. Urban Environment-Science to Society(UES25) a product  is  launched by the Secretary of MoES Dr M.Ravichandran & Sri M.Krishan, Secretary, Ministry of Electronics & Information Technology) Meity, on 15 th December 2025, at the Ministry of Earth sciences, which is developed under the (National Supercomputing Mission) NSM urban Modelling project, that is funded by Meity, Govt.of India. This platform serves as an integrated framework for weather, air quality and urban flood information, empowering operational agencies, Municipal Corporations, researchers and disaster management authorities. 4 th Deep Ocean Council meeting,  under the Deep Ocean Mission  has inaugurated & conducted by the Secretary of MoES, Dr M.Ravichandran on 17 th December 2025 at the Ministry of Earth sciences, in the meeting several verticals of the mission were discussed like that-Deep sea mining & manned submersible, ocean climate change advisory services, exploration & conservation of deep sea bio-diversity, deep ocean survey and exploration, energy and fresh water from the ocean and advanced marine station for ocean biology. The Earth  System Science Organisation(ESSO) Review meeting has hosted by the Ministry of earth Sciences, at Shillong, Meghalay on 19 th December 2025 under the chairmanship of the Secretary of MoES, Dr.M.Ravichandran. In the program DG of Meteorology  Dr. Mrutunjay Mohapatra and Heads and Directors of MoES institutions  were attended. In the meeting several focused points were discussed- like strengthening inter institutional collaboration, identifying scientific & technological gaps & aligning ESSO’s roadmap with India’s Vision 2047 across weather, climate, ocean and Earth System Sciences . 9 th National Lighting conference has been organised at the Ministry of Earth Sciences, on 22 nd December 2025, this was hosted by the jointly by these aligned institutions MOES-NDMA-IMD-CROPC. In the event the focal theme was --“challenge of building resilience of vulnerable communities against rising surge in atmospheric electricity, its relation to extreme weather events and citizen science”. In the program Secretary of MoES, Dr.M Ravichandran & D.G of IMD Dr Mrutunjay Mohapatra and other dignitaries were also present there. *** NKR/JKP (रिलीज़ आईडी: 2207878)",
    "scraped_at": "2025-12-23T17:42:55.038619"
  },
  {
    "id": "2207853",
    "ministry": "Ministry of Environment, Forest and Climate Change",
    "title": "CAQM issues Show Cause Notices to Six Thermal Power Plants within 300 km of Delhi, for non-compliance of Biomass Co-firing Norms",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207853",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Environment, Forest and Climate Change CAQM issues Show Cause Notices to Six Thermal Power Plants within 300 km of Delhi, for non-compliance of Biomass Co-firing Norms Environmental Compensation of about ₹61.85 crore proposed प्रविष्टि तिथि:\r\n                23 DEC 2025 7:16PM by PIB Delhi The Commission for Air Quality Management in NCR and Adjoining Areas (CAQM) has issued Show Cause Notices to six coal-based Thermal Power Plants (TPPs) located within a radius of 300 km of Delhi. These notices were issued for non-compliance with the mandatory provisions relating to co-firing of pellets or briquettes made from crop residue, notified under the Environment (Utilisation of Crop Residue by Thermal Power Plants) Rules, 2023. The action follows a detailed review of compliance status for FY 2024–25, based on data provided by the Ministry of Power, Government of India. The Environment (Utilisation of Crop Residue by Thermal Power Plants) Rules, 2023 mandate all coal-based TPPs to utilise a minimum 5% blend of biomass pellets or briquettes made of crop residue along with coal, with a minimum threshold of more than 3% co-firing prescribed for FY 2024–25 to avoid imposition of Environmental Compensation (EC). These Statutory provisions were notified with the objective of promoting ex-situ management of paddy straw, reducing incidents of stubble burning, and mitigating air pollution in NCR and Adjoining Areas. The Commission has, since 2021, issued multiple Statutory Directions, including Direction No. 42 dated 17.09.2021, and has consistently monitored implementation through periodic reviews and inspections. Despite these measures, the compliance status of the following TPPs has been found to be unsatisfactory during FY 2024-25, with biomass co-firing levels remaining well below the mandated thresholds. Consequently, Show Cause Notices proposing imposition of EC have been issued to the concerned plants, as detailed below: Talwandi Sabo Power Limited (TSPL – Vedanta), Mansa, Punjab – proposed EC of approx. ₹33.02 Crore; Panipat Thermal Power Station (PTPS), Panipat, Haryana – proposed EC of approx. ₹8.98 Crore; Deenbandhu Chhotu Ram Thermal Power Station (DCRTPS), Yamunanagar, Haryana – proposed EC of approx. ₹6.69 Crore; Rajiv Gandhi Thermal Power Plant (RGTPP), Hisar, Haryana – proposed EC of approx. ₹5.55 Crore; PSPCL – Guru Hargobind Thermal Power Plant, Lehra Mohabbat, Punjab – proposed EC of approx. ₹4.87 Crore; Harduaganj Thermal Power Station, UPRVUNL, Uttar Pradesh – proposed EC of approx. ₹2.74 Crore. The total Environmental Compensation proposed across these 6 TPPs amounts to approx. ₹61.85 Crore. Since issuance of Direction No. 42, the Commission intensively reviewed the matter with all concerned stakeholders including TPPs. Observing a huge lag in compliance and directions of the Hon’ble Supreme Court, the Commission in early 2024 issued Notices u/s 14 of CAQM Act, 2021 to 4 TPPs whose performance was consistently poor since the exercise has been started. The Commission also flagged the concern before 7 TPPs and all concerned authorities for immediate measures to comply with the Environment (Utilisation of Crop Residue by Thermal Power Plants) Rules, 2023. Even a Committee was constituted for examining the representations of non-compliant TPPs (if any) for the period of FY 2024-25. The concerned TPPs have been directed to submit their written explanations within 15 days from the date of issue of the Show Cause Notices. Failing which further action shall be initiated in accordance with the provisions of the Commission for Air Quality Management in National Capital Region and Adjoining Areas Act, 2021, including action under Section 14 of the Act. The Commission reiterates that biomass co-firing in TPPs is a critical intervention for effective ex-situ management of crop residue and for reduction of air pollution in NCR and Adjoining Areas. The Commission shall continue to pursue strict enforcement of Statutory Directions to ensure timely and sustained compliance by all regulated entities. ***** VM/SK (रिलीज़ आईडी: 2207853) आगंतुक पटल  : 292 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu Ministry of Environment, Forest and Climate Change CAQM issues Show Cause Notices to Six Thermal Power Plants within 300 km of Delhi, for non-compliance of Biomass Co-firing Norms Environmental Compensation of about ₹61.85 crore proposed प्रविष्टि तिथि:\r\n                        23 DEC 2025 7:16PM by PIB Delhi The Commission for Air Quality Management in NCR and Adjoining Areas (CAQM) has issued Show Cause Notices to six coal-based Thermal Power Plants (TPPs) located within a radius of 300 km of Delhi. These notices were issued for non-compliance with the mandatory provisions relating to co-firing of pellets or briquettes made from crop residue, notified under the Environment (Utilisation of Crop Residue by Thermal Power Plants) Rules, 2023. The action follows a detailed review of compliance status for FY 2024–25, based on data provided by the Ministry of Power, Government of India. The Environment (Utilisation of Crop Residue by Thermal Power Plants) Rules, 2023 mandate all coal-based TPPs to utilise a minimum 5% blend of biomass pellets or briquettes made of crop residue along with coal, with a minimum threshold of more than 3% co-firing prescribed for FY 2024–25 to avoid imposition of Environmental Compensation (EC). These Statutory provisions were notified with the objective of promoting ex-situ management of paddy straw, reducing incidents of stubble burning, and mitigating air pollution in NCR and Adjoining Areas. The Commission has, since 2021, issued multiple Statutory Directions, including Direction No. 42 dated 17.09.2021, and has consistently monitored implementation through periodic reviews and inspections. Despite these measures, the compliance status of the following TPPs has been found to be unsatisfactory during FY 2024-25, with biomass co-firing levels remaining well below the mandated thresholds. Consequently, Show Cause Notices proposing imposition of EC have been issued to the concerned plants, as detailed below: Talwandi Sabo Power Limited (TSPL – Vedanta), Mansa, Punjab – proposed EC of approx. ₹33.02 Crore; Panipat Thermal Power Station (PTPS), Panipat, Haryana – proposed EC of approx. ₹8.98 Crore; Deenbandhu Chhotu Ram Thermal Power Station (DCRTPS), Yamunanagar, Haryana – proposed EC of approx. ₹6.69 Crore; Rajiv Gandhi Thermal Power Plant (RGTPP), Hisar, Haryana – proposed EC of approx. ₹5.55 Crore; PSPCL – Guru Hargobind Thermal Power Plant, Lehra Mohabbat, Punjab – proposed EC of approx. ₹4.87 Crore; Harduaganj Thermal Power Station, UPRVUNL, Uttar Pradesh – proposed EC of approx. ₹2.74 Crore. The total Environmental Compensation proposed across these 6 TPPs amounts to approx. ₹61.85 Crore. Since issuance of Direction No. 42, the Commission intensively reviewed the matter with all concerned stakeholders including TPPs. Observing a huge lag in compliance and directions of the Hon’ble Supreme Court, the Commission in early 2024 issued Notices u/s 14 of CAQM Act, 2021 to 4 TPPs whose performance was consistently poor since the exercise has been started. The Commission also flagged the concern before 7 TPPs and all concerned authorities for immediate measures to comply with the Environment (Utilisation of Crop Residue by Thermal Power Plants) Rules, 2023. Even a Committee was constituted for examining the representations of non-compliant TPPs (if any) for the period of FY 2024-25. The concerned TPPs have been directed to submit their written explanations within 15 days from the date of issue of the Show Cause Notices. Failing which further action shall be initiated in accordance with the provisions of the Commission for Air Quality Management in National Capital Region and Adjoining Areas Act, 2021, including action under Section 14 of the Act. The Commission reiterates that biomass co-firing in TPPs is a critical intervention for effective ex-situ management of crop residue and for reduction of air pollution in NCR and Adjoining Areas. The Commission shall continue to pursue strict enforcement of Statutory Directions to ensure timely and sustained compliance by all regulated entities. ***** VM/SK (रिलीज़ आईडी: 2207853)",
    "scraped_at": "2025-12-23T17:42:57.219122"
  },
  {
    "id": "2207838",
    "ministry": "Ministry of Health and Family Welfare",
    "title": "Union Health Minister Shri J.P. Nadda Participates in the Bhumi Pujan of PPP-Model Based Medical Colleges in Dhar and Betul in Madhya Pradesh",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207838",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Health and Family Welfare Union Health Minister Shri J.P. Nadda Participates in the Bhumi Pujan of PPP-Model Based Medical Colleges in Dhar and Betul in Madhya Pradesh Healthcare Reaches the Last Mile: PPP-Model Medical Colleges to Transform Remote Areas of Dhar and Betul New Medical Colleges to Empower Rural Youth and Expand Healthcare Access Union Health Minister highlights the paradigm shift in India’s health care in the last 11 years; reckons growth in multiple sectors Union Health Minister underscores Rapid Growth in Medical Colleges from 387 to 819 and MBBS Seats from 51,000 to 1.28 Lakh Under the Vision of Honourable Prime Minister, 75,000 Additional Medical Seats to Be Added by 2029 to Strengthen Healthcare Workforce: Shri J.P. Nadda प्रविष्टि तिथि:\r\n                23 DEC 2025 6:32PM by PIB Delhi Union Minister for Health and Family Welfare, Shri J.P. Nadda, today participated in the Bhumi Pujan ceremony marking the commencement of construction of two new medical colleges under the innovative Public–Private Partnership (PPP) model in Dhar and Betul districts. These institutions are part of four PPP-based medical colleges being developed in the State—Dhar, Betul, Katni, and Panna—linked with existing district hospitals to strengthen both medical education and healthcare service delivery. Under this model, the State Government has provided up to 25 acres of land on lease, while private service providers will construct academic and clinical infrastructure, including medical college buildings, hostels, laboratories, and residential complexes. The associated district hospitals will be upgraded in strict accordance with National Medical Commission (NMC) norms, while remaining under the administrative control of the State Government to ensure uninterrupted public health services. Addressing the gathering in Dhar, Madhya Pradesh, Shri Nadda described the occasion as a historic milestone, noting that the PPP model reflects a forward-looking approach to expanding medical education and healthcare delivery. He highlighted that India’s healthcare system, once focused primarily on curative care, has undergone a paradigm shift since 2017 under the leadership of Prime Minister Shri Narendra Modi, moving towards preventive, promotive, and holistic healthcare. Shri Nadda underscored the role of over 1.82 lakh Ayushman Arogya Mandirs (AAMs) in delivering comprehensive primary healthcare, particularly maternal and child health services, from pregnancy to safe institutional delivery and vaccination. He also noted the success of the U-WIN portal, which enables real-time immunisation surveillance for approximately 2.5 crore pregnant women and 2.5 crore children nationwide, supported by Anganwadi and ASHA workers. Highlighting the key achievements during his address in Betul, Madhya Pradesh, Union Health Minister informed that institutional deliveries in the country have risen to nearly 89%, driven by ASHA workers’ grassroots mobilisation. He said, India’s decline in the Maternal Mortality Ratio (MMR) has been more than twice the global average. Over 40 crore people have been screened for hypertension, with 6.80 crore diagnosed and under treatment. Over 40 crore screened for diabetes, with 4.60 crore diagnosed and receiving care. Cancer screening initiatives have reached millions, identifying thousands of cases early. Shri Nadda emphasised that systematic screening and early detection are enabling timely treatment and improved health outcomes. The Minister also highlighted the unprecedented growth in medical education infrastructure: •           Medical colleges have increased from 387 in 2014 to 819 at present. •           MBBS seats have more than doubled from 51,000 to over 1.28 lakh. •           The Government is committed to adding 75,000 new medical seats by 2029, strengthening India’s healthcare human resources. Chief Minister of Madhya Pradesh, Shri Mohan Yadav, expressed gratitude to the Union Government for its support in strengthening healthcare infrastructure. He noted that linking new medical colleges with district hospitals will optimise resources, expand specialist and tertiary care to underserved regions, and reduce the need for patients to travel to larger cities for advanced treatment. The initiative aligns with the State’s vision of “Swastha Jeevan Samriddhi ka Aadhar” (Healthy life is the foundation of prosperity), focusing on expanding medical education opportunities for local youth and generating employment in nursing, paramedical, and allied health sectors. The ceremony was attended by Shri Durga Das Uikley, Minister of State for Tribal Affairs; Smt. Savitri Thakur, Minister of State for Women and Child Development; Shri Rajendra Shukla, Deputy Chief Minister and State Health Minister; Shri Kailash Vijayvargiya, Minister of Parliamentary Affairs along with other eminent leaders from the State. *** SR HFW–HFM participates in Bhumi Pujan/23 rd December 2025/2 (रिलीज़ आईडी: 2207838) आगंतुक पटल  : 186 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Health and Family Welfare Union Health Minister Shri J.P. Nadda Participates in the Bhumi Pujan of PPP-Model Based Medical Colleges in Dhar and Betul in Madhya Pradesh Healthcare Reaches the Last Mile: PPP-Model Medical Colleges to Transform Remote Areas of Dhar and Betul New Medical Colleges to Empower Rural Youth and Expand Healthcare Access Union Health Minister highlights the paradigm shift in India’s health care in the last 11 years; reckons growth in multiple sectors Union Health Minister underscores Rapid Growth in Medical Colleges from 387 to 819 and MBBS Seats from 51,000 to 1.28 Lakh Under the Vision of Honourable Prime Minister, 75,000 Additional Medical Seats to Be Added by 2029 to Strengthen Healthcare Workforce: Shri J.P. Nadda प्रविष्टि तिथि:\r\n                        23 DEC 2025 6:32PM by PIB Delhi Union Minister for Health and Family Welfare, Shri J.P. Nadda, today participated in the Bhumi Pujan ceremony marking the commencement of construction of two new medical colleges under the innovative Public–Private Partnership (PPP) model in Dhar and Betul districts. These institutions are part of four PPP-based medical colleges being developed in the State—Dhar, Betul, Katni, and Panna—linked with existing district hospitals to strengthen both medical education and healthcare service delivery. Under this model, the State Government has provided up to 25 acres of land on lease, while private service providers will construct academic and clinical infrastructure, including medical college buildings, hostels, laboratories, and residential complexes. The associated district hospitals will be upgraded in strict accordance with National Medical Commission (NMC) norms, while remaining under the administrative control of the State Government to ensure uninterrupted public health services. Addressing the gathering in Dhar, Madhya Pradesh, Shri Nadda described the occasion as a historic milestone, noting that the PPP model reflects a forward-looking approach to expanding medical education and healthcare delivery. He highlighted that India’s healthcare system, once focused primarily on curative care, has undergone a paradigm shift since 2017 under the leadership of Prime Minister Shri Narendra Modi, moving towards preventive, promotive, and holistic healthcare. Shri Nadda underscored the role of over 1.82 lakh Ayushman Arogya Mandirs (AAMs) in delivering comprehensive primary healthcare, particularly maternal and child health services, from pregnancy to safe institutional delivery and vaccination. He also noted the success of the U-WIN portal, which enables real-time immunisation surveillance for approximately 2.5 crore pregnant women and 2.5 crore children nationwide, supported by Anganwadi and ASHA workers. Highlighting the key achievements during his address in Betul, Madhya Pradesh, Union Health Minister informed that institutional deliveries in the country have risen to nearly 89%, driven by ASHA workers’ grassroots mobilisation. He said, India’s decline in the Maternal Mortality Ratio (MMR) has been more than twice the global average. Over 40 crore people have been screened for hypertension, with 6.80 crore diagnosed and under treatment. Over 40 crore screened for diabetes, with 4.60 crore diagnosed and receiving care. Cancer screening initiatives have reached millions, identifying thousands of cases early. Shri Nadda emphasised that systematic screening and early detection are enabling timely treatment and improved health outcomes. The Minister also highlighted the unprecedented growth in medical education infrastructure: •           Medical colleges have increased from 387 in 2014 to 819 at present. •           MBBS seats have more than doubled from 51,000 to over 1.28 lakh. •           The Government is committed to adding 75,000 new medical seats by 2029, strengthening India’s healthcare human resources. Chief Minister of Madhya Pradesh, Shri Mohan Yadav, expressed gratitude to the Union Government for its support in strengthening healthcare infrastructure. He noted that linking new medical colleges with district hospitals will optimise resources, expand specialist and tertiary care to underserved regions, and reduce the need for patients to travel to larger cities for advanced treatment. The initiative aligns with the State’s vision of “Swastha Jeevan Samriddhi ka Aadhar” (Healthy life is the foundation of prosperity), focusing on expanding medical education opportunities for local youth and generating employment in nursing, paramedical, and allied health sectors. The ceremony was attended by Shri Durga Das Uikley, Minister of State for Tribal Affairs; Smt. Savitri Thakur, Minister of State for Women and Child Development; Shri Rajendra Shukla, Deputy Chief Minister and State Health Minister; Shri Kailash Vijayvargiya, Minister of Parliamentary Affairs along with other eminent leaders from the State. *** SR HFW–HFM participates in Bhumi Pujan/23 rd December 2025/2 (रिलीज़ आईडी: 2207838)",
    "scraped_at": "2025-12-23T17:42:58.942963"
  },
  {
    "id": "2207717",
    "ministry": "Ministry of Health and Family Welfare",
    "title": "Union Health Ministry’s Two-day Influenza Chintan Shivir Strengthens Inter-Ministerial Convergence for Preparedness and Response ahead of the flu season",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207717",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Health and Family Welfare Union Health Ministry’s Two-day Influenza Chintan Shivir Strengthens Inter-Ministerial Convergence for Preparedness and Response ahead of the flu season Leads to Development of a Comprehensive, Structured Influenza Preparedness Checklist Covering Surveillance, Early Warning, Risk Assessment, Laboratory Systems, Clinical Response, and One Health Coordination Chintan Shivir concludes with a consensus on adopting a whole-of-Government and One Health approach to address seasonal and zoonotic influenza Ministries Reaffirm Commitment to Integrated Surveillance, Strengthened Laboratories, and Coordinated Pandemic Preparedness प्रविष्टि तिथि:\r\n                23 DEC 2025 3:39PM by PIB Delhi The National Centre for Disease Control (NCDC), on behalf of the Ministry of Health and Family Welfare (MoHFW), in collaboration with the World Health Organization (WHO) India organised a two-day Influenza Chintan Shivir from 22–23 December 2025 in New Delhi on the theme “Strengthening Inter-ministerial and Inter-sectoral Convergence for Influenza Preparedness and Response.” Stakeholders from the Disaster Management (DM) Cell of MoHFW, Indian Council of Medical Research (ICMR), Department of Animal Husbandry and Dairying (DAHD), and the National Institute of High Security Animal Diseases (NIHSAD) participated in this Chintan Shivir. The Shivir provided a structured platform for deliberations to strengthen preparedness and response mechanisms ahead of the upcoming influenza season. The inaugural session was inaugurated by Union Health Minister, Shri Jagat Prakash Nadda, through a video message. He emphasized the importance of aligned preparedness and response measures, including surge capacity planning, to build country’s resilience against influenza. He highlighted the critical role of the Integrated Disease Surveillance Programme (IDSP) and stressed the need for coordinated efforts between the Centre and States to ensure robust and collaborative surveillance systems. The Chintan Shivir witnessed participation from around 100 eminent representatives from multiple ministries, including Health, Animal Husbandry, Agriculture, and Environment, along with premier research institutions, State Governments, and international partners— furthering the Government’s One Health and whole-of-Government approach. Eleven States with a history of reporting Influenza Cases participated in person, while IDSP officials from State & District Surveillance Units joined virtually. This inclusion enabled cross-learning by sharing best practices. The deliberations included technical presentations, panel discussions, group work sessions, and State presentations. Influenza still continues to pose a significant public health challenge, particularly for vulnerable populations such as young children, older adults, pregnant women, and individuals with chronic illnesses. The Ministry of Health and Family Welfare continues to monitor seasonal influenza trends across States and Union Territories in real time through the IDSP network. Deliberations reiterated that influenza preparedness must be supported through effective inter-sectoral convergence, with MoHFW further strengthening surveillance, laboratory capacity, and clinical preparedness for early detection and timely response to seasonal and zoonotic influenza outbreaks. A key outcome of the Chintan Shivir was the development of a structured influenza preparedness checklist after detailed deliberations during these two days. The checklist is intended to guide the Centre, States and Districts in preparedness planning across four key domains: Surveillance, Early Warning, and Risk Assessment Laboratory Systems Strengthening Hospital Preparedness and Clinical Response One Health Coordination and Risk Communication & Community Engagement (RCCE) The Chintan Shivir concluded with a consensus on adopting a whole-of-Government and One Health approach to address seasonal and zoonotic influenza. Ministries agreed to strengthen integrated surveillance across human, animal, and wildlife sectors; enhance laboratory and genomic capacities; ensure timely data sharing; and align sectoral action plans with the national pandemic preparedness framework. The deliberations reaffirmed India’s commitment to coordinated national action to prevent, detect, and respond effectively to influenza and other respiratory viral threats. ****** SR HFW/NCDC Influenza Chintan Shivir/23Dec2025/1 (रिलीज़ आईडी: 2207717) आगंतुक पटल  : 232 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Tamil , Telugu Ministry of Health and Family Welfare Union Health Ministry’s Two-day Influenza Chintan Shivir Strengthens Inter-Ministerial Convergence for Preparedness and Response ahead of the flu season Leads to Development of a Comprehensive, Structured Influenza Preparedness Checklist Covering Surveillance, Early Warning, Risk Assessment, Laboratory Systems, Clinical Response, and One Health Coordination Chintan Shivir concludes with a consensus on adopting a whole-of-Government and One Health approach to address seasonal and zoonotic influenza Ministries Reaffirm Commitment to Integrated Surveillance, Strengthened Laboratories, and Coordinated Pandemic Preparedness प्रविष्टि तिथि:\r\n                        23 DEC 2025 3:39PM by PIB Delhi The National Centre for Disease Control (NCDC), on behalf of the Ministry of Health and Family Welfare (MoHFW), in collaboration with the World Health Organization (WHO) India organised a two-day Influenza Chintan Shivir from 22–23 December 2025 in New Delhi on the theme “Strengthening Inter-ministerial and Inter-sectoral Convergence for Influenza Preparedness and Response.” Stakeholders from the Disaster Management (DM) Cell of MoHFW, Indian Council of Medical Research (ICMR), Department of Animal Husbandry and Dairying (DAHD), and the National Institute of High Security Animal Diseases (NIHSAD) participated in this Chintan Shivir. The Shivir provided a structured platform for deliberations to strengthen preparedness and response mechanisms ahead of the upcoming influenza season. The inaugural session was inaugurated by Union Health Minister, Shri Jagat Prakash Nadda, through a video message. He emphasized the importance of aligned preparedness and response measures, including surge capacity planning, to build country’s resilience against influenza. He highlighted the critical role of the Integrated Disease Surveillance Programme (IDSP) and stressed the need for coordinated efforts between the Centre and States to ensure robust and collaborative surveillance systems. The Chintan Shivir witnessed participation from around 100 eminent representatives from multiple ministries, including Health, Animal Husbandry, Agriculture, and Environment, along with premier research institutions, State Governments, and international partners— furthering the Government’s One Health and whole-of-Government approach. Eleven States with a history of reporting Influenza Cases participated in person, while IDSP officials from State & District Surveillance Units joined virtually. This inclusion enabled cross-learning by sharing best practices. The deliberations included technical presentations, panel discussions, group work sessions, and State presentations. Influenza still continues to pose a significant public health challenge, particularly for vulnerable populations such as young children, older adults, pregnant women, and individuals with chronic illnesses. The Ministry of Health and Family Welfare continues to monitor seasonal influenza trends across States and Union Territories in real time through the IDSP network. Deliberations reiterated that influenza preparedness must be supported through effective inter-sectoral convergence, with MoHFW further strengthening surveillance, laboratory capacity, and clinical preparedness for early detection and timely response to seasonal and zoonotic influenza outbreaks. A key outcome of the Chintan Shivir was the development of a structured influenza preparedness checklist after detailed deliberations during these two days. The checklist is intended to guide the Centre, States and Districts in preparedness planning across four key domains: Surveillance, Early Warning, and Risk Assessment Laboratory Systems Strengthening Hospital Preparedness and Clinical Response One Health Coordination and Risk Communication & Community Engagement (RCCE) The Chintan Shivir concluded with a consensus on adopting a whole-of-Government and One Health approach to address seasonal and zoonotic influenza. Ministries agreed to strengthen integrated surveillance across human, animal, and wildlife sectors; enhance laboratory and genomic capacities; ensure timely data sharing; and align sectoral action plans with the national pandemic preparedness framework. The deliberations reaffirmed India’s commitment to coordinated national action to prevent, detect, and respond effectively to influenza and other respiratory viral threats. ****** SR HFW/NCDC Influenza Chintan Shivir/23Dec2025/1 (रिलीज़ आईडी: 2207717)",
    "scraped_at": "2025-12-23T17:43:00.745089"
  },
  {
    "id": "2207962",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister and Minister of Cooperation Shri Amit Shah condoles the demise of renowned Hindi writer and Jnanpith Award laureate Vinod Kumar Shukla, terming it a great loss to the literary world",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207962",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah condoles the demise of renowned Hindi writer and Jnanpith Award laureate Vinod Kumar Shukla, terming it a great loss to the literary world Vinod Kumar Shukla, known for his simple writing style and humble personality, will always be remembered for his unique literary artistry My deepest condolences are with his family, admirers and countless readers May God grant peace to the departed soul, Om Shanti Shanti Shanti प्रविष्टि तिथि:\r\n                23 DEC 2025 10:04PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has condoled the demise of renowned Hindi writer and Jnanpith Award laureate Vinod Kumar Shukla and termed it a great loss to the literary world. In a post on ‘X’, Union Home Minister Shri Amit Shah said that the passing of renowned Hindi writer and Jnanpith Award recipient Vinod Kumar Shukla is a great loss to the literary world. He said that Vinod Kumar Shukla, known for his simple writing style and humble personality, will always be remembered for his unique literary artistry. Shri Shah said that my deepest condolences are with his family, admirers and countless readers. May God grant peace to the departed soul. Om Shanti Shanti Shanti. प्रसिद्ध हिंदी साहित्यकार, भारतीय ज्ञानपीठ से सम्मानित विनोद कुमार शुक्ल जी का निधन साहित्य जगत के लिए बहुत बड़ी क्षति है। सादगीपूर्ण लेखन और सरल व्यक्तित्व के लिए प्रसिद्ध विनोद कुमार शुक्ल जी अपनी विशिष्ट लेखन कला के लिए सदैव याद किए जाएँगे। मेरी संवेदनाएँ उनके परिजनों,… — Amit Shah (@AmitShah) December 23, 2025 *** RK / RR / PS (रिलीज़ आईडी: 2207962) आगंतुक पटल  : 106 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी , Malayalam Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah condoles the demise of renowned Hindi writer and Jnanpith Award laureate Vinod Kumar Shukla, terming it a great loss to the literary world Vinod Kumar Shukla, known for his simple writing style and humble personality, will always be remembered for his unique literary artistry My deepest condolences are with his family, admirers and countless readers May God grant peace to the departed soul, Om Shanti Shanti Shanti प्रविष्टि तिथि:\r\n                        23 DEC 2025 10:04PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has condoled the demise of renowned Hindi writer and Jnanpith Award laureate Vinod Kumar Shukla and termed it a great loss to the literary world. In a post on ‘X’, Union Home Minister Shri Amit Shah said that the passing of renowned Hindi writer and Jnanpith Award recipient Vinod Kumar Shukla is a great loss to the literary world. He said that Vinod Kumar Shukla, known for his simple writing style and humble personality, will always be remembered for his unique literary artistry. Shri Shah said that my deepest condolences are with his family, admirers and countless readers. May God grant peace to the departed soul. Om Shanti Shanti Shanti. प्रसिद्ध हिंदी साहित्यकार, भारतीय ज्ञानपीठ से सम्मानित विनोद कुमार शुक्ल जी का निधन साहित्य जगत के लिए बहुत बड़ी क्षति है। सादगीपूर्ण लेखन और सरल व्यक्तित्व के लिए प्रसिद्ध विनोद कुमार शुक्ल जी अपनी विशिष्ट लेखन कला के लिए सदैव याद किए जाएँगे। मेरी संवेदनाएँ उनके परिजनों,… — Amit Shah (@AmitShah) December 23, 2025 *** RK / RR / PS (रिलीज़ आईडी: 2207962)",
    "scraped_at": "2025-12-23T17:43:02.440734"
  },
  {
    "id": "2207762",
    "ministry": "Ministry of Panchayati Raj",
    "title": "PESA Mahotsav begins in Visakhapatnam with energetic PESA Run and day-long tribal sports, cultural and grassroots engagements",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207762",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Panchayati Raj PESA Mahotsav begins in Visakhapatnam with energetic PESA Run and day-long tribal sports, cultural and grassroots engagements प्रविष्टि तिथि:\r\n                23 DEC 2025 4:47PM by PIB Hyderabad Visakhapatnam, 23 rd December 2025 The two-day PESA Mahotsav (23–24 December 2025) commenced today in Visakhapatnam, Andhra Pradesh, with the PESA Run along the iconic Ramakrishna (R.K.) Beach, marking a vibrant start to the celebrations around the Panchayats (Extension to Scheduled Areas) Act, 1996 (PESA). The early-morning PESA Run witnessed enthusiastic participation from people across all age groups, especially the tribal youth. The run was flagged off by Arjuna Awardee and renowned Indian archer Ms. Jyothi Surekha Vennam in the presence of Smt. Mukta Shekhar, Joint Secretary, Ministry of Panchayati Raj; Shri Mutyalaraju Revu, Commissioner, APSIRD&PR; Shri V. R. Krishna Teja Mylavarapu, Commissioner & Director (Panchayat Raj & Rural Development); Dr. M. Sudhakar Rao, Additional Commissioner (PR); and other senior officials, who also addressed the participants. The speakers highlighted the spirit of PESA and its role in empowering Gram Sabhas and safeguarding the rights, community resources and cultural identity of tribal communities in Scheduled Areas. Following the PESA Run, the PESA Mahotsav was formally inaugurated by Smt. Mukta Shekhar, Joint Secretary, MoPR, Dr. Bijaya Kumar Behera, Economic Adviser, MoPR and Shri V. R. Krishna Teja Mylavarapu, Commissioner & Director (Panchayat Raj & Rural Development), Government of Andhra Pradesh, and a series of activities were organised throughout the day. Exhibition stalls, including a Craft Bazaar and Food Festival, showcased tribal handicrafts and local cuisines. Competitive events in Kabaddi and Archery were conducted, with Kabaddi semi-final matches held during the day and archery competitions progressing through qualifying, elimination and medal rounds. The 2 nd half of the 1 st day event featured vibrant Tribal Demo Games by teams from several PESA States, presenting traditional indigenous games such as Cholo, Yedu Penkulata, Gedi Doud, Rasa Kashi, Uppanna Barelu, Pithool, Sikor, Mallakhamba and Chakki Khel, reflecting the rich sporting heritage of tribal communities. In parallel, Gram Sabhas were conducted in ten PESA Gram Panchayats under Alluri Sitharama Raju District with discussions on thematic areas, including strengthening of Gram Sabhas, prevention of land alienation, ownership of minor forest produce, control over minor minerals, management of community resources and minor water bodies, control over intoxicants and money lending, and preservation of customs, traditions and cultural identity. The PESA Mahotsav continues tomorrow with technical sessions, launch of landmark initiatives, cultural events, prize distribution ceremony and valedictory sessions to mark the celebrations of PESA Day, reinforcing the message of participatory governance and strengthening grassroots democracy in Scheduled Areas. YouTube: https://www.youtube.com/live/X6EGU9lBmmg?si=UZYMQZaYaXU114nt Facebook: https://fb.watch/E9QNp8k3Pm/ Twitter:  https://x.com/mopr_goi/status/2003320353259733118?s=20 *** GSK/YUP (रिलीज़ आईडी: 2207762) आगंतुक पटल  : 317 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Gujarati , Odia , Telugu Ministry of Panchayati Raj PESA Mahotsav begins in Visakhapatnam with energetic PESA Run and day-long tribal sports, cultural and grassroots engagements प्रविष्टि तिथि:\r\n                        23 DEC 2025 4:47PM by PIB Hyderabad Visakhapatnam, 23 rd December 2025 The two-day PESA Mahotsav (23–24 December 2025) commenced today in Visakhapatnam, Andhra Pradesh, with the PESA Run along the iconic Ramakrishna (R.K.) Beach, marking a vibrant start to the celebrations around the Panchayats (Extension to Scheduled Areas) Act, 1996 (PESA). The early-morning PESA Run witnessed enthusiastic participation from people across all age groups, especially the tribal youth. The run was flagged off by Arjuna Awardee and renowned Indian archer Ms. Jyothi Surekha Vennam in the presence of Smt. Mukta Shekhar, Joint Secretary, Ministry of Panchayati Raj; Shri Mutyalaraju Revu, Commissioner, APSIRD&PR; Shri V. R. Krishna Teja Mylavarapu, Commissioner & Director (Panchayat Raj & Rural Development); Dr. M. Sudhakar Rao, Additional Commissioner (PR); and other senior officials, who also addressed the participants. The speakers highlighted the spirit of PESA and its role in empowering Gram Sabhas and safeguarding the rights, community resources and cultural identity of tribal communities in Scheduled Areas. Following the PESA Run, the PESA Mahotsav was formally inaugurated by Smt. Mukta Shekhar, Joint Secretary, MoPR, Dr. Bijaya Kumar Behera, Economic Adviser, MoPR and Shri V. R. Krishna Teja Mylavarapu, Commissioner & Director (Panchayat Raj & Rural Development), Government of Andhra Pradesh, and a series of activities were organised throughout the day. Exhibition stalls, including a Craft Bazaar and Food Festival, showcased tribal handicrafts and local cuisines. Competitive events in Kabaddi and Archery were conducted, with Kabaddi semi-final matches held during the day and archery competitions progressing through qualifying, elimination and medal rounds. The 2 nd half of the 1 st day event featured vibrant Tribal Demo Games by teams from several PESA States, presenting traditional indigenous games such as Cholo, Yedu Penkulata, Gedi Doud, Rasa Kashi, Uppanna Barelu, Pithool, Sikor, Mallakhamba and Chakki Khel, reflecting the rich sporting heritage of tribal communities. In parallel, Gram Sabhas were conducted in ten PESA Gram Panchayats under Alluri Sitharama Raju District with discussions on thematic areas, including strengthening of Gram Sabhas, prevention of land alienation, ownership of minor forest produce, control over minor minerals, management of community resources and minor water bodies, control over intoxicants and money lending, and preservation of customs, traditions and cultural identity. The PESA Mahotsav continues tomorrow with technical sessions, launch of landmark initiatives, cultural events, prize distribution ceremony and valedictory sessions to mark the celebrations of PESA Day, reinforcing the message of participatory governance and strengthening grassroots democracy in Scheduled Areas. YouTube: https://www.youtube.com/live/X6EGU9lBmmg?si=UZYMQZaYaXU114nt Facebook: https://fb.watch/E9QNp8k3Pm/ Twitter:  https://x.com/mopr_goi/status/2003320353259733118?s=20 *** GSK/YUP (रिलीज़ आईडी: 2207762)",
    "scraped_at": "2025-12-23T17:43:04.134164"
  },
  {
    "id": "2207846",
    "ministry": "Ministry of Personnel, Public Grievances & Pensions",
    "title": "Dr. Jitendra Singh will chair the 15th Pension Adalat at T N Chaturvedi Hall, IIPA, New Delhi on 24.12.2025",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207846",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Personnel, Public Grievances & Pensions Dr. Jitendra Singh will chair the 15th Pension Adalat at T N Chaturvedi Hall, IIPA, New Delhi on 24.12.2025 1087 long pending pension grievances will be taken up for redressal Committed to ensure faster resolution of grievances and enhance dignity and financial security for the Family Pensioners प्रविष्टि तिथि:\r\n                23 DEC 2025 6:57PM by PIB Delhi Department of Pension and Pensioners’ Welfare will be conducting the 15th Pension Adalat under the Chairmanship of Hon’ble MoS (PP), Dr Jitendra Singh at T N Chaturvedi Hall, Indian Institute of Public Administration (IIPA), New Delhi on 24.12.2025. 1087 long standing pension grievances pertaining to 24 Departments/Ministries are proposed to be taken up in the Adalat for redressal. Department wise list is mentioned below: S.No. Ministry/Department No. of Cases Ministry of Defence 716 Ministry of Home Affairs 242 Employees Provident Fund Organisation (Head Office) 38 Department of Financial Services (Banking Division) 24 Central Board of Direct Taxes (Income Tax) 20 Ministry of Railways ( Railway Board) 10 Department of Health & Family Welfare 07 Ministry of External Affairs 04 Ministry of Housing and Urban Affairs 03 Ministry of Petroleum and Natural Gas 03 Department of Agriculture and Farmers Welfare 02 Department of Commerce 02 Department of Personnel and Training 02 Department of Scientific & Industrial Research 02 Ministry of Statistics and Programme Implementation 02 O/o the Comptroller & Auditor General of India 02 Central Pension Accounts Office New Delhi 01 Department of Food and Public Distribution 01 Department of Higher Education 01 Department of Posts 01 Department of Rural Development 01 Department of Space 01 Ministry of Civil Aviation 01 Ministry of Panchayati Raj 01 TOTAL 1087 It is envisaged to resolve the long-pending grievances thereby facilitating payment of the rightful due of the pensioners whether in the form of huge arrears due to delay in either starting of the family pension or due to procedural delays, the pension has not been processed and disbursed correctly. ***** NKR/AK (रिलीज़ आईडी: 2207846) आगंतुक पटल  : 146 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Personnel, Public Grievances & Pensions Dr. Jitendra Singh will chair the 15th Pension Adalat at T N Chaturvedi Hall, IIPA, New Delhi on 24.12.2025 1087 long pending pension grievances will be taken up for redressal Committed to ensure faster resolution of grievances and enhance dignity and financial security for the Family Pensioners प्रविष्टि तिथि:\r\n                        23 DEC 2025 6:57PM by PIB Delhi Department of Pension and Pensioners’ Welfare will be conducting the 15th Pension Adalat under the Chairmanship of Hon’ble MoS (PP), Dr Jitendra Singh at T N Chaturvedi Hall, Indian Institute of Public Administration (IIPA), New Delhi on 24.12.2025. 1087 long standing pension grievances pertaining to 24 Departments/Ministries are proposed to be taken up in the Adalat for redressal. Department wise list is mentioned below: S.No. Ministry/Department No. of Cases Ministry of Defence 716 Ministry of Home Affairs 242 Employees Provident Fund Organisation (Head Office) 38 Department of Financial Services (Banking Division) 24 Central Board of Direct Taxes (Income Tax) 20 Ministry of Railways ( Railway Board) 10 Department of Health & Family Welfare 07 Ministry of External Affairs 04 Ministry of Housing and Urban Affairs 03 Ministry of Petroleum and Natural Gas 03 Department of Agriculture and Farmers Welfare 02 Department of Commerce 02 Department of Personnel and Training 02 Department of Scientific & Industrial Research 02 Ministry of Statistics and Programme Implementation 02 O/o the Comptroller & Auditor General of India 02 Central Pension Accounts Office New Delhi 01 Department of Food and Public Distribution 01 Department of Higher Education 01 Department of Posts 01 Department of Rural Development 01 Department of Space 01 Ministry of Civil Aviation 01 Ministry of Panchayati Raj 01 TOTAL 1087 It is envisaged to resolve the long-pending grievances thereby facilitating payment of the rightful due of the pensioners whether in the form of huge arrears due to delay in either starting of the family pension or due to procedural delays, the pension has not been processed and disbursed correctly. ***** NKR/AK (रिलीज़ आईडी: 2207846)",
    "scraped_at": "2025-12-23T17:43:06.281049"
  },
  {
    "id": "2207797",
    "ministry": "Ministry of Power",
    "title": "Shri Manohar Lal Inaugurates Commercial Operation of the first Unit of Country's Largest Hydropower Project",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207797",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Power Shri Manohar Lal Inaugurates Commercial Operation of the first Unit of Country's Largest Hydropower Project प्रविष्टि तिथि:\r\n                23 DEC 2025 5:37PM by PIB Delhi Shri Manohar Lal, Union Minister of Power, Housing & Urban Affairs, inaugurated today the commercial operation of Unit–2 (250 MW) of the 2000 MW (8×250 MW) Subansiri Lower Hydroelectric Project through virtual mode. He stated that the commissioning of this unit is “not just a technical achievement, but a testament to years of hard work, dedication, and teamwork.” He further emphasized that the Subansiri Project stands as a symbol of India’s commitment to clean and sustainable energy, supporting North-East India’s growth, strengthening the national grid and advancing India’s ambitious Net Zero goals. The event was also attended by Shri Pankaj Agarwal, Secretary (Power), Shri Bhupender Gupta, CMD, NHPC, and other officers of the Ministry of Power and NHPC. Shri Pankaj Agarwal lauded NHPC’s achievement, highlighting that the Subansiri Lower Project will greatly improve energy supply in the North-East and serve as a testament to India’s commitment to state-of-the-art, sustainable power systems. He emphasized timely commissioning of the remaining units, noting that the Subansiri Project will continue to play a pivotal role in India’s transition to a Net Zero energy future while generating substantial socio-economic benefits for local communities. Shri Bhupender Gupta, CMD, NHPC, expressed his heartfelt gratitude to the Ministry of Power, the Governments of Arunachal Pradesh and Assam, former NHPC leadership, the entire Subansiri Project team, all key stakeholders and partners for their dedicated support in making this milestone achievement possible. He further stated that the project will strengthen the national grid, support sustainable development in the North-East and provide reliable renewable energy to meet growing demand. With the commissioning of Unit # 2, the Project is moving swiftly towards commissioning of 3 Units of 250 MW each shortly, followed by phased commissioning of the remaining four units during 2026-27. Upon full commissioning, the 2000 MW Subansiri Lower Hydroelectric Project will make a significant contribution to India’s renewable energy capacity, enhance national grid resilience and usher in a new era in massive clean energy contribution. As India’s largest hydropower project, the Subansiri Lower Project comprises 8 units of 250 MW each and is designed as a Run-of-the-River scheme with small pondage, diverting water through eight Head Race Tunnels (HRTs) to generate 7,422 million units (MU) of renewable electricity annually contributing significantly to India’s green energy future. The project features the largest dam in North-East India, a 116-metre-high concrete gravity dam, which not only strengthens regional infrastructure and grid resilience but also enhances flood moderation and water management in the Subansiri River basin. The Subansiri Lower H.E. Project exemplifies engineering excellence, featuring India’s heaviest hydro generator rotors, largest stators and biggest main inlet valves, along with innovations such as the nation’s largest aggregate processing plants, highest-capacity batching plant and first-ever use of Rotec’s Tower Belt for dam concreting in India. As the first cascaded dam on the Subansiri River, it provides flood moderation with a 442 million cubic metre flood cushion. With a gross reservoir storage of 1,365 million cubic metres at FRL, about one-third remains empty during floods to absorb excess water and protect downstream communities. NHPC has implemented extensive riverbank protection and erosion control measures along the Subansiri River, completing works up to 30 km downstream and extending them up to 60 km. with an investment of about ₹522 crore. This has effectively stabilized the riverbanks for over five years. In addition, NHPC is supporting downstream community development through livelihood programs in piggery, sericulture and handloom, developed with IRMA. These initiatives, now in production, benefit around 5,000 women farmers and promote sustainable socio-economic development in the region. Apart from supplying electricity to 16 beneficiary states across India, the Subansiri Lower H.E. Project will provide free power allocations to Arunachal Pradesh and Assam, while the North-East region will receive 1,000 MW from the project, significantly strengthening regional energy availability. The project has generated strong socio-economic benefits for the region by engaging around 7,000 local people daily during its construction phase and creating numerous direct and indirect jobs through contractors, service providers and local markets. With the commissioning of the project and the availability of continuous power, new small-scale industries are expected to emerge, further expanding employment and business opportunities while helping reduce outmigration. Additionally, the project is expected to boost tourism and enhance river navigation, contributing to long-term regional development and prosperity. NHPC has invested around ₹155 crore in CSR initiatives across Arunachal Pradesh and Assam. Key works include constructing 3,129 toilets under Swachh Vidyalaya Abhiyaan, establishing a Vivekananda Kendra Vidyalaya in Dollungmukh serving 250 students , providing safe drinking water facilities at 1,841 locations and RO water with sanitation at 9 locations and executing multiple rural development projects such as community halls, meeting halls, causeways and water supply schemes in nearby areas. Over the last five decades, NHPC has successfully executed hydropower projects in some of the most challenging terrains and has diversified into solar, wind, and green hydrogen, reinforcing its position as a 100% Green Energy Company. With an installed capacity of 8333 MW from 30 power stations and 14 projects totaling 9704 MW currently under construction, NHPC continues to play a vital role in advancing India’s clean energy transition and strengthening national energy security. ******* NR/AP (रिलीज़ आईडी: 2207797) आगंतुक पटल  : 656 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी Ministry of Power Shri Manohar Lal Inaugurates Commercial Operation of the first Unit of Country's Largest Hydropower Project प्रविष्टि तिथि:\r\n                        23 DEC 2025 5:37PM by PIB Delhi Shri Manohar Lal, Union Minister of Power, Housing & Urban Affairs, inaugurated today the commercial operation of Unit–2 (250 MW) of the 2000 MW (8×250 MW) Subansiri Lower Hydroelectric Project through virtual mode. He stated that the commissioning of this unit is “not just a technical achievement, but a testament to years of hard work, dedication, and teamwork.” He further emphasized that the Subansiri Project stands as a symbol of India’s commitment to clean and sustainable energy, supporting North-East India’s growth, strengthening the national grid and advancing India’s ambitious Net Zero goals. The event was also attended by Shri Pankaj Agarwal, Secretary (Power), Shri Bhupender Gupta, CMD, NHPC, and other officers of the Ministry of Power and NHPC. Shri Pankaj Agarwal lauded NHPC’s achievement, highlighting that the Subansiri Lower Project will greatly improve energy supply in the North-East and serve as a testament to India’s commitment to state-of-the-art, sustainable power systems. He emphasized timely commissioning of the remaining units, noting that the Subansiri Project will continue to play a pivotal role in India’s transition to a Net Zero energy future while generating substantial socio-economic benefits for local communities. Shri Bhupender Gupta, CMD, NHPC, expressed his heartfelt gratitude to the Ministry of Power, the Governments of Arunachal Pradesh and Assam, former NHPC leadership, the entire Subansiri Project team, all key stakeholders and partners for their dedicated support in making this milestone achievement possible. He further stated that the project will strengthen the national grid, support sustainable development in the North-East and provide reliable renewable energy to meet growing demand. With the commissioning of Unit # 2, the Project is moving swiftly towards commissioning of 3 Units of 250 MW each shortly, followed by phased commissioning of the remaining four units during 2026-27. Upon full commissioning, the 2000 MW Subansiri Lower Hydroelectric Project will make a significant contribution to India’s renewable energy capacity, enhance national grid resilience and usher in a new era in massive clean energy contribution. As India’s largest hydropower project, the Subansiri Lower Project comprises 8 units of 250 MW each and is designed as a Run-of-the-River scheme with small pondage, diverting water through eight Head Race Tunnels (HRTs) to generate 7,422 million units (MU) of renewable electricity annually contributing significantly to India’s green energy future. The project features the largest dam in North-East India, a 116-metre-high concrete gravity dam, which not only strengthens regional infrastructure and grid resilience but also enhances flood moderation and water management in the Subansiri River basin. The Subansiri Lower H.E. Project exemplifies engineering excellence, featuring India’s heaviest hydro generator rotors, largest stators and biggest main inlet valves, along with innovations such as the nation’s largest aggregate processing plants, highest-capacity batching plant and first-ever use of Rotec’s Tower Belt for dam concreting in India. As the first cascaded dam on the Subansiri River, it provides flood moderation with a 442 million cubic metre flood cushion. With a gross reservoir storage of 1,365 million cubic metres at FRL, about one-third remains empty during floods to absorb excess water and protect downstream communities. NHPC has implemented extensive riverbank protection and erosion control measures along the Subansiri River, completing works up to 30 km downstream and extending them up to 60 km. with an investment of about ₹522 crore. This has effectively stabilized the riverbanks for over five years. In addition, NHPC is supporting downstream community development through livelihood programs in piggery, sericulture and handloom, developed with IRMA. These initiatives, now in production, benefit around 5,000 women farmers and promote sustainable socio-economic development in the region. Apart from supplying electricity to 16 beneficiary states across India, the Subansiri Lower H.E. Project will provide free power allocations to Arunachal Pradesh and Assam, while the North-East region will receive 1,000 MW from the project, significantly strengthening regional energy availability. The project has generated strong socio-economic benefits for the region by engaging around 7,000 local people daily during its construction phase and creating numerous direct and indirect jobs through contractors, service providers and local markets. With the commissioning of the project and the availability of continuous power, new small-scale industries are expected to emerge, further expanding employment and business opportunities while helping reduce outmigration. Additionally, the project is expected to boost tourism and enhance river navigation, contributing to long-term regional development and prosperity. NHPC has invested around ₹155 crore in CSR initiatives across Arunachal Pradesh and Assam. Key works include constructing 3,129 toilets under Swachh Vidyalaya Abhiyaan, establishing a Vivekananda Kendra Vidyalaya in Dollungmukh serving 250 students , providing safe drinking water facilities at 1,841 locations and RO water with sanitation at 9 locations and executing multiple rural development projects such as community halls, meeting halls, causeways and water supply schemes in nearby areas. Over the last five decades, NHPC has successfully executed hydropower projects in some of the most challenging terrains and has diversified into solar, wind, and green hydrogen, reinforcing its position as a 100% Green Energy Company. With an installed capacity of 8333 MW from 30 power stations and 14 projects totaling 9704 MW currently under construction, NHPC continues to play a vital role in advancing India’s clean energy transition and strengthening national energy security. ******* NR/AP (रिलीज़ आईडी: 2207797)",
    "scraped_at": "2025-12-23T17:43:08.450173"
  },
  {
    "id": "2207860",
    "ministry": "Ministry of Science & Technology",
    "title": "President Droupadi Murmu Confers \"Rashtriya Vigyan Puraskar 2025\" on 24 eminent Scientists at Rashtrapati Bhavan",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207860",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Science & Technology President Droupadi Murmu Confers \"Rashtriya Vigyan Puraskar 2025\" on 24 eminent Scientists at Rashtrapati Bhavan Prestigious \"Vigyan Ratna Puruskar\" for lifetime achievement conferred posthumously on renowned Astrophysicist Jayant Narlikar as India Honours Scientific Excellence The CSIR-Aroma Mission Team that powered India’s much-discussed \"Purple Revolution\" and Lavender entrepreneurship finds recognition in \"Rashtriya Vigyan Team Puraskar 2025\" or Vigyan Team Award प्रविष्टि तिथि:\r\n                23 DEC 2025 7:25PM by PIB Delhi At the second \"Rashtriya Vigyan Puraskar\" ceremony held at Rashtrapati Bhavan today, the prestigious \"Rashtriya Vigyan Ratna Puraskar 2025\" for lifetime achievement was awarded posthumously to eminent astrophysicist Prof. Jayant Vishnu Narlikar while the entrepreneurial science team that powered India’s much-discussed \"Purple Revolution\" and Lavender entrepreneurship found national recognition in \"Rashtriya Vigyan Team Puraskar 2025\" or Vigyan Team Award , which was bagged by the CSIR-led Aroma Mission. President Droupadi Murmu presented the awards to 24 scientists and innovators across disciplines, in the presence of Union Minister of Science and Technology Dr. Jitendra Singh. The Rashtriya Vigyan Puruskars were instituted by the Modi government. Taking to 'X', Dr Jitendra Singh wrote, \"Congratulations “Team Aroma” for the coveted #RashtriyaVigyanPuruskar 2025, in recognition of your contribution in gifting the world the concept of “Purple Revolution” and presenting “Lavender” as a new avenue of Agri-Entrepreneurship…. kindling prospects of attractive livelihood even in remote hilly terrains of the Himalayas\". Congratulations “Team Aroma” for the coveted #RashtriyaVigyanPuruskar 2025, in recognition of your contribution in gifting the world the concept of “Purple Revolution” and presenting “Lavender” as a new avenue of Agri-Entrepreneurship…. kindling prospects of attractive… pic.twitter.com/FsEegr6PET — Dr Jitendra Singh (@DrJitendraSingh) December 23, 2025 The Aroma Mission team, working under the Council of Scientific and Industrial Research, has been widely credited with translating laboratory research into field-level outcomes by promoting cultivation and processing of aromatic crops, particularly lavender, in the Himalayan region. Its work helped open new livelihood avenues for farmers in Jammu and Kashmir, reduced dependence on imports of essential oils, and demonstrated how coordinated scientific intervention can lead to measurable socio-economic impact. The recognition places collaborative, application-oriented science at the centre of the national awards framework. The Lavender cultivation and entrepreneurship, beginning from Bhaderwah and Gulmarg townships of J&K has now spread in other parts of the UT also and is being adopted by other States like Uttarakhand and Himachal Pradesh as well. The Rashtriya Vigyan Puraskar, instituted last year as part of a new national science awards architecture, is designed to acknowledge scientific work across the full spectrum — from lifetime achievement to early-career excellence and team-based innovation. This year’s ceremony marked the second edition of the awards, underscoring the government’s intent to present science and technology honours in a structured, contemporary format aligned with global best practices. Among the honours announced, the Vigyan Ratna for lifetime achievement was awarded posthumously to eminent astrophysicist Prof. Jayant Vishnu Narlikar, while several Vigyan Shri and Vigyan Yuva awards recognised individual contributions across physics, agriculture, biological sciences, chemistry, engineering, medicine, space science, mathematics, and technology. The full list of awardees spans senior scientists as well as researchers below the age of 45, reflecting the award’s emphasis on both experience and emerging talent. Under the Vigyan Shri category, which recognises distinguished contributions in specific fields, awards were conferred on Dr. Gyanendra Pratap Singh (Agricultural Science), Dr. Yusuf Mohammad Sheikh (Atomic Energy), Dr. K. Thangaraj (Biological Sciences), Prof. Pradeep Thalappil (Chemistry), Prof. Aniruddha Bhalchandra Pandit (Engineering Sciences), Dr. S. Venkata Mohan (Environmental Science), Prof. Mahan Mj (Mathematics and Computer Science), and Shri Jayan N (Space Science and Technology), highlighting sustained and field-defining work across disciplines. The Vigyan Yuva–Shanti Swarup Bhatnagar Award, aimed at scientists below the age of 45, recognised emerging researchers for innovative contributions. Awardees included Prof. Amit Kumar Agarwal and Prof. Surhud Shrikant More in Physics; Dr. Jagdis Gupta Kapuganti and Dr. Satendra Kumar Mangrauthia in Agricultural Science; Dr. Deepa Agashe and Shri Debarka Sengupta in Biological Sciences; Dr. Dibyendu Das in Chemistry; Dr. Waliur Rahaman in Earth Science; Prof. Arkaprava Basu in Engineering Sciences; Prof. Sabyasachi Mukherjee and Prof. Shweta Prem Agrawal in Mathematics and Computer Science; Dr. Suresh Kumar in Medicine; Shri Ankur Garg in Space Science and Technology; and Prof. Mohanasankar Sivaprakasam in Technology and Innovation. Women scientists featured prominently among this year’s awardees, with recognition across multiple categories and disciplines. Researchers such as Dr. Deepa Agashe and Prof. Shweta Prem Agrawal were honoured for their work, reflecting the growing participation and leadership of women in India’s scientific ecosystem. Dr. Jitendra Singh congratulated all the award recipients, stating that their work reflected the depth and diversity of India’s scientific talent and underscored the role of science and technology in addressing national priorities and improving the quality of life of citizens. The presence of the President and the Science and Technology Minister was seen as reinforcing the national priority accorded to scientific research, innovation, and its translation into public value. The awards framework also seeks to bring clarity to categories, particularly the young scientist segment, by clearly defining age and achievement criteria. With the Aroma Mission’s recognition, the ceremony highlighted how government-backed scientific programmes, when anchored in local needs and implemented through teamwork, can deliver outcomes that go beyond laboratories and journals. As India looks to strengthen its science-led development model, the Rashtriya Vigyan Puraskar is increasingly positioned as a platform that connects research excellence with national priorities and grassroots impact. List of Awardees for Rashtriya Vigyan Puraskar (RVP) - 2025 ***** NKR/AK (रिलीज़ आईडी: 2207860) आगंतुक पटल  : 319 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , Kannada Ministry of Science & Technology President Droupadi Murmu Confers \"Rashtriya Vigyan Puraskar 2025\" on 24 eminent Scientists at Rashtrapati Bhavan Prestigious \"Vigyan Ratna Puruskar\" for lifetime achievement conferred posthumously on renowned Astrophysicist Jayant Narlikar as India Honours Scientific Excellence The CSIR-Aroma Mission Team that powered India’s much-discussed \"Purple Revolution\" and Lavender entrepreneurship finds recognition in \"Rashtriya Vigyan Team Puraskar 2025\" or Vigyan Team Award प्रविष्टि तिथि:\r\n                        23 DEC 2025 7:25PM by PIB Delhi At the second \"Rashtriya Vigyan Puraskar\" ceremony held at Rashtrapati Bhavan today, the prestigious \"Rashtriya Vigyan Ratna Puraskar 2025\" for lifetime achievement was awarded posthumously to eminent astrophysicist Prof. Jayant Vishnu Narlikar while the entrepreneurial science team that powered India’s much-discussed \"Purple Revolution\" and Lavender entrepreneurship found national recognition in \"Rashtriya Vigyan Team Puraskar 2025\" or Vigyan Team Award , which was bagged by the CSIR-led Aroma Mission. President Droupadi Murmu presented the awards to 24 scientists and innovators across disciplines, in the presence of Union Minister of Science and Technology Dr. Jitendra Singh. The Rashtriya Vigyan Puruskars were instituted by the Modi government. Taking to 'X', Dr Jitendra Singh wrote, \"Congratulations “Team Aroma” for the coveted #RashtriyaVigyanPuruskar 2025, in recognition of your contribution in gifting the world the concept of “Purple Revolution” and presenting “Lavender” as a new avenue of Agri-Entrepreneurship…. kindling prospects of attractive livelihood even in remote hilly terrains of the Himalayas\". Congratulations “Team Aroma” for the coveted #RashtriyaVigyanPuruskar 2025, in recognition of your contribution in gifting the world the concept of “Purple Revolution” and presenting “Lavender” as a new avenue of Agri-Entrepreneurship…. kindling prospects of attractive… pic.twitter.com/FsEegr6PET — Dr Jitendra Singh (@DrJitendraSingh) December 23, 2025 The Aroma Mission team, working under the Council of Scientific and Industrial Research, has been widely credited with translating laboratory research into field-level outcomes by promoting cultivation and processing of aromatic crops, particularly lavender, in the Himalayan region. Its work helped open new livelihood avenues for farmers in Jammu and Kashmir, reduced dependence on imports of essential oils, and demonstrated how coordinated scientific intervention can lead to measurable socio-economic impact. The recognition places collaborative, application-oriented science at the centre of the national awards framework. The Lavender cultivation and entrepreneurship, beginning from Bhaderwah and Gulmarg townships of J&K has now spread in other parts of the UT also and is being adopted by other States like Uttarakhand and Himachal Pradesh as well. The Rashtriya Vigyan Puraskar, instituted last year as part of a new national science awards architecture, is designed to acknowledge scientific work across the full spectrum — from lifetime achievement to early-career excellence and team-based innovation. This year’s ceremony marked the second edition of the awards, underscoring the government’s intent to present science and technology honours in a structured, contemporary format aligned with global best practices. Among the honours announced, the Vigyan Ratna for lifetime achievement was awarded posthumously to eminent astrophysicist Prof. Jayant Vishnu Narlikar, while several Vigyan Shri and Vigyan Yuva awards recognised individual contributions across physics, agriculture, biological sciences, chemistry, engineering, medicine, space science, mathematics, and technology. The full list of awardees spans senior scientists as well as researchers below the age of 45, reflecting the award’s emphasis on both experience and emerging talent. Under the Vigyan Shri category, which recognises distinguished contributions in specific fields, awards were conferred on Dr. Gyanendra Pratap Singh (Agricultural Science), Dr. Yusuf Mohammad Sheikh (Atomic Energy), Dr. K. Thangaraj (Biological Sciences), Prof. Pradeep Thalappil (Chemistry), Prof. Aniruddha Bhalchandra Pandit (Engineering Sciences), Dr. S. Venkata Mohan (Environmental Science), Prof. Mahan Mj (Mathematics and Computer Science), and Shri Jayan N (Space Science and Technology), highlighting sustained and field-defining work across disciplines. The Vigyan Yuva–Shanti Swarup Bhatnagar Award, aimed at scientists below the age of 45, recognised emerging researchers for innovative contributions. Awardees included Prof. Amit Kumar Agarwal and Prof. Surhud Shrikant More in Physics; Dr. Jagdis Gupta Kapuganti and Dr. Satendra Kumar Mangrauthia in Agricultural Science; Dr. Deepa Agashe and Shri Debarka Sengupta in Biological Sciences; Dr. Dibyendu Das in Chemistry; Dr. Waliur Rahaman in Earth Science; Prof. Arkaprava Basu in Engineering Sciences; Prof. Sabyasachi Mukherjee and Prof. Shweta Prem Agrawal in Mathematics and Computer Science; Dr. Suresh Kumar in Medicine; Shri Ankur Garg in Space Science and Technology; and Prof. Mohanasankar Sivaprakasam in Technology and Innovation. Women scientists featured prominently among this year’s awardees, with recognition across multiple categories and disciplines. Researchers such as Dr. Deepa Agashe and Prof. Shweta Prem Agrawal were honoured for their work, reflecting the growing participation and leadership of women in India’s scientific ecosystem. Dr. Jitendra Singh congratulated all the award recipients, stating that their work reflected the depth and diversity of India’s scientific talent and underscored the role of science and technology in addressing national priorities and improving the quality of life of citizens. The presence of the President and the Science and Technology Minister was seen as reinforcing the national priority accorded to scientific research, innovation, and its translation into public value. The awards framework also seeks to bring clarity to categories, particularly the young scientist segment, by clearly defining age and achievement criteria. With the Aroma Mission’s recognition, the ceremony highlighted how government-backed scientific programmes, when anchored in local needs and implemented through teamwork, can deliver outcomes that go beyond laboratories and journals. As India looks to strengthen its science-led development model, the Rashtriya Vigyan Puraskar is increasingly positioned as a platform that connects research excellence with national priorities and grassroots impact. List of Awardees for Rashtriya Vigyan Puraskar (RVP) - 2025 ***** NKR/AK (रिलीज़ आईडी: 2207860)",
    "scraped_at": "2025-12-23T17:43:11.506165"
  },
  {
    "id": "2207800",
    "ministry": "Ministry of Social Justice & Empowerment",
    "title": "Department of Social Justice & Empowerment and National Institute for Entrepreneurship and Small Business Development trains 25 transgender persons in entrepreneurship",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207800",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Social Justice & Empowerment Department of Social Justice & Empowerment and National Institute for Entrepreneurship and Small Business Development trains 25 transgender persons in entrepreneurship Valedictory function of second batch of entrepreneurship development training for transgender persons organized by Department of Social Justice & Empowerment 25 transgender persons trained in entrepreneurship, more such trainings to be organized nation wide प्रविष्टि तिथि:\r\n                23 DEC 2025 5:41PM by PIB Delhi The second batch of entrepreneurship development training programme of 25 transgender candidates was completed and its valedictory was held today at Conference Room of Department of Social Justice & Empowerment, Shastri Bhawan, New Delhi. This training was sponsored by the Department of Social Justice & Empowerment and was organized by the National Institute of Entrepreneurship & Small Business Development (NIESBUD), an autonomous institution of Ministry of Skill and Entrepreneurship Development. The valedictory function was chaired by Shri Sudhansh Pant, Secretary, Department of Social Justice & Empowerment, co-chaired by Ms Monali P Dhakate, Joint Secretary, Department of Social Justice & Empowerment and Dr. Poonam Sinha, Director General, National Institute of Entrepreneurship & Small Business Development. Ms. Abhina Aher, CEO, Tweet Foundation, the community based organization, mobilised for this batch of training programme was also present in the valedictory function. Shri Brijesh Kumar, Joint Director, DoSJE briefed on the training conducted by NIESBUD. Participants Manvi, Ziyah Khan, Aryan, Rahat Singh and Katha given  their feedback. While showing interest in taking up entrepreneurship as career to become job provider instead of job seeker, the participants praised the post-training handholding part of the training module. Some of the participants are already into small scale business of bakery, artificial jewellery etc. which they plan to take to higher level by the skills learnt during this training session. Ms Abhina Aher, CEO, Tweet Foundation thanked this collaborative training of NIESBUD and DoSJE and suggested that such to be replicated with convergent welfare plans of other Ministries and Departments as well. Shri Sudhansh Pant, Secretary, DoSJE provided his insights on taking up entrepreneurship as career and the efforts government of India is making in mainstreaming and uplifting social status of the transgender persons. He said that this a small yet very important step in process of economic empowerment of transgender persons and such trainings are need to be organized in entire country. He suggested that the data of trained transgender persons must be maintained with NIESBUD and the trained candidates to be tracked timely for their career growth either in job or self-employment. The next batch of entrepreneurship development training for transgender persons has been planned at Mumbai. Vote of thanks of the valedictory function were presented by Dr.Shivani Dey, Director, NIESBUD. The officials of DoSJE, NIESBUD and Tweet Foundation were present during the function. ****** KV (रिलीज़ आईडी: 2207800) आगंतुक पटल  : 176 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Social Justice & Empowerment Department of Social Justice & Empowerment and National Institute for Entrepreneurship and Small Business Development trains 25 transgender persons in entrepreneurship Valedictory function of second batch of entrepreneurship development training for transgender persons organized by Department of Social Justice & Empowerment 25 transgender persons trained in entrepreneurship, more such trainings to be organized nation wide प्रविष्टि तिथि:\r\n                        23 DEC 2025 5:41PM by PIB Delhi The second batch of entrepreneurship development training programme of 25 transgender candidates was completed and its valedictory was held today at Conference Room of Department of Social Justice & Empowerment, Shastri Bhawan, New Delhi. This training was sponsored by the Department of Social Justice & Empowerment and was organized by the National Institute of Entrepreneurship & Small Business Development (NIESBUD), an autonomous institution of Ministry of Skill and Entrepreneurship Development. The valedictory function was chaired by Shri Sudhansh Pant, Secretary, Department of Social Justice & Empowerment, co-chaired by Ms Monali P Dhakate, Joint Secretary, Department of Social Justice & Empowerment and Dr. Poonam Sinha, Director General, National Institute of Entrepreneurship & Small Business Development. Ms. Abhina Aher, CEO, Tweet Foundation, the community based organization, mobilised for this batch of training programme was also present in the valedictory function. Shri Brijesh Kumar, Joint Director, DoSJE briefed on the training conducted by NIESBUD. Participants Manvi, Ziyah Khan, Aryan, Rahat Singh and Katha given  their feedback. While showing interest in taking up entrepreneurship as career to become job provider instead of job seeker, the participants praised the post-training handholding part of the training module. Some of the participants are already into small scale business of bakery, artificial jewellery etc. which they plan to take to higher level by the skills learnt during this training session. Ms Abhina Aher, CEO, Tweet Foundation thanked this collaborative training of NIESBUD and DoSJE and suggested that such to be replicated with convergent welfare plans of other Ministries and Departments as well. Shri Sudhansh Pant, Secretary, DoSJE provided his insights on taking up entrepreneurship as career and the efforts government of India is making in mainstreaming and uplifting social status of the transgender persons. He said that this a small yet very important step in process of economic empowerment of transgender persons and such trainings are need to be organized in entire country. He suggested that the data of trained transgender persons must be maintained with NIESBUD and the trained candidates to be tracked timely for their career growth either in job or self-employment. The next batch of entrepreneurship development training for transgender persons has been planned at Mumbai. Vote of thanks of the valedictory function were presented by Dr.Shivani Dey, Director, NIESBUD. The officials of DoSJE, NIESBUD and Tweet Foundation were present during the function. ****** KV (रिलीज़ आईडी: 2207800)",
    "scraped_at": "2025-12-23T17:43:13.743792"
  },
  {
    "id": "2207748",
    "ministry": "Ministry of Social Justice & Empowerment",
    "title": "Celebration of Intergenerational Bonds at Government Excellence Higher Secondary School, Nowgong, Madhya Pradesh",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207748",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Social Justice & Empowerment Celebration of Intergenerational Bonds at Government Excellence Higher Secondary School, Nowgong, Madhya Pradesh प्रविष्टि तिथि:\r\n                23 DEC 2025 4:34PM by PIB Delhi The Department of Social Justice & Empowerment, Government of India, organized a programme titled “Celebration of Intergenerational Bonds” on 23 December 2025 at Government Excellence Higher Secondary School, Nowgong, District Chhatarpur, Madhya Pradesh with the objective of strengthening emotional, social, and cultural bonding between different generations and promoting active and dignified ageing. The event was graced by Shri Virendra Kumar, Hon’ble Union Minister for Social Justice & Empowerment, Government of India. Senior government officers, representatives of social organizations, and a large number of students, and family members, including grandparents of the children, were also present in large numbers. The programme aimed to further strengthen the spirit of affection, dialogue, cooperation, and mutual respect between generations. Such initiatives play a vital role in connecting society, carrying forward values and traditions, and strengthening collective social consciousness. The event reaffirmed the Government of India’s commitment to building an inclusive and elder-friendly society by encouraging intergenerational engagement, community participation, and active ageing. It highlighted how the experiences, wisdom, and values of senior citizens, when combined with the energy, creativity, and curiosity of children and youth, contribute to the creation of a balanced, sensitive, and progressive society. The programme at Government Excellence Higher Secondary School, Nowgong featured a wide range of activities designed to promote intergenerational harmony and social cohesion: Cultural performances by students , including dance, music, and artistic presentations, conveying strong messages on the importance of intergenerational bonding, respect for elders, and the continuity of values. Interactive session with senior citizens , providing a platform for them to share their experiences, reflections, and feedback on the initiative, thereby fostering meaningful dialogue between generations. Collective pledge-taking programme, a pledge was administered by Hon'ble Minister, Dr. Virendra Kumar to the attendees, across all age groups for upholding respect, love, and care towards senior citizens. The pledge taking reinforced a shared sense of responsibility and commitment towards the dignity, and well-being of senior citizens. Walkathon led by the Hon’ble Union Minister for Social Justice & Empowerment , symbolizing the shared commitment of children, youth, and senior citizens towards health, unity, and an active lifestyle. The walkathon presented a powerful visual of social harmony and community participation. In his address, Shri Virendra Kumar, Hon’ble Union Minister of Social Justice & Empowerment, emphasized that senior citizens are the custodians of experience, tradition, and values, and are an invaluable strength of the nation. He underlined the importance of promoting active, healthy, and dignified ageing through community-based initiatives and intergenerational engagement. The Hon’ble Minister highlighted several key initiatives of the Ministry, including: Rashtriya Vayoshri Yojana (RVY), under which assistive devices related to mobility, vision, and hearing are provided to senior citizens, enabling them to lead independent and confident lives with dignity. He informed that over 7.28 lakh senior citizens across the country have benefited from the scheme so far. Strengthening of Elderline 14567, which has received more than 27 lakh calls, providing support, guidance, and emergency assistance to senior citizens. Promotion of intergenerational bonding through cultural, community, and outreach programmes across the country, and the provision of celebration of grandparents day at school. Dr. Virendra Kumar, Hon'ble Minister, SJ&E also interacted personally with senior citizens during the programme, listening to their experiences and feedback. The Celebration of this program at Government Excellence Higher Secondary School, Nowgong, Chhatarpur, successfully brought together senior citizens, children, youth, and the community on a shared platform of respect, participation, and cooperation. Through cultural expression, dialogue, physical activity, and collective commitment, the event reinforced the message that intergenerational harmony is essential for building a healthy, inclusive, and compassionate society. Aligned with the vision of Viksit Bharat@2047, the programme underscored the pivotal role of senior citizens as mentors and role models, while encouraging the younger generation to learn from their experiences and contribute actively to nation-building. The event marked another meaningful step in advancing the national agenda on senior citizen welfare and fostering a harmonious, empowered, and inclusive India. ***** KV (रिलीज़ आईडी: 2207748) आगंतुक पटल  : 141 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Social Justice & Empowerment Celebration of Intergenerational Bonds at Government Excellence Higher Secondary School, Nowgong, Madhya Pradesh प्रविष्टि तिथि:\r\n                        23 DEC 2025 4:34PM by PIB Delhi The Department of Social Justice & Empowerment, Government of India, organized a programme titled “Celebration of Intergenerational Bonds” on 23 December 2025 at Government Excellence Higher Secondary School, Nowgong, District Chhatarpur, Madhya Pradesh with the objective of strengthening emotional, social, and cultural bonding between different generations and promoting active and dignified ageing. The event was graced by Shri Virendra Kumar, Hon’ble Union Minister for Social Justice & Empowerment, Government of India. Senior government officers, representatives of social organizations, and a large number of students, and family members, including grandparents of the children, were also present in large numbers. The programme aimed to further strengthen the spirit of affection, dialogue, cooperation, and mutual respect between generations. Such initiatives play a vital role in connecting society, carrying forward values and traditions, and strengthening collective social consciousness. The event reaffirmed the Government of India’s commitment to building an inclusive and elder-friendly society by encouraging intergenerational engagement, community participation, and active ageing. It highlighted how the experiences, wisdom, and values of senior citizens, when combined with the energy, creativity, and curiosity of children and youth, contribute to the creation of a balanced, sensitive, and progressive society. The programme at Government Excellence Higher Secondary School, Nowgong featured a wide range of activities designed to promote intergenerational harmony and social cohesion: Cultural performances by students , including dance, music, and artistic presentations, conveying strong messages on the importance of intergenerational bonding, respect for elders, and the continuity of values. Interactive session with senior citizens , providing a platform for them to share their experiences, reflections, and feedback on the initiative, thereby fostering meaningful dialogue between generations. Collective pledge-taking programme, a pledge was administered by Hon'ble Minister, Dr. Virendra Kumar to the attendees, across all age groups for upholding respect, love, and care towards senior citizens. The pledge taking reinforced a shared sense of responsibility and commitment towards the dignity, and well-being of senior citizens. Walkathon led by the Hon’ble Union Minister for Social Justice & Empowerment , symbolizing the shared commitment of children, youth, and senior citizens towards health, unity, and an active lifestyle. The walkathon presented a powerful visual of social harmony and community participation. In his address, Shri Virendra Kumar, Hon’ble Union Minister of Social Justice & Empowerment, emphasized that senior citizens are the custodians of experience, tradition, and values, and are an invaluable strength of the nation. He underlined the importance of promoting active, healthy, and dignified ageing through community-based initiatives and intergenerational engagement. The Hon’ble Minister highlighted several key initiatives of the Ministry, including: Rashtriya Vayoshri Yojana (RVY), under which assistive devices related to mobility, vision, and hearing are provided to senior citizens, enabling them to lead independent and confident lives with dignity. He informed that over 7.28 lakh senior citizens across the country have benefited from the scheme so far. Strengthening of Elderline 14567, which has received more than 27 lakh calls, providing support, guidance, and emergency assistance to senior citizens. Promotion of intergenerational bonding through cultural, community, and outreach programmes across the country, and the provision of celebration of grandparents day at school. Dr. Virendra Kumar, Hon'ble Minister, SJ&E also interacted personally with senior citizens during the programme, listening to their experiences and feedback. The Celebration of this program at Government Excellence Higher Secondary School, Nowgong, Chhatarpur, successfully brought together senior citizens, children, youth, and the community on a shared platform of respect, participation, and cooperation. Through cultural expression, dialogue, physical activity, and collective commitment, the event reinforced the message that intergenerational harmony is essential for building a healthy, inclusive, and compassionate society. Aligned with the vision of Viksit Bharat@2047, the programme underscored the pivotal role of senior citizens as mentors and role models, while encouraging the younger generation to learn from their experiences and contribute actively to nation-building. The event marked another meaningful step in advancing the national agenda on senior citizen welfare and fostering a harmonious, empowered, and inclusive India. ***** KV (रिलीज़ आईडी: 2207748)",
    "scraped_at": "2025-12-23T17:43:15.567736"
  },
  {
    "id": "2207735",
    "ministry": "Ministry of Social Justice & Empowerment",
    "title": "Celebration of Intergenerational Bonds",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207735",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Social Justice & Empowerment Celebration of Intergenerational Bonds प्रविष्टि तिथि:\r\n                23 DEC 2025 4:13PM by PIB Delhi The Department of Social Justice & Empowerment, Government of India, organized a programme titled “Celebration of Intergenerational Bonds” on 22 December 2025 at Old Tehsil Complex, Mehal Gate, District Chhatarpur, Madhya Pradesh, with the objective of strengthening emotional, social, and cultural bonding between different generations and promoting active and dignified ageing. The event was graced by Shri Virendra Kumar, Hon’ble Union Minister for Social Justice & Empowerment, Government of India. Senior government officers, representatives of social organizations, and a large number of students, and family members, including grandparents of the children, were also present in large numbers. The programme aimed to further strengthen the spirit of affection, dialogue, cooperation, and mutual respect between generations. Such initiatives play a vital role in connecting society, carrying forward values and traditions, and strengthening collective social consciousness. The event reaffirmed the Government of India’s commitment to building an inclusive and elder-friendly society by encouraging intergenerational engagement, community participation, and active ageing. It highlighted how the experiences, wisdom, and values of senior citizens, when combined with the energy, creativity, and curiosity of children and youth, contribute to the creation of a balanced, sensitive, and progressive society. The programme at Old Tehsil Complex featured a wide range of activities designed to promote intergenerational harmony and social cohesion as Cultural performances by students, Interactive session with senior citizens, Collective pledge-taking programme and Walkathon led by the Hon’ble Union Minister for Social Justice & Empowerment. In his address, Shri Virendra Kumar, Hon’ble Union Minister of Social Justice & Empowerment, emphasized that senior citizens are the custodians of experience, tradition, and values, and are an invaluable strength of the nation. He underlined the importance of promoting active, healthy, and dignified ageing through community-based initiatives and intergenerational engagement. The Hon’ble Minister highlighted several key initiatives of the Ministry, including, Rashtriya Vayoshri Yojana (RVY), under which assistive devices related to mobility, vision, and hearing are provided to senior citizens, enabling them to lead independent and confident lives with dignity. He informed that over 7.28 lakh senior citizens across the country have benefited from the scheme so far. Strengthening of Elderline 14567, which has received more than 27 lakh calls, providing support, guidance, and emergency assistance to senior citizens. Promotion of intergenerational bonding through cultural, community, and outreach programmes across the country, and the provision of celebration of grandparents’ day at school. The Celebration of this program at Old Tehsil Complex, Mehal Gate, Chhatarpur, successfully brought together senior citizens, children, youth, and the community on a shared platform of respect, participation, and cooperation. Through cultural expression, dialogue, physical activity, and collective commitment, the event reinforced the message that intergenerational harmony is essential for building a healthy, inclusive, and compassionate society. Aligned with the vision of Viksit Bharat@2047, the programme underscored the pivotal role of senior citizens as mentors and role models, while encouraging the younger generation to learn from their experiences and contribute actively to nation-building. The event marked another meaningful step in advancing the national agenda on senior citizen welfare and fostering a harmonious, empowered, and inclusive India. ***** KV (रिलीज़ आईडी: 2207735) आगंतुक पटल  : 188 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati , Tamil Ministry of Social Justice & Empowerment Celebration of Intergenerational Bonds प्रविष्टि तिथि:\r\n                        23 DEC 2025 4:13PM by PIB Delhi The Department of Social Justice & Empowerment, Government of India, organized a programme titled “Celebration of Intergenerational Bonds” on 22 December 2025 at Old Tehsil Complex, Mehal Gate, District Chhatarpur, Madhya Pradesh, with the objective of strengthening emotional, social, and cultural bonding between different generations and promoting active and dignified ageing. The event was graced by Shri Virendra Kumar, Hon’ble Union Minister for Social Justice & Empowerment, Government of India. Senior government officers, representatives of social organizations, and a large number of students, and family members, including grandparents of the children, were also present in large numbers. The programme aimed to further strengthen the spirit of affection, dialogue, cooperation, and mutual respect between generations. Such initiatives play a vital role in connecting society, carrying forward values and traditions, and strengthening collective social consciousness. The event reaffirmed the Government of India’s commitment to building an inclusive and elder-friendly society by encouraging intergenerational engagement, community participation, and active ageing. It highlighted how the experiences, wisdom, and values of senior citizens, when combined with the energy, creativity, and curiosity of children and youth, contribute to the creation of a balanced, sensitive, and progressive society. The programme at Old Tehsil Complex featured a wide range of activities designed to promote intergenerational harmony and social cohesion as Cultural performances by students, Interactive session with senior citizens, Collective pledge-taking programme and Walkathon led by the Hon’ble Union Minister for Social Justice & Empowerment. In his address, Shri Virendra Kumar, Hon’ble Union Minister of Social Justice & Empowerment, emphasized that senior citizens are the custodians of experience, tradition, and values, and are an invaluable strength of the nation. He underlined the importance of promoting active, healthy, and dignified ageing through community-based initiatives and intergenerational engagement. The Hon’ble Minister highlighted several key initiatives of the Ministry, including, Rashtriya Vayoshri Yojana (RVY), under which assistive devices related to mobility, vision, and hearing are provided to senior citizens, enabling them to lead independent and confident lives with dignity. He informed that over 7.28 lakh senior citizens across the country have benefited from the scheme so far. Strengthening of Elderline 14567, which has received more than 27 lakh calls, providing support, guidance, and emergency assistance to senior citizens. Promotion of intergenerational bonding through cultural, community, and outreach programmes across the country, and the provision of celebration of grandparents’ day at school. The Celebration of this program at Old Tehsil Complex, Mehal Gate, Chhatarpur, successfully brought together senior citizens, children, youth, and the community on a shared platform of respect, participation, and cooperation. Through cultural expression, dialogue, physical activity, and collective commitment, the event reinforced the message that intergenerational harmony is essential for building a healthy, inclusive, and compassionate society. Aligned with the vision of Viksit Bharat@2047, the programme underscored the pivotal role of senior citizens as mentors and role models, while encouraging the younger generation to learn from their experiences and contribute actively to nation-building. The event marked another meaningful step in advancing the national agenda on senior citizen welfare and fostering a harmonious, empowered, and inclusive India. ***** KV (रिलीज़ आईडी: 2207735)",
    "scraped_at": "2025-12-23T17:43:17.385212"
  },
  {
    "id": "2207861",
    "ministry": "Ministry of Statistics & Programme Implementation",
    "title": "MoSPI organises Pre-release Consultative Workshop on the Base Revision of GDP, CPI and IIP on 23rd December 2025 at Bharat Mandapam, New Delhi",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207861",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Statistics & Programme Implementation MoSPI organises Pre-release Consultative Workshop on the Base Revision of GDP, CPI and IIP on 23rd December 2025 at Bharat Mandapam, New Delhi प्रविष्टि तिथि:\r\n                23 DEC 2025 7:30PM by PIB Delhi The Ministry of Statistics and Programme Implementation (MoSPI) organised the Second Pre-release Consultative Workshop on the Base Revision of the Gross Domestic Product (GDP), Consumer Price Index (CPI) and Index of Industrial Production (IIP) on 23 rd December, 2025 at Bharat Mandapam, Pragati Maidan, New Delhi. The First Pre-release Consultative Workshop was held on 26 th November, 2026 at Mumbai. The primary objective of the workshop was to strengthen transparency, foster informed dialogue and ensure broad-based consultation before the release of the revised series of GDP, CPI, and IIP by way of sharing proposed methodological and structural improvements with the participants. New series of National Accounts and IIP with FY 2022-23 as base year are scheduled to be released on 27 th February, 2026 and 28 th May, 2026 respectively, whereas the new series of CPI with base year 2024 is scheduled to be released 12 th February, 2026. Inaugural session of the Workshop was graced by the distinguished dignitaries, including Shri Suman K. Bery, Vice Chairman, NITI Aayog as the Chief Guest, Dr. Saurabh Garg, Secretary, MoSPI, Dr. V. Anantha Nageswaran, Chief Economic Advisor and Shri N. K. Santoshi, Director General (Central Statistics), MoSPI. The workshop brought together a wide spectrum of participants, including eminent economists, experts from financial institutions and the banking sector, subject-matter specialists, users of core statistics, and senior officials from the Central and State Governments. In his inaugural address, Shri Suman K. Bery, Vice Chairman, NITI Aayog and the Chief Guest of the event emphasized the importance of engaging with various data users and stakeholders to address the issues regarding reliability and credibility of statistics produced by MoSPI and added that the pre-release consultative workshop is a welcome step in that direction. As the country is transitioning towards upper middle-income country in short to medium term, he opined the need of accurate data for tracking this progress. Dr. Saurabh Garg, Secretary, MoSPI, in his address, highlighted the importance of data-driven decision making for realizing the goal of ‘Viksit Bharat 2047’. Delineating the salient features of the revised series, he highlighted the use of Annual Survey of Unincorporated Sector Enterprises for measuring the informal sector; use of Double Deflation and Volume or Single Extrapolation in place Single Deflation; use of new data sources like Goods and Services Tax (GST) and Public Finance Management System (PFMS) which are available at a relatively shorter time lag; integration of Supply and Use Table (SUT) framework with National Accounts Framework to address the issue of statistical discrepancy; real time data collection and enhanced coverage of rural and urban markets for CPI; and, compilation of IIP at more granular level. Dr. V. Anantha Nageswaran, Chief Economic Advisor, in his address, commended the effort of MoSPI to organize the workshop to afford an opportunity to researchers, experts and various data users to understand the improvements being introduced in new series of GDP, CPI and IIP. He opined that measuring informal sector is relatively more challenging. However, a methodology which is transparent, enables generation of consistent estimates over a period of time and helps capture real picture of economy can be considered as a reasonably sound methodology. In the welcome address, Shri N. K. Santoshi, Director General (Central Statistics), MoSPI expressed gratitude to the Chief Guest and other participants for gracing the workshop. He informed the participants about the mechanism followed in the base revision exercise and highlighted that expert committees constituted to steer the base revision of GDP, CPI and IIP held numerous meetings to arrive at the improvements being introduced in the new series. The methodologies proposed to be employed in the new series are as per the guidelines accepted internationally. Inaugural session was followed by three technical sessions, one each on National Accounts, CPI and IIP, wherein proposed improvements in the revised series were presented. Presentations were followed by open house discussion, where queries of participants were addressed. Proposed improvements in the new series are also available on the website of the Ministry ( www.mospi.gov.in ) in the form of discussion papers. Users of National Accounts, CPI and IIP data may share feedback/comments/suggestions with the Ministry on the proposed changes. ***** Samrat/ (रिलीज़ आईडी: 2207861) आगंतुक पटल  : 202 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi Ministry of Statistics & Programme Implementation MoSPI organises Pre-release Consultative Workshop on the Base Revision of GDP, CPI and IIP on 23rd December 2025 at Bharat Mandapam, New Delhi प्रविष्टि तिथि:\r\n                        23 DEC 2025 7:30PM by PIB Delhi The Ministry of Statistics and Programme Implementation (MoSPI) organised the Second Pre-release Consultative Workshop on the Base Revision of the Gross Domestic Product (GDP), Consumer Price Index (CPI) and Index of Industrial Production (IIP) on 23 rd December, 2025 at Bharat Mandapam, Pragati Maidan, New Delhi. The First Pre-release Consultative Workshop was held on 26 th November, 2026 at Mumbai. The primary objective of the workshop was to strengthen transparency, foster informed dialogue and ensure broad-based consultation before the release of the revised series of GDP, CPI, and IIP by way of sharing proposed methodological and structural improvements with the participants. New series of National Accounts and IIP with FY 2022-23 as base year are scheduled to be released on 27 th February, 2026 and 28 th May, 2026 respectively, whereas the new series of CPI with base year 2024 is scheduled to be released 12 th February, 2026. Inaugural session of the Workshop was graced by the distinguished dignitaries, including Shri Suman K. Bery, Vice Chairman, NITI Aayog as the Chief Guest, Dr. Saurabh Garg, Secretary, MoSPI, Dr. V. Anantha Nageswaran, Chief Economic Advisor and Shri N. K. Santoshi, Director General (Central Statistics), MoSPI. The workshop brought together a wide spectrum of participants, including eminent economists, experts from financial institutions and the banking sector, subject-matter specialists, users of core statistics, and senior officials from the Central and State Governments. In his inaugural address, Shri Suman K. Bery, Vice Chairman, NITI Aayog and the Chief Guest of the event emphasized the importance of engaging with various data users and stakeholders to address the issues regarding reliability and credibility of statistics produced by MoSPI and added that the pre-release consultative workshop is a welcome step in that direction. As the country is transitioning towards upper middle-income country in short to medium term, he opined the need of accurate data for tracking this progress. Dr. Saurabh Garg, Secretary, MoSPI, in his address, highlighted the importance of data-driven decision making for realizing the goal of ‘Viksit Bharat 2047’. Delineating the salient features of the revised series, he highlighted the use of Annual Survey of Unincorporated Sector Enterprises for measuring the informal sector; use of Double Deflation and Volume or Single Extrapolation in place Single Deflation; use of new data sources like Goods and Services Tax (GST) and Public Finance Management System (PFMS) which are available at a relatively shorter time lag; integration of Supply and Use Table (SUT) framework with National Accounts Framework to address the issue of statistical discrepancy; real time data collection and enhanced coverage of rural and urban markets for CPI; and, compilation of IIP at more granular level. Dr. V. Anantha Nageswaran, Chief Economic Advisor, in his address, commended the effort of MoSPI to organize the workshop to afford an opportunity to researchers, experts and various data users to understand the improvements being introduced in new series of GDP, CPI and IIP. He opined that measuring informal sector is relatively more challenging. However, a methodology which is transparent, enables generation of consistent estimates over a period of time and helps capture real picture of economy can be considered as a reasonably sound methodology. In the welcome address, Shri N. K. Santoshi, Director General (Central Statistics), MoSPI expressed gratitude to the Chief Guest and other participants for gracing the workshop. He informed the participants about the mechanism followed in the base revision exercise and highlighted that expert committees constituted to steer the base revision of GDP, CPI and IIP held numerous meetings to arrive at the improvements being introduced in the new series. The methodologies proposed to be employed in the new series are as per the guidelines accepted internationally. Inaugural session was followed by three technical sessions, one each on National Accounts, CPI and IIP, wherein proposed improvements in the revised series were presented. Presentations were followed by open house discussion, where queries of participants were addressed. Proposed improvements in the new series are also available on the website of the Ministry ( www.mospi.gov.in ) in the form of discussion papers. Users of National Accounts, CPI and IIP data may share feedback/comments/suggestions with the Ministry on the proposed changes. ***** Samrat/ (रिलीज़ आईडी: 2207861)",
    "scraped_at": "2025-12-23T17:43:19.095536"
  },
  {
    "id": "2207890",
    "ministry": "Ministry of Tourism",
    "title": "Chennai hosts final zonal round as PHDCCI concludes nationwide National Young Chef Competition journey",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207890",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Tourism Chennai hosts final zonal round as PHDCCI concludes nationwide National Young Chef Competition journey All eyes now on NYCC Grand Finale at IHM Pusa, New Delhi on 19 January 2026 प्रविष्टि तिथि:\r\n                23 DEC 2025 7:57PM by PIB Delhi PHD Chamber of Commerce and Industry (PHDCCI) organized the South Zone round of National Young Chef Competition (NYCC) at the Faculty of Hotel Management & Culinary Arts, Dr. M.G.R. Educational & Research Institute, Chennai, bringing together high- potential culinary students from leading hotel management institutes across Southern India. Organised in partnership with the Ministry of Tourism, Government of India; Indian Federation of Culinary Associations (IFCA); and Tourism & Hospitality Skill Council (THSC), the South Zone round continued NYCC’s national mission of ‘Celebrating Indian Culinary Heritage: Blending Tradition with Innovation’ by encouraging young chefs to reinterpret classical Indian flavours using contemporary techniques, while remaining rooted in regional traditions. Spread over six months, NYCC has travelled across the country through four zonal rounds before culminating in a Grand Finale in New Delhi. Following the successful North, East and West Zone rounds held in Chandigarh, Kolkata and Mumbai respectively, the final zonal spotlight shifted to Chennai, where seven institutes competed in an intense live cook-off, showcasing creativity, innovation and strong technical skill. Following a closely contested competition, three teams from Culinary Academy of India, Hyderabad; Asian Christian Culinary & Agricultural Science Institute, Hosur and IHM, Hyderabad emerged as winners and will represent the South Zone at the Grand Finale. Team from IHM Shri Shakti, Hyderabad was declared the runner-up. In its maiden edition, NYCC is open exclusively to final-year hospitality students across government, private, stand-alone institutions and university departments specializing in hospitality and hotel management. The initiative aims to create a focused national platform for Indian cuisine, highlighting its depth, diversity and regional techniques, while connecting aspiring chefs with the industry for internships, mentorship and long-term career opportunities. The participating institutes in the South Zone round included Asian Christian Culinary & Agricultural Science Institute, Hosur; Chennais Amirta International Institute of Hotel Management; Culinary Academy of India, Hyderabad; Hindusthan College of Arts and Science, Coimbatore; IHM Shri Shakti, Hyderabad; Indian Culinary Institute, Tirupati; and Institute of Hotel Management, Hyderabad. Each participating team prepared a three-course Indian meal comprising starter, main course and dessert within two and a half hours. The jury for the South Zone round was chaired by Chef Anil Grover, Certified WorldChefs Judge and included Chef Ajeeth Janardhanan, Culinary Director, The Residency Towers; Chef Prem Kumar Mahendran, Executive Chef, Welcomhotel Chennai; Chef Natesan Kannan, Chief Coordinator, SICA Junior Forum; and Chef Nageshwaran K, Executive Sous Chef, GRT Hotels & Resorts. Renowned Indian Celebrity Chef, K. Damodharan (Chef Damu), while interacting with the participants, remarked, “Indian cuisine is deeply rooted in culture, memory and emotion and it is essential for young chefs to first understand its soul before reinterpreting it. What impressed me today was the sincerity with which students approached traditional flavours while presenting them with confidence and creativity. Initiatives like NYCC play a crucial role in nurturing chefs who respect tradition, yet have the courage to innovate and take Indian cuisine to global platforms.” Commenting on the competition, Chef Grover, said, “The South Zone round stood out for its strong technical fundamentals and confident expression of Indian flavours. Platforms like NYCC are critical in shaping chefs who understand not just how to cook, but why we cook the way we do.” Ms. Sulagna Ghosh, Secretary, PHDCCI, added, “The South Zone round of NYCC reflects the immense talent and discipline that hospitality education in Southern India offers. NYCC is steadily evolving into a national movement that connects education, industry and youth, while reinforcing pride in India’s culinary heritage.” The Grand Finale of NYCC will be held on 19 January 2026 at the Institute of Hotel Management Pusa, New Delhi and will be graced by Shri Gajendra Singh Shekhawat, Hon’ble Minister of Tourism and Culture, Government of India, as the Chief Guest. NYCC continues to be supported by a strong consortium of industry partners including TATA Consumer Products, Lee Kum Kee, Nestle Professional, Cremica Food Industries, Venus Industries, Hospitality & Kitchen Solutions (HAKS), Wagh Bakri Tea Group, Welbilt India (Merrychef & Convotherm), McCain Foods, Chefs Unlimited, Dr. M.G.R. Educational & Research Institute, South India Chef’s Association (SICA) and Purchasing Professional Forum – India (PPFI). For further details on NYCC, please visit the PHDCCI events page: https://phdccitourismhospitality.in/upcoming-events/phdcci-national-chef-competition/ **** Sunil Kumar Tiwari tourism4pib[at]gmail[dot]com (रिलीज़ आईडी: 2207890) आगंतुक पटल  : 99 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Tamil Ministry of Tourism Chennai hosts final zonal round as PHDCCI concludes nationwide National Young Chef Competition journey All eyes now on NYCC Grand Finale at IHM Pusa, New Delhi on 19 January 2026 प्रविष्टि तिथि:\r\n                        23 DEC 2025 7:57PM by PIB Delhi PHD Chamber of Commerce and Industry (PHDCCI) organized the South Zone round of National Young Chef Competition (NYCC) at the Faculty of Hotel Management & Culinary Arts, Dr. M.G.R. Educational & Research Institute, Chennai, bringing together high- potential culinary students from leading hotel management institutes across Southern India. Organised in partnership with the Ministry of Tourism, Government of India; Indian Federation of Culinary Associations (IFCA); and Tourism & Hospitality Skill Council (THSC), the South Zone round continued NYCC’s national mission of ‘Celebrating Indian Culinary Heritage: Blending Tradition with Innovation’ by encouraging young chefs to reinterpret classical Indian flavours using contemporary techniques, while remaining rooted in regional traditions. Spread over six months, NYCC has travelled across the country through four zonal rounds before culminating in a Grand Finale in New Delhi. Following the successful North, East and West Zone rounds held in Chandigarh, Kolkata and Mumbai respectively, the final zonal spotlight shifted to Chennai, where seven institutes competed in an intense live cook-off, showcasing creativity, innovation and strong technical skill. Following a closely contested competition, three teams from Culinary Academy of India, Hyderabad; Asian Christian Culinary & Agricultural Science Institute, Hosur and IHM, Hyderabad emerged as winners and will represent the South Zone at the Grand Finale. Team from IHM Shri Shakti, Hyderabad was declared the runner-up. In its maiden edition, NYCC is open exclusively to final-year hospitality students across government, private, stand-alone institutions and university departments specializing in hospitality and hotel management. The initiative aims to create a focused national platform for Indian cuisine, highlighting its depth, diversity and regional techniques, while connecting aspiring chefs with the industry for internships, mentorship and long-term career opportunities. The participating institutes in the South Zone round included Asian Christian Culinary & Agricultural Science Institute, Hosur; Chennais Amirta International Institute of Hotel Management; Culinary Academy of India, Hyderabad; Hindusthan College of Arts and Science, Coimbatore; IHM Shri Shakti, Hyderabad; Indian Culinary Institute, Tirupati; and Institute of Hotel Management, Hyderabad. Each participating team prepared a three-course Indian meal comprising starter, main course and dessert within two and a half hours. The jury for the South Zone round was chaired by Chef Anil Grover, Certified WorldChefs Judge and included Chef Ajeeth Janardhanan, Culinary Director, The Residency Towers; Chef Prem Kumar Mahendran, Executive Chef, Welcomhotel Chennai; Chef Natesan Kannan, Chief Coordinator, SICA Junior Forum; and Chef Nageshwaran K, Executive Sous Chef, GRT Hotels & Resorts. Renowned Indian Celebrity Chef, K. Damodharan (Chef Damu), while interacting with the participants, remarked, “Indian cuisine is deeply rooted in culture, memory and emotion and it is essential for young chefs to first understand its soul before reinterpreting it. What impressed me today was the sincerity with which students approached traditional flavours while presenting them with confidence and creativity. Initiatives like NYCC play a crucial role in nurturing chefs who respect tradition, yet have the courage to innovate and take Indian cuisine to global platforms.” Commenting on the competition, Chef Grover, said, “The South Zone round stood out for its strong technical fundamentals and confident expression of Indian flavours. Platforms like NYCC are critical in shaping chefs who understand not just how to cook, but why we cook the way we do.” Ms. Sulagna Ghosh, Secretary, PHDCCI, added, “The South Zone round of NYCC reflects the immense talent and discipline that hospitality education in Southern India offers. NYCC is steadily evolving into a national movement that connects education, industry and youth, while reinforcing pride in India’s culinary heritage.” The Grand Finale of NYCC will be held on 19 January 2026 at the Institute of Hotel Management Pusa, New Delhi and will be graced by Shri Gajendra Singh Shekhawat, Hon’ble Minister of Tourism and Culture, Government of India, as the Chief Guest. NYCC continues to be supported by a strong consortium of industry partners including TATA Consumer Products, Lee Kum Kee, Nestle Professional, Cremica Food Industries, Venus Industries, Hospitality & Kitchen Solutions (HAKS), Wagh Bakri Tea Group, Welbilt India (Merrychef & Convotherm), McCain Foods, Chefs Unlimited, Dr. M.G.R. Educational & Research Institute, South India Chef’s Association (SICA) and Purchasing Professional Forum – India (PPFI). For further details on NYCC, please visit the PHDCCI events page: https://phdccitourismhospitality.in/upcoming-events/phdcci-national-chef-competition/ **** Sunil Kumar Tiwari tourism4pib[at]gmail[dot]com (रिलीज़ आईडी: 2207890)",
    "scraped_at": "2025-12-23T17:43:21.238536"
  },
  {
    "id": "2207862",
    "ministry": "Ministry of Youth Affairs and Sports",
    "title": "Ministry of Youth Affairs & Sports Launches Comprehensive Internship Policy to Build Next Generation of Sports Professionals",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207862",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Youth Affairs and Sports Ministry of Youth Affairs & Sports Launches Comprehensive Internship Policy to Build Next Generation of Sports Professionals Under the new policy, 452 internships will be offered annually across the MoYAS & its key institutions, including the Sports Authority of India (SAI), National Anti-Doping Agency (NADA) and National Dope Testing Laboratory (NDTL) \"Through this internship programme, we are opening the doors of sports governance and administration to our youth, enabling them to gain hands-on experience and make a long-term impact in nation-building through sports,” Dr. Mansukh Mandaviya, Union Minister for Youth Affairs & Sports प्रविष्टि तिथि:\r\n                23 DEC 2025 7:32PM by PIB Delhi The Ministry of Youth Affairs and Sports (MYAS) today launched a Comprehensive Internship Policy aimed at creating a structured, large-scale platform for nurturing young talent and strengthening India’s sports ecosystem. The ‘Comprehensive Internship Policy for Ministry of Youth Affairs & Sports (MYAS) and its Autonomous Bodies’ will provide meaningful internship opportunities to college and university students across the Ministry and its autonomous bodies, offering first-hand exposure to sports governance, administration and allied professional domains. Union Minister of Youth Affairs and Sports Dr. Mansukh Mandaviya said that the initiative will empower young minds to contribute meaningfully to India’s sporting journey. “The transformation of India’s sports ecosystem requires strong institutional backing supported by skilled professionals and young talent. Through this internship programme, we are opening the doors of sports governance and administration to our youth, enabling them to gain hands-on experience and make a long-term impact in nation-building through sports,” Dr. Mandaviya said. Under the new policy, 452 internships will be offered annually across the Ministry of Youth Affairs and Sports and its key institutions, including the Sports Authority of India (SAI), National Anti-Doping Agency (NADA) and National Dope Testing Laboratory (NDTL). The initiative aims to build a robust talent pipeline in sports governance, administration, sports science, anti-doping, event management and athlete support services. The programme aligns closely with the objectives of the National Sports Policy and Khelo Bharat Niti 2025, with a strong focus on youth empowerment, capacity building and professionalisation of sports administration. The policy further supports India’s long-term vision of developing a future-ready sports ecosystem capable of sustaining elite performance and hosting major international sporting events. Dr. Mandaviya further noted that the programme addresses the growing requirement for professionally trained manpower as India expands its sporting infrastructure, strengthens governance reforms and enhances its global sporting footprint. The interns will receive structured onboarding, mentorship from domain experts and real-time exposure to policy formulation and implementation. They will contribute directly to flagship initiatives such as Khelo India, Target Olympic Podium Scheme (TOPS), Target Asian Games Group (TAGG), and gain experience at SAI Stadia, Regional Centres (RCs) and National Centres of Excellence (NCOEs). The internships will span over 20 functional domains, including sports management, sports science, event operations, media and communications, legal affairs, IT systems, international sports governance and anti-doping. Special focus will be given to sports science research, laboratory testing, data analysis and scientific support to athletes. Interns placed with NADA will assist in anti-doping awareness, legal compliance, case management and policy support, while those at NDTL will gain exposure to advanced laboratory-based anti-doping processes, including sample analysis and research. The programme seeks to promote youth engagement, digital fluency, innovation and entrepreneurship while building a pipeline of trained professionals capable of contributing to policy, infrastructure development, media outreach, legal frameworks, sports science and sports management. Two recruitment cycles will be conducted every year; in January and July, through a centralised online portal, ensuring transparency, inclusivity and merit-based selection. The Comprehensive Internship Programme is a significant step towards promoting clean sport, transparent governance and scientific advancement, reinforcing India’s commitment to fair play, athlete welfare and excellence in sports administration. To know more about the Comprehensive Internship Policy * click here * *** Ayushman Kumar (रिलीज़ आईडी: 2207862) आगंतुक पटल  : 167 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Gujarati Ministry of Youth Affairs and Sports Ministry of Youth Affairs & Sports Launches Comprehensive Internship Policy to Build Next Generation of Sports Professionals Under the new policy, 452 internships will be offered annually across the MoYAS & its key institutions, including the Sports Authority of India (SAI), National Anti-Doping Agency (NADA) and National Dope Testing Laboratory (NDTL) \"Through this internship programme, we are opening the doors of sports governance and administration to our youth, enabling them to gain hands-on experience and make a long-term impact in nation-building through sports,” Dr. Mansukh Mandaviya, Union Minister for Youth Affairs & Sports प्रविष्टि तिथि:\r\n                        23 DEC 2025 7:32PM by PIB Delhi The Ministry of Youth Affairs and Sports (MYAS) today launched a Comprehensive Internship Policy aimed at creating a structured, large-scale platform for nurturing young talent and strengthening India’s sports ecosystem. The ‘Comprehensive Internship Policy for Ministry of Youth Affairs & Sports (MYAS) and its Autonomous Bodies’ will provide meaningful internship opportunities to college and university students across the Ministry and its autonomous bodies, offering first-hand exposure to sports governance, administration and allied professional domains. Union Minister of Youth Affairs and Sports Dr. Mansukh Mandaviya said that the initiative will empower young minds to contribute meaningfully to India’s sporting journey. “The transformation of India’s sports ecosystem requires strong institutional backing supported by skilled professionals and young talent. Through this internship programme, we are opening the doors of sports governance and administration to our youth, enabling them to gain hands-on experience and make a long-term impact in nation-building through sports,” Dr. Mandaviya said. Under the new policy, 452 internships will be offered annually across the Ministry of Youth Affairs and Sports and its key institutions, including the Sports Authority of India (SAI), National Anti-Doping Agency (NADA) and National Dope Testing Laboratory (NDTL). The initiative aims to build a robust talent pipeline in sports governance, administration, sports science, anti-doping, event management and athlete support services. The programme aligns closely with the objectives of the National Sports Policy and Khelo Bharat Niti 2025, with a strong focus on youth empowerment, capacity building and professionalisation of sports administration. The policy further supports India’s long-term vision of developing a future-ready sports ecosystem capable of sustaining elite performance and hosting major international sporting events. Dr. Mandaviya further noted that the programme addresses the growing requirement for professionally trained manpower as India expands its sporting infrastructure, strengthens governance reforms and enhances its global sporting footprint. The interns will receive structured onboarding, mentorship from domain experts and real-time exposure to policy formulation and implementation. They will contribute directly to flagship initiatives such as Khelo India, Target Olympic Podium Scheme (TOPS), Target Asian Games Group (TAGG), and gain experience at SAI Stadia, Regional Centres (RCs) and National Centres of Excellence (NCOEs). The internships will span over 20 functional domains, including sports management, sports science, event operations, media and communications, legal affairs, IT systems, international sports governance and anti-doping. Special focus will be given to sports science research, laboratory testing, data analysis and scientific support to athletes. Interns placed with NADA will assist in anti-doping awareness, legal compliance, case management and policy support, while those at NDTL will gain exposure to advanced laboratory-based anti-doping processes, including sample analysis and research. The programme seeks to promote youth engagement, digital fluency, innovation and entrepreneurship while building a pipeline of trained professionals capable of contributing to policy, infrastructure development, media outreach, legal frameworks, sports science and sports management. Two recruitment cycles will be conducted every year; in January and July, through a centralised online portal, ensuring transparency, inclusivity and merit-based selection. The Comprehensive Internship Programme is a significant step towards promoting clean sport, transparent governance and scientific advancement, reinforcing India’s commitment to fair play, athlete welfare and excellence in sports administration. To know more about the Comprehensive Internship Policy * click here * *** Ayushman Kumar (रिलीज़ आईडी: 2207862)",
    "scraped_at": "2025-12-23T17:43:23.527557"
  },
  {
    "id": "2207767",
    "ministry": "PIB Headquarters",
    "title": "From Fields to Futures",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207767",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters From Fields to Futures How Good Governance Is Rewriting India’s Agricultural Story प्रविष्टि तिथि:\r\n                23 DEC 2025 5:06PM by PIB Delhi In Dabhadi village of Nashik district, Maharashtra , Mrs. Bhavana Nilkanth Nikam chose agriculture as a profession despite being a graduate. Through structured capacity-building interventions provided by the Krishi Vigyan Kendra (KVK) and support under various agricultural department programmes, she established a 2,000 sq. m polyhouse , adopting modern practices such as drip irrigation , farm mechanisation , and the integration of allied activities, including fishery and poultry farming. Her farm currently produces high-value crops such as capsicum, tomatoes, beans, and grapes, supported by rainwater harvesting ponds that ensure assured irrigation during dry periods. In recognition of her innovative approach, she received several honours, including the Innovative Woman Farmer Samman Patra award by the Government of Maharashtra in 2021. The transformation of her farm into a model integrated farming system has enhanced and diversified her household income, and it has also emerged as a demonstration and learning site for farmers from neighbouring villages, many of whom have replicated similar practices after observing its outcomes. Hundreds of kilometres away in the Banka district of Bihar , Mrs. Binita Kumari transformed a modest intervention into a scalable livelihood opportunity. Belonging to a farming household, she received training in mushroom cultivation and spawn production from KVK Banka. Starting with just 25 mushroom bags, she gradually expanded her enterprise by introducing multiple mushroom varieties and adopting year-round production practices. Today, she earns Rs. 2.5-3 lakh annually from the sale of fresh mushrooms and spawn, and also supplies spawn to other farmers. She now aspires to establish a well-equipped mushroom spawn laboratory to cater to the requirements of neighbouring villages. Her initiative has enabled nearly 300 women farmers from nearby villages to adopt mushroom cultivation as a sustainable source of income, demonstrating how targeted skill training and institutional support can generate broader community-level impacts beyond individual households. Together, these narratives reflect the broader trajectory of Indian agriculture. According to the Economic Survey 2024-25 , the ‘Agriculture and Allied Activities’ sector remains the backbone of the Indian economy , contributing approximately 16 percent of the country’s GDP for FY24 (Provisional Estimates) at current prices and providing livelihoods to nearly 46.1 percent of the population . Beyond its central role in ensuring food security, the sector exerts a significant influence on allied and downstream industries, thereby supporting overall economic growth. Consequently, governance reforms have increasingly prioritized the creation of a comprehensive ecosystem encompassing income support, infrastructure development, irrigation expansion, risk mitigation mechanisms, improved market access, and sustainability-oriented interventions. To illustrate, initiatives such as the PM-Kisan Samman Nidhi have provided direct income support to millions of farmers, enabling them to cover input costs and plan their agricultural activities more effectively. To date, Rs. 3.88 lakh crore has been released through 21 installments . Investments under the Agriculture Infrastructure Fund have strengthened post-harvest management and storage facilities, thereby reducing the need for distress sales. As of December 23, 2025, it has more than 2.87 lakh registered beneficiaries, with disbursements exceeding Rs. 57,000 crore . The Pradhan Mantri Krishi Sinchayee Yojana has expanded irrigation coverage and promoted micro-irrigation, enabling farmers to shift towards higher-value and less water-intensive crops. The government has also implemented the Rashtriya Krishi Vikas Yojana (RKVY) , a centrally sponsored scheme comprising seven components, including the Per Drop More Crop (PDMC) initiative, the Sub-Mission on Agricultural Mechanization, Soil Health and Fertility, Rainfed Area Development, Crop Diversification, an Accelerated Fund for Agri Start-ups, and others. In parallel, e-NAM (e-National Agriculture Market) has improved market access and price transparency, while the Pradhan Mantri Fasal Bima Yojana has provided a safety net against crop losses. As of December 23, 2025, a total of 16.06 lakh farmers benefited by this scheme, for the Kharif and Rabi crop of 2025, receiving claims amounting to Rs. 3.60 lakh . Additionally, the Soil Health Card scheme has promoted the use of balanced fertilizers, supporting long-term soil productivity and sustainability. The impact of these initiatives is significantly enhanced by their convergence at the farm level, supported by institutions such as NABARD and the Indian Council of Agricultural Research (ICAR) . When interventions related to irrigation, income support, infrastructure development, insurance, extension services, and market access operate in an integrated manner, the agricultural system becomes more resilient and less susceptible to external shocks. The numerous success stories of individual farmers and women-led collectives engaged in value addition demonstrate that governance outcomes are most effective and visible when policy measures translate into concrete and measurable improvements in the farmers' livelihoods. In Sangareddy district of Telangana , tribal farming households addressed chronic dependence on rainfall and persistently low incomes through the adoption of diversified horticulture under an integrated development project supported by NABARD grant assistance . The intervention promoted mango cultivation combined with intercropping of pulses and vegetables, alongside the creation of irrigation infrastructure, including ring tanks and submersible pumps, and convergence with schemes providing agricultural inputs and wage employment. As a result, over 500 acres were brought under horticulture, an additional 115 acres received assured irrigation, and beneficiary households recorded incremental annual mango incomes of Rs. 50,000 - Rs.70,000 by the fourth year. Overall average household incomes increased from Rs.0.3-Rs.0.4 lakh to Rs.1.01-Rs.1.68 lakh. The initiative also contributed to a reduction in out-migration from 30% to 20% and strengthened community institutions, including self-help groups and farmers’ clubs. Another illustrative case emerges from the Rewari district of Haryana , where the Dharchana Farmer Producer Company Limited (FPC) transformed local oilseed cultivation into a sustainable, collective enterprise benefiting more than 500 farmers , with women constituting nearly 90% of its membership. By aggregating and procuring oilseeds through the FPO, eliminating intermediaries, and providing value-added services such as decentralized procurement and mobile collection, members realized an additional income of approximately Rs.200 per quintal by reducing mandi charges and transportation costs. Concurrently, the FPC recorded a turnover of Rs. 58.8 lakh and a profit of Rs. 50,000 in FY 2022–23 . This experience underscores how the institutionalization of market linkages and value-chain services through producer organizations can enhance farm incomes while strengthening farmers’ participation in agribusiness activities. As India observes Good Governance Day, these field-level experiences underscore a fundamental insight: effective governance in agriculture extends beyond achieving higher yields. It is about restoring confidence in farming as a viable and dignified livelihood, where individual effort is reinforced by supportive systems, risks are mitigated through robust institutions, and future outcomes can be planned with greater certainty. From fields to futures, India’s agricultural narrative is being reshaped by farmers whose achievements are firmly anchored in policy coherence, participatory approaches, and demonstrable outcomes. References Ministry of Agriculture and Farmers Welfare https://agriinfra.dac.gov.in/Home/Dashboard https://pmfby.gov.in/adminStatistics/dashboard https://www.nabard.org/annual-report/success-stories.html https://agriwelfare.gov.in/Documents/AR_Eng_2024_25.pdf https://rkvy.da.gov.in/static/download/pdf/PM_RKVY_Guidelines_2024.pdf https://agriwelfare.gov.in/Documents/Success-Story-For-approval.pdf https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=156092&ModuleId=3&reg=3&lang=2 Ministry of Finance https://www.indiabudget.gov.in/economicsurvey/doc/eschapter/echap09.pdf Click here to see pdf **** PIB Research (रिलीज़ आईडी: 2207767) आगंतुक पटल  : 317 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी PIB Headquarters From Fields to Futures How Good Governance Is Rewriting India’s Agricultural Story प्रविष्टि तिथि:\r\n                        23 DEC 2025 5:06PM by PIB Delhi In Dabhadi village of Nashik district, Maharashtra , Mrs. Bhavana Nilkanth Nikam chose agriculture as a profession despite being a graduate. Through structured capacity-building interventions provided by the Krishi Vigyan Kendra (KVK) and support under various agricultural department programmes, she established a 2,000 sq. m polyhouse , adopting modern practices such as drip irrigation , farm mechanisation , and the integration of allied activities, including fishery and poultry farming. Her farm currently produces high-value crops such as capsicum, tomatoes, beans, and grapes, supported by rainwater harvesting ponds that ensure assured irrigation during dry periods. In recognition of her innovative approach, she received several honours, including the Innovative Woman Farmer Samman Patra award by the Government of Maharashtra in 2021. The transformation of her farm into a model integrated farming system has enhanced and diversified her household income, and it has also emerged as a demonstration and learning site for farmers from neighbouring villages, many of whom have replicated similar practices after observing its outcomes. Hundreds of kilometres away in the Banka district of Bihar , Mrs. Binita Kumari transformed a modest intervention into a scalable livelihood opportunity. Belonging to a farming household, she received training in mushroom cultivation and spawn production from KVK Banka. Starting with just 25 mushroom bags, she gradually expanded her enterprise by introducing multiple mushroom varieties and adopting year-round production practices. Today, she earns Rs. 2.5-3 lakh annually from the sale of fresh mushrooms and spawn, and also supplies spawn to other farmers. She now aspires to establish a well-equipped mushroom spawn laboratory to cater to the requirements of neighbouring villages. Her initiative has enabled nearly 300 women farmers from nearby villages to adopt mushroom cultivation as a sustainable source of income, demonstrating how targeted skill training and institutional support can generate broader community-level impacts beyond individual households. Together, these narratives reflect the broader trajectory of Indian agriculture. According to the Economic Survey 2024-25 , the ‘Agriculture and Allied Activities’ sector remains the backbone of the Indian economy , contributing approximately 16 percent of the country’s GDP for FY24 (Provisional Estimates) at current prices and providing livelihoods to nearly 46.1 percent of the population . Beyond its central role in ensuring food security, the sector exerts a significant influence on allied and downstream industries, thereby supporting overall economic growth. Consequently, governance reforms have increasingly prioritized the creation of a comprehensive ecosystem encompassing income support, infrastructure development, irrigation expansion, risk mitigation mechanisms, improved market access, and sustainability-oriented interventions. To illustrate, initiatives such as the PM-Kisan Samman Nidhi have provided direct income support to millions of farmers, enabling them to cover input costs and plan their agricultural activities more effectively. To date, Rs. 3.88 lakh crore has been released through 21 installments . Investments under the Agriculture Infrastructure Fund have strengthened post-harvest management and storage facilities, thereby reducing the need for distress sales. As of December 23, 2025, it has more than 2.87 lakh registered beneficiaries, with disbursements exceeding Rs. 57,000 crore . The Pradhan Mantri Krishi Sinchayee Yojana has expanded irrigation coverage and promoted micro-irrigation, enabling farmers to shift towards higher-value and less water-intensive crops. The government has also implemented the Rashtriya Krishi Vikas Yojana (RKVY) , a centrally sponsored scheme comprising seven components, including the Per Drop More Crop (PDMC) initiative, the Sub-Mission on Agricultural Mechanization, Soil Health and Fertility, Rainfed Area Development, Crop Diversification, an Accelerated Fund for Agri Start-ups, and others. In parallel, e-NAM (e-National Agriculture Market) has improved market access and price transparency, while the Pradhan Mantri Fasal Bima Yojana has provided a safety net against crop losses. As of December 23, 2025, a total of 16.06 lakh farmers benefited by this scheme, for the Kharif and Rabi crop of 2025, receiving claims amounting to Rs. 3.60 lakh . Additionally, the Soil Health Card scheme has promoted the use of balanced fertilizers, supporting long-term soil productivity and sustainability. The impact of these initiatives is significantly enhanced by their convergence at the farm level, supported by institutions such as NABARD and the Indian Council of Agricultural Research (ICAR) . When interventions related to irrigation, income support, infrastructure development, insurance, extension services, and market access operate in an integrated manner, the agricultural system becomes more resilient and less susceptible to external shocks. The numerous success stories of individual farmers and women-led collectives engaged in value addition demonstrate that governance outcomes are most effective and visible when policy measures translate into concrete and measurable improvements in the farmers' livelihoods. In Sangareddy district of Telangana , tribal farming households addressed chronic dependence on rainfall and persistently low incomes through the adoption of diversified horticulture under an integrated development project supported by NABARD grant assistance . The intervention promoted mango cultivation combined with intercropping of pulses and vegetables, alongside the creation of irrigation infrastructure, including ring tanks and submersible pumps, and convergence with schemes providing agricultural inputs and wage employment. As a result, over 500 acres were brought under horticulture, an additional 115 acres received assured irrigation, and beneficiary households recorded incremental annual mango incomes of Rs. 50,000 - Rs.70,000 by the fourth year. Overall average household incomes increased from Rs.0.3-Rs.0.4 lakh to Rs.1.01-Rs.1.68 lakh. The initiative also contributed to a reduction in out-migration from 30% to 20% and strengthened community institutions, including self-help groups and farmers’ clubs. Another illustrative case emerges from the Rewari district of Haryana , where the Dharchana Farmer Producer Company Limited (FPC) transformed local oilseed cultivation into a sustainable, collective enterprise benefiting more than 500 farmers , with women constituting nearly 90% of its membership. By aggregating and procuring oilseeds through the FPO, eliminating intermediaries, and providing value-added services such as decentralized procurement and mobile collection, members realized an additional income of approximately Rs.200 per quintal by reducing mandi charges and transportation costs. Concurrently, the FPC recorded a turnover of Rs. 58.8 lakh and a profit of Rs. 50,000 in FY 2022–23 . This experience underscores how the institutionalization of market linkages and value-chain services through producer organizations can enhance farm incomes while strengthening farmers’ participation in agribusiness activities. As India observes Good Governance Day, these field-level experiences underscore a fundamental insight: effective governance in agriculture extends beyond achieving higher yields. It is about restoring confidence in farming as a viable and dignified livelihood, where individual effort is reinforced by supportive systems, risks are mitigated through robust institutions, and future outcomes can be planned with greater certainty. From fields to futures, India’s agricultural narrative is being reshaped by farmers whose achievements are firmly anchored in policy coherence, participatory approaches, and demonstrable outcomes. References Ministry of Agriculture and Farmers Welfare https://agriinfra.dac.gov.in/Home/Dashboard https://pmfby.gov.in/adminStatistics/dashboard https://www.nabard.org/annual-report/success-stories.html https://agriwelfare.gov.in/Documents/AR_Eng_2024_25.pdf https://rkvy.da.gov.in/static/download/pdf/PM_RKVY_Guidelines_2024.pdf https://agriwelfare.gov.in/Documents/Success-Story-For-approval.pdf https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=156092&ModuleId=3&reg=3&lang=2 Ministry of Finance https://www.indiabudget.gov.in/economicsurvey/doc/eschapter/echap09.pdf Click here to see pdf **** PIB Research (रिलीज़ आईडी: 2207767)",
    "scraped_at": "2025-12-23T17:43:25.401993"
  },
  {
    "id": "2207901",
    "ministry": "Competition Commission of India",
    "title": "CCI has approved acquisition of certain warrants of Federal Bank Limited by Asia II Topco XIII Pte. Ltd.",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207901",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Competition Commission of India CCI has approved acquisition of certain warrants of Federal Bank Limited by Asia II Topco XIII Pte. Ltd. प्रविष्टि तिथि:\r\n                23 DEC 2025 8:18PM by PIB Delhi Competition Commission of India has approved the acquisition of certain warrants of Federal Bank Limited by Asia II Topco XIII Pte. Ltd. The proposed combination envisages acquisition of certain warrants by Asia II Topco XIII Pte. Ltd. (Acquirer), each carrying a right to subscribe to one fully paid-up equity share of Federal Bank Limited (Target). Upon full exercise of the warrants, the Acquirer will hold 9.99% of the paid-up share capital of the Target, on a fully diluted basis. The Acquirer will have the right to nominate a director on the Target’s board (as long as the Acquirer holds at least 5% of the paid-up share capital of the Target). The Acquirer is controlled by funds advised and / or managed by affiliates of Blackstone Inc. The Target is a private sector commercial bank in India and offers a wide range of products and services, such as deposits, loans, payment services, etc. Detailed order of the Commission will follow. ***** NB/ONP (रिलीज़ आईडी: 2207901) आगंतुक पटल  : 118 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu Competition Commission of India CCI has approved acquisition of certain warrants of Federal Bank Limited by Asia II Topco XIII Pte. Ltd. प्रविष्टि तिथि:\r\n                        23 DEC 2025 8:18PM by PIB Delhi Competition Commission of India has approved the acquisition of certain warrants of Federal Bank Limited by Asia II Topco XIII Pte. Ltd. The proposed combination envisages acquisition of certain warrants by Asia II Topco XIII Pte. Ltd. (Acquirer), each carrying a right to subscribe to one fully paid-up equity share of Federal Bank Limited (Target). Upon full exercise of the warrants, the Acquirer will hold 9.99% of the paid-up share capital of the Target, on a fully diluted basis. The Acquirer will have the right to nominate a director on the Target’s board (as long as the Acquirer holds at least 5% of the paid-up share capital of the Target). The Acquirer is controlled by funds advised and / or managed by affiliates of Blackstone Inc. The Target is a private sector commercial bank in India and offers a wide range of products and services, such as deposits, loans, payment services, etc. Detailed order of the Commission will follow. ***** NB/ONP (रिलीज़ आईडी: 2207901)",
    "scraped_at": "2025-12-23T17:43:27.578387"
  },
  {
    "id": "2207899",
    "ministry": "Competition Commission of India",
    "title": "CCI has approved Tata Steel Limited’s proposed acquisition of sole control in Tata BlueScope Steel Pvt. Ltd. by purchasing the remaining 50% equity shareholding currently held by BlueScope Steel Asia Holdings Pty Ltd.",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207899",
    "date": "23 DEC 2025",
    "content": "Press Release:Press Information Bureau Competition Commission of India CCI has approved Tata Steel Limited’s proposed acquisition of sole control in Tata BlueScope Steel Pvt. Ltd. by purchasing the remaining 50% equity shareholding currently held by BlueScope Steel Asia Holdings Pty Ltd. प्रविष्टि तिथि:\r\n                23 DEC 2025 8:17PM by PIB Delhi The Competition Commission of India has approved Tata Steel Limited’s proposed acquisition of sole control in Tata BlueScope Steel Pvt. Ltd. by purchasing the remaining 50% equity shareholding currently held by BlueScope Steel Asia Holdings Pty Ltd. The proposed combination entails Tata Steel Limited’s (Acquirer) acquisition of sole control in Tata BlueScope Steel Private Limited (Target) by purchasing the remaining 50% equity shareholding currently held by BlueScope Steel Asia Holdings Pty Limited (Seller) (Proposed Combination). Tata Steel, a public limited listed entity is engaged in the production and sale of steel and related steel products, serving diverse sectors such as agriculture, automotive, construction, energy and infrastructure. It is inter alia also engaged in the mining of iron ore, and production of iron ore pellets, sponge iron and crude steel. The Target is a 50:50 joint venture between BlueScope Steel Limited (BlueScope Australia), through its wholly owned subsidiary, the Seller and the Acquirer through its wholly owned subsidiary, Tata Steel Downstream Products Limited (TSDPL). It operates in the coated steel segment, offering surface coated steel products (SCPs) and associated solutions. It’s product portfolio includes metallic coated or galvanised steel products (GPs), pre-painted and colour-coated steel products (CCPs) as coils or as end products with applications in roofing, walling and cladding. Detailed order of the Commission will follow. ***** NB/ONP (रिलीज़ आईडी: 2207899) आगंतुक पटल  : 95 Competition Commission of India CCI has approved Tata Steel Limited’s proposed acquisition of sole control in Tata BlueScope Steel Pvt. Ltd. by purchasing the remaining 50% equity shareholding currently held by BlueScope Steel Asia Holdings Pty Ltd. प्रविष्टि तिथि:\r\n                        23 DEC 2025 8:17PM by PIB Delhi The Competition Commission of India has approved Tata Steel Limited’s proposed acquisition of sole control in Tata BlueScope Steel Pvt. Ltd. by purchasing the remaining 50% equity shareholding currently held by BlueScope Steel Asia Holdings Pty Ltd. The proposed combination entails Tata Steel Limited’s (Acquirer) acquisition of sole control in Tata BlueScope Steel Private Limited (Target) by purchasing the remaining 50% equity shareholding currently held by BlueScope Steel Asia Holdings Pty Limited (Seller) (Proposed Combination). Tata Steel, a public limited listed entity is engaged in the production and sale of steel and related steel products, serving diverse sectors such as agriculture, automotive, construction, energy and infrastructure. It is inter alia also engaged in the mining of iron ore, and production of iron ore pellets, sponge iron and crude steel. The Target is a 50:50 joint venture between BlueScope Steel Limited (BlueScope Australia), through its wholly owned subsidiary, the Seller and the Acquirer through its wholly owned subsidiary, Tata Steel Downstream Products Limited (TSDPL). It operates in the coated steel segment, offering surface coated steel products (SCPs) and associated solutions. It’s product portfolio includes metallic coated or galvanised steel products (GPs), pre-painted and colour-coated steel products (CCPs) as coils or as end products with applications in roofing, walling and cladding. Detailed order of the Commission will follow. ***** NB/ONP (रिलीज़ आईडी: 2207899)",
    "scraped_at": "2025-12-23T17:43:29.711439"
  }
]