[
  {
    "id": "2207153",
    "ministry": "Vice President's Secretariat",
    "title": "Vice-President Shri C. P. Radhakrishnan participates in World Meditation Day celebrations at Kanha Shanti Vanam, Telangana",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207153",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Vice President's Secretariat Vice-President Shri C. P. Radhakrishnan participates in World Meditation Day celebrations at Kanha Shanti Vanam, Telangana Meditation vital for inner peace and social harmony: Vice-President True development includes emotional and spiritual well-being: Vice-President India’s spiritual traditions guide the world: Vice-President Vice-President appreciates Daaji’s contribution to spreading meditation globally प्रविष्टि तिथि:\r\n                21 DEC 2025 1:21PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, today participated at the World Meditation Day celebrations at Kanha Shanti Vanam in Telangana and highlighted the timeless relevance of meditation in fostering inner peace, emotional well-being and social harmony. Addressing the gathering, the Vice-President said that meditation is a universal practice that transcends cultural, geographical and religious boundaries. He described it as a path to mental clarity, emotional stability and inner transformation, and noted that World Meditation Day provides an opportunity to recognise its growing importance in modern life. The Vice-President recalled India’s role in co-sponsoring the United Nations General Assembly resolution declaring 21 December as World Meditation Day, describing it as a global recognition of the power of meditation to promote mental well-being and spiritual growth. He also appreciated the contribution of  Daaji in spreading the practice of meditation globally. He added that India, with its centuries-old traditions of meditation, yoga and spiritual inquiry, continues to offer enduring wisdom to the world. Highlighting India’s civilisational heritage, Shri Radhakrishnan said that meditation in Bharat has long been regarded as an ancient science of the mind and spirit, nurtured by sages and seers. Drawing upon teachings from the Bhagavad Gita and the Tamil spiritual classic Thirumantiram, he emphasised that mastery of the mind through meditation leads to inner harmony, self-realisation and ethical living. The Vice-President underlined that meditation has a vital role to play in the journey towards Viksit Bharat@2047. He said that national development must encompass not only economic progress but also emotional well-being and spiritual upliftment, and that meditation can contribute significantly to building a peaceful, resilient and compassionate society. Referring to the vision of Mission LiFE, the Vice-President said that meditation nurtures values such as mindfulness, responsibility and harmony with nature, which are essential for sustainable living. He appreciated Kanha Shanti Vanam for adopting environmentally responsible practices and promoting holistic well-being. Calling upon citizens to integrate meditation into daily life, Shri Radhakrishnan urged individuals, families and communities to lead by example and encourage future generations to embrace practices that promote mental peace, balance and harmony. Governor of Telangana, Shri Jishnu Dev Varma; Minister, Government of Telangana, Shri D. Sridhar Babu; and Spiritual Guide of Heartfulness Meditation, Daaji Kamlesh D. Patel, and other dignitaries along with thousands who joined the meditation session at Kanha Shanti Vanam were present at the celebrations. *** PR/ASM (रिलीज़ आईडी: 2207153) आगंतुक पटल  : 127 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Tamil Vice President's Secretariat Vice-President Shri C. P. Radhakrishnan participates in World Meditation Day celebrations at Kanha Shanti Vanam, Telangana Meditation vital for inner peace and social harmony: Vice-President True development includes emotional and spiritual well-being: Vice-President India’s spiritual traditions guide the world: Vice-President Vice-President appreciates Daaji’s contribution to spreading meditation globally प्रविष्टि तिथि:\r\n                        21 DEC 2025 1:21PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, today participated at the World Meditation Day celebrations at Kanha Shanti Vanam in Telangana and highlighted the timeless relevance of meditation in fostering inner peace, emotional well-being and social harmony. Addressing the gathering, the Vice-President said that meditation is a universal practice that transcends cultural, geographical and religious boundaries. He described it as a path to mental clarity, emotional stability and inner transformation, and noted that World Meditation Day provides an opportunity to recognise its growing importance in modern life. The Vice-President recalled India’s role in co-sponsoring the United Nations General Assembly resolution declaring 21 December as World Meditation Day, describing it as a global recognition of the power of meditation to promote mental well-being and spiritual growth. He also appreciated the contribution of  Daaji in spreading the practice of meditation globally. He added that India, with its centuries-old traditions of meditation, yoga and spiritual inquiry, continues to offer enduring wisdom to the world. Highlighting India’s civilisational heritage, Shri Radhakrishnan said that meditation in Bharat has long been regarded as an ancient science of the mind and spirit, nurtured by sages and seers. Drawing upon teachings from the Bhagavad Gita and the Tamil spiritual classic Thirumantiram, he emphasised that mastery of the mind through meditation leads to inner harmony, self-realisation and ethical living. The Vice-President underlined that meditation has a vital role to play in the journey towards Viksit Bharat@2047. He said that national development must encompass not only economic progress but also emotional well-being and spiritual upliftment, and that meditation can contribute significantly to building a peaceful, resilient and compassionate society. Referring to the vision of Mission LiFE, the Vice-President said that meditation nurtures values such as mindfulness, responsibility and harmony with nature, which are essential for sustainable living. He appreciated Kanha Shanti Vanam for adopting environmentally responsible practices and promoting holistic well-being. Calling upon citizens to integrate meditation into daily life, Shri Radhakrishnan urged individuals, families and communities to lead by example and encourage future generations to embrace practices that promote mental peace, balance and harmony. Governor of Telangana, Shri Jishnu Dev Varma; Minister, Government of Telangana, Shri D. Sridhar Babu; and Spiritual Guide of Heartfulness Meditation, Daaji Kamlesh D. Patel, and other dignitaries along with thousands who joined the meditation session at Kanha Shanti Vanam were present at the celebrations. *** PR/ASM (रिलीज़ आईडी: 2207153)",
    "scraped_at": "2025-12-21T09:36:14.504585"
  },
  {
    "id": "2207171",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister Shri Narendra Modi lays foundation stone of Ammonia-Urea Fertilizer Project of Assam Valley Fertilizer and Chemical Company Limited at Namrup, Assam",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207171",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister Shri Narendra Modi lays foundation stone of Ammonia-Urea Fertilizer Project of Assam Valley Fertilizer and Chemical Company Limited at Namrup, Assam Assam has picked up a new momentum of development: PM Our government is placing farmers' welfare at the centre of all its efforts: PM Initiatives like PM Dhan Dhanya Krishi Yojana and the Dalhan Atmanirbharta Mission are launched to promote farming and support farmers: PM Guided by the vision of Sabka Saath, Sabka Vikas, our efforts have transformed the lives of poor: PM प्रविष्टि तिथि:\r\n                21 DEC 2025 2:57PM by PIB Delhi Prime Minister Shri Narendra Modi laid the foundation stone of Ammonia-Urea Fertilizer Project of Assam Valley Fertilizer and Chemical Company Limited at Namrup in Dibrugarh, Assam today. Addressing the gathering on the occasion, Shri Modi remarked that this is the land of great heroes like Chaolung Sukhapa and Mahaveer Lachit Borphukan. He highlighted the contributions of Bhimbar Deuri, Shaheed Kushal Kunvar, Moran King Bodousa, Malati Mem, Indira Miri, Swargadeo Sarbananda Singh, and the valiant Sati Sadhani. The Prime Minister stated that he bows to the sacred soil of Ujani Assam, this great land of valor and sacrifice. Shri Modi observed that he could see people gathered in large numbers ahead, extending their affection. He especially highlighted the presence of mothers and sisters, noting that the love and blessings they brought were extraordinary. He remarked that many sisters had come carrying the fragrance of Assam’s tea gardens. The Prime Minister stated that this fragrance creates a unique feeling in his relationship with Assam. He bowed to all present and expressed gratitude for their affection and love. Stating that today is a historic day for Assam and the entire North East, Shri Modi remarked that the long-awaited dream of Namrup and Dibrugarh has been fulfilled, as a new chapter of industrial progress begins in the region. He highlighted that just a short while ago he performed the bhoomi pujan of the Ammonia–Urea Fertilizer Plant, and before arriving in Dibrugarh, inaugurated the new terminal at Guwahati Airport. The Prime Minister noted that everyone is saying Assam has now caught a new pace of development. He emphasized that what is being witnessed today is only the beginning, and Assam must be taken much further ahead. He recalled the strength and role Assam held during the Ahom kingdom and asserted that in a developed India, Assam will play an equally powerful role. He underlined the start of new industries, the building of modern infrastructure, semiconductor manufacturing, new opportunities in agriculture, the advancement of tea gardens and their workers, and the growing potential in tourism, affirming that Assam is progressing in every sector. Shri Modi extended his best wishes for the modern fertilizer plant and congratulated the people for the new terminal at Guwahati Airport. He remarked that under their governments at Union and state, the synergy of industry and connectivity is fulfilling Assam’s dreams and inspiring the youth to dream bigger. Emphasizing that in building a developed India, the nation’s farmers and annadatas have a crucial role, the PM stated that the government is working with farmers’ interests as the top priority and that farmer-friendly schemes are being extended to all. He highlighted that alongside agricultural welfare initiatives, it is essential to ensure a continuous supply of fertilizers to farmers. Shri Modi remarked that in the coming time, the new urea plant will guarantee this supply. He noted that around ₹11,000 crore will be invested in the fertilizer project, which will produce more than 12 lakh metric tonnes of fertilizer annually. He underlined that with production taking place locally, supply will be faster and logistic costs will be reduced. Highlighting that the Namrup unit will generate thousands of new opportunities for employment and self-employment, Shri Modi remarked that with the plant becoming operational, many people will secure permanent jobs locally. He added that associated work such as repair, supply, and other related activities will also provide employment to the youth. Shri Modi questioned why such farmer welfare initiatives are happening only after their government came to power. He noted that Namrup had long been a center of fertilizer production, and at one time the fertilizer produced here strengthened the fields of the North East and supported farmers’ crops. He recalled that even when fertilizer supply was a challenge in many parts of the country, Namrup remained a source of hope for farmers. However, he pointed out that the technology of the old plants became outdated over time and previous governments paid no attention. As a result, several units of the Namrup plant were shut down, leaving farmers across the North East distressed, their incomes hurt, and agricultural difficulties increasing. The Prime Minister asserted that today, their governments at Union and State are resolving the problems created by the previous ruling dispensation. Prime Minister remarked that just like in Assam, fertilizer factories in many other states had also shut down. He recalled the difficult conditions farmers faced at that time, when they had to stand in long queues for urea, police had to be deployed at shops, and farmers were subjected to lathi charges. He stated that the opposition had worsened these conditions, while the present government is correcting them. He highlighted that during the previous ruling dispensation era fertilizer factories were closing, whereas the current government has started several plants in Gorakhpur, Sindri, Barauni, and Ramagundam. He added that the private sector is also being encouraged in this field. The Prime Minister emphasized that as a result of these efforts, India is moving towards self-reliance in the area of urea. “In 2014 the country produced only 225 lakh metric tonnes of urea, whereas today production has reached nearly 306 lakh metric tonnes”, highlighted the Prime Minister, noting that India requires about 380 lakh metric tonnes of urea annually and the government is working swiftly to bridge this gap. He emphasized that the government is highly sensitive to the interests of farmers. Shri Modi remarked that even the urea imported at high prices from abroad is not allowed to burden farmers, as their government bears that cost through subsidies. He stated that Indian farmers receive a bag of urea for just ₹300, while the government pays nearly ₹3,000 to other countries for that same bag. He underlined that the remaining amount is covered by their government so that farmer brothers and sisters do not face any financial burden. He further urged the farmers to save soil by optimising the usage of Urea and other fertilizers. Prime Minister Modi stated that today, from seed to market, their government stands firmly with farmers. He highlighted that money for farm work is being directly transferred into farmers’ accounts so they do not have to wander for loans. He remarked that so far, nearly ₹4 lakh crore has been sent to farmers’ accounts under the PM Kisan Samman Nidhi. The Prime Minister noted that this year alone, two schemes worth ₹35,000 crore have been launched to support farmers. He emphasized that the PM Dhan Dhanya Krishi Yojana and the Dalhan Atmanirbharta Mission will further promote agriculture. Underlining that the government is working by keeping every need of farmers in mind, Shri Modi remarked that when crops are damaged due to adverse weather, farmers are supported through the crop insurance scheme. He highlighted that procurement arrangements have been improved to ensure farmers receive the right price for their produce. The Prime Minister affirmed that the government firmly believes the nation can progress only when farmers are strong, and every possible effort is being made towards this. The Prime Minister noted that after the formation of the government at the Centre, livestock farmers and fish farmers were also included under the Kisan Credit Card facility, and they are benefiting greatly from it. He emphasized that through KCC, farmers have received assistance of more than ₹10 lakh crore this year. He added that the reduction of GST on bio-fertilizers has also provided significant relief to farmers. Shri Modi underlined that their government is actively encouraging natural farming, with the launch of the National Mission on Natural Farming that has already connected lakhs of farmers. He pointed out that in recent years, 10,000 Farmer Producer Organizations (FPOs) have been established across the country. He further highlighted that with special focus on the North East, the government has launched a mission related to oil palm, which will not only make India self-reliant in edible oils but also enhance the income of farmers in the region. Highlighting that a large number of tea garden workers are present in this region, the PM stated that it was their government which facilitated the opening of Jan Dhan bank accounts for seven and a half lakh tea garden workers in Assam. He remarked that by being connected to the banking system, these workers now have the benefit of direct transfer of money into their accounts. The Prime Minister emphasized that the government is expanding facilities such as schools, roads, electricity, water, and hospitals in tea garden areas. Underlining that the government is moving forward with the mantra of Sabka Saath, Sabka Vikas, and this vision has brought a major transformation in the lives of the poor, Shri Modi noted that in the past 11 years, 25 crore people have come out of poverty due to these efforts, and a neo-middle class has emerged in the country. He added that this has been possible because the living standards of poor families have continuously improved in recent years. The Prime Minister pointed out that fresh data has come which symbolizes the changes taking place in India. He highlighted that earlier, among the poorest families in villages, only one in ten had a bike, whereas now nearly half the families in villages own a bike or a car. He remarked that mobile phones have reached almost every household, and items like refrigerators, once considered a luxury, have now become common, finding a place even in village kitchens. He noted that despite the spread of smartphones, the trend of owning televisions in villages has increased. Shri Modi emphasized that these changes did not happen on their own, but because the poor of the country are becoming empowered and even those living in remote areas are now benefiting from development. Underscoring that their Governments at the Union & State are  governments for the poor, tribals, youth, and women, and is working to end decades of violence in Assam and the North East, Shri Modi underlined that the government has always kept Assam’s identity and culture paramount, highlighting symbols of Assamese pride on every platform. He pointed out that this is why the government proudly built a 125-foot statue of Mahaveer Lachit Borphukan, celebrated the birth centenary of Bhupen Hazarika, and promoted Assam’s art, crafts, and the Gamosa to global recognition. He mentioned that just a few days ago, when Russian President H.E. Mr. Vladimir Putin visited Delhi, he gifted him Assam’s black tea with great pride. The Prime Minister asserted that every effort that enhances Assam’s dignity is given priority. He remarked that when they undertake such work, it causes the greatest discomfort to the opposition. He recalled that when the government conferred the Bharat Ratna on Bhupen Hazarika, opposition openly opposed it, with its national president commenting, ‘Modi was giving Bharat Ratna to singers and performers’. He added that even when a semiconductor unit was set up in Assam, opposition opposed it. The Prime Minister reminded that it was the opposition government that for decades denied land rights to the tea community brothers and sisters, whereas their government has given them land rights and a dignified life. He stated that the opposition continues to push anti-national thinking, seeking to settle Bangladeshi infiltrators on Assam’s forests and lands to strengthen its vote bank. Prime Minister further stated that the Opposition has no concern for Assam, its people, or their identity, and is only interested in power and government. He remarked that the Opposition prefers illegal Bangladeshi infiltrators, settled them, and continues to protect them. He highlighted that this is why the Opposition opposes the purification of voter lists. Shri Modi emphasized that Assam must be safeguarded from the poison of Opposition’s appeasement and vote-bank politics. He assured the people that their party stands like a shield to protect Assam’s identity and honor. Underlining that in building a developed India, Shri Modi said the role of Eastern India and the North East is continuously increasing, reiterating that Eastern India will become the growth engine of the nation’s development. He pointed out that the new Namrup unit is a symbol of this transformation, as the fertilizer produced here will not only serve Assam’s fields but also reach Bihar, Jharkhand, West Bengal, and Eastern Uttar Pradesh. He stressed that this is a significant contribution of the North East to the country’s fertilizer needs. The Prime Minister concluded by remarking that projects like Namrup demonstrate that in the coming time, the North East will emerge as a major center of self-reliant India and will remain as Asthalakshmi in true sense. He once again congratulated everyone on the new fertilizer plant. Governor of Assam, Shri Lakshman Prasad Acharya, Chief Minister of Assam, Shri Himanta Biswa Sarma, Union Minister, Shri Sarbananda Sonowal were present among other dignitaries at the event. Background Prime Minister performed Bhoomipujan of the new brownfield Ammonia-Urea Fertilizer Project at Namrup, in Dibrugarh, Assam, within the existing premises of Brahmaputra Valley Fertilizer Corporation Limited (BVFCL). Furthering Prime Minister’s vision of Farmers’ Welfare, the project, with an estimated investment of over Rs. 10,600 crore, will meet fertilizer requirements of Assam and neighbouring states, reduce import dependence, generate substantial employment and catalyse regional economic development. It stands as a cornerstone of industrial revival and farmer welfare. The Bhoomi Pujan of the Ammonia-Urea Fertilizer Project in Namrup will empower our hardworking farmers. It will boost the agriculture sector across Assam and the Northeast. https://t.co/U0yiOB10zL — Narendra Modi (@narendramodi) December 21, 2025 Assam has picked up a new momentum of development. pic.twitter.com/gfa0h2zDao — PMO India (@PMOIndia) December 21, 2025 Our government is placing farmers' welfare at the centre of all its efforts. pic.twitter.com/e0peEY5m06 — PMO India (@PMOIndia) December 21, 2025 Initiatives to promote farming and support farmers. pic.twitter.com/EIDKA3MxRG — PMO India (@PMOIndia) December 21, 2025 Guided by the vision of Sabka Saath, Sabka Vikas, our efforts have transformed the lives of poor. pic.twitter.com/RtOPpFJELK — PMO India (@PMOIndia) December 21, 2025 *** MJPS/SR (रिलीज़ आईडी: 2207171) आगंतुक पटल  : 18 Prime Minister's Office Prime Minister Shri Narendra Modi lays foundation stone of Ammonia-Urea Fertilizer Project of Assam Valley Fertilizer and Chemical Company Limited at Namrup, Assam Assam has picked up a new momentum of development: PM Our government is placing farmers' welfare at the centre of all its efforts: PM Initiatives like PM Dhan Dhanya Krishi Yojana and the Dalhan Atmanirbharta Mission are launched to promote farming and support farmers: PM Guided by the vision of Sabka Saath, Sabka Vikas, our efforts have transformed the lives of poor: PM प्रविष्टि तिथि:\r\n                        21 DEC 2025 2:57PM by PIB Delhi Prime Minister Shri Narendra Modi laid the foundation stone of Ammonia-Urea Fertilizer Project of Assam Valley Fertilizer and Chemical Company Limited at Namrup in Dibrugarh, Assam today. Addressing the gathering on the occasion, Shri Modi remarked that this is the land of great heroes like Chaolung Sukhapa and Mahaveer Lachit Borphukan. He highlighted the contributions of Bhimbar Deuri, Shaheed Kushal Kunvar, Moran King Bodousa, Malati Mem, Indira Miri, Swargadeo Sarbananda Singh, and the valiant Sati Sadhani. The Prime Minister stated that he bows to the sacred soil of Ujani Assam, this great land of valor and sacrifice. Shri Modi observed that he could see people gathered in large numbers ahead, extending their affection. He especially highlighted the presence of mothers and sisters, noting that the love and blessings they brought were extraordinary. He remarked that many sisters had come carrying the fragrance of Assam’s tea gardens. The Prime Minister stated that this fragrance creates a unique feeling in his relationship with Assam. He bowed to all present and expressed gratitude for their affection and love. Stating that today is a historic day for Assam and the entire North East, Shri Modi remarked that the long-awaited dream of Namrup and Dibrugarh has been fulfilled, as a new chapter of industrial progress begins in the region. He highlighted that just a short while ago he performed the bhoomi pujan of the Ammonia–Urea Fertilizer Plant, and before arriving in Dibrugarh, inaugurated the new terminal at Guwahati Airport. The Prime Minister noted that everyone is saying Assam has now caught a new pace of development. He emphasized that what is being witnessed today is only the beginning, and Assam must be taken much further ahead. He recalled the strength and role Assam held during the Ahom kingdom and asserted that in a developed India, Assam will play an equally powerful role. He underlined the start of new industries, the building of modern infrastructure, semiconductor manufacturing, new opportunities in agriculture, the advancement of tea gardens and their workers, and the growing potential in tourism, affirming that Assam is progressing in every sector. Shri Modi extended his best wishes for the modern fertilizer plant and congratulated the people for the new terminal at Guwahati Airport. He remarked that under their governments at Union and state, the synergy of industry and connectivity is fulfilling Assam’s dreams and inspiring the youth to dream bigger. Emphasizing that in building a developed India, the nation’s farmers and annadatas have a crucial role, the PM stated that the government is working with farmers’ interests as the top priority and that farmer-friendly schemes are being extended to all. He highlighted that alongside agricultural welfare initiatives, it is essential to ensure a continuous supply of fertilizers to farmers. Shri Modi remarked that in the coming time, the new urea plant will guarantee this supply. He noted that around ₹11,000 crore will be invested in the fertilizer project, which will produce more than 12 lakh metric tonnes of fertilizer annually. He underlined that with production taking place locally, supply will be faster and logistic costs will be reduced. Highlighting that the Namrup unit will generate thousands of new opportunities for employment and self-employment, Shri Modi remarked that with the plant becoming operational, many people will secure permanent jobs locally. He added that associated work such as repair, supply, and other related activities will also provide employment to the youth. Shri Modi questioned why such farmer welfare initiatives are happening only after their government came to power. He noted that Namrup had long been a center of fertilizer production, and at one time the fertilizer produced here strengthened the fields of the North East and supported farmers’ crops. He recalled that even when fertilizer supply was a challenge in many parts of the country, Namrup remained a source of hope for farmers. However, he pointed out that the technology of the old plants became outdated over time and previous governments paid no attention. As a result, several units of the Namrup plant were shut down, leaving farmers across the North East distressed, their incomes hurt, and agricultural difficulties increasing. The Prime Minister asserted that today, their governments at Union and State are resolving the problems created by the previous ruling dispensation. Prime Minister remarked that just like in Assam, fertilizer factories in many other states had also shut down. He recalled the difficult conditions farmers faced at that time, when they had to stand in long queues for urea, police had to be deployed at shops, and farmers were subjected to lathi charges. He stated that the opposition had worsened these conditions, while the present government is correcting them. He highlighted that during the previous ruling dispensation era fertilizer factories were closing, whereas the current government has started several plants in Gorakhpur, Sindri, Barauni, and Ramagundam. He added that the private sector is also being encouraged in this field. The Prime Minister emphasized that as a result of these efforts, India is moving towards self-reliance in the area of urea. “In 2014 the country produced only 225 lakh metric tonnes of urea, whereas today production has reached nearly 306 lakh metric tonnes”, highlighted the Prime Minister, noting that India requires about 380 lakh metric tonnes of urea annually and the government is working swiftly to bridge this gap. He emphasized that the government is highly sensitive to the interests of farmers. Shri Modi remarked that even the urea imported at high prices from abroad is not allowed to burden farmers, as their government bears that cost through subsidies. He stated that Indian farmers receive a bag of urea for just ₹300, while the government pays nearly ₹3,000 to other countries for that same bag. He underlined that the remaining amount is covered by their government so that farmer brothers and sisters do not face any financial burden. He further urged the farmers to save soil by optimising the usage of Urea and other fertilizers. Prime Minister Modi stated that today, from seed to market, their government stands firmly with farmers. He highlighted that money for farm work is being directly transferred into farmers’ accounts so they do not have to wander for loans. He remarked that so far, nearly ₹4 lakh crore has been sent to farmers’ accounts under the PM Kisan Samman Nidhi. The Prime Minister noted that this year alone, two schemes worth ₹35,000 crore have been launched to support farmers. He emphasized that the PM Dhan Dhanya Krishi Yojana and the Dalhan Atmanirbharta Mission will further promote agriculture. Underlining that the government is working by keeping every need of farmers in mind, Shri Modi remarked that when crops are damaged due to adverse weather, farmers are supported through the crop insurance scheme. He highlighted that procurement arrangements have been improved to ensure farmers receive the right price for their produce. The Prime Minister affirmed that the government firmly believes the nation can progress only when farmers are strong, and every possible effort is being made towards this. The Prime Minister noted that after the formation of the government at the Centre, livestock farmers and fish farmers were also included under the Kisan Credit Card facility, and they are benefiting greatly from it. He emphasized that through KCC, farmers have received assistance of more than ₹10 lakh crore this year. He added that the reduction of GST on bio-fertilizers has also provided significant relief to farmers. Shri Modi underlined that their government is actively encouraging natural farming, with the launch of the National Mission on Natural Farming that has already connected lakhs of farmers. He pointed out that in recent years, 10,000 Farmer Producer Organizations (FPOs) have been established across the country. He further highlighted that with special focus on the North East, the government has launched a mission related to oil palm, which will not only make India self-reliant in edible oils but also enhance the income of farmers in the region. Highlighting that a large number of tea garden workers are present in this region, the PM stated that it was their government which facilitated the opening of Jan Dhan bank accounts for seven and a half lakh tea garden workers in Assam. He remarked that by being connected to the banking system, these workers now have the benefit of direct transfer of money into their accounts. The Prime Minister emphasized that the government is expanding facilities such as schools, roads, electricity, water, and hospitals in tea garden areas. Underlining that the government is moving forward with the mantra of Sabka Saath, Sabka Vikas, and this vision has brought a major transformation in the lives of the poor, Shri Modi noted that in the past 11 years, 25 crore people have come out of poverty due to these efforts, and a neo-middle class has emerged in the country. He added that this has been possible because the living standards of poor families have continuously improved in recent years. The Prime Minister pointed out that fresh data has come which symbolizes the changes taking place in India. He highlighted that earlier, among the poorest families in villages, only one in ten had a bike, whereas now nearly half the families in villages own a bike or a car. He remarked that mobile phones have reached almost every household, and items like refrigerators, once considered a luxury, have now become common, finding a place even in village kitchens. He noted that despite the spread of smartphones, the trend of owning televisions in villages has increased. Shri Modi emphasized that these changes did not happen on their own, but because the poor of the country are becoming empowered and even those living in remote areas are now benefiting from development. Underscoring that their Governments at the Union & State are  governments for the poor, tribals, youth, and women, and is working to end decades of violence in Assam and the North East, Shri Modi underlined that the government has always kept Assam’s identity and culture paramount, highlighting symbols of Assamese pride on every platform. He pointed out that this is why the government proudly built a 125-foot statue of Mahaveer Lachit Borphukan, celebrated the birth centenary of Bhupen Hazarika, and promoted Assam’s art, crafts, and the Gamosa to global recognition. He mentioned that just a few days ago, when Russian President H.E. Mr. Vladimir Putin visited Delhi, he gifted him Assam’s black tea with great pride. The Prime Minister asserted that every effort that enhances Assam’s dignity is given priority. He remarked that when they undertake such work, it causes the greatest discomfort to the opposition. He recalled that when the government conferred the Bharat Ratna on Bhupen Hazarika, opposition openly opposed it, with its national president commenting, ‘Modi was giving Bharat Ratna to singers and performers’. He added that even when a semiconductor unit was set up in Assam, opposition opposed it. The Prime Minister reminded that it was the opposition government that for decades denied land rights to the tea community brothers and sisters, whereas their government has given them land rights and a dignified life. He stated that the opposition continues to push anti-national thinking, seeking to settle Bangladeshi infiltrators on Assam’s forests and lands to strengthen its vote bank. Prime Minister further stated that the Opposition has no concern for Assam, its people, or their identity, and is only interested in power and government. He remarked that the Opposition prefers illegal Bangladeshi infiltrators, settled them, and continues to protect them. He highlighted that this is why the Opposition opposes the purification of voter lists. Shri Modi emphasized that Assam must be safeguarded from the poison of Opposition’s appeasement and vote-bank politics. He assured the people that their party stands like a shield to protect Assam’s identity and honor. Underlining that in building a developed India, Shri Modi said the role of Eastern India and the North East is continuously increasing, reiterating that Eastern India will become the growth engine of the nation’s development. He pointed out that the new Namrup unit is a symbol of this transformation, as the fertilizer produced here will not only serve Assam’s fields but also reach Bihar, Jharkhand, West Bengal, and Eastern Uttar Pradesh. He stressed that this is a significant contribution of the North East to the country’s fertilizer needs. The Prime Minister concluded by remarking that projects like Namrup demonstrate that in the coming time, the North East will emerge as a major center of self-reliant India and will remain as Asthalakshmi in true sense. He once again congratulated everyone on the new fertilizer plant. Governor of Assam, Shri Lakshman Prasad Acharya, Chief Minister of Assam, Shri Himanta Biswa Sarma, Union Minister, Shri Sarbananda Sonowal were present among other dignitaries at the event. Background Prime Minister performed Bhoomipujan of the new brownfield Ammonia-Urea Fertilizer Project at Namrup, in Dibrugarh, Assam, within the existing premises of Brahmaputra Valley Fertilizer Corporation Limited (BVFCL). Furthering Prime Minister’s vision of Farmers’ Welfare, the project, with an estimated investment of over Rs. 10,600 crore, will meet fertilizer requirements of Assam and neighbouring states, reduce import dependence, generate substantial employment and catalyse regional economic development. It stands as a cornerstone of industrial revival and farmer welfare. The Bhoomi Pujan of the Ammonia-Urea Fertilizer Project in Namrup will empower our hardworking farmers. It will boost the agriculture sector across Assam and the Northeast. https://t.co/U0yiOB10zL — Narendra Modi (@narendramodi) December 21, 2025 Assam has picked up a new momentum of development. pic.twitter.com/gfa0h2zDao — PMO India (@PMOIndia) December 21, 2025 Our government is placing farmers' welfare at the centre of all its efforts. pic.twitter.com/e0peEY5m06 — PMO India (@PMOIndia) December 21, 2025 Initiatives to promote farming and support farmers. pic.twitter.com/EIDKA3MxRG — PMO India (@PMOIndia) December 21, 2025 Guided by the vision of Sabka Saath, Sabka Vikas, our efforts have transformed the lives of poor. pic.twitter.com/RtOPpFJELK — PMO India (@PMOIndia) December 21, 2025 *** MJPS/SR (रिलीज़ आईडी: 2207171)",
    "scraped_at": "2025-12-21T09:36:18.055867"
  },
  {
    "id": "2207152",
    "ministry": "Ministry of Commerce & Industry",
    "title": "GeM Facilitates Transparent Disposal of Government Assets Through Its Forward Auction Module",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207152",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Commerce & Industry GeM Facilitates Transparent Disposal of Government Assets Through Its Forward Auction Module GeM Forward Auction Module Facilitates Over ₹2,200 Crore in Government Asset Disposal Between 2021 and 2025 More Than 13,000 Auctions Conducted Through GeM Forward Auction Module, Enabling Participation of Over 23,000 Bidders प्रविष्टि तिथि:\r\n                21 DEC 2025 12:36PM by PIB Delhi The Government e Marketplace (GeM) operates as a digital platform through which ministries, departments and public sector entities procure goods and services. In addition to this function, GeM facilitates disposal of government assets through its Forward Auction module, introducing online competitive bidding and improving transparency, efficiency and value discovery in a process that was traditionally fragmented and paperwork-intensive. A Forward Auction is a digital bidding process through which government departments sell assets such as scrap, e-waste, old vehicles, machinery and leasehold properties including buildings and land to the highest bidder. In this process, the government lists an item on the platform, registered bidders place competing bids and the highest offer is declared successful. Through GeM’s secure digital interface, departments are able to set reserve prices, define participation conditions and monitor bidding in real time, ensuring efficiency and transparency throughout the auction lifecycle. The relevance of Forward Auctions extends across sectors and geographies, with a wide spectrum of government assets being brought onto the platform. These include e-waste such as old printers, laptops and IT equipment; industrial and non-industrial machinery; scrap and disposables including lube oil and metal and non-metal items; lease land and buildings for residential, commercial and institutional use; end-of-life vehicles; and sublet or lease of properties such as dormitories, parking spaces and toll booths. Between December 2021 and November 2025, GeM’s Forward Auction module facilitated auctions worth more than ₹2,200 crore, conducted over 13,000 auctions, onboarded more than 23,000 registered bidders and enabled participation from over 17,000 auctioneers. These figures underscore that Forward Auctions are no longer a pilot initiative but have evolved into a nationwide digital mechanism for government asset disposal. The impact of this shift is evident from multiple instances across the country. One such case is the auction of 100 EWS flats at Aliganj, Lucknow, conducted by the State Bank of India, which realised ₹34.53 crore through the GeM platform. The auction outcome led SBI to formally acknowledge the conduct of the process by the GeM Forward Auction team, reflecting the role of transparent digital mechanisms in enabling value discovery. Another example is the National Zoological Park, New Delhi, which had faced challenges in disposing of unusable and obsolete articles over an extended period. Through the Forward Auction process, the Zoo achieved a highest bid above the reserve value and placed on record its appreciation for the support received during the auction. Efficient disposal of scrap through such mechanisms contributes to improved operational processes and optimal utilisation of public resources. The range of assets being auctioned through GeM highlights the breadth of applications of the Forward Auction module. Recent auctions include the sale of screened gypsum worth ₹3.35 crore by FCI Aravali Gypsum and Minerals India Ltd., disposal of 261 condemned vehicles in the Jammu Division, auction of salvage items by the Border Roads Organisation, lease of a dormitory in Gulmarg for a period of five years, and auction of boating activity rights at a lake in Spurtar. These examples indicate a move towards competitive disposal mechanisms for a wide variety of government assets. Participation in GeM Forward Auctions has been structured to facilitate ease of access for bidders. Interested participants are required to visit the GeM homepage, register through the Forward Auction Bidder Registration link, submit PAN and other required details, and complete email verification and onboarding. Upon payment of the Earnest Money Deposit, where applicable, bidders may participate in live auctions that are conducted online, are time-bound and follow defined security protocols. All auctions are publicly listed, except for a limited number where participation is restricted to pre-qualified bidders owing to the nature of the assets. Beyond individual transactions, Forward Auctions contribute to broader governance objectives by reducing opacity in government asset disposal, addressing administrative delays, enabling fair competition, generating improved returns from public assets, facilitating faster clearance of scrap and obsolete materials, and supporting environmental responsibility, particularly in relation to e-waste management. Forward Auction on GeM reflects a change in approach to government asset disposal. It provides a common digital interface for government departments and businesses where rules are predetermined, bidding processes are visible and outcomes are based on competitive criteria. The platform accommodates participation ranging from local scrap dealers to larger real-estate entities and supports disposal activities spanning old machinery to property assets. As adoption of Forward Auctions expands across departments, the process underscores the integration of transparency and digital systems into public asset management practices. *** Abhishek Dayal/ Shabbir Azad/ Ishita Biswas (रिलीज़ आईडी: 2207152) आगंतुक पटल  : 124 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi Ministry of Commerce & Industry GeM Facilitates Transparent Disposal of Government Assets Through Its Forward Auction Module GeM Forward Auction Module Facilitates Over ₹2,200 Crore in Government Asset Disposal Between 2021 and 2025 More Than 13,000 Auctions Conducted Through GeM Forward Auction Module, Enabling Participation of Over 23,000 Bidders प्रविष्टि तिथि:\r\n                        21 DEC 2025 12:36PM by PIB Delhi The Government e Marketplace (GeM) operates as a digital platform through which ministries, departments and public sector entities procure goods and services. In addition to this function, GeM facilitates disposal of government assets through its Forward Auction module, introducing online competitive bidding and improving transparency, efficiency and value discovery in a process that was traditionally fragmented and paperwork-intensive. A Forward Auction is a digital bidding process through which government departments sell assets such as scrap, e-waste, old vehicles, machinery and leasehold properties including buildings and land to the highest bidder. In this process, the government lists an item on the platform, registered bidders place competing bids and the highest offer is declared successful. Through GeM’s secure digital interface, departments are able to set reserve prices, define participation conditions and monitor bidding in real time, ensuring efficiency and transparency throughout the auction lifecycle. The relevance of Forward Auctions extends across sectors and geographies, with a wide spectrum of government assets being brought onto the platform. These include e-waste such as old printers, laptops and IT equipment; industrial and non-industrial machinery; scrap and disposables including lube oil and metal and non-metal items; lease land and buildings for residential, commercial and institutional use; end-of-life vehicles; and sublet or lease of properties such as dormitories, parking spaces and toll booths. Between December 2021 and November 2025, GeM’s Forward Auction module facilitated auctions worth more than ₹2,200 crore, conducted over 13,000 auctions, onboarded more than 23,000 registered bidders and enabled participation from over 17,000 auctioneers. These figures underscore that Forward Auctions are no longer a pilot initiative but have evolved into a nationwide digital mechanism for government asset disposal. The impact of this shift is evident from multiple instances across the country. One such case is the auction of 100 EWS flats at Aliganj, Lucknow, conducted by the State Bank of India, which realised ₹34.53 crore through the GeM platform. The auction outcome led SBI to formally acknowledge the conduct of the process by the GeM Forward Auction team, reflecting the role of transparent digital mechanisms in enabling value discovery. Another example is the National Zoological Park, New Delhi, which had faced challenges in disposing of unusable and obsolete articles over an extended period. Through the Forward Auction process, the Zoo achieved a highest bid above the reserve value and placed on record its appreciation for the support received during the auction. Efficient disposal of scrap through such mechanisms contributes to improved operational processes and optimal utilisation of public resources. The range of assets being auctioned through GeM highlights the breadth of applications of the Forward Auction module. Recent auctions include the sale of screened gypsum worth ₹3.35 crore by FCI Aravali Gypsum and Minerals India Ltd., disposal of 261 condemned vehicles in the Jammu Division, auction of salvage items by the Border Roads Organisation, lease of a dormitory in Gulmarg for a period of five years, and auction of boating activity rights at a lake in Spurtar. These examples indicate a move towards competitive disposal mechanisms for a wide variety of government assets. Participation in GeM Forward Auctions has been structured to facilitate ease of access for bidders. Interested participants are required to visit the GeM homepage, register through the Forward Auction Bidder Registration link, submit PAN and other required details, and complete email verification and onboarding. Upon payment of the Earnest Money Deposit, where applicable, bidders may participate in live auctions that are conducted online, are time-bound and follow defined security protocols. All auctions are publicly listed, except for a limited number where participation is restricted to pre-qualified bidders owing to the nature of the assets. Beyond individual transactions, Forward Auctions contribute to broader governance objectives by reducing opacity in government asset disposal, addressing administrative delays, enabling fair competition, generating improved returns from public assets, facilitating faster clearance of scrap and obsolete materials, and supporting environmental responsibility, particularly in relation to e-waste management. Forward Auction on GeM reflects a change in approach to government asset disposal. It provides a common digital interface for government departments and businesses where rules are predetermined, bidding processes are visible and outcomes are based on competitive criteria. The platform accommodates participation ranging from local scrap dealers to larger real-estate entities and supports disposal activities spanning old machinery to property assets. As adoption of Forward Auctions expands across departments, the process underscores the integration of transparency and digital systems into public asset management practices. *** Abhishek Dayal/ Shabbir Azad/ Ishita Biswas (रिलीज़ आईडी: 2207152)",
    "scraped_at": "2025-12-21T09:36:19.844141"
  },
  {
    "id": "2207151",
    "ministry": "Ministry of Commerce & Industry",
    "title": "GeM Platform Empowers Micro and Small Enterprises, Women Entrepreneurs and SC/ST Businesses to Compete and Secure Orders in Government Procurement",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207151",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Commerce & Industry GeM Platform Empowers Micro and Small Enterprises, Women Entrepreneurs and SC/ST Businesses to Compete and Secure Orders in Government Procurement GeM Records Over 11.25 Lakh MSE Sellers Securing ₹7.44 Lakh Crore in Government Orders Women-Led MSEs on GeM Secure Over ₹78,000 Crore in Government Procurement Micro and Small Enterprises Contribute 44.8% of Total Orders on GeM, Exceeding 25% Procurement Target प्रविष्टि तिथि:\r\n                21 DEC 2025 12:35PM by PIB Delhi The Government e-Marketplace (GeM) provides a digital platform that enables Micro and Small Enterprises (MSEs), women entrepreneurs, SC/ST businesses and startups to participate in government procurement and secure orders across sectors. This is reflected when a women-led clean energy firm from Vadodara supplies renewable energy solutions, or a small enterprise from Nagpur delivers surveillance infrastructure to the Central Government, showing that enterprise size is no longer a barrier to opportunity. As of 30 November 2025, GeM has recorded more than 11.25 lakh registered MSE sellers on the platform. These enterprises have cumulatively secured orders worth ₹7.44 lakh crore, accounting for 44.8 per cent of the total order value transacted through GeM, exceeding the mandated annual procurement target of 25 per cent. This participation reflects an expanding role of smaller enterprises in public procurement. Women-led enterprises have also registered increased participation on the platform. More than 2 lakh women-owned MSEs are currently active on GeM and have secured cumulative orders worth ₹78,066 crore. Their participation is supported through initiatives such as Womaniya, which focus on onboarding, training and improving access to procurement opportunities for women entrepreneurs. The participation of MSEs on GeM is supported through platform features aligned with national procurement policies. Buyers can identify products offered by MSEs, including women-led and SC/ST MSE sellers, through dedicated marketplace filters. Eligible MSEs are also provided purchase preference and relaxations in Earnest Money Deposit requirements, as well as prior turnover and experience criteria, with the objective of facilitating wider participation while maintaining accountability. The outcomes of these measures are reflected in transactions completed by MSEs and startups across sectors. In November 2025, a women-led MSE from Gujarat, FS Green Energies Private Limited, Vadodara, supplied renewable energy solutions valued at over ₹53 crore to the Department of Heavy Industries. During the same period, an MSE owned by an SC/ST entrepreneur, Infrastructure Development and Management Services, Nagpur, Maharashtra, supported surveillance infrastructure valued at ₹29 crore for the Central Government. A startup based in Mumbai, Cloudstrats Technologies Private Limited, Maharashtra, delivered technology services amounting to ₹191 crore, securing high-value contracts within a short period of scaling up operations. Beyond facilitating transactions, GeM supports transparency, speed and traceability in public procurement processes while enabling participation of enterprises from different regions and communities. By integrating digital processes with procurement policy provisions, the platform supports objectives related to Digital India and Atmanirbhar Bharat by enabling local enterprises to engage with government procurement at scale. As public procurement systems continue to evolve, the increasing participation of MSEs and women-led enterprises on GeM reflects an approach where access, inclusion and regional participation are integral components of government purchasing frameworks. *** Abhishek Dayal/ Shabbir Azad/ Ishita Biswas (रिलीज़ आईडी: 2207151) आगंतुक पटल  : 107 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Commerce & Industry GeM Platform Empowers Micro and Small Enterprises, Women Entrepreneurs and SC/ST Businesses to Compete and Secure Orders in Government Procurement GeM Records Over 11.25 Lakh MSE Sellers Securing ₹7.44 Lakh Crore in Government Orders Women-Led MSEs on GeM Secure Over ₹78,000 Crore in Government Procurement Micro and Small Enterprises Contribute 44.8% of Total Orders on GeM, Exceeding 25% Procurement Target प्रविष्टि तिथि:\r\n                        21 DEC 2025 12:35PM by PIB Delhi The Government e-Marketplace (GeM) provides a digital platform that enables Micro and Small Enterprises (MSEs), women entrepreneurs, SC/ST businesses and startups to participate in government procurement and secure orders across sectors. This is reflected when a women-led clean energy firm from Vadodara supplies renewable energy solutions, or a small enterprise from Nagpur delivers surveillance infrastructure to the Central Government, showing that enterprise size is no longer a barrier to opportunity. As of 30 November 2025, GeM has recorded more than 11.25 lakh registered MSE sellers on the platform. These enterprises have cumulatively secured orders worth ₹7.44 lakh crore, accounting for 44.8 per cent of the total order value transacted through GeM, exceeding the mandated annual procurement target of 25 per cent. This participation reflects an expanding role of smaller enterprises in public procurement. Women-led enterprises have also registered increased participation on the platform. More than 2 lakh women-owned MSEs are currently active on GeM and have secured cumulative orders worth ₹78,066 crore. Their participation is supported through initiatives such as Womaniya, which focus on onboarding, training and improving access to procurement opportunities for women entrepreneurs. The participation of MSEs on GeM is supported through platform features aligned with national procurement policies. Buyers can identify products offered by MSEs, including women-led and SC/ST MSE sellers, through dedicated marketplace filters. Eligible MSEs are also provided purchase preference and relaxations in Earnest Money Deposit requirements, as well as prior turnover and experience criteria, with the objective of facilitating wider participation while maintaining accountability. The outcomes of these measures are reflected in transactions completed by MSEs and startups across sectors. In November 2025, a women-led MSE from Gujarat, FS Green Energies Private Limited, Vadodara, supplied renewable energy solutions valued at over ₹53 crore to the Department of Heavy Industries. During the same period, an MSE owned by an SC/ST entrepreneur, Infrastructure Development and Management Services, Nagpur, Maharashtra, supported surveillance infrastructure valued at ₹29 crore for the Central Government. A startup based in Mumbai, Cloudstrats Technologies Private Limited, Maharashtra, delivered technology services amounting to ₹191 crore, securing high-value contracts within a short period of scaling up operations. Beyond facilitating transactions, GeM supports transparency, speed and traceability in public procurement processes while enabling participation of enterprises from different regions and communities. By integrating digital processes with procurement policy provisions, the platform supports objectives related to Digital India and Atmanirbhar Bharat by enabling local enterprises to engage with government procurement at scale. As public procurement systems continue to evolve, the increasing participation of MSEs and women-led enterprises on GeM reflects an approach where access, inclusion and regional participation are integral components of government purchasing frameworks. *** Abhishek Dayal/ Shabbir Azad/ Ishita Biswas (रिलीज़ आईडी: 2207151)",
    "scraped_at": "2025-12-21T09:36:21.993978"
  },
  {
    "id": "2207157",
    "ministry": "Ministry of Environment, Forest and Climate Change",
    "title": "Union Environment Minister chairs NTCA and Project Elephant Meetings at Sundarbans; Reviews National Strategies for Tiger and Elephant Conservation",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207157",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Environment, Forest and Climate Change Union Environment Minister chairs NTCA and Project Elephant Meetings at Sundarbans; Reviews National Strategies for Tiger and Elephant Conservation Tiger Conservation Plans approved and Expansion of Project Cheetah appraised; Review of Human–Wildlife Conflict Mitigation and Sixth Cycle of All India Tiger Estimation Project Elephant Steering Committee Reviews Elephant Estimation, Conflict Management and Reaffirms Commitment to Science-based, Community-centric Conservation Approaches प्रविष्टि तिथि:\r\n                21 DEC 2025 1:50PM by PIB Delhi The 28th Meeting of the National Tiger Conservation Authority (NTCA) and the 22nd Steering Committee Meeting of Project Elephant were held on 21 December 2025 at the Sundarbans Tiger Reserve, West Bengal, under the chairmanship of the Union Minister for Environment, Forest and Climate Change, Shri Bhupender Yadav. The meetings brought together senior government officials, scientists, and field experts from tiger and elephant range states, along with representatives of key conservation institutions, to review the progress of Project Tiger and Project Elephant and to deliberate on future strategies for the conservation of tigers and elephants in India. Chairing the NTCA meeting , Shri Yadav emphasized India’s globally recognised tiger conservation model and underscored the importance of science-based management, landscape-level planning, community participation, inter-state coordination, and international collaboration. The minutes of the 27th Meeting held on 18 April 2025 were confirmed and the Action Taken Report on decisions taken therein was reviewed. The outcomes of four Regional Meetings were discussed, with a focus on key challenges faced by tiger reserves. Measures to address human–tiger conflict, including a three-pronged strategy and the launch of the project ‘Management of Tigers Outside Tiger Reserves’, were highlighted. Issues related to staff shortages, financial constraints, habitat degradation, and invasive species management were also reviewed, with directions issued for appropriate follow-up by States and concerned authorities. The meeting ratified the decisions of the Technical Committee Meetings of the NTCA, covering approval of Tiger Conservation Plans; extension and expansion of Project Cheetah; tiger translocation; prey augmentation; landscape management planning; carnivore health management training programmes; and inputs provided by the NTCA on project proposals to the Standing Committee of the National Board for Wildlife (NBWL). Updates were presented on compliance with the directions of the 7th National Board for Wildlife pertaining to the NTCA, including the expansion of Project Cheetah to Gandhisagar Wildlife Sanctuary and the Banni Grassland in Gujarat, as well as progress on initiatives supported under CAMPA. Preparatory activities for the proposed Global Big Cat Summit were also reviewed. The Minister reviewed major ongoing activities of the NTCA, including progress under the sixth cycle of the All India Tiger Estimation, landscape-level training programmes across different regions, commencement of ground surveys from November 2025, and international cooperation under Project Cheetah, including visits by delegations from South Africa, Namibia, and Botswana. The meeting also took note of the Order of the Hon’ble Supreme Court and deliberated on its implications for tiger conservation and management. The Steering Committee Meeting of Project Elephant commenced with the confirmation of the Action Taken Report of the 21st Steering Committee Meeting, followed by deliberations on issues raised by Steering Committee Members and Permanent Invitees. Presentations were made on the status of Regional Action Plans for elephant conservation in Southern India and North-Eastern India, highlighting progress achieved by elephant range states and identifying priority areas for coordinated inter-state action. The Steering Committee reviewed updates on the All-India Synchronized Elephant Estimation , a critical exercise for evidence-based planning and decision-making. Progress under the Model Elephant Conservation Plan for the Nilgiri Elephant Reserve and ongoing work on DNA profiling of captive elephants were also discussed, with emphasis on strengthening scientific management and welfare standards. A comprehensive review of the status of human–elephant conflict across the country was undertaken. The Committee discussed findings from ongoing studies on conflict drivers and mitigation measures, along with the status and adequacy of compensation mechanisms adopted by elephant range states. The meeting also deliberated on the evaluation of elephant population estimation methods, progress on integrated conservation and management strategies for the Ripu–Chirang Elephant Reserve, and future action plans. These include the conduct of Management Effectiveness Evaluation for all Elephant Reserves with CAMPA funding support and a proposed study on elephant corridors, habitat utilisation, and conflict hotspots in the Bandhavgarh region. The Steering Committee reaffirmed the Government of India’s commitment to science-based conservation, inter-state coordination, technological innovation, and community-centric approaches to ensure a sustainable future for elephants and the people living in elephant landscapes. On the occasion, Shri Yadav released six publications. These included Project Cheetah in India , highlighting the progress achieved under Project Cheetah through scientific management and international cooperation; the latest issue of STRIPES , NTCA’s outreach journal, focusing on modern technology, tiger dispersal, and the commencement of the sixth cycle of the All India Tiger Estimation (AITE); an NTCA booklet documenting India’s tiger conservation framework and institutional milestones; Tigerverse – Little-known facts from India’s Tiger Reserves, showcasing biodiversity, culture, and conservation stories from tiger reserves across the country; Best Practices in Captive Elephant Management for Elephant Handlers and the December 2025 issue of the TRUMPET Quarterly Journal. ***** VM (रिलीज़ आईडी: 2207157) आगंतुक पटल  : 134 Ministry of Environment, Forest and Climate Change Union Environment Minister chairs NTCA and Project Elephant Meetings at Sundarbans; Reviews National Strategies for Tiger and Elephant Conservation Tiger Conservation Plans approved and Expansion of Project Cheetah appraised; Review of Human–Wildlife Conflict Mitigation and Sixth Cycle of All India Tiger Estimation Project Elephant Steering Committee Reviews Elephant Estimation, Conflict Management and Reaffirms Commitment to Science-based, Community-centric Conservation Approaches प्रविष्टि तिथि:\r\n                        21 DEC 2025 1:50PM by PIB Delhi The 28th Meeting of the National Tiger Conservation Authority (NTCA) and the 22nd Steering Committee Meeting of Project Elephant were held on 21 December 2025 at the Sundarbans Tiger Reserve, West Bengal, under the chairmanship of the Union Minister for Environment, Forest and Climate Change, Shri Bhupender Yadav. The meetings brought together senior government officials, scientists, and field experts from tiger and elephant range states, along with representatives of key conservation institutions, to review the progress of Project Tiger and Project Elephant and to deliberate on future strategies for the conservation of tigers and elephants in India. Chairing the NTCA meeting , Shri Yadav emphasized India’s globally recognised tiger conservation model and underscored the importance of science-based management, landscape-level planning, community participation, inter-state coordination, and international collaboration. The minutes of the 27th Meeting held on 18 April 2025 were confirmed and the Action Taken Report on decisions taken therein was reviewed. The outcomes of four Regional Meetings were discussed, with a focus on key challenges faced by tiger reserves. Measures to address human–tiger conflict, including a three-pronged strategy and the launch of the project ‘Management of Tigers Outside Tiger Reserves’, were highlighted. Issues related to staff shortages, financial constraints, habitat degradation, and invasive species management were also reviewed, with directions issued for appropriate follow-up by States and concerned authorities. The meeting ratified the decisions of the Technical Committee Meetings of the NTCA, covering approval of Tiger Conservation Plans; extension and expansion of Project Cheetah; tiger translocation; prey augmentation; landscape management planning; carnivore health management training programmes; and inputs provided by the NTCA on project proposals to the Standing Committee of the National Board for Wildlife (NBWL). Updates were presented on compliance with the directions of the 7th National Board for Wildlife pertaining to the NTCA, including the expansion of Project Cheetah to Gandhisagar Wildlife Sanctuary and the Banni Grassland in Gujarat, as well as progress on initiatives supported under CAMPA. Preparatory activities for the proposed Global Big Cat Summit were also reviewed. The Minister reviewed major ongoing activities of the NTCA, including progress under the sixth cycle of the All India Tiger Estimation, landscape-level training programmes across different regions, commencement of ground surveys from November 2025, and international cooperation under Project Cheetah, including visits by delegations from South Africa, Namibia, and Botswana. The meeting also took note of the Order of the Hon’ble Supreme Court and deliberated on its implications for tiger conservation and management. The Steering Committee Meeting of Project Elephant commenced with the confirmation of the Action Taken Report of the 21st Steering Committee Meeting, followed by deliberations on issues raised by Steering Committee Members and Permanent Invitees. Presentations were made on the status of Regional Action Plans for elephant conservation in Southern India and North-Eastern India, highlighting progress achieved by elephant range states and identifying priority areas for coordinated inter-state action. The Steering Committee reviewed updates on the All-India Synchronized Elephant Estimation , a critical exercise for evidence-based planning and decision-making. Progress under the Model Elephant Conservation Plan for the Nilgiri Elephant Reserve and ongoing work on DNA profiling of captive elephants were also discussed, with emphasis on strengthening scientific management and welfare standards. A comprehensive review of the status of human–elephant conflict across the country was undertaken. The Committee discussed findings from ongoing studies on conflict drivers and mitigation measures, along with the status and adequacy of compensation mechanisms adopted by elephant range states. The meeting also deliberated on the evaluation of elephant population estimation methods, progress on integrated conservation and management strategies for the Ripu–Chirang Elephant Reserve, and future action plans. These include the conduct of Management Effectiveness Evaluation for all Elephant Reserves with CAMPA funding support and a proposed study on elephant corridors, habitat utilisation, and conflict hotspots in the Bandhavgarh region. The Steering Committee reaffirmed the Government of India’s commitment to science-based conservation, inter-state coordination, technological innovation, and community-centric approaches to ensure a sustainable future for elephants and the people living in elephant landscapes. On the occasion, Shri Yadav released six publications. These included Project Cheetah in India , highlighting the progress achieved under Project Cheetah through scientific management and international cooperation; the latest issue of STRIPES , NTCA’s outreach journal, focusing on modern technology, tiger dispersal, and the commencement of the sixth cycle of the All India Tiger Estimation (AITE); an NTCA booklet documenting India’s tiger conservation framework and institutional milestones; Tigerverse – Little-known facts from India’s Tiger Reserves, showcasing biodiversity, culture, and conservation stories from tiger reserves across the country; Best Practices in Captive Elephant Management for Elephant Handlers and the December 2025 issue of the TRUMPET Quarterly Journal. ***** VM (रिलीज़ आईडी: 2207157)",
    "scraped_at": "2025-12-21T09:36:23.730130"
  },
  {
    "id": "2207154",
    "ministry": "Ministry of Panchayati Raj",
    "title": "Visakhapatnam, Andhra Pradesh Gears Up for Grand PESA Mahotsav Celebrations on 23rd–24th December 2025",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207154",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Panchayati Raj Visakhapatnam, Andhra Pradesh Gears Up for Grand PESA Mahotsav Celebrations on 23rd–24th December 2025 PESA Portal, PESA Indicators to Be Launched ; Special Gram Sabhas to Be Organised Across All PESA States प्रविष्टि तिथि:\r\n                21 DEC 2025 1:24PM by PIB Delhi The Ministry of Panchayati Raj is celebrating a two-day PESA Mahotsav : Utsav Lok Sanskriti Ka on 23rd & 24th December 2025 in Visakhapatnam, Andhra Pradesh to mark the enactment of the Panchayats (Extension to Scheduled Areas) Act, 1996 (PESA). PESA Day is being  observed on 24th December as anniversary of the PESA Act. The mahotsav will be inaugurated by Shri Konidala Pawan Kalyan, Deputy Chief Minister and Minister for the Panchayati Raj & Rural Development, Government of Andhra Pradesh. Union Secretary, Ministry of Panchayati Raj, Shri Vivek Bharadwaj along with other senior officials of the centre and the state will also attend the event. The celebration is expected to witness the participation of nearly 2,000 representatives from all 10 PESA States, including Panchayat representatives, sportspersons, cultural artists etc. The PESA Mahotsav is envisaged as a national platform to celebrate the cultural and traditional heritage of tribal communities from PESA areas. Several important national initiatives on PESA will be launched on 24th December 2025. These include the PESA Portal for dissemination of information and monitoring of PESA implementation, PESA Indicators to assess the status of implementation across States, Training Modules on PESA in Tribal Languages to strengthen awareness and grassroots capacity-building and an E-book on Kinnaur district of Himachal Pradesh , documenting the region’s traditional knowledge, culture and heritage. As part of the celebrations special Gram Sabhas will be held in PESA Gram Panchayats of Andhra Pradesh with the participation of elected representatives from the participating States on ten identified PESA themes. In addition, special Gram Sabhas will also be organised across all ten PESA States on 24th December 2025,  focusing on strengthening community participation, protection of natural resources, preservation of customary practices, livelihoods and social justice. The mahotsav will witness a range of sports and cultural activities, showcasing the diversity and vibrancy of India’s tribal heritage. The primary venue for the Mahotsav will be Visakhapatnam Port Authority Campus with activities spread across Ramakrishna Beach, Indoor Stadium, Cricket Stadium and the Kalavani Auditorium all in the city of Visakhapatnam, Andhra Pradesh. About PESA Act 1996 In terms of article 243M(4)(b) of the Constitution of India, Parliament enacted “The Provisions of the Panchayats (Extension to the Scheduled Areas) Act, 1996” (called as PESA Act), for extending the provisions of Part-IX of the Constitution, with certain exceptions and modification, to the Scheduled Areas. Scheduled Areas are those areas which are declared by the President of India. Article 244(1) and the Fifth Schedule to the Constitution deals with provisions relating to the Scheduled Areas.  Since those Scheduled Areas are mentioned under Fifth Schedule of the Constitution, therefore, they are called as Fifth Schedule Areas. At present, Fifth Schedule Areas have been declared in 10 States viz. Andhra Pradesh, Chhattisgarh, Gujarat, Himachal Pradesh, Jharkhand, Madhya Pradesh, Maharashtra, Odisha, Rajasthan and Telangana. *** Aditi Agrawal (रिलीज़ आईडी: 2207154) आगंतुक पटल  : 127 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी , Gujarati Ministry of Panchayati Raj Visakhapatnam, Andhra Pradesh Gears Up for Grand PESA Mahotsav Celebrations on 23rd–24th December 2025 PESA Portal, PESA Indicators to Be Launched ; Special Gram Sabhas to Be Organised Across All PESA States प्रविष्टि तिथि:\r\n                        21 DEC 2025 1:24PM by PIB Delhi The Ministry of Panchayati Raj is celebrating a two-day PESA Mahotsav : Utsav Lok Sanskriti Ka on 23rd & 24th December 2025 in Visakhapatnam, Andhra Pradesh to mark the enactment of the Panchayats (Extension to Scheduled Areas) Act, 1996 (PESA). PESA Day is being  observed on 24th December as anniversary of the PESA Act. The mahotsav will be inaugurated by Shri Konidala Pawan Kalyan, Deputy Chief Minister and Minister for the Panchayati Raj & Rural Development, Government of Andhra Pradesh. Union Secretary, Ministry of Panchayati Raj, Shri Vivek Bharadwaj along with other senior officials of the centre and the state will also attend the event. The celebration is expected to witness the participation of nearly 2,000 representatives from all 10 PESA States, including Panchayat representatives, sportspersons, cultural artists etc. The PESA Mahotsav is envisaged as a national platform to celebrate the cultural and traditional heritage of tribal communities from PESA areas. Several important national initiatives on PESA will be launched on 24th December 2025. These include the PESA Portal for dissemination of information and monitoring of PESA implementation, PESA Indicators to assess the status of implementation across States, Training Modules on PESA in Tribal Languages to strengthen awareness and grassroots capacity-building and an E-book on Kinnaur district of Himachal Pradesh , documenting the region’s traditional knowledge, culture and heritage. As part of the celebrations special Gram Sabhas will be held in PESA Gram Panchayats of Andhra Pradesh with the participation of elected representatives from the participating States on ten identified PESA themes. In addition, special Gram Sabhas will also be organised across all ten PESA States on 24th December 2025,  focusing on strengthening community participation, protection of natural resources, preservation of customary practices, livelihoods and social justice. The mahotsav will witness a range of sports and cultural activities, showcasing the diversity and vibrancy of India’s tribal heritage. The primary venue for the Mahotsav will be Visakhapatnam Port Authority Campus with activities spread across Ramakrishna Beach, Indoor Stadium, Cricket Stadium and the Kalavani Auditorium all in the city of Visakhapatnam, Andhra Pradesh. About PESA Act 1996 In terms of article 243M(4)(b) of the Constitution of India, Parliament enacted “The Provisions of the Panchayats (Extension to the Scheduled Areas) Act, 1996” (called as PESA Act), for extending the provisions of Part-IX of the Constitution, with certain exceptions and modification, to the Scheduled Areas. Scheduled Areas are those areas which are declared by the President of India. Article 244(1) and the Fifth Schedule to the Constitution deals with provisions relating to the Scheduled Areas.  Since those Scheduled Areas are mentioned under Fifth Schedule of the Constitution, therefore, they are called as Fifth Schedule Areas. At present, Fifth Schedule Areas have been declared in 10 States viz. Andhra Pradesh, Chhattisgarh, Gujarat, Himachal Pradesh, Jharkhand, Madhya Pradesh, Maharashtra, Odisha, Rajasthan and Telangana. *** Aditi Agrawal (रिलीज़ आईडी: 2207154)",
    "scraped_at": "2025-12-21T09:36:25.459130"
  },
  {
    "id": "2207165",
    "ministry": "Ministry of Youth Affairs and Sports",
    "title": "Dr. Mansukh Mandaviya Leads First Anniversary Celebrations of Fit India Sundays on Cycle in Puducherry",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207165",
    "date": "21 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Youth Affairs and Sports Dr. Mansukh Mandaviya Leads First Anniversary Celebrations of Fit India Sundays on Cycle in Puducherry Over 1,500 Participants Cycle at Rock Beach Union Sports Minister Launches Fit India Mobile App Carbon Credit Incentivization, boosting Cycling enthusiasts Puducherry Lieutenant Governor K. Kailashnathan, Chief Minister N. Rangasamy grace milestone event alongside Khel Ratna awardees Sharath Kamal and PR Sreejesh प्रविष्टि तिथि:\r\n                21 DEC 2025 2:33PM by PIB Delhi Union Minister of Youth Affairs and Sports Dr. Mansukh Mandaviya summed the entire one-year experience in a brief update: “2 lakh+ locations, 20 lakh+ people. One Mission - Fit India. Celebrating 1 year of #SundaysOnCycle,” he wrote on X, this Sunday morning. 700+ districts ✨ 2 lakh+ locations 📍 20 lakh+ people 🚴 One Mission 💪 Fit India 🇮🇳 Celebrating 1 year of #SundaysOnCycle . 📍 Puducherry pic.twitter.com/U5a4rhcDzu — Dr Mansukh Mandaviya (@mansukhmandviya) December 21, 2025 Over 1500 cyclists, representing people from all walks of life, including school students, NaMo Cycling Clubs, students from Puducherry University, and more turned the scenic Rock Beach in Puducherry into a vibrant festival of fitness; reflecting the growing national importance of the movement and the rise of cycling in the nation. Padma Bhushan and Khel Ratna awardees P R Sreejesh and Sharath Kamal rode alongside the youth, further inspiring participants to embrace sports and fitness. In every single aspect, the landmark first anniversary edition of the Fit India Sundays on Cycle in Puducherry turned into a complete fitness carnival zone as multiple fun games and activities like Zumba, carrom, chess, mallakhamb, silambam, yoga, rope skipping, also took centre stage. Co-incidentally, also with December 21 being the World Meditation Day, the message was collectively sent out that Fitness is indeed, Meditation in Motion! The Sunday morning gathering in Puducherry today also consisted the Lieutenant Governor K. Kailashnathan, Chief Minister N. Rangasamy, Legislative Assembly Speaker R. Selvam, and Puducherry Home Minister A. Namassivayam, and other distinguished government officials, besides the presence of Hon’ble Union Sports Minister Dr. Mansukh Mandaviya – who flagged off the very first event in New Delhi a year back. Addressing the gathering, Dr. Mandaviya explained how Fit India Sundays on Cycle has evolved from a modest beginning into a nationwide people’s movement. “When we started this initiative a year ago, it was organised at just five locations with about 500 participants. Today, more than 10,000 locations across the country take part every Sunday, with over 10 lakh citizens joining regularly. It has become a passion, a culture and a powerful solution for pollution. Hon’ble Prime Minister Narendra Modi has also helped in turning this movement into a nationwide fight against obesity,” he said. Lieutenant Governor, Puducherry, K. Kailashnathan described the initiative as a timely message for society. “Dr. Mandaviya’s own village in Bhavnagar Gujarat, consists of 4000 people only. And everyone there commutes in a cycle, no other two-wheeler or four-wheelers. As citizens, we often don’t realise how small lifestyle changes can collectively make a big difference for the environment, especially in terms of reducing the carbon footprint,” he said. Puducherry Chief Minister N. Rangasamy praised the Fit India Movement for promoting accessible fitness. “Cycling is one of the easiest and most effective ways to stay healthy. Only when our body is fit can we achieve our goals in life. I truly appreciate the Prime Minister’s vision behind the entire Fit India movement,” he said. Simultaneously held in more than 10000 locations of the country today, Sports Authority of India and Khelo India centres across Hazaribagh, Kargil, Patiala, Lucknow, Golaghat, Rajnandgaon in Chattisgarh, Hisar, Tinsukia, Visakhapatnam, Kashipur in Uttarakhand, Cuttack, and more organised the events with various Banks across the country, being the special partners. The celebs gathering also included Arjuna Awardee archers Jyothi Surekha and Abhishek Verma from SAI Sonipat. A major impetus has been added to Sundays on Cycle by NaMo Fit India Cycling clubs and My Bharat volunteers who have been a key part of the campaign. The morning’s event in Puducherry also saw the launch of the much-awaited Fit India Mobile App Carbon Credit Incentivization, boosting Cycling enthusiasts. Three cyclists who earned the highest carbon credits were felicitated during the event - Bharatbhai Parmar, Shashikant Veerkar, and Govind Singh. Citizens can cycle and earn carbon credits, which can be redeemed later. “From now on, every month, cyclists from every State and Union Territory will be mapped through the Fit India mobile app and the top three performers will be incentivised. This is to encourage and reward citizens for adopting cycling as a daily habit,” Dr. Mandaviya added. The Fit India Ambassadors and Influencers who have remained key and have championed the cause of Sundays on Cycle were also felicitated. The names included Nidhi Nigam, Aishwarya Raj (Champion) and ambassadors Dr. Shikha Gupta, Yukti Arya, mountaineer Divya Arul, Tamil Nadu Cycling State champion Siva Senthil. The entire journey of the cycling movement was very well summed up by Indian hockey’s very own ‘wall’ PR Sreejesh. “Being fit is not about training for medals alone, it is about building discipline and balance in everyday life. Cycling is a simple habit, but when adopted collectively, it builds a healthier society and a stronger nation. I’m happy that Union Sports Minister's Fit India Sundays on Cycle initiative has transformed fitness into a people’s movement, where families, youngsters and professionals participate with equal enthusiasm,” the Padma Bhushan awardee, said. As the cyclists were flagged off along the scenic coastline in Puducherry, the anniversary edition sent out a clear message that the Sundays on Cycle has transitioned from being just an event to a nationwide culture driving fitness, sustainability and community participation across India. ***** Ayushman Kumar (रिलीज़ आईडी: 2207165) आगंतुक पटल  : 27 Ministry of Youth Affairs and Sports Dr. Mansukh Mandaviya Leads First Anniversary Celebrations of Fit India Sundays on Cycle in Puducherry Over 1,500 Participants Cycle at Rock Beach Union Sports Minister Launches Fit India Mobile App Carbon Credit Incentivization, boosting Cycling enthusiasts Puducherry Lieutenant Governor K. Kailashnathan, Chief Minister N. Rangasamy grace milestone event alongside Khel Ratna awardees Sharath Kamal and PR Sreejesh प्रविष्टि तिथि:\r\n                        21 DEC 2025 2:33PM by PIB Delhi Union Minister of Youth Affairs and Sports Dr. Mansukh Mandaviya summed the entire one-year experience in a brief update: “2 lakh+ locations, 20 lakh+ people. One Mission - Fit India. Celebrating 1 year of #SundaysOnCycle,” he wrote on X, this Sunday morning. 700+ districts ✨ 2 lakh+ locations 📍 20 lakh+ people 🚴 One Mission 💪 Fit India 🇮🇳 Celebrating 1 year of #SundaysOnCycle . 📍 Puducherry pic.twitter.com/U5a4rhcDzu — Dr Mansukh Mandaviya (@mansukhmandviya) December 21, 2025 Over 1500 cyclists, representing people from all walks of life, including school students, NaMo Cycling Clubs, students from Puducherry University, and more turned the scenic Rock Beach in Puducherry into a vibrant festival of fitness; reflecting the growing national importance of the movement and the rise of cycling in the nation. Padma Bhushan and Khel Ratna awardees P R Sreejesh and Sharath Kamal rode alongside the youth, further inspiring participants to embrace sports and fitness. In every single aspect, the landmark first anniversary edition of the Fit India Sundays on Cycle in Puducherry turned into a complete fitness carnival zone as multiple fun games and activities like Zumba, carrom, chess, mallakhamb, silambam, yoga, rope skipping, also took centre stage. Co-incidentally, also with December 21 being the World Meditation Day, the message was collectively sent out that Fitness is indeed, Meditation in Motion! The Sunday morning gathering in Puducherry today also consisted the Lieutenant Governor K. Kailashnathan, Chief Minister N. Rangasamy, Legislative Assembly Speaker R. Selvam, and Puducherry Home Minister A. Namassivayam, and other distinguished government officials, besides the presence of Hon’ble Union Sports Minister Dr. Mansukh Mandaviya – who flagged off the very first event in New Delhi a year back. Addressing the gathering, Dr. Mandaviya explained how Fit India Sundays on Cycle has evolved from a modest beginning into a nationwide people’s movement. “When we started this initiative a year ago, it was organised at just five locations with about 500 participants. Today, more than 10,000 locations across the country take part every Sunday, with over 10 lakh citizens joining regularly. It has become a passion, a culture and a powerful solution for pollution. Hon’ble Prime Minister Narendra Modi has also helped in turning this movement into a nationwide fight against obesity,” he said. Lieutenant Governor, Puducherry, K. Kailashnathan described the initiative as a timely message for society. “Dr. Mandaviya’s own village in Bhavnagar Gujarat, consists of 4000 people only. And everyone there commutes in a cycle, no other two-wheeler or four-wheelers. As citizens, we often don’t realise how small lifestyle changes can collectively make a big difference for the environment, especially in terms of reducing the carbon footprint,” he said. Puducherry Chief Minister N. Rangasamy praised the Fit India Movement for promoting accessible fitness. “Cycling is one of the easiest and most effective ways to stay healthy. Only when our body is fit can we achieve our goals in life. I truly appreciate the Prime Minister’s vision behind the entire Fit India movement,” he said. Simultaneously held in more than 10000 locations of the country today, Sports Authority of India and Khelo India centres across Hazaribagh, Kargil, Patiala, Lucknow, Golaghat, Rajnandgaon in Chattisgarh, Hisar, Tinsukia, Visakhapatnam, Kashipur in Uttarakhand, Cuttack, and more organised the events with various Banks across the country, being the special partners. The celebs gathering also included Arjuna Awardee archers Jyothi Surekha and Abhishek Verma from SAI Sonipat. A major impetus has been added to Sundays on Cycle by NaMo Fit India Cycling clubs and My Bharat volunteers who have been a key part of the campaign. The morning’s event in Puducherry also saw the launch of the much-awaited Fit India Mobile App Carbon Credit Incentivization, boosting Cycling enthusiasts. Three cyclists who earned the highest carbon credits were felicitated during the event - Bharatbhai Parmar, Shashikant Veerkar, and Govind Singh. Citizens can cycle and earn carbon credits, which can be redeemed later. “From now on, every month, cyclists from every State and Union Territory will be mapped through the Fit India mobile app and the top three performers will be incentivised. This is to encourage and reward citizens for adopting cycling as a daily habit,” Dr. Mandaviya added. The Fit India Ambassadors and Influencers who have remained key and have championed the cause of Sundays on Cycle were also felicitated. The names included Nidhi Nigam, Aishwarya Raj (Champion) and ambassadors Dr. Shikha Gupta, Yukti Arya, mountaineer Divya Arul, Tamil Nadu Cycling State champion Siva Senthil. The entire journey of the cycling movement was very well summed up by Indian hockey’s very own ‘wall’ PR Sreejesh. “Being fit is not about training for medals alone, it is about building discipline and balance in everyday life. Cycling is a simple habit, but when adopted collectively, it builds a healthier society and a stronger nation. I’m happy that Union Sports Minister's Fit India Sundays on Cycle initiative has transformed fitness into a people’s movement, where families, youngsters and professionals participate with equal enthusiasm,” the Padma Bhushan awardee, said. As the cyclists were flagged off along the scenic coastline in Puducherry, the anniversary edition sent out a clear message that the Sundays on Cycle has transitioned from being just an event to a nationwide culture driving fitness, sustainability and community participation across India. ***** Ayushman Kumar (रिलीज़ आईडी: 2207165)",
    "scraped_at": "2025-12-21T09:36:27.383934"
  }
]