[
  {
    "id": "2207008",
    "ministry": "President's Secretariat",
    "title": "PRESIDENT OF INDIA ADDRESSES CONFERENCE ON ‘TIMELESS WISDOM OF BHARAT: PATHWAYS OF PEACE AND PROGRESS’ AT HYDERABAD",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207008",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau President's Secretariat PRESIDENT OF INDIA ADDRESSES CONFERENCE ON ‘TIMELESS WISDOM OF BHARAT: PATHWAYS OF PEACE AND PROGRESS’ AT HYDERABAD THE CONFLUENCE OF MODERNITY AND SPIRITUALITY IS THE GREATEST STRENGTH OF OUR CIVILIZATION: PRESIDENT DROUPADI MURMU प्रविष्टि तिथि:\r\n                20 DEC 2025 5:57PM by PIB Delhi The President of India, Smt Droupadi Murmu, addressed the conference on ‘Timeless Wisdom of Bharat: Pathways of Peace and Progress’, being organised by Brahma Kumaris Shanti Sarovar to mark its 21st Anniversary at Hyderabad today (December 20, 2025). Speaking on the occasion, the President said that the global community is undergoing numerous transformations. Along with these changes, we face many serious challenges such as mental health issues, social conflicts, ecological imbalance, and the erosion of human values. In view of this, the theme of the conference is very relevant. She said that we must remember that material development alone does not bring happiness and peace. Inner stability, emotional intelligence, and a value-based approach are essential. The President said that India's ancient sage tradition has given us the message of truth, non-violence, and peaceful coexistence. Our spiritual heritage offers solutions to the world's mental, moral, and environmental problems. The confluence of modernity and spirituality is the greatest strength of our civilization. The concept of Vasudhaiva Kutumbakam —the idea of considering the whole world as one family—is the greatest need for global peace today. The President said that spirituality acts as a strong foundation for social unity and national progress. When an individual develops mental stability, moral values, and self-control, his/her behaviour promotes discipline, tolerance, and cooperation in society. People inspired by spiritual consciousness remain aware of their duties and strive to bring about positive change in society. Such individuals also make active contributions to nation-building. The President was happy to note that for decades, the Brahma Kumaris organization has been spreading universal Indian values to various countries. This organization is strengthening the moral and emotional fabric of society by fostering peace and positivity among people. In this way, it is making a significant contribution to nation-building. Please click here to see the President's Speech- *** MJPS/SR (रिलीज़ आईडी: 2207008) आगंतुक पटल  : 313 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Malayalam , Urdu , हिन्दी , Marathi , Tamil , Telugu President's Secretariat PRESIDENT OF INDIA ADDRESSES CONFERENCE ON ‘TIMELESS WISDOM OF BHARAT: PATHWAYS OF PEACE AND PROGRESS’ AT HYDERABAD THE CONFLUENCE OF MODERNITY AND SPIRITUALITY IS THE GREATEST STRENGTH OF OUR CIVILIZATION: PRESIDENT DROUPADI MURMU प्रविष्टि तिथि:\r\n                        20 DEC 2025 5:57PM by PIB Delhi The President of India, Smt Droupadi Murmu, addressed the conference on ‘Timeless Wisdom of Bharat: Pathways of Peace and Progress’, being organised by Brahma Kumaris Shanti Sarovar to mark its 21st Anniversary at Hyderabad today (December 20, 2025). Speaking on the occasion, the President said that the global community is undergoing numerous transformations. Along with these changes, we face many serious challenges such as mental health issues, social conflicts, ecological imbalance, and the erosion of human values. In view of this, the theme of the conference is very relevant. She said that we must remember that material development alone does not bring happiness and peace. Inner stability, emotional intelligence, and a value-based approach are essential. The President said that India's ancient sage tradition has given us the message of truth, non-violence, and peaceful coexistence. Our spiritual heritage offers solutions to the world's mental, moral, and environmental problems. The confluence of modernity and spirituality is the greatest strength of our civilization. The concept of Vasudhaiva Kutumbakam —the idea of considering the whole world as one family—is the greatest need for global peace today. The President said that spirituality acts as a strong foundation for social unity and national progress. When an individual develops mental stability, moral values, and self-control, his/her behaviour promotes discipline, tolerance, and cooperation in society. People inspired by spiritual consciousness remain aware of their duties and strive to bring about positive change in society. Such individuals also make active contributions to nation-building. The President was happy to note that for decades, the Brahma Kumaris organization has been spreading universal Indian values to various countries. This organization is strengthening the moral and emotional fabric of society by fostering peace and positivity among people. In this way, it is making a significant contribution to nation-building. Please click here to see the President's Speech- *** MJPS/SR (रिलीज़ आईडी: 2207008)",
    "scraped_at": "2025-12-20T17:33:53.052303"
  },
  {
    "id": "2207027",
    "ministry": "Vice President's Secretariat",
    "title": "Vice-President Shri C. P. Radhakrishnan addresses Valedictory Session of National Conference of Chairpersons of State Public Service Commissions in Hyderabad",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207027",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Vice President's Secretariat Vice-President Shri C. P. Radhakrishnan addresses Valedictory Session of National Conference of Chairpersons of State Public Service Commissions in Hyderabad Vice-President highlights role of PSCs in nation-building Quality of civil services decisive for Viksit Bharat: Vice-President Merit must not only be upheld, it must be seen to be upheld: Vice-President प्रविष्टि तिथि:\r\n                20 DEC 2025 7:01PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, today participated at the Valedictory Session of the Conference of Chairpersons of State Public Service Commissions in Hyderabad and underscored the pivotal role of Public Service Commissions in shaping the quality, integrity and effectiveness of India’s governance systems. Vice-President of India, Shri C. P. Radhakrishnan, today participated in the Valedictory Session of the National Conference of Chairpersons of State Public Service Commissions (PSCs) in Hyderabad. He highlighted the pivotal role of PSCs in nation-building and good governance,… pic.twitter.com/iqWk6eISiO — Vice-President of India (@VPIndia) December 20, 2025 Addressing the gathering, the Vice-President said that as India progresses towards the vision of Viksit Bharat@2047, the quality of governance, and more importantly the quality of people who run institutions, will be decisive. He described Public Service Commissions as constitutional institutions entrusted with the critical responsibility of selecting competent, impartial and ethical individuals to serve the nation The Vice-President noted that the independence of Public Service Commissions, as enshrined in the Constitution, has been central to safeguarding merit, fairness and transparency in public recruitment. Over the decades, he said, the Commissions at the Union and State levels have strengthened public confidence by ensuring administrative continuity, institutional stability and impartial selection of civil servants Emphasising the evolving demands on the civil services, he highlighted that the effective implementation of national priorities, such as digital governance, social inclusion, infrastructure development, climate action, and economic transformation, depends on the quality of administrators selected today. Highlighting the importance of ethical standards, Shri C. P. Radhakrishnan said that impartiality is the moral foundation of public recruitment and that transparency is essential to eliminate bias. He observed that even isolated irregularities can undermine institutional credibility, and called for zero tolerance towards malpractice in public examinations The Vice-President also emphasised that effective governance today requires civil servants with strong ethical judgment, emotional intelligence, leadership ability and teamwork, in addition to academic competence. He suggested that Public Service Commissions may explore fair and structured assessments of behavioural and ethical competencies alongside knowledge-based examinations Stressing that recruitment alone cannot ensure lifelong excellence, Shri C. P. Radhakrishnan said that performance appraisal, vigilance oversight and periodic review mechanisms must be applied objectively and transparently to safeguard institutional integrity. He added that character and ethical conduct are foundational to nation-building and public trust Referring to India’s demographic dividend, the Vice-President encouraged Public Service Commissions to explore innovative approaches to talent mapping and employability, including initiatives similar to Pratibha Setu, to match the right talent with the right roles. Concluding his address, Shri C. P. Radhakrishnan expressed confidence that Public Service Commissions would continue to strengthen the foundations of good governance and play a central role in India’s journey towards a Viksit and Aatma Nirbhar Bharat. *** PR/ASM (रिलीज़ आईडी: 2207027) आगंतुक पटल  : 134 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी , Tamil , Malayalam Vice President's Secretariat Vice-President Shri C. P. Radhakrishnan addresses Valedictory Session of National Conference of Chairpersons of State Public Service Commissions in Hyderabad Vice-President highlights role of PSCs in nation-building Quality of civil services decisive for Viksit Bharat: Vice-President Merit must not only be upheld, it must be seen to be upheld: Vice-President प्रविष्टि तिथि:\r\n                        20 DEC 2025 7:01PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, today participated at the Valedictory Session of the Conference of Chairpersons of State Public Service Commissions in Hyderabad and underscored the pivotal role of Public Service Commissions in shaping the quality, integrity and effectiveness of India’s governance systems. Vice-President of India, Shri C. P. Radhakrishnan, today participated in the Valedictory Session of the National Conference of Chairpersons of State Public Service Commissions (PSCs) in Hyderabad. He highlighted the pivotal role of PSCs in nation-building and good governance,… pic.twitter.com/iqWk6eISiO — Vice-President of India (@VPIndia) December 20, 2025 Addressing the gathering, the Vice-President said that as India progresses towards the vision of Viksit Bharat@2047, the quality of governance, and more importantly the quality of people who run institutions, will be decisive. He described Public Service Commissions as constitutional institutions entrusted with the critical responsibility of selecting competent, impartial and ethical individuals to serve the nation The Vice-President noted that the independence of Public Service Commissions, as enshrined in the Constitution, has been central to safeguarding merit, fairness and transparency in public recruitment. Over the decades, he said, the Commissions at the Union and State levels have strengthened public confidence by ensuring administrative continuity, institutional stability and impartial selection of civil servants Emphasising the evolving demands on the civil services, he highlighted that the effective implementation of national priorities, such as digital governance, social inclusion, infrastructure development, climate action, and economic transformation, depends on the quality of administrators selected today. Highlighting the importance of ethical standards, Shri C. P. Radhakrishnan said that impartiality is the moral foundation of public recruitment and that transparency is essential to eliminate bias. He observed that even isolated irregularities can undermine institutional credibility, and called for zero tolerance towards malpractice in public examinations The Vice-President also emphasised that effective governance today requires civil servants with strong ethical judgment, emotional intelligence, leadership ability and teamwork, in addition to academic competence. He suggested that Public Service Commissions may explore fair and structured assessments of behavioural and ethical competencies alongside knowledge-based examinations Stressing that recruitment alone cannot ensure lifelong excellence, Shri C. P. Radhakrishnan said that performance appraisal, vigilance oversight and periodic review mechanisms must be applied objectively and transparently to safeguard institutional integrity. He added that character and ethical conduct are foundational to nation-building and public trust Referring to India’s demographic dividend, the Vice-President encouraged Public Service Commissions to explore innovative approaches to talent mapping and employability, including initiatives similar to Pratibha Setu, to match the right talent with the right roles. Concluding his address, Shri C. P. Radhakrishnan expressed confidence that Public Service Commissions would continue to strengthen the foundations of good governance and play a central role in India’s journey towards a Viksit and Aatma Nirbhar Bharat. *** PR/ASM (रिलीज़ आईडी: 2207027)",
    "scraped_at": "2025-12-20T17:33:55.213497"
  },
  {
    "id": "2206976",
    "ministry": "Vice President's Secretariat",
    "title": "Vice-President Shri C. P. Radhakrishnan addresses AEPC Annual Awards Function",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206976",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Vice President's Secretariat Vice-President Shri C. P. Radhakrishnan addresses AEPC Annual Awards Function Apparel exports vital to India’s economic growth and key to achieving the vision of a Viksit and Aatma Nirbhar Bharat: Vice-President Vice-President lauds resilience of apparel exporters despite global challenges Vice-President calls for modernisation, value addition and market diversification in the sector प्रविष्टि तिथि:\r\n                20 DEC 2025 4:32PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, today participated in the Annual Awards Function of the Apparel Export Promotion Council (AEPC) in New Delhi and congratulated the awardees for their outstanding contributions to India’s apparel export sector. Vice-President of India, Shri C. P. Radhakrishnan, participated as the Chief Guest at the Apparel Export Promotion Council (AEPC) Awards Function in New Delhi. Congratulating the awardees, he highlighted the Government of India’s strong and multi-dimensional support to the… pic.twitter.com/uyoVxdP4pN — Vice-President of India (@VPIndia) December 20, 2025 Addressing the gathering, the Vice-President said that the apparel and textile sector remains a vital pillar of India’s economy, providing direct employment to over 45 million people and supporting more than 100 million livelihoods indirectly. He noted that the sector contributes about 2 per cent to the Gross Domestic Product (GDP) and accounts for nearly 11 per cent of manufacturing Gross Value Added (GVA). The Vice-President said that the Government of India, under the leadership of Prime Minister Shri Narendra Modi, has extended strong and multi-dimensional support to the textiles and apparel industry through progressive policies and schemes such as PM MITRA Parks and the SAMARTH Skill Development Programme. He added that the Prime Minister has laid out a comprehensive Vision 2030 aimed at transforming the sector into a global powerhouse. He emphasised that government initiatives achieve their true purpose only when industry partners respond with innovation and determination. Expressing happiness that, in an era defined by global challenges, India’s apparel exporters have demonstrated remarkable resilience and progress, the Vice-President said that the Government has been actively engaging in discussions and initiatives to resolve challenges faced by the sector, including through ongoing Free Trade Agreement (FTA) negotiations. The Vice-President urged the apparel industry to actively explore new markets such as Asia, Africa and Latin America. He also called upon the industry to focus on value addition, diversify the export basket, reduce import dependence, encourage innovation and research and development, and promote sustainable exports. The Vice-President observed that the textile sector is labour-intensive and the second-largest source of employment in the country after agriculture. He stressed the need to ensure labour welfare across the industry. He said that exports in the sector are expected to double in the coming years, creating significant additional employment opportunities. He expressed confidence that the apparel sector will play a leading role in achieving the vision of a Viksit and Aatma Nirbhar Bharat. Highlighting his close association with the textile industry, the Vice-President noted that he hails from Tiruppur, India’s hosiery and knitwear hub, and has closely witnessed the evolution of the sector. He recalled his experience as a Member of Parliament and Co-Chairman of the Sub-Committee on Textiles under the Parliamentary Standing Committee on Commerce, which enabled him to study the sector’s challenges and contribute to policy recommendations. He also appreciated AEPC’s role as a bridge between the government and the industry and released its coffee table book titled “Threads of Time: Story of India’s Textiles”. Shri Manjinder Singh Sirsa, Minister of Industries, Government of NCT of Delhi; Shri Sudhir Sekhri, Chairman, AEPC; Dr. A. Sakthivel, Vice Chairman, AEPC; and other distinguished guests from the textile and apparel industry were present on the occasion. *** PR/ASM (रिलीज़ आईडी: 2206976) आगंतुक पटल  : 271 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati , Tamil , Malayalam Vice President's Secretariat Vice-President Shri C. P. Radhakrishnan addresses AEPC Annual Awards Function Apparel exports vital to India’s economic growth and key to achieving the vision of a Viksit and Aatma Nirbhar Bharat: Vice-President Vice-President lauds resilience of apparel exporters despite global challenges Vice-President calls for modernisation, value addition and market diversification in the sector प्रविष्टि तिथि:\r\n                        20 DEC 2025 4:32PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, today participated in the Annual Awards Function of the Apparel Export Promotion Council (AEPC) in New Delhi and congratulated the awardees for their outstanding contributions to India’s apparel export sector. Vice-President of India, Shri C. P. Radhakrishnan, participated as the Chief Guest at the Apparel Export Promotion Council (AEPC) Awards Function in New Delhi. Congratulating the awardees, he highlighted the Government of India’s strong and multi-dimensional support to the… pic.twitter.com/uyoVxdP4pN — Vice-President of India (@VPIndia) December 20, 2025 Addressing the gathering, the Vice-President said that the apparel and textile sector remains a vital pillar of India’s economy, providing direct employment to over 45 million people and supporting more than 100 million livelihoods indirectly. He noted that the sector contributes about 2 per cent to the Gross Domestic Product (GDP) and accounts for nearly 11 per cent of manufacturing Gross Value Added (GVA). The Vice-President said that the Government of India, under the leadership of Prime Minister Shri Narendra Modi, has extended strong and multi-dimensional support to the textiles and apparel industry through progressive policies and schemes such as PM MITRA Parks and the SAMARTH Skill Development Programme. He added that the Prime Minister has laid out a comprehensive Vision 2030 aimed at transforming the sector into a global powerhouse. He emphasised that government initiatives achieve their true purpose only when industry partners respond with innovation and determination. Expressing happiness that, in an era defined by global challenges, India’s apparel exporters have demonstrated remarkable resilience and progress, the Vice-President said that the Government has been actively engaging in discussions and initiatives to resolve challenges faced by the sector, including through ongoing Free Trade Agreement (FTA) negotiations. The Vice-President urged the apparel industry to actively explore new markets such as Asia, Africa and Latin America. He also called upon the industry to focus on value addition, diversify the export basket, reduce import dependence, encourage innovation and research and development, and promote sustainable exports. The Vice-President observed that the textile sector is labour-intensive and the second-largest source of employment in the country after agriculture. He stressed the need to ensure labour welfare across the industry. He said that exports in the sector are expected to double in the coming years, creating significant additional employment opportunities. He expressed confidence that the apparel sector will play a leading role in achieving the vision of a Viksit and Aatma Nirbhar Bharat. Highlighting his close association with the textile industry, the Vice-President noted that he hails from Tiruppur, India’s hosiery and knitwear hub, and has closely witnessed the evolution of the sector. He recalled his experience as a Member of Parliament and Co-Chairman of the Sub-Committee on Textiles under the Parliamentary Standing Committee on Commerce, which enabled him to study the sector’s challenges and contribute to policy recommendations. He also appreciated AEPC’s role as a bridge between the government and the industry and released its coffee table book titled “Threads of Time: Story of India’s Textiles”. Shri Manjinder Singh Sirsa, Minister of Industries, Government of NCT of Delhi; Shri Sudhir Sekhri, Chairman, AEPC; Dr. A. Sakthivel, Vice Chairman, AEPC; and other distinguished guests from the textile and apparel industry were present on the occasion. *** PR/ASM (रिलीज़ आईडी: 2206976)",
    "scraped_at": "2025-12-20T17:33:57.223109"
  },
  {
    "id": "2207075",
    "ministry": "Prime Minister's Office",
    "title": "Text of PM’s address during inauguration of Lokapriya Gopinath Bardoloi International Airport in Guwahati, Assam",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207075",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Text of PM’s address during inauguration of   Lokapriya Gopinath Bardoloi International Airport in Guwahati, Assam प्रविष्टि तिथि:\r\n                20 DEC 2025 8:26PM by PIB Delhi नोमोस्कार। लुइटपोरिया राइजोलोई मुर श्रोद्धा अरु मरोम ज़ासिसु! असम के गर्वनर लक्ष्मण प्रसाद आचार्य जी, मुख्यमंत्री हिमंत बिस्वा सरमा जी, केंद्र में मेरे सहयोगी, हमारे पूर्व मुख्यमंत्री सर्बानंद सोनोवाल जी, राम मोहन नायडू जी, मुरलीधर मोहोल जी, पबित्रा मार्गेरिटा जी, असम सरकार के मंत्रिगण, अन्य महानुभाव, भाईयों और बहनों। मैं अपना भाषण शुरू करूं उससे पहले, मैं आप सबसे एक प्रार्थना करता हूं, कि आज विजय का आज का जो दिवस है, एक प्रकार से विकास के उत्सव का दिवस है और ये सिर्फ असम नहीं, पूरे नॉर्थ ईस्ट के विकास का उत्सव है, और इसलिए मेरी आपसे प्रार्थना है कि अपना मोबाइल फोन निकालिए, उसपर फ्लैश लाईट चालू कीजिए और सब के सब इस विकास उत्सव में भागीदार बनिए। हर एक के मोबाईल फोन का लाईट जलना चाहिए, देखिए तालियों के गूंज से पूरा देश देखेगा, कि असम विकास का उत्सव मना रहा है। जब विकास का प्रकाश पहुंचता है, तो जिंदगी की हर राह नई ऊंचाईयों को छूने लग जाती है। बहुत-बहुत धन्यवाद सबका। साथियों, असम की धरती से मेरा लगाव, यहां के लोगों का प्यार और स्नेह, और खासकर असम और पूर्वोत्तर की मेरी माताओं-बहनों का अपनापन, ये मुझे निरंतर प्रेरित करते हैं, पूर्वोत्तर के विकास के हमारे संकल्प को ताकत देते हैं। मैं देख रहा हूं, आज एक बार फिर असम के विकास में नया अध्याय जुड़ रहा है, और ऐसे में भारत रत्न भूपेन दा की पंक्तियां बहुत सटीक हो जाती हैं। लुइदोर पार जिलिकाई टुलिबोलोई, आमी प्रोतिज्ञाबोद्ध! आमी हॉन्कल्पबोद्ध! यानी लुइत नदी का तट उज्जवल होगा, अंधकार की हर दीवार टूटेगी और ये होकर रहेगा, यही हमारा संकल्प है, यही हमारी प्रतिज्ञा है। साथियों, भूपेन दा की ये पंक्तियां केवल एक गीत नहीं थी, ये असम को प्यार करने वाली हर महान आत्मा का संकल्प था और आज ये संकल्प हमारे सामने सिद्ध हो रहा है। जैसे असम में विशाल ब्रह्मपुत्र की धाराएं कभी नहीं रूकती, वैसे ही बीजेपी की डबल इंजन सरकार में यहां विकास की धारा भी अनवरत बह रही है। आज लोकप्रिय गोपीनाथ बोरदोलोई एयरपोर्ट के नए टर्मिनल का उद्धघाटन हमारे इस संकल्प का प्रमाण है। मैं सभी असमवासियों को, देश के लोगों को, इस नई टर्मिनल बिल्डिंग के लिए बहुत-बहुत बधाई देता हूं। बहनों और भाईयों, अब से कुछ देर पहले मुझे गोपीनाथ बोरदोलोई जी की प्रतिमा का अनावरण करने का सौभाग्य मिला है। बोरदोलोई जी असम के पहले मुख्यमंत्री थे, असम का गौरव थे, असम की पहचान, असम का भविष्य और असम के हित उन्होंने कभी भी इससे समझौता नहीं किया। उनकी ये प्रतिमा आने वाली पीढ़ियों को प्रेरित करती रहेगी, उनमें असम को लेकर गौरव की भावना जगाएगी। साथियों, आधुनिक एयरपोर्ट जैसी सुविधाएं कनेक्टिविटी का आधुनिक इनफ्रास्ट्रक्चऱ ये किसी भी राज्य के लिए नई संभावनाओं और नए अवसरों के गेटवे होते हैं। ये राज्य के बढ़ते आत्मविश्वास और लोगों के भरोसे के स्तम्भ होते हैं। आप भी जब देखते हैं कि असम में इतने शानदार हाईवे बन रहे हैं एय़रपोर्ट बन रहे हैं तो आप भी कहते हैं- अब जाकर असम के साथ न्याय होना शुरू हुआ है। वरना साथियों, काँग्रेस की सरकारों के लिए असम और पूर्वोत्तर का विकास उनके एजेंडे में ही नहीं था। काँग्रेस की सरकारें, और उनमें बैठे लोग कहते थे, असम और पूर्वोत्तर में जाता ही कौन है? काँग्रेस कहती थी, असम को, पूर्वोत्तर को, आधुनिक एयरपोर्ट की, हाइवेज और बेहतर रेलवेज की जरूरत ही क्या है? इसी सोच की वजह से कांग्रेस ने दशकों तक इस पूरे क्षेत्र की उपेक्षा की। साथियों, कांग्रेस 6-7 दशक तक जो गलतियां करती रही, और मोदी एक एक करके उसको सुधार रहा है। मोदी कहता है, काँग्रेस वाले नॉर्थईस्ट जाएँ या न जाएँ, मुझे तो नॉर्थईस्ट और असम आते ही अपने लोगों के बीच होने का एहसास होता है। मोदी के लिए असम का विकास, ये जरूरत भी है, ज़िम्मेदारी भी है, और इसकी जवाबदेही भी है। और इसीलिए साथियों, बीते 11 वर्षों में असम और नॉर्थईस्ट के लिए लाखों करोड़ रुपए की विकास परियोजनाएं शुरू हुईं हैं। आज असम आगे भी बढ़ रहा है, और नए कीर्तिमान भी गढ़ रहा है। मुझे ये जानकर अच्छा लगा कि असम भारतीय न्याय संहिता लागू करने में देश में नंबर-1 राज्य बना है। असम ने 50 लाख से ज्यादा स्मार्ट प्री-पेड मीटरलगाकर भी एक नया रिकॉर्ड बनाया है। कांग्रेस के समय में असम में बिना पर्ची, बिना खर्ची के सरकारी नौकरी मिलना असंभव था। लेकिन आज यहां हजारों युवाओं को बिना पर्ची-बिना खर्ची नौकरी मिल रही है। भाजपा की सरकार में असम की संस्कृति को हर मंच पर बढ़ावा दिया जा रहा है। मैं भूल नहीं सकता, जब पिछले साल 13 अप्रैल को गुवाहाटी स्टेडियम में 11 हजार से ज्यादा कलाकारों ने एक साथ बिहू नृत्य किया था। इस घटना को गिनीज वर्ल्ड रिकॉर्ड में दर्ज किया गया है। ऐसे ही नए रिकॉर्ड बनाते हुए असम तेजी से आगे बढ़ रहा है। साथियों, अब इस नई टर्मिनल बिल्डिंग से गुवाहाटी और असम की क्षमता और ज्यादा बढ़ जाएगी। इस टर्मिनल पर हर साल करीब सवा करोड़ से ज्यादा यात्री सफर कर सकेंगे! यानी, बड़ी संख्या में पर्यटक भी असम आ सकेंगे। श्रद्धालुओं के लिए माँ कामाख्या के दर्शन की सुविधा भी आसान हो जाएगी। इस नए एयरपोर्ट टर्मिनल में कदम रखते ही ये साफ दिखता है विकास भी औऱ विरासत भी, ये मंत्र के मायने क्या हैं? इस एयरपोर्ट को असम की प्रकृति और संस्कृति को ध्यान में रखकर गढ़ा गया है। टर्मिनल के अंदर हरियाली है। Indoor forest जैसी व्यवस्था है। चारों तरफ प्रकृति से जुड़ा डिजाइन है, यहां आने वाला हर यात्री सुकून महसूस करे। इसकी बनावट में बांस का खास इस्तेमाल किया गया है। बांस असम के जीवन का अभिन्न हिस्सा है, वो यहां मजबूती भी दिखाता है और खूबसूरती भी। और दिल्ली में बैठे हुए भूतकाल की सरकारों को ये बंबू क्या है, इसकी पहचान भी नहीं थी। आप हैरान होंगे, 2014 में आपने मुझे काम दिया उसके पहले हमारे देश में एक कानून था, ये कानून ऐसा था कि आप बंबू को काट नहीं सकते, अब कोई मुझे समझाए भई क्यों? क्योंकि उन्होंने कह दिया बंबू एक ट्री है, वृक्ष है, और जब एक बार वृक्ष कह दिया, तो फिर सारे दरवाजे बंद हो गए। जबकि बंबू दुनिया मानती है, कि ये एक पौधा है और हमने कानून हटाया और ग्रास की कैटेगरी में, जो सचमुच में बंबू की पहचान है उसमें लाया और तब जाकर के आज ये बंबू से इतनी बड़ी भव्य इमारत निर्माण हुई है और आज अगर आप सोशल मीडिया देखोगे, तो दुनिया भर में भारत के एयरपोर्ट की रचनाओं की चर्चा हो रही है। साथियों, इनफ्रास्ट्रक्चर के इस विकास का बहुत बड़ा संदेश, भारत की विकास यात्रा की पहचान बन रहा है। इससे उद्योगों को बढ़ावा मिलता है। निवेशकों को कनेक्टिविटी का भरोसा मिलता है। लोकल प्रोडक्ट्स को दुनिया भर में पहुंचाने का रास्ता खुलता है। और, सबसे बड़ा भरोसा उस युवा को मिलता है, जिसके लिए नए अवसर पैदा होते हैं। और इसलिए आज हम असम को, असीम संभावनाओं की इसी उड़ान पर आगे बढ़ते देख रहे हैं। साथियों, आज भारत को देखने का दुनिया का नज़रिया बदला है, और भारत की भूमिका भी बदली है। भारत अब दुनिया की तीसरी सबसे बड़ी अर्थव्यवस्था बनने जा रहा है। 11 साल के भीतर-भीतर ये कैसे हुआ? साथियों, इसमें बहुत बड़ी भूमिका आधुनिक इनफ्रास्ट्रक्चर के विकास की है। भारत 2047 की तैयारी कर रहा है, विकसित भारत के संकल्प को सिद्ध करने के लिए हम इंफ्रास्ट्रक्चर पर फोकस कर रहे हैं। और सबसे अहम बात ये है कि, विकास के इस महान अभियान में देश के हर राज्य की, हर क्षेत्र की भागीदारी है। हम पिछड़ों को प्राथमिकता दे रहे हैं। देश का हर राज्य एक साथ प्रगति करे, और विकसित भारत के मिशन में अपना योगदान दे, हमारी सरकार इस दिशा में काम कर रही है। और मुझे खुशी है कि आज असम और पूर्वोत्तर हमारे इस मिशन का नेतृत्व कर रहे हैं। हमने Act East पॉलिसी के जरिए पूर्वोत्तर को प्राथमिकता दी, और आज, हम असम को भारत के ईस्टर्न गेटवे के रूप में उभरता देख रहे हैं। असम भारत को ASEAN देशों से जोड़ने के लिए ब्रिज की भूमिका निभा रहा है। ये शुरुआत अभी बहुत आगे तक जाएगी। और, असम कई क्षेत्रों में विकसित भारत का इंजन बनेगा। साथियों, आज असम और पूरा नॉर्थ ईस्ट भारत के विकास का नया प्रवेशद्वार बन रहा है। मल्टी-मोडल कनेक्टिविटी के संकल्प ने इस क्षेत्र की दिशा और इसकी दशा, दोनों बदली हैं। असम में नए पुल बनाने की रफ्तार, नए मोबाइल टावर लगाने की स्पीड, विकास के हर काम की गति, सपनों को हकीकत में बदल रही है। ब्रह्मपुत्र पर बने पुलों ने असम की कनेक्टिविटी को नई मजबूती और नया आत्मविश्वास दिया है। आजादी के बाद के 6-7 दशक में यहाँ केवल तीन बड़े पुल बन पाए थे। लेकिन पिछले एक दशक में चार नए मेगा ब्रिज पूरे किए गए हैं, इनके अलावा कई ऐतिहासिक परियोजनाएँ आकार ले रही हैं। बोगीबील और ढोला-सादिया जैसे सबसे लंबे पुलों ने असम को रणनीतिक रूप से और अधिक सशक्त बना दिया है। रेलवे कनेक्टिविटी में भी एक क्रांतिकारी बदलाव आया है। बोगीबील ब्रिज के शुरू होने से अपर असम और देश के बाकी हिस्सों के बीच की दूरी सिमट गई है। गुवाहाटी से न्यू जलपाईगुड़ी तक चलने वाली वंदे भारत एक्सप्रेस ने यात्रा के समय को कम कर दिया है। देश में वाटरवेज के विकास का फायदा भी असम को मिल रहा है। कार्गो ट्रैफिक में 140 प्रतिशत की बढ़ोतरी हुई है, ये इस बात का प्रमाण है कि ब्रह्मपुत्र केवल नदी नहीं, बल्कि आर्थिक शक्ति का प्रवाह है। पांडु में पहली शिप रिपेयर सुविधा विकसित हो रही है, वाराणसी से डिब्रूगढ़ तक चलने वाली गंगा विकास क्रूज़ को लेकर उत्साह है, इससे नॉर्थ ईस्ट, ग्लोबल क्रूज़ टूरिज्म के मानचित्र पर स्थापित हो गया है। साथियों, काँग्रेस की सरकारों ने असम और पूर्वोत्तर को विकास से दूर रखने का जो पाप किया था, उसका बहुत बड़ा खामियाजा देश की सुरक्षा, एकता और अखंडता को उठाना पड़ा। काँग्रेस की सरकारों में हिंसा का दौर दशकों तक फलता फूलता रहा, हम केवल 10-11 साल के भीतर उसे खत्म करने की तरफ बढ़ रहे हैं। पूर्वोत्तर में पहले जहां हिंसा और खून-खराबा होता था, आज वहाँ 4G और 5G टेक्नालजी से डिजिटल कनेक्टिविटी पहुँच रही है। जो जिले, कभी हिंसा ग्रस्त माने जाते थे, आजवो आकांक्षी जिलों के रूप में विकसित हो रहे हैं। आने वाले समय में यही इलाके इंडस्ट्रियल कॉरिडॉर भी बनेंगे। इसीलिए, आज नॉर्थईस्ट को लेकर एक नया भरोसा जगा है। हमें इसे और मजबूती देनी है। साथियों, हमें असम और पूर्वोत्तर के विकास में कामयाबी इसलिए भी मिल रही है, क्योंकि हम इस क्षेत्र की पहचान और संस्कृति की सुरक्षा कर रहे हैं। काँग्रेस ने एक और पाप किया था, उसने यहाँ की पहचान को मिटाने की साजिश की थी। और ये षड्यंत्र केवल कुछ वर्षों का नहीं है! काँग्रेस के इस पाप की जड़ें आज़ादी के पहले से जुड़ी हैं। वो समय, जब मुस्लिम लीग और अँग्रेजी हुकूमत मिलकर भारत के विभाजन की जमीन तैयार कर रहे थे, उस समय असम को भी अविभाजित बंगाल का, यानी ईस्ट पाकिस्तान का हिस्सा बनाने की योजना बनाई गई थी। काँग्रेस उस साजिश का हिस्सा बनने जा रही थी। तब बोरदोलोई जी अपनी ही पार्टी के खिलाफ खड़े हो गए थे। उन्होंने असम की पहचान को खत्म करने के इस षड्यंत्र का विरोध किया। और, असम को देश से अलग होने से बचा लिया। भाजपा पार्टी, हमेशा पार्टी लाइन से ऊपर उठकर हर देशभक्त का सम्मान करती है। अटल जी के नेतृत्व में जब भारतीय जनता पार्टी की सरकार आई, तब उन्हें भारत रत्न दिया गया। भाइयों बहनों, बोरदोलोई जी ने आज़ादी के पहले तो असम को बचा लिया था, लेकिन, उनके बाद काँग्रेस ने फिर से असम विरोधी और देश विरोधी काम शुरू कर दिये। काँग्रेस ने अपना वोटबैंक बढ़ाने के लिए मजहबी तुष्टीकरण के षड्यंत्र रचे हैं। बंगाल और असम में अपने वोटबैंक वाले घुसपैठियों को खुली छूट दी गई है। यहाँ की डेमोग्राफी को बदला गया है। इन घुसपैठियों ने हमारे जंगलों पर कब्जा किया, हमारी ज़मीनों पर कब्जा किया। इसका नतीजा ये हुआ कि पूरे असम की सुरक्षा और पहचान दांव पर लग गई है। साथियों, आज हिमंत जी की सरकार और उनकी टीम के सभी साथी बहुत मेहनत से, असम के संसाधनों को इस गैर-कानूनी और देशविरोधी अतिक्रमण से मुक्त करा रही है। असम के संसाधन असम के लोगों के काम आयें, इसके लिए हर स्तर पर काम हो रहा है। केंद्र सरकार ने भी घुसपैठ रोकने के लिए सख्ती की है। अवैध घुसपैठियों को बाहर निकालने के लिए उनकी पहचान भी कराई जा रही है। लेकिन भाइयों बहनों, काँग्रेस पार्टी और इंडी गठबंधन के लोग खुलकर देशविरोधी एजेंडों पर उतर आए हैं। देश का सुप्रीम कोर्ट तक घुसपैठियों को बाहर करने की बात कर चुका है। लेकिन, ये लोग घुसपैठियों के बचाव में बयानबाजी कर रहे हैं। इनके वकील कोर्ट में घुसपैठियों को बसाने की पैरवी कर रहे हैं। चुनाव आयोग निष्पक्ष चुनाव के लिए SIR की प्रक्रिया करवा रहा है, तो, इन लोगों को  देश के हर कोने में तकलीफ हो रही है। ऐसे लोग, असमिया भाई-बहनों के हितों को नहीं बचाएंगे। ये लोग आपकी जमीन और जंगलों पर किसी और का कब्जा होने देंगे, इनकी देशविरोधी मानसिकता पुराने दौर की हिंसा और अशांति वाले हालात पैदा कर सकती है। और इसलिए मेरे असम के भाई-बहन, हमें बहुत सावधान रहना है। जिस असम की अस्मिता के लिए बोरदोलोई जी जैसे लोगों ने जीवन भर अपना सब कुछ नौछावर किया, हमें उसकी रक्षा करनी है। असम के लोगों को एकजुट रहना है। हमें असम के विकास को डिरेल होने से बचाना है, काँग्रेस के षडयंत्रों को पल-पल, कदम-कदम पर विफल करते रहना है। साथियों, आज दुनिया भारत की ओर उम्मीद से देख रही है। भारत के भविष्य का नया सूर्योदय पूर्वोत्तर से ही होना है। इसके लिए, हमें साथ मिलकर अपने सपनों के लिए काम करना होगा। हमें असम के विकास को सबसे आगे रखकर चलना होगा। मुझे विश्वास है, हमारे ये सामूहिक प्रयास असम को नई ऊंचाई पर लेकर जाएंगे। हम विकसित भारत के सपने पूरा करेंगे। और विकसित असम से विकसित भारत का रास्ता बनने वाला है। इसी कामना के साथ मैं एक बार फिर नए टर्मिनल की बधाई देता हूं। आप सबका बहुत-बहुत धन्यवाद। मेरे साथ बोलिए- वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। ***** MJPS/ST/SS/AK/DK (रिलीज़ आईडी: 2207075) आगंतुक पटल  : 145 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी , Assamese , Gujarati Prime Minister's Office Text of PM’s address during inauguration of   Lokapriya Gopinath Bardoloi International Airport in Guwahati, Assam प्रविष्टि तिथि:\r\n                        20 DEC 2025 8:26PM by PIB Delhi नोमोस्कार। लुइटपोरिया राइजोलोई मुर श्रोद्धा अरु मरोम ज़ासिसु! असम के गर्वनर लक्ष्मण प्रसाद आचार्य जी, मुख्यमंत्री हिमंत बिस्वा सरमा जी, केंद्र में मेरे सहयोगी, हमारे पूर्व मुख्यमंत्री सर्बानंद सोनोवाल जी, राम मोहन नायडू जी, मुरलीधर मोहोल जी, पबित्रा मार्गेरिटा जी, असम सरकार के मंत्रिगण, अन्य महानुभाव, भाईयों और बहनों। मैं अपना भाषण शुरू करूं उससे पहले, मैं आप सबसे एक प्रार्थना करता हूं, कि आज विजय का आज का जो दिवस है, एक प्रकार से विकास के उत्सव का दिवस है और ये सिर्फ असम नहीं, पूरे नॉर्थ ईस्ट के विकास का उत्सव है, और इसलिए मेरी आपसे प्रार्थना है कि अपना मोबाइल फोन निकालिए, उसपर फ्लैश लाईट चालू कीजिए और सब के सब इस विकास उत्सव में भागीदार बनिए। हर एक के मोबाईल फोन का लाईट जलना चाहिए, देखिए तालियों के गूंज से पूरा देश देखेगा, कि असम विकास का उत्सव मना रहा है। जब विकास का प्रकाश पहुंचता है, तो जिंदगी की हर राह नई ऊंचाईयों को छूने लग जाती है। बहुत-बहुत धन्यवाद सबका। साथियों, असम की धरती से मेरा लगाव, यहां के लोगों का प्यार और स्नेह, और खासकर असम और पूर्वोत्तर की मेरी माताओं-बहनों का अपनापन, ये मुझे निरंतर प्रेरित करते हैं, पूर्वोत्तर के विकास के हमारे संकल्प को ताकत देते हैं। मैं देख रहा हूं, आज एक बार फिर असम के विकास में नया अध्याय जुड़ रहा है, और ऐसे में भारत रत्न भूपेन दा की पंक्तियां बहुत सटीक हो जाती हैं। लुइदोर पार जिलिकाई टुलिबोलोई, आमी प्रोतिज्ञाबोद्ध! आमी हॉन्कल्पबोद्ध! यानी लुइत नदी का तट उज्जवल होगा, अंधकार की हर दीवार टूटेगी और ये होकर रहेगा, यही हमारा संकल्प है, यही हमारी प्रतिज्ञा है। साथियों, भूपेन दा की ये पंक्तियां केवल एक गीत नहीं थी, ये असम को प्यार करने वाली हर महान आत्मा का संकल्प था और आज ये संकल्प हमारे सामने सिद्ध हो रहा है। जैसे असम में विशाल ब्रह्मपुत्र की धाराएं कभी नहीं रूकती, वैसे ही बीजेपी की डबल इंजन सरकार में यहां विकास की धारा भी अनवरत बह रही है। आज लोकप्रिय गोपीनाथ बोरदोलोई एयरपोर्ट के नए टर्मिनल का उद्धघाटन हमारे इस संकल्प का प्रमाण है। मैं सभी असमवासियों को, देश के लोगों को, इस नई टर्मिनल बिल्डिंग के लिए बहुत-बहुत बधाई देता हूं। बहनों और भाईयों, अब से कुछ देर पहले मुझे गोपीनाथ बोरदोलोई जी की प्रतिमा का अनावरण करने का सौभाग्य मिला है। बोरदोलोई जी असम के पहले मुख्यमंत्री थे, असम का गौरव थे, असम की पहचान, असम का भविष्य और असम के हित उन्होंने कभी भी इससे समझौता नहीं किया। उनकी ये प्रतिमा आने वाली पीढ़ियों को प्रेरित करती रहेगी, उनमें असम को लेकर गौरव की भावना जगाएगी। साथियों, आधुनिक एयरपोर्ट जैसी सुविधाएं कनेक्टिविटी का आधुनिक इनफ्रास्ट्रक्चऱ ये किसी भी राज्य के लिए नई संभावनाओं और नए अवसरों के गेटवे होते हैं। ये राज्य के बढ़ते आत्मविश्वास और लोगों के भरोसे के स्तम्भ होते हैं। आप भी जब देखते हैं कि असम में इतने शानदार हाईवे बन रहे हैं एय़रपोर्ट बन रहे हैं तो आप भी कहते हैं- अब जाकर असम के साथ न्याय होना शुरू हुआ है। वरना साथियों, काँग्रेस की सरकारों के लिए असम और पूर्वोत्तर का विकास उनके एजेंडे में ही नहीं था। काँग्रेस की सरकारें, और उनमें बैठे लोग कहते थे, असम और पूर्वोत्तर में जाता ही कौन है? काँग्रेस कहती थी, असम को, पूर्वोत्तर को, आधुनिक एयरपोर्ट की, हाइवेज और बेहतर रेलवेज की जरूरत ही क्या है? इसी सोच की वजह से कांग्रेस ने दशकों तक इस पूरे क्षेत्र की उपेक्षा की। साथियों, कांग्रेस 6-7 दशक तक जो गलतियां करती रही, और मोदी एक एक करके उसको सुधार रहा है। मोदी कहता है, काँग्रेस वाले नॉर्थईस्ट जाएँ या न जाएँ, मुझे तो नॉर्थईस्ट और असम आते ही अपने लोगों के बीच होने का एहसास होता है। मोदी के लिए असम का विकास, ये जरूरत भी है, ज़िम्मेदारी भी है, और इसकी जवाबदेही भी है। और इसीलिए साथियों, बीते 11 वर्षों में असम और नॉर्थईस्ट के लिए लाखों करोड़ रुपए की विकास परियोजनाएं शुरू हुईं हैं। आज असम आगे भी बढ़ रहा है, और नए कीर्तिमान भी गढ़ रहा है। मुझे ये जानकर अच्छा लगा कि असम भारतीय न्याय संहिता लागू करने में देश में नंबर-1 राज्य बना है। असम ने 50 लाख से ज्यादा स्मार्ट प्री-पेड मीटरलगाकर भी एक नया रिकॉर्ड बनाया है। कांग्रेस के समय में असम में बिना पर्ची, बिना खर्ची के सरकारी नौकरी मिलना असंभव था। लेकिन आज यहां हजारों युवाओं को बिना पर्ची-बिना खर्ची नौकरी मिल रही है। भाजपा की सरकार में असम की संस्कृति को हर मंच पर बढ़ावा दिया जा रहा है। मैं भूल नहीं सकता, जब पिछले साल 13 अप्रैल को गुवाहाटी स्टेडियम में 11 हजार से ज्यादा कलाकारों ने एक साथ बिहू नृत्य किया था। इस घटना को गिनीज वर्ल्ड रिकॉर्ड में दर्ज किया गया है। ऐसे ही नए रिकॉर्ड बनाते हुए असम तेजी से आगे बढ़ रहा है। साथियों, अब इस नई टर्मिनल बिल्डिंग से गुवाहाटी और असम की क्षमता और ज्यादा बढ़ जाएगी। इस टर्मिनल पर हर साल करीब सवा करोड़ से ज्यादा यात्री सफर कर सकेंगे! यानी, बड़ी संख्या में पर्यटक भी असम आ सकेंगे। श्रद्धालुओं के लिए माँ कामाख्या के दर्शन की सुविधा भी आसान हो जाएगी। इस नए एयरपोर्ट टर्मिनल में कदम रखते ही ये साफ दिखता है विकास भी औऱ विरासत भी, ये मंत्र के मायने क्या हैं? इस एयरपोर्ट को असम की प्रकृति और संस्कृति को ध्यान में रखकर गढ़ा गया है। टर्मिनल के अंदर हरियाली है। Indoor forest जैसी व्यवस्था है। चारों तरफ प्रकृति से जुड़ा डिजाइन है, यहां आने वाला हर यात्री सुकून महसूस करे। इसकी बनावट में बांस का खास इस्तेमाल किया गया है। बांस असम के जीवन का अभिन्न हिस्सा है, वो यहां मजबूती भी दिखाता है और खूबसूरती भी। और दिल्ली में बैठे हुए भूतकाल की सरकारों को ये बंबू क्या है, इसकी पहचान भी नहीं थी। आप हैरान होंगे, 2014 में आपने मुझे काम दिया उसके पहले हमारे देश में एक कानून था, ये कानून ऐसा था कि आप बंबू को काट नहीं सकते, अब कोई मुझे समझाए भई क्यों? क्योंकि उन्होंने कह दिया बंबू एक ट्री है, वृक्ष है, और जब एक बार वृक्ष कह दिया, तो फिर सारे दरवाजे बंद हो गए। जबकि बंबू दुनिया मानती है, कि ये एक पौधा है और हमने कानून हटाया और ग्रास की कैटेगरी में, जो सचमुच में बंबू की पहचान है उसमें लाया और तब जाकर के आज ये बंबू से इतनी बड़ी भव्य इमारत निर्माण हुई है और आज अगर आप सोशल मीडिया देखोगे, तो दुनिया भर में भारत के एयरपोर्ट की रचनाओं की चर्चा हो रही है। साथियों, इनफ्रास्ट्रक्चर के इस विकास का बहुत बड़ा संदेश, भारत की विकास यात्रा की पहचान बन रहा है। इससे उद्योगों को बढ़ावा मिलता है। निवेशकों को कनेक्टिविटी का भरोसा मिलता है। लोकल प्रोडक्ट्स को दुनिया भर में पहुंचाने का रास्ता खुलता है। और, सबसे बड़ा भरोसा उस युवा को मिलता है, जिसके लिए नए अवसर पैदा होते हैं। और इसलिए आज हम असम को, असीम संभावनाओं की इसी उड़ान पर आगे बढ़ते देख रहे हैं। साथियों, आज भारत को देखने का दुनिया का नज़रिया बदला है, और भारत की भूमिका भी बदली है। भारत अब दुनिया की तीसरी सबसे बड़ी अर्थव्यवस्था बनने जा रहा है। 11 साल के भीतर-भीतर ये कैसे हुआ? साथियों, इसमें बहुत बड़ी भूमिका आधुनिक इनफ्रास्ट्रक्चर के विकास की है। भारत 2047 की तैयारी कर रहा है, विकसित भारत के संकल्प को सिद्ध करने के लिए हम इंफ्रास्ट्रक्चर पर फोकस कर रहे हैं। और सबसे अहम बात ये है कि, विकास के इस महान अभियान में देश के हर राज्य की, हर क्षेत्र की भागीदारी है। हम पिछड़ों को प्राथमिकता दे रहे हैं। देश का हर राज्य एक साथ प्रगति करे, और विकसित भारत के मिशन में अपना योगदान दे, हमारी सरकार इस दिशा में काम कर रही है। और मुझे खुशी है कि आज असम और पूर्वोत्तर हमारे इस मिशन का नेतृत्व कर रहे हैं। हमने Act East पॉलिसी के जरिए पूर्वोत्तर को प्राथमिकता दी, और आज, हम असम को भारत के ईस्टर्न गेटवे के रूप में उभरता देख रहे हैं। असम भारत को ASEAN देशों से जोड़ने के लिए ब्रिज की भूमिका निभा रहा है। ये शुरुआत अभी बहुत आगे तक जाएगी। और, असम कई क्षेत्रों में विकसित भारत का इंजन बनेगा। साथियों, आज असम और पूरा नॉर्थ ईस्ट भारत के विकास का नया प्रवेशद्वार बन रहा है। मल्टी-मोडल कनेक्टिविटी के संकल्प ने इस क्षेत्र की दिशा और इसकी दशा, दोनों बदली हैं। असम में नए पुल बनाने की रफ्तार, नए मोबाइल टावर लगाने की स्पीड, विकास के हर काम की गति, सपनों को हकीकत में बदल रही है। ब्रह्मपुत्र पर बने पुलों ने असम की कनेक्टिविटी को नई मजबूती और नया आत्मविश्वास दिया है। आजादी के बाद के 6-7 दशक में यहाँ केवल तीन बड़े पुल बन पाए थे। लेकिन पिछले एक दशक में चार नए मेगा ब्रिज पूरे किए गए हैं, इनके अलावा कई ऐतिहासिक परियोजनाएँ आकार ले रही हैं। बोगीबील और ढोला-सादिया जैसे सबसे लंबे पुलों ने असम को रणनीतिक रूप से और अधिक सशक्त बना दिया है। रेलवे कनेक्टिविटी में भी एक क्रांतिकारी बदलाव आया है। बोगीबील ब्रिज के शुरू होने से अपर असम और देश के बाकी हिस्सों के बीच की दूरी सिमट गई है। गुवाहाटी से न्यू जलपाईगुड़ी तक चलने वाली वंदे भारत एक्सप्रेस ने यात्रा के समय को कम कर दिया है। देश में वाटरवेज के विकास का फायदा भी असम को मिल रहा है। कार्गो ट्रैफिक में 140 प्रतिशत की बढ़ोतरी हुई है, ये इस बात का प्रमाण है कि ब्रह्मपुत्र केवल नदी नहीं, बल्कि आर्थिक शक्ति का प्रवाह है। पांडु में पहली शिप रिपेयर सुविधा विकसित हो रही है, वाराणसी से डिब्रूगढ़ तक चलने वाली गंगा विकास क्रूज़ को लेकर उत्साह है, इससे नॉर्थ ईस्ट, ग्लोबल क्रूज़ टूरिज्म के मानचित्र पर स्थापित हो गया है। साथियों, काँग्रेस की सरकारों ने असम और पूर्वोत्तर को विकास से दूर रखने का जो पाप किया था, उसका बहुत बड़ा खामियाजा देश की सुरक्षा, एकता और अखंडता को उठाना पड़ा। काँग्रेस की सरकारों में हिंसा का दौर दशकों तक फलता फूलता रहा, हम केवल 10-11 साल के भीतर उसे खत्म करने की तरफ बढ़ रहे हैं। पूर्वोत्तर में पहले जहां हिंसा और खून-खराबा होता था, आज वहाँ 4G और 5G टेक्नालजी से डिजिटल कनेक्टिविटी पहुँच रही है। जो जिले, कभी हिंसा ग्रस्त माने जाते थे, आजवो आकांक्षी जिलों के रूप में विकसित हो रहे हैं। आने वाले समय में यही इलाके इंडस्ट्रियल कॉरिडॉर भी बनेंगे। इसीलिए, आज नॉर्थईस्ट को लेकर एक नया भरोसा जगा है। हमें इसे और मजबूती देनी है। साथियों, हमें असम और पूर्वोत्तर के विकास में कामयाबी इसलिए भी मिल रही है, क्योंकि हम इस क्षेत्र की पहचान और संस्कृति की सुरक्षा कर रहे हैं। काँग्रेस ने एक और पाप किया था, उसने यहाँ की पहचान को मिटाने की साजिश की थी। और ये षड्यंत्र केवल कुछ वर्षों का नहीं है! काँग्रेस के इस पाप की जड़ें आज़ादी के पहले से जुड़ी हैं। वो समय, जब मुस्लिम लीग और अँग्रेजी हुकूमत मिलकर भारत के विभाजन की जमीन तैयार कर रहे थे, उस समय असम को भी अविभाजित बंगाल का, यानी ईस्ट पाकिस्तान का हिस्सा बनाने की योजना बनाई गई थी। काँग्रेस उस साजिश का हिस्सा बनने जा रही थी। तब बोरदोलोई जी अपनी ही पार्टी के खिलाफ खड़े हो गए थे। उन्होंने असम की पहचान को खत्म करने के इस षड्यंत्र का विरोध किया। और, असम को देश से अलग होने से बचा लिया। भाजपा पार्टी, हमेशा पार्टी लाइन से ऊपर उठकर हर देशभक्त का सम्मान करती है। अटल जी के नेतृत्व में जब भारतीय जनता पार्टी की सरकार आई, तब उन्हें भारत रत्न दिया गया। भाइयों बहनों, बोरदोलोई जी ने आज़ादी के पहले तो असम को बचा लिया था, लेकिन, उनके बाद काँग्रेस ने फिर से असम विरोधी और देश विरोधी काम शुरू कर दिये। काँग्रेस ने अपना वोटबैंक बढ़ाने के लिए मजहबी तुष्टीकरण के षड्यंत्र रचे हैं। बंगाल और असम में अपने वोटबैंक वाले घुसपैठियों को खुली छूट दी गई है। यहाँ की डेमोग्राफी को बदला गया है। इन घुसपैठियों ने हमारे जंगलों पर कब्जा किया, हमारी ज़मीनों पर कब्जा किया। इसका नतीजा ये हुआ कि पूरे असम की सुरक्षा और पहचान दांव पर लग गई है। साथियों, आज हिमंत जी की सरकार और उनकी टीम के सभी साथी बहुत मेहनत से, असम के संसाधनों को इस गैर-कानूनी और देशविरोधी अतिक्रमण से मुक्त करा रही है। असम के संसाधन असम के लोगों के काम आयें, इसके लिए हर स्तर पर काम हो रहा है। केंद्र सरकार ने भी घुसपैठ रोकने के लिए सख्ती की है। अवैध घुसपैठियों को बाहर निकालने के लिए उनकी पहचान भी कराई जा रही है। लेकिन भाइयों बहनों, काँग्रेस पार्टी और इंडी गठबंधन के लोग खुलकर देशविरोधी एजेंडों पर उतर आए हैं। देश का सुप्रीम कोर्ट तक घुसपैठियों को बाहर करने की बात कर चुका है। लेकिन, ये लोग घुसपैठियों के बचाव में बयानबाजी कर रहे हैं। इनके वकील कोर्ट में घुसपैठियों को बसाने की पैरवी कर रहे हैं। चुनाव आयोग निष्पक्ष चुनाव के लिए SIR की प्रक्रिया करवा रहा है, तो, इन लोगों को  देश के हर कोने में तकलीफ हो रही है। ऐसे लोग, असमिया भाई-बहनों के हितों को नहीं बचाएंगे। ये लोग आपकी जमीन और जंगलों पर किसी और का कब्जा होने देंगे, इनकी देशविरोधी मानसिकता पुराने दौर की हिंसा और अशांति वाले हालात पैदा कर सकती है। और इसलिए मेरे असम के भाई-बहन, हमें बहुत सावधान रहना है। जिस असम की अस्मिता के लिए बोरदोलोई जी जैसे लोगों ने जीवन भर अपना सब कुछ नौछावर किया, हमें उसकी रक्षा करनी है। असम के लोगों को एकजुट रहना है। हमें असम के विकास को डिरेल होने से बचाना है, काँग्रेस के षडयंत्रों को पल-पल, कदम-कदम पर विफल करते रहना है। साथियों, आज दुनिया भारत की ओर उम्मीद से देख रही है। भारत के भविष्य का नया सूर्योदय पूर्वोत्तर से ही होना है। इसके लिए, हमें साथ मिलकर अपने सपनों के लिए काम करना होगा। हमें असम के विकास को सबसे आगे रखकर चलना होगा। मुझे विश्वास है, हमारे ये सामूहिक प्रयास असम को नई ऊंचाई पर लेकर जाएंगे। हम विकसित भारत के सपने पूरा करेंगे। और विकसित असम से विकसित भारत का रास्ता बनने वाला है। इसी कामना के साथ मैं एक बार फिर नए टर्मिनल की बधाई देता हूं। आप सबका बहुत-बहुत धन्यवाद। मेरे साथ बोलिए- वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। वंदे मातरम्। ***** MJPS/ST/SS/AK/DK (रिलीज़ आईडी: 2207075)",
    "scraped_at": "2025-12-20T17:33:59.105870"
  },
  {
    "id": "2207003",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister Shri Narendra Modi inaugurates New Terminal Building of Lokapriya Gopinath Bardoloi International Airport in Guwahati, Assam",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207003",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister Shri Narendra Modi inaugurates New Terminal Building of Lokapriya Gopinath Bardoloi International Airport in Guwahati, Assam Modern airports and advanced connectivity infrastructure serve as gateways to new possibilities and new opportunities for any state: PM Today, Assam and the entire North East are emerging as the new gateway to India's development: PM The North East will lead India's future growth: PM प्रविष्टि तिथि:\r\n                20 DEC 2025 5:50PM by PIB Delhi Marking a transformative milestone in Assam’s connectivity, economic expansion and global engagement, Prime Minister Shri Narendra Modi inaugurated the New Terminal Building of Lokapriya Gopinath Bardoloi International Airport in Guwahati today. Addressing the gathering on the occasion, Shri Modi said that today marks the festival of development and progress of Assam and the North East. He highlighted that when the light of progress reaches people, every path in life begins to touch new heights. The Prime Minister further remarked that his deep attachment to the land of Assam, the love and affection of its people, and especially the warmth and belongingness of the mothers and sisters of Assam and the Northeast continuously inspire him and strengthen the collective resolve for the development of the region. He highlighted that today once again a new chapter is being added in Assam’s development. Referring to Bharat Ratna Bhupen Hazarika’s lines, Shri Modi emphasized that this means the banks of the mighty Brahmaputra river will shine, every wall of darkness will be broken, and this will certainly happen as it is the nation’s resolve and solemn pledge. Highlighting that Bhupen Hazarika’s lines were not merely a song but a solemn resolve of every great soul who loved Assam, and today this resolve is being fulfilled, Shri Modi remarked that just as the mighty currents of the Brahmaputra never stop, similarly under their governments at the Union and State, the stream of development in Assam continues uninterrupted. He stated that the inauguration of the new terminal at the Lokapriya Gopinath Bardoloi Airport stands as proof of this commitment, and extended congratulations to the people of Assam and the nation for this new terminal building. The Prime Minister further remarked that a short while ago he had the privilege of unveiling the statue of Gopinath Bardoloi, Assam’s first Chief Minister and a source of pride for the state. He emphasized that Shri Bardoloi never compromised on Assam’s identity, future, and interests, and his statue will continue to inspire future generations, instilling in them a deep sense of pride for Assam. “Modern airport facilities and advanced connectivity infrastructure serve as gateways to new possibilities and opportunities for any state, and stand as pillars of growing confidence and trust among the people”, exclaimed the Prime Minister. He remarked that when people witness the construction of magnificent highways and airports in Assam, they themselves acknowledge that true justice for Assam has finally begun. He contrasted this with the past, stating that for the previous governments, the development of Assam and the Northeast was never on their agenda. He noted that leaders in those governments used to say, “Who even goes to Assam and the Northeast?” and questioned the need for modern airports, highways, and better railways in the region. The Prime Minister emphasized that this mindset led the opposition to neglect the entire region for decades. Pointing out that the mistakes committed by the opposition over six to seven decades are being corrected one by one under his leadership, Shri Modi stated that whether opposition leaders visit the Northeast or not, he himself feels a sense of belonging among his own people whenever he comes to Assam and the region. He emphasized that for him, the development of Assam is not only a necessity but also a responsibility and an accountability. The Prime Minister highlighted that in the past eleven years, development projects worth lakhs of crores of rupees have been initiated for Assam and the Northeast. He noted that Assam is progressing further and creating new milestones, mentioning with satisfaction that Assam has become the number one state in the country to implement the Bharatiya Nyaya Sanhita. He added that Assam has also set a record by installing more than 50 lakh smart prepaid meters. He contrasted this with the previous dispensation era, when obtaining a government job without bribes or recommendations was impossible, and underlined that today thousands of youth are getting jobs without such practices. Shri Modi further highlighted that under their government, Assam’s culture is being promoted on every platform. He recalled the historic event of 13 April 2023, when more than 11,000 artists performed the Bihu dance together at the Guwahati stadium, an achievement that was recorded in the Guinness World Records. He remarked that by creating such new records, Assam is moving forward rapidly. Underlining that with this new terminal building, the capacity of Guwahati and Assam will increase significantly, enabling more than 1.25 crore passengers to travel annually, Shri Modi highlighted that this will also allow a large number of tourists to visit Assam and make it easier for devotees to have darshan of Maa Kamakhya. He stated that stepping into this new airport terminal clearly reflects the true meaning of the mantra of development along with heritage. The Prime Minister emphasized that the airport has been designed keeping in mind Assam’s nature and culture, with greenery inside and arrangements resembling an indoor forest. He noted that the design is connected to nature all around so that every passenger feels peace and comfort. He further highlighted the special use of bamboo in the construction, underscoring that bamboo is an integral part of life in Assam, symbolizing both strength and beauty. Shri Modi also recalled that their government in a landmark move in 2017, amended the Indian Forest Act, 1927, to legally reclassify bamboo grown in non-forest areas as a \"grass\" instead of a \"tree\". This move, he said, has led to the creation of a wonderful structure in the form of a new Terminal today. Underscoring the development of infrastructure carries a very significant message, the Prime Minister highlighted that it boosts industries, gives investors confidence in connectivity, and opens pathways for local products to reach global markets. He emphasized that the greatest assurance is given to the youth, for whom new opportunities are created. “Today, Assam is seen advancing on this very flight of limitless possibilities”, stated the Prime Minister. Shri Modi remarked that today the world’s perspective towards India has changed, and India’s role has also transformed. He highlighted that India is now on the path to becoming the world’s third-largest economy. He questioned how this was achieved within just 11 years and emphasized that the development of modern infrastructure has played a major role. The Prime Minister stated that India is preparing for 2047, focusing on infrastructure to fulfill the resolve of a developed nation. He underlined that the most important aspect of this grand development campaign is the participation of every state and every region. He noted that the government is prioritizing the underprivileged, ensuring that every state progresses together and contributes to the mission of a developed India. He expressed happiness that Assam and the Northeast are leading this mission. Shri Modi highlighted that through the Act East Policy, the Northeast has been given priority, and today Assam is emerging as India’s Eastern Gateway. He remarked that Assam is playing the role of a bridge connecting India with ASEAN countries. He affirmed that this beginning will go much further, and Assam will become an engine of developed India in many sectors. “Assam and the entire Northeast are becoming the new gateway of India’s development,” emphasised Shri Modi, highlighting that the vision of multi-modal connectivity has transformed both the condition and direction of this region. He stated that the pace of building new bridges in Assam, the speed of installing new mobile towers, and the momentum of every development project are turning dreams into reality. He emphasized that the bridges built over the Brahmaputra have given Assam new strength and confidence in connectivity. The Prime Minister pointed out that in the six to seven decades after independence, only three major bridges were built here, but in the last decade four new mega bridges have been completed, along with several historic projects taking shape. He noted that the longest bridges such as Bogibeel and Dhola-Sadiya have made Assam strategically stronger. He underlined that railway connectivity has also undergone a revolutionary change, with the Bogibeel Bridge reducing the distance between Upper Assam and the rest of the country. He remarked that the Vande Bharat Express running from Guwahati to New Jalpaiguri has reduced travel time. Shri Modi further highlighted that Assam is also benefiting from the development of waterways, with cargo traffic increasing by 140 percent, proving that the Brahmaputra is not just a river but a flow of economic power. He stated that the first ship repair facility is being developed at Pandu, and the enthusiasm around the Ganga Vilas Cruise from Varanasi to Dibrugarh has placed the Northeast firmly on the global cruise tourism map. Criticizing the previous governments for keeping Assam and the Northeast away from development, Shri Modi said the nation had to pay a heavy price in terms of security, unity, and integrity. He highlighted that under opposition rule, violence thrived for decades, whereas in the last 10–11 years efforts are being made to end it. He stated that where once violence and bloodshed prevailed in the Northeast, today digital connectivity through 4G and 5G technology is reaching these areas. The Prime Minister emphasized that districts once considered violence-affected are now developing as aspirational districts, and in the coming times these very regions will become industrial corridors. He underlined that a new confidence has arisen regarding the Northeast, and stressed the need to strengthen it further. The Prime Minister remarked that success in the development of Assam and the Northeast is also being achieved because the government is safeguarding the identity and culture of the region. He highlighted that the opposition  by conspiring to erase this identity, and this conspiracy was not limited to just a few years. He stated that the roots of this wrongdoing go back to the pre-independence era, when the Muslim League and the British government were preparing the ground for India’s partition, and at that time there was also a plan to make Assam a part of undivided Bengal, that is, East Pakistan. Shri Modi noted that Congress was going to be part of this conspiracy, but Shri Bardoloi ji stood against his own party, opposed this plot to destroy Assam’s identity, and saved Assam from being separated from the country. He emphasized that their party rises above party lines to honor every patriot, and under the leadership of Shri Atal Bihari Vajpayee ji, when their government came to power, Bardoloi ji was conferred the Bharat Ratna. The Prime Minister remarked that while Shri Bardoloi ji had saved Assam before independence, the first ruling dispensation in the post- independence era once again began anti-Assam and anti-national activities thereafter. He highlighted that they conspired to expand their vote bank through religious appeasement, giving free rein to infiltrators in Bengal and Assam. He stated that the region’s demography was altered, and these infiltrators encroached upon forests and lands. The Prime Minister emphasized that as a result, the security and identity of the entire state of Assam were put at risk. Shri Modi remarked that the government under Shri Himanta Biswa Sarma is working diligently to free Assam’s resources from illegal and anti-national encroachments. He highlighted that efforts are being made at every level to ensure Assam’s resources benefit the people of Assam. He stated that the Union government has also taken strict measures to stop infiltration, with identification processes underway to remove illegal infiltrators. The Prime Minister emphasized that the Opposition and their alliance have openly adopted anti-national agendas, even as the Supreme Court has spoken about removing infiltrators. He noted that these parties are issuing statements in defense of infiltrators, and their lawyers are pleading in court to settle them. He remarked that when the Election Commission is conducting the SIR process to ensure fair elections, these groups are opposing it. The Prime Minister underlined that such people will not protect the interests of Assamese brothers and sisters, and will allow others to occupy their land and forests. He warned that their anti-national mindset could recreate the violence and unrest of earlier times. He stressed that it is therefore essential to remain vigilant, for the people of Assam to stay united, and to continue defeating the Opposition's conspiracies to prevent Assam’s development from being derailed. “Today the world is looking towards India with hope, and the new sunrise of India’s future is to begin from the Northeast’, affirmed Shri Modi. He highlighted that for this, collective efforts are required to work towards shared dreams, with Assam’s development kept at the forefront. He expressed confidence that these joint endeavors will take Assam to new heights and fulfill the vision of a developed India. Concluding his remarks, the Prime Minister once again extended congratulations on the inauguration of the new terminal. Governor of Assam, Shri Lakshman Prasad Acharya, Chief Minister of Assam, Shri Himanta Biswa Sarma, Union Ministers, Shri Sarbananda Sonowal, Shri K Rammohan Naidu, Shri Murlidhar Mohol, Shri Pabitra Margherita were present among other dignitaries at the event. Background The newly completed Integrated New Terminal Building Of Lokapriya Gopinath Bardoloi International Airport in Guwahati, spread over nearly 1.4 lakh square metres, is designed to handle up to 1.3 crore passengers annually, supported by major upgrades to the runway, airfield systems, aprons and taxiways. India’s first nature-themed airport terminal, the airport’s design draws inspiration from Assam’s biodiversity and cultural heritage under the theme “Bamboo Orchids”. The terminal makes pioneering use of about 140 metric tonnes of locally sourced Northeast bamboo, complemented by Kaziranga-inspired green landscapes, japi motifs, the iconic rhino symbol and 57 orchid-inspired columns reflecting the Kopou flower. A unique “Sky Forest”, featuring nearly one lakh plants of indigenous species, offers arriving passengers an immersive, forest-like experience. The terminal sets new benchmarks in passenger convenience and digital innovation. Features such as full-body scanners for fast, non-intrusive security screening, DigiYatra-enabled contactless travel, automated baggage handling, fast-track immigration and AI-driven airport operations ensure seamless, secure and efficient journeys. The new terminal building of Lokapriya Gopinath Bardoloi International Airport will boost connectivity, commerce and tourism across Assam and entire Northeast. https://t.co/jRJdcJIOSB — Narendra Modi (@narendramodi) December 20, 2025 Modern airports and advanced connectivity infrastructure serve as gateways to new possibilities and new opportunities for any state. pic.twitter.com/E7fs1kgCQK — PMO India (@PMOIndia) December 20, 2025 Today, Assam and the entire North East are emerging as the new gateway to India's development. pic.twitter.com/6IR2FaTi5x — PMO India (@PMOIndia) December 20, 2025 The North East will lead India's future growth. pic.twitter.com/1uURYScmQc — PMO India (@PMOIndia) December 20, 2025 *** MJPS/SR (रिलीज़ आईडी: 2207003) आगंतुक पटल  : 477 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Assamese , Urdu , Marathi , हिन्दी , Gujarati , Odia , Tamil , Malayalam Prime Minister's Office Prime Minister Shri Narendra Modi inaugurates New Terminal Building of Lokapriya Gopinath Bardoloi International Airport in Guwahati, Assam Modern airports and advanced connectivity infrastructure serve as gateways to new possibilities and new opportunities for any state: PM Today, Assam and the entire North East are emerging as the new gateway to India's development: PM The North East will lead India's future growth: PM प्रविष्टि तिथि:\r\n                        20 DEC 2025 5:50PM by PIB Delhi Marking a transformative milestone in Assam’s connectivity, economic expansion and global engagement, Prime Minister Shri Narendra Modi inaugurated the New Terminal Building of Lokapriya Gopinath Bardoloi International Airport in Guwahati today. Addressing the gathering on the occasion, Shri Modi said that today marks the festival of development and progress of Assam and the North East. He highlighted that when the light of progress reaches people, every path in life begins to touch new heights. The Prime Minister further remarked that his deep attachment to the land of Assam, the love and affection of its people, and especially the warmth and belongingness of the mothers and sisters of Assam and the Northeast continuously inspire him and strengthen the collective resolve for the development of the region. He highlighted that today once again a new chapter is being added in Assam’s development. Referring to Bharat Ratna Bhupen Hazarika’s lines, Shri Modi emphasized that this means the banks of the mighty Brahmaputra river will shine, every wall of darkness will be broken, and this will certainly happen as it is the nation’s resolve and solemn pledge. Highlighting that Bhupen Hazarika’s lines were not merely a song but a solemn resolve of every great soul who loved Assam, and today this resolve is being fulfilled, Shri Modi remarked that just as the mighty currents of the Brahmaputra never stop, similarly under their governments at the Union and State, the stream of development in Assam continues uninterrupted. He stated that the inauguration of the new terminal at the Lokapriya Gopinath Bardoloi Airport stands as proof of this commitment, and extended congratulations to the people of Assam and the nation for this new terminal building. The Prime Minister further remarked that a short while ago he had the privilege of unveiling the statue of Gopinath Bardoloi, Assam’s first Chief Minister and a source of pride for the state. He emphasized that Shri Bardoloi never compromised on Assam’s identity, future, and interests, and his statue will continue to inspire future generations, instilling in them a deep sense of pride for Assam. “Modern airport facilities and advanced connectivity infrastructure serve as gateways to new possibilities and opportunities for any state, and stand as pillars of growing confidence and trust among the people”, exclaimed the Prime Minister. He remarked that when people witness the construction of magnificent highways and airports in Assam, they themselves acknowledge that true justice for Assam has finally begun. He contrasted this with the past, stating that for the previous governments, the development of Assam and the Northeast was never on their agenda. He noted that leaders in those governments used to say, “Who even goes to Assam and the Northeast?” and questioned the need for modern airports, highways, and better railways in the region. The Prime Minister emphasized that this mindset led the opposition to neglect the entire region for decades. Pointing out that the mistakes committed by the opposition over six to seven decades are being corrected one by one under his leadership, Shri Modi stated that whether opposition leaders visit the Northeast or not, he himself feels a sense of belonging among his own people whenever he comes to Assam and the region. He emphasized that for him, the development of Assam is not only a necessity but also a responsibility and an accountability. The Prime Minister highlighted that in the past eleven years, development projects worth lakhs of crores of rupees have been initiated for Assam and the Northeast. He noted that Assam is progressing further and creating new milestones, mentioning with satisfaction that Assam has become the number one state in the country to implement the Bharatiya Nyaya Sanhita. He added that Assam has also set a record by installing more than 50 lakh smart prepaid meters. He contrasted this with the previous dispensation era, when obtaining a government job without bribes or recommendations was impossible, and underlined that today thousands of youth are getting jobs without such practices. Shri Modi further highlighted that under their government, Assam’s culture is being promoted on every platform. He recalled the historic event of 13 April 2023, when more than 11,000 artists performed the Bihu dance together at the Guwahati stadium, an achievement that was recorded in the Guinness World Records. He remarked that by creating such new records, Assam is moving forward rapidly. Underlining that with this new terminal building, the capacity of Guwahati and Assam will increase significantly, enabling more than 1.25 crore passengers to travel annually, Shri Modi highlighted that this will also allow a large number of tourists to visit Assam and make it easier for devotees to have darshan of Maa Kamakhya. He stated that stepping into this new airport terminal clearly reflects the true meaning of the mantra of development along with heritage. The Prime Minister emphasized that the airport has been designed keeping in mind Assam’s nature and culture, with greenery inside and arrangements resembling an indoor forest. He noted that the design is connected to nature all around so that every passenger feels peace and comfort. He further highlighted the special use of bamboo in the construction, underscoring that bamboo is an integral part of life in Assam, symbolizing both strength and beauty. Shri Modi also recalled that their government in a landmark move in 2017, amended the Indian Forest Act, 1927, to legally reclassify bamboo grown in non-forest areas as a \"grass\" instead of a \"tree\". This move, he said, has led to the creation of a wonderful structure in the form of a new Terminal today. Underscoring the development of infrastructure carries a very significant message, the Prime Minister highlighted that it boosts industries, gives investors confidence in connectivity, and opens pathways for local products to reach global markets. He emphasized that the greatest assurance is given to the youth, for whom new opportunities are created. “Today, Assam is seen advancing on this very flight of limitless possibilities”, stated the Prime Minister. Shri Modi remarked that today the world’s perspective towards India has changed, and India’s role has also transformed. He highlighted that India is now on the path to becoming the world’s third-largest economy. He questioned how this was achieved within just 11 years and emphasized that the development of modern infrastructure has played a major role. The Prime Minister stated that India is preparing for 2047, focusing on infrastructure to fulfill the resolve of a developed nation. He underlined that the most important aspect of this grand development campaign is the participation of every state and every region. He noted that the government is prioritizing the underprivileged, ensuring that every state progresses together and contributes to the mission of a developed India. He expressed happiness that Assam and the Northeast are leading this mission. Shri Modi highlighted that through the Act East Policy, the Northeast has been given priority, and today Assam is emerging as India’s Eastern Gateway. He remarked that Assam is playing the role of a bridge connecting India with ASEAN countries. He affirmed that this beginning will go much further, and Assam will become an engine of developed India in many sectors. “Assam and the entire Northeast are becoming the new gateway of India’s development,” emphasised Shri Modi, highlighting that the vision of multi-modal connectivity has transformed both the condition and direction of this region. He stated that the pace of building new bridges in Assam, the speed of installing new mobile towers, and the momentum of every development project are turning dreams into reality. He emphasized that the bridges built over the Brahmaputra have given Assam new strength and confidence in connectivity. The Prime Minister pointed out that in the six to seven decades after independence, only three major bridges were built here, but in the last decade four new mega bridges have been completed, along with several historic projects taking shape. He noted that the longest bridges such as Bogibeel and Dhola-Sadiya have made Assam strategically stronger. He underlined that railway connectivity has also undergone a revolutionary change, with the Bogibeel Bridge reducing the distance between Upper Assam and the rest of the country. He remarked that the Vande Bharat Express running from Guwahati to New Jalpaiguri has reduced travel time. Shri Modi further highlighted that Assam is also benefiting from the development of waterways, with cargo traffic increasing by 140 percent, proving that the Brahmaputra is not just a river but a flow of economic power. He stated that the first ship repair facility is being developed at Pandu, and the enthusiasm around the Ganga Vilas Cruise from Varanasi to Dibrugarh has placed the Northeast firmly on the global cruise tourism map. Criticizing the previous governments for keeping Assam and the Northeast away from development, Shri Modi said the nation had to pay a heavy price in terms of security, unity, and integrity. He highlighted that under opposition rule, violence thrived for decades, whereas in the last 10–11 years efforts are being made to end it. He stated that where once violence and bloodshed prevailed in the Northeast, today digital connectivity through 4G and 5G technology is reaching these areas. The Prime Minister emphasized that districts once considered violence-affected are now developing as aspirational districts, and in the coming times these very regions will become industrial corridors. He underlined that a new confidence has arisen regarding the Northeast, and stressed the need to strengthen it further. The Prime Minister remarked that success in the development of Assam and the Northeast is also being achieved because the government is safeguarding the identity and culture of the region. He highlighted that the opposition  by conspiring to erase this identity, and this conspiracy was not limited to just a few years. He stated that the roots of this wrongdoing go back to the pre-independence era, when the Muslim League and the British government were preparing the ground for India’s partition, and at that time there was also a plan to make Assam a part of undivided Bengal, that is, East Pakistan. Shri Modi noted that Congress was going to be part of this conspiracy, but Shri Bardoloi ji stood against his own party, opposed this plot to destroy Assam’s identity, and saved Assam from being separated from the country. He emphasized that their party rises above party lines to honor every patriot, and under the leadership of Shri Atal Bihari Vajpayee ji, when their government came to power, Bardoloi ji was conferred the Bharat Ratna. The Prime Minister remarked that while Shri Bardoloi ji had saved Assam before independence, the first ruling dispensation in the post- independence era once again began anti-Assam and anti-national activities thereafter. He highlighted that they conspired to expand their vote bank through religious appeasement, giving free rein to infiltrators in Bengal and Assam. He stated that the region’s demography was altered, and these infiltrators encroached upon forests and lands. The Prime Minister emphasized that as a result, the security and identity of the entire state of Assam were put at risk. Shri Modi remarked that the government under Shri Himanta Biswa Sarma is working diligently to free Assam’s resources from illegal and anti-national encroachments. He highlighted that efforts are being made at every level to ensure Assam’s resources benefit the people of Assam. He stated that the Union government has also taken strict measures to stop infiltration, with identification processes underway to remove illegal infiltrators. The Prime Minister emphasized that the Opposition and their alliance have openly adopted anti-national agendas, even as the Supreme Court has spoken about removing infiltrators. He noted that these parties are issuing statements in defense of infiltrators, and their lawyers are pleading in court to settle them. He remarked that when the Election Commission is conducting the SIR process to ensure fair elections, these groups are opposing it. The Prime Minister underlined that such people will not protect the interests of Assamese brothers and sisters, and will allow others to occupy their land and forests. He warned that their anti-national mindset could recreate the violence and unrest of earlier times. He stressed that it is therefore essential to remain vigilant, for the people of Assam to stay united, and to continue defeating the Opposition's conspiracies to prevent Assam’s development from being derailed. “Today the world is looking towards India with hope, and the new sunrise of India’s future is to begin from the Northeast’, affirmed Shri Modi. He highlighted that for this, collective efforts are required to work towards shared dreams, with Assam’s development kept at the forefront. He expressed confidence that these joint endeavors will take Assam to new heights and fulfill the vision of a developed India. Concluding his remarks, the Prime Minister once again extended congratulations on the inauguration of the new terminal. Governor of Assam, Shri Lakshman Prasad Acharya, Chief Minister of Assam, Shri Himanta Biswa Sarma, Union Ministers, Shri Sarbananda Sonowal, Shri K Rammohan Naidu, Shri Murlidhar Mohol, Shri Pabitra Margherita were present among other dignitaries at the event. Background The newly completed Integrated New Terminal Building Of Lokapriya Gopinath Bardoloi International Airport in Guwahati, spread over nearly 1.4 lakh square metres, is designed to handle up to 1.3 crore passengers annually, supported by major upgrades to the runway, airfield systems, aprons and taxiways. India’s first nature-themed airport terminal, the airport’s design draws inspiration from Assam’s biodiversity and cultural heritage under the theme “Bamboo Orchids”. The terminal makes pioneering use of about 140 metric tonnes of locally sourced Northeast bamboo, complemented by Kaziranga-inspired green landscapes, japi motifs, the iconic rhino symbol and 57 orchid-inspired columns reflecting the Kopou flower. A unique “Sky Forest”, featuring nearly one lakh plants of indigenous species, offers arriving passengers an immersive, forest-like experience. The terminal sets new benchmarks in passenger convenience and digital innovation. Features such as full-body scanners for fast, non-intrusive security screening, DigiYatra-enabled contactless travel, automated baggage handling, fast-track immigration and AI-driven airport operations ensure seamless, secure and efficient journeys. The new terminal building of Lokapriya Gopinath Bardoloi International Airport will boost connectivity, commerce and tourism across Assam and entire Northeast. https://t.co/jRJdcJIOSB — Narendra Modi (@narendramodi) December 20, 2025 Modern airports and advanced connectivity infrastructure serve as gateways to new possibilities and new opportunities for any state. pic.twitter.com/E7fs1kgCQK — PMO India (@PMOIndia) December 20, 2025 Today, Assam and the entire North East are emerging as the new gateway to India's development. pic.twitter.com/6IR2FaTi5x — PMO India (@PMOIndia) December 20, 2025 The North East will lead India's future growth. pic.twitter.com/1uURYScmQc — PMO India (@PMOIndia) December 20, 2025 *** MJPS/SR (रिलीज़ आईडी: 2207003)",
    "scraped_at": "2025-12-20T17:34:01.509953"
  },
  {
    "id": "2206959",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister shares an article highlighting the Viksit Bharat G RAM G Bill",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206959",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister shares an article highlighting the Viksit Bharat G RAM G Bill प्रविष्टि तिथि:\r\n                20 DEC 2025 3:22PM by PIB Delhi The Prime Minister, Shri Narendra Modi, has shared an article written by Union Minister Shri Shivraj Singh Chouhan, highlighting the objectives of the Viksit Bharat G RAM G Bill. The article points to how the Viksit Bharat G RAM G Bill aims to transform rural livelihoods by enhancing the employment guarantee, embedding local planning, balancing worker security with farm productivity, converging schemes, strengthening frontline capacity and modernising governance. It further highlights that the Bill is not a retreat from social protection, but its renewal. Responding to the article written by Union Minister, Shri Modi said; “In this must-read article, Union Minister Shri @ChouhanShivraj explains how the Viksit Bharat G RAM G Bill aims to transform rural livelihoods by enhancing the employment guarantee, embedding local planning, balancing worker security with farm productivity, converging schemes, strengthening frontline capacity and modernising governance. He highlights that the bill is not a retreat from social protection — it is its renewal.” In this must-read article, Union Minister Shri @ChouhanShivraj explains how the Viksit Bharat G RAM G Bill aims to transform rural livelihoods by enhancing the employment guarantee, embedding local planning, balancing worker security with farm productivity, converging schemes,… https://t.co/j6Cy1SstnL — PMO India (@PMOIndia) December 20, 2025 संसद से पारित ‘विकसित भारत–गारंटी फॉर रोजगार एंड आजीविका मिशन (ग्रामीण)’ यानि VB-जी राम जी विधेयक, कानून बनने के बाद गांवों को विकास का इंजन बनाने में अहम भूमिका निभाएगा। केंद्रीय मंत्री श्री @ChouhanShivraj जी अपने इस आलेख में बताते हैं कि यह योजना किस तरह भ्रष्टाचार को खत्म कर… https://t.co/6DbKUuNhjB — PMO India (@PMOIndia) December 20, 2025 ******* MJPS/ST (रिलीज़ आईडी: 2206959) आगंतुक पटल  : 562 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Bengali , Assamese , Manipuri , Gujarati , Tamil , Telugu , Kannada , Malayalam , Malayalam Prime Minister's Office Prime Minister shares an article highlighting the Viksit Bharat G RAM G Bill प्रविष्टि तिथि:\r\n                        20 DEC 2025 3:22PM by PIB Delhi The Prime Minister, Shri Narendra Modi, has shared an article written by Union Minister Shri Shivraj Singh Chouhan, highlighting the objectives of the Viksit Bharat G RAM G Bill. The article points to how the Viksit Bharat G RAM G Bill aims to transform rural livelihoods by enhancing the employment guarantee, embedding local planning, balancing worker security with farm productivity, converging schemes, strengthening frontline capacity and modernising governance. It further highlights that the Bill is not a retreat from social protection, but its renewal. Responding to the article written by Union Minister, Shri Modi said; “In this must-read article, Union Minister Shri @ChouhanShivraj explains how the Viksit Bharat G RAM G Bill aims to transform rural livelihoods by enhancing the employment guarantee, embedding local planning, balancing worker security with farm productivity, converging schemes, strengthening frontline capacity and modernising governance. He highlights that the bill is not a retreat from social protection — it is its renewal.” In this must-read article, Union Minister Shri @ChouhanShivraj explains how the Viksit Bharat G RAM G Bill aims to transform rural livelihoods by enhancing the employment guarantee, embedding local planning, balancing worker security with farm productivity, converging schemes,… https://t.co/j6Cy1SstnL — PMO India (@PMOIndia) December 20, 2025 संसद से पारित ‘विकसित भारत–गारंटी फॉर रोजगार एंड आजीविका मिशन (ग्रामीण)’ यानि VB-जी राम जी विधेयक, कानून बनने के बाद गांवों को विकास का इंजन बनाने में अहम भूमिका निभाएगा। केंद्रीय मंत्री श्री @ChouhanShivraj जी अपने इस आलेख में बताते हैं कि यह योजना किस तरह भ्रष्टाचार को खत्म कर… https://t.co/6DbKUuNhjB — PMO India (@PMOIndia) December 20, 2025 ******* MJPS/ST (रिलीज़ आईडी: 2206959)",
    "scraped_at": "2025-12-20T17:34:03.684975"
  },
  {
    "id": "2207084",
    "ministry": "Ministry of Agriculture &\r\nFarmers Welfare",
    "title": "Union Agriculture Minister Shri Shivraj Singh Chouhan participates in Chaudhary Charan Singh Kisan Samman Ceremony",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207084",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Agriculture &\r\nFarmers Welfare Union Agriculture Minister Shri Shivraj Singh Chouhan participates in Chaudhary Charan Singh Kisan Samman Ceremony “Chaudhary Charan Singh symbolized farmer welfare, prosperity, and rural development” – Shri Shivraj Singh Chouhan “Viksit Bharat — G Ram G law will pave a new path for rural employment and development” – Shri Chouhan “The new ‘Viksit Bharat — G Ram G’ law seeks to balance the interests of farmers and labourers” – Shri Shivraj Chouhan “Employment guarantee could not be meaningful only through digging work” – Shri Chouhan “Under the new law, construction of schools, drains, roads, culverts, and even farm roads, will be undertaken” – Shri Shivraj Singh Chouhan “Scientists will visit fields once a year to interact directly with farmers” – Union Agriculture Minister “Government to introduce a bill against fake fertilisers and pesticides in the next Parliament session” – Shri Shivraj Singh “Under the leadership of Prime Minister Shri Narendra Modi, the government will continue its commitment to welfare and development” – Shri Shivraj Singh Chouhan प्रविष्टि तिथि:\r\n                20 DEC 2025 8:40PM by PIB Delhi Union Minister for Agriculture and Farmers’ Welfare, and Rural Development, Shri Shivraj Singh Chouhan today participated as the Chief Guest in the Chaudhary Charan Singh Kisan Samman Ceremony organised by the Kisan Trust at the PHD Chamber of Commerce and Industry, New Delhi. On this occasion, the Union Minister released a book and felicitated progressive farmers and institutions for their exemplary contribution in the field of agriculture. Minister of State (Independent Charge) for Education, Skill Development and Entrepreneurship, Shri Jayant Chaudhary, attended the ceremony as the Guest of Honour. The Union Minister honoured progressive farmer Shri Satyawan Sehrawat; Dr. Devendra Kumar Yadav, who is the Deputy Director General of the Indian Agricultural Research Institute, with the Krishi Ratna Award 2025 under the Agricultural Advancement category; Fruvatec Private Limited recognised in the Agripreneurship category; Pratham Education Foundation was awarded in the Kisan Trust Seva Ratna category, while the Kisan Trust Kalam Ratna Award was conferred on Shri Harveer Singh. While addressing the gathering, Union Agriculture Minister Shri Shivraj Singh Chouhan said that Chaudhary Charan Singh remained an ideal figure throughout his life. The entire nation looked up to him with hope and trust. He was an embodiment of truth, humility, and determination, deeply committed to the progress of villages, the poor, and the farmers. Shri Chouhan said that it was Chaudhary Sahib who proclaimed that the path to India’s prosperity passes through the field boundaries of the farmer. Shri Chouhan added that Chaudhary Charan Singh played a vital role in the freedom struggle. Inspired by Mahatma Gandhi, he joined the Salt Satyagraha, broke the Salt Law by making salt near the Hindon River, and even went to jail for the cause. After Independence too, he fearlessly stood against injustice. Shri Chouhan remarked that no one contributed more significantly to the abolition of the zamindari system than Chaudhary Charan Singh. The Union Minister said that it was Chaudhary Sahib who made the remarkable effort to link food grain storage in warehouses with welfare of the poor. The concept of ‘food in exchange of employment’ — ensuring honourable food security for every poor household — was his visionary contribution. Shri Chouhan also discussed the recently passed ‘Viksit Bharat – Guarantee for Employment and Livelihood Mission (Rural)’ — popularly known as ‘G Ram G Law’ — and said that the essence of this new law lies in the spirit of welfare for the poor. He noted that under this law, guaranteed employment has been increased from 100 days to 125 days. He mentioned that last year, an allocation of ₹88,000 crore was made under MGNREGA, which was later raised to ₹1 lakh crore, and further to ₹1.11 lakh crore. “Should such large allocations not be meaningfully utilised for rural development works?” he asked. He observed that the employment guarantee scheme could not achieve its true purpose merely through digging activities, which often gave scope for corruption. The new law, he said, brings major reforms by ensuring not only guaranteed employment but also visible transformation in villages. Each village will prepare its own list of development works, which will then be implemented accordingly. Employment generation and rural development will go hand in hand — construction of schools, drains, roads, culverts, and even farm roads will be undertaken under this scheme. Shri Chouhan said that the new law classifies panchayats according to their development and employment needs, and funds will be allocated on that basis. The law also considers labourers engaged in sowing, harvesting, and agricultural operations. A strong effort has been made to create a healthy balance between farmers and labourers. The Union Minister further said that under the leadership of Prime Minister Shri Narendra Modi, the government is striving to achieve better outcomes. He emphasised the importance of direct dialogue between scientists and farmers, promoting the ‘Lab-to-Land’ vision to bring research findings directly to the fields. The government has decided that scientists will visit farms once a year for direct interaction and exchange of knowledge with farmers. He also urged researchers to align their studies with the actual needs of farmers. Expressing concern over the sale of fake fertilisers, pesticides, and other unauthorised biostimulants disguised under misleading tags, Shri Chouhan said that the government is taking comprehensive measures against such malpractices. A new bill will be introduced in the upcoming Parliament session to curb these issues. Strict laws will be enacted, and stringent actions will be taken against dishonest traders. He also urged Kisan Trust to offer suggestions for the upcoming budget session and in formulating five-year plans for the agriculture sector, and invited ideas for the proposed ‘Chintan Shivir’. Concluding his address, Union Agriculture Minister Shri Shivraj Singh Chouhan reaffirmed that the government, guided by the values and principles of Chaudhary Charan Singh and led by Prime Minister Shri Narendra Modi, will leave no stone unturned in advancing farmer welfare and rural progress. ** RC/AR (रिलीज़ आईडी: 2207084) आगंतुक पटल  : 110 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी , Marathi , Gujarati , Kannada Ministry of Agriculture &\r\nFarmers Welfare Union Agriculture Minister Shri Shivraj Singh Chouhan participates in Chaudhary Charan Singh Kisan Samman Ceremony “Chaudhary Charan Singh symbolized farmer welfare, prosperity, and rural development” – Shri Shivraj Singh Chouhan “Viksit Bharat — G Ram G law will pave a new path for rural employment and development” – Shri Chouhan “The new ‘Viksit Bharat — G Ram G’ law seeks to balance the interests of farmers and labourers” – Shri Shivraj Chouhan “Employment guarantee could not be meaningful only through digging work” – Shri Chouhan “Under the new law, construction of schools, drains, roads, culverts, and even farm roads, will be undertaken” – Shri Shivraj Singh Chouhan “Scientists will visit fields once a year to interact directly with farmers” – Union Agriculture Minister “Government to introduce a bill against fake fertilisers and pesticides in the next Parliament session” – Shri Shivraj Singh “Under the leadership of Prime Minister Shri Narendra Modi, the government will continue its commitment to welfare and development” – Shri Shivraj Singh Chouhan प्रविष्टि तिथि:\r\n                        20 DEC 2025 8:40PM by PIB Delhi Union Minister for Agriculture and Farmers’ Welfare, and Rural Development, Shri Shivraj Singh Chouhan today participated as the Chief Guest in the Chaudhary Charan Singh Kisan Samman Ceremony organised by the Kisan Trust at the PHD Chamber of Commerce and Industry, New Delhi. On this occasion, the Union Minister released a book and felicitated progressive farmers and institutions for their exemplary contribution in the field of agriculture. Minister of State (Independent Charge) for Education, Skill Development and Entrepreneurship, Shri Jayant Chaudhary, attended the ceremony as the Guest of Honour. The Union Minister honoured progressive farmer Shri Satyawan Sehrawat; Dr. Devendra Kumar Yadav, who is the Deputy Director General of the Indian Agricultural Research Institute, with the Krishi Ratna Award 2025 under the Agricultural Advancement category; Fruvatec Private Limited recognised in the Agripreneurship category; Pratham Education Foundation was awarded in the Kisan Trust Seva Ratna category, while the Kisan Trust Kalam Ratna Award was conferred on Shri Harveer Singh. While addressing the gathering, Union Agriculture Minister Shri Shivraj Singh Chouhan said that Chaudhary Charan Singh remained an ideal figure throughout his life. The entire nation looked up to him with hope and trust. He was an embodiment of truth, humility, and determination, deeply committed to the progress of villages, the poor, and the farmers. Shri Chouhan said that it was Chaudhary Sahib who proclaimed that the path to India’s prosperity passes through the field boundaries of the farmer. Shri Chouhan added that Chaudhary Charan Singh played a vital role in the freedom struggle. Inspired by Mahatma Gandhi, he joined the Salt Satyagraha, broke the Salt Law by making salt near the Hindon River, and even went to jail for the cause. After Independence too, he fearlessly stood against injustice. Shri Chouhan remarked that no one contributed more significantly to the abolition of the zamindari system than Chaudhary Charan Singh. The Union Minister said that it was Chaudhary Sahib who made the remarkable effort to link food grain storage in warehouses with welfare of the poor. The concept of ‘food in exchange of employment’ — ensuring honourable food security for every poor household — was his visionary contribution. Shri Chouhan also discussed the recently passed ‘Viksit Bharat – Guarantee for Employment and Livelihood Mission (Rural)’ — popularly known as ‘G Ram G Law’ — and said that the essence of this new law lies in the spirit of welfare for the poor. He noted that under this law, guaranteed employment has been increased from 100 days to 125 days. He mentioned that last year, an allocation of ₹88,000 crore was made under MGNREGA, which was later raised to ₹1 lakh crore, and further to ₹1.11 lakh crore. “Should such large allocations not be meaningfully utilised for rural development works?” he asked. He observed that the employment guarantee scheme could not achieve its true purpose merely through digging activities, which often gave scope for corruption. The new law, he said, brings major reforms by ensuring not only guaranteed employment but also visible transformation in villages. Each village will prepare its own list of development works, which will then be implemented accordingly. Employment generation and rural development will go hand in hand — construction of schools, drains, roads, culverts, and even farm roads will be undertaken under this scheme. Shri Chouhan said that the new law classifies panchayats according to their development and employment needs, and funds will be allocated on that basis. The law also considers labourers engaged in sowing, harvesting, and agricultural operations. A strong effort has been made to create a healthy balance between farmers and labourers. The Union Minister further said that under the leadership of Prime Minister Shri Narendra Modi, the government is striving to achieve better outcomes. He emphasised the importance of direct dialogue between scientists and farmers, promoting the ‘Lab-to-Land’ vision to bring research findings directly to the fields. The government has decided that scientists will visit farms once a year for direct interaction and exchange of knowledge with farmers. He also urged researchers to align their studies with the actual needs of farmers. Expressing concern over the sale of fake fertilisers, pesticides, and other unauthorised biostimulants disguised under misleading tags, Shri Chouhan said that the government is taking comprehensive measures against such malpractices. A new bill will be introduced in the upcoming Parliament session to curb these issues. Strict laws will be enacted, and stringent actions will be taken against dishonest traders. He also urged Kisan Trust to offer suggestions for the upcoming budget session and in formulating five-year plans for the agriculture sector, and invited ideas for the proposed ‘Chintan Shivir’. Concluding his address, Union Agriculture Minister Shri Shivraj Singh Chouhan reaffirmed that the government, guided by the values and principles of Chaudhary Charan Singh and led by Prime Minister Shri Narendra Modi, will leave no stone unturned in advancing farmer welfare and rural progress. ** RC/AR (रिलीज़ आईडी: 2207084)",
    "scraped_at": "2025-12-20T17:34:05.699073"
  },
  {
    "id": "2207019",
    "ministry": "Ministry of Communications",
    "title": "Minister of State for Communications and Rural Development Dr. Pemmasani Chandra Sekhar inaugurates Andhra Pradesh’s first Gen-Z transformed campus Post Office at VIT- AP University, Amravati",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207019",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Communications Minister of State for Communications and Rural Development Dr. Pemmasani Chandra Sekhar inaugurates Andhra Pradesh’s first Gen-Z transformed campus Post Office at VIT- AP University, Amravati प्रविष्टि तिथि:\r\n                20 DEC 2025 6:33PM by PIB Delhi As part of a nationwide initiative to modernise campus Post Offices and transform them into vibrant, student-centric service hubs, the Gen-Z themed VIT-AP University Sub Post Office was inaugurated today at the VIT-AP University campus, Amaravati, by Dr. Pemmasani Chandra Sekhar, Minister of State for Rural Development & Communications . The inauguration ceremony was attended by several dignitaries, including Ms. B. P. Sridevi, IPoS, Chief Postmaster General, Andhra Pradesh Circle; Dr. P. Arulmolivarman, Vice-Chancellor, VIT-AP University; Smt. A. Thameem Anasariya, IAS, Collector & District Magistrate, Guntur District; Dr. Jagadish Chandra Mudiganti, Registrar, VIT-AP University; Dr. Vennam Upender, IPoS, Postmaster General, Vijayawada Region; Shri K. Vinod Kumar, IP&TAFS, General Manager (Finance), Andhra Pradesh Circle; and Shri Abhilash Pasam, Director of Accounts , along with other senior officers and faculty members. This initiative represents another important step in India Post’s mission to connect with young India, promote financial inclusion, and deliver modern, accessible services within campus ecosystems. The inauguration marks a significant milestone in India Post’s transformation journey aimed at reimagining traditional Post Offices as contemporary, future-ready institutions while strengthening engagement with the younger generation. The newly revamped Post Office has been thoughtfully designed to resonate with Gen-Z sensibilities, combining functionality with creativity, innovation, and a modern aesthetic. The Gen-Z themed Post Office features new-generation facilities such as an India Post literature wall, coffee zone, foosball table, free Wi-Fi, magazine stand, and enhanced digital service access, creating a welcoming and student-friendly environment. On the occasion, the  Minister of State also released a Special Postal Cover titled “VIT: Gen-Z Themed Post Office of Andhra Pradesh.” Addressing the gathering, Dr. Pemmasani Chandrasekhar stated that the initiative reflects the Department of Posts’ commitment to transforming Post Offices into vibrant service centres aligned with the evolving aspirations of young citizens. He emphasised that such initiatives will play a crucial role in familiarising students with essential postal, financial, and digital services in an accessible and engaging manner. Conceptualised specifically for Gen-Z users, the campus Post Office offers simplified service delivery, digital payment options, and seamless access to postal, banking, and insurance services under one roof. The initiative reinforces India Post’s focus on innovation, inclusivity, and customer-centric service delivery while promoting financial awareness among students. *** MI/ARJ (रिलीज़ आईडी: 2207019) आगंतुक पटल  : 171 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Communications Minister of State for Communications and Rural Development Dr. Pemmasani Chandra Sekhar inaugurates Andhra Pradesh’s first Gen-Z transformed campus Post Office at VIT- AP University, Amravati प्रविष्टि तिथि:\r\n                        20 DEC 2025 6:33PM by PIB Delhi As part of a nationwide initiative to modernise campus Post Offices and transform them into vibrant, student-centric service hubs, the Gen-Z themed VIT-AP University Sub Post Office was inaugurated today at the VIT-AP University campus, Amaravati, by Dr. Pemmasani Chandra Sekhar, Minister of State for Rural Development & Communications . The inauguration ceremony was attended by several dignitaries, including Ms. B. P. Sridevi, IPoS, Chief Postmaster General, Andhra Pradesh Circle; Dr. P. Arulmolivarman, Vice-Chancellor, VIT-AP University; Smt. A. Thameem Anasariya, IAS, Collector & District Magistrate, Guntur District; Dr. Jagadish Chandra Mudiganti, Registrar, VIT-AP University; Dr. Vennam Upender, IPoS, Postmaster General, Vijayawada Region; Shri K. Vinod Kumar, IP&TAFS, General Manager (Finance), Andhra Pradesh Circle; and Shri Abhilash Pasam, Director of Accounts , along with other senior officers and faculty members. This initiative represents another important step in India Post’s mission to connect with young India, promote financial inclusion, and deliver modern, accessible services within campus ecosystems. The inauguration marks a significant milestone in India Post’s transformation journey aimed at reimagining traditional Post Offices as contemporary, future-ready institutions while strengthening engagement with the younger generation. The newly revamped Post Office has been thoughtfully designed to resonate with Gen-Z sensibilities, combining functionality with creativity, innovation, and a modern aesthetic. The Gen-Z themed Post Office features new-generation facilities such as an India Post literature wall, coffee zone, foosball table, free Wi-Fi, magazine stand, and enhanced digital service access, creating a welcoming and student-friendly environment. On the occasion, the  Minister of State also released a Special Postal Cover titled “VIT: Gen-Z Themed Post Office of Andhra Pradesh.” Addressing the gathering, Dr. Pemmasani Chandrasekhar stated that the initiative reflects the Department of Posts’ commitment to transforming Post Offices into vibrant service centres aligned with the evolving aspirations of young citizens. He emphasised that such initiatives will play a crucial role in familiarising students with essential postal, financial, and digital services in an accessible and engaging manner. Conceptualised specifically for Gen-Z users, the campus Post Office offers simplified service delivery, digital payment options, and seamless access to postal, banking, and insurance services under one roof. The initiative reinforces India Post’s focus on innovation, inclusivity, and customer-centric service delivery while promoting financial awareness among students. *** MI/ARJ (रिलीज़ आईडी: 2207019)",
    "scraped_at": "2025-12-20T17:34:07.797318"
  },
  {
    "id": "2207055",
    "ministry": "Ministry of Finance",
    "title": "Union Minister for Finance and Corporate Affairs Smt. Nirmala Sitharaman, along with Minister of State for Corporate Affairs Shri Harsh Malhotra, chairs Chintan Shivir of Ministry of Finance and Ministry of Corporate Aff...",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207055",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Finance Union Minister for Finance and Corporate Affairs Smt. Nirmala Sitharaman, along with Minister of State for Corporate Affairs Shri Harsh Malhotra, chairs Chintan Shivir of Ministry of Finance and Ministry of Corporate Affairs Senior officers from the Ministry of Finance, Ministry of Corporate Affairs, and associated departments are also participating in the Chintan Shivir प्रविष्टि तिथि:\r\n                20 DEC 2025 7:47PM by PIB Delhi Union Minister for Finance and Corporate Affairs Smt. Nirmala Sitharaman, along with Union Minister of State for Corporate Affairs Shri Harsh Malhotra, chaired the Chintan Shivir of the Ministry of Finance and the Ministry of Corporate Affairs, at Hampi in Vijayanagara district, Karnataka, today. All Secretaries of the Ministry of Finance and the Ministry of Corporate Affairs, Chairmen of Central Board of Direct Taxes (CBDT) and Central Board of Indirect Taxes and Customs (CBIC), and the Chief Economic Adviser to the Government of India were also present, besides senior officers from the Ministry of Finance and the Ministry of Corporate Affairs, and associated departments. In a session on “AI, Ease of Doing Business & Financing for Viksit Bharat”, the discussions focused on strengthening institutional capacity and policymaking through the use of artificial intelligence, technology-enabled systems, and process reforms to improve Ease of Doing Business. Deliberations covered simplification of procedures, regulatory predictability, coordinated inter-departmental functioning, efficient fund flows, future-ready tax administration, financing pathways for sustained growth, and leveraging digital tools for transparency, efficiency, and accountability. In her remarks, FM Smt. Sitharaman reflected on the historical significance of the Vijayanagara region, noting that it represents one of the closest examples of an Indian empire at its peak barely 500 years ago, with its imprint visible across large parts of the subcontinent. She also drew attention to the contrast within the same district — where magnificent monuments coexist with drought-prone areas facing low agricultural productivity and human–animal conflict — underscoring the need to remain grounded in present-day developmental realities. Union Minister for Finance and Corporate Affairs Smt. @nsitharaman , along with Union Minister of State for Corporate Affairs Shri @hdmalhotra , chaired the Chintan Shivir of the Ministry of Finance @FinMinIndia and Ministry of Corporate Affairs @MCA21India , at Hampi in… pic.twitter.com/FN2Qxfx9Tu — Ministry of Finance (@FinMinIndia) December 20, 2025 **** NB/KMN (रिलीज़ आईडी: 2207055) आगंतुक पटल  : 180 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Kannada Ministry of Finance Union Minister for Finance and Corporate Affairs Smt. Nirmala Sitharaman, along with Minister of State for Corporate Affairs Shri Harsh Malhotra, chairs Chintan Shivir of Ministry of Finance and Ministry of Corporate Affairs Senior officers from the Ministry of Finance, Ministry of Corporate Affairs, and associated departments are also participating in the Chintan Shivir प्रविष्टि तिथि:\r\n                        20 DEC 2025 7:47PM by PIB Delhi Union Minister for Finance and Corporate Affairs Smt. Nirmala Sitharaman, along with Union Minister of State for Corporate Affairs Shri Harsh Malhotra, chaired the Chintan Shivir of the Ministry of Finance and the Ministry of Corporate Affairs, at Hampi in Vijayanagara district, Karnataka, today. All Secretaries of the Ministry of Finance and the Ministry of Corporate Affairs, Chairmen of Central Board of Direct Taxes (CBDT) and Central Board of Indirect Taxes and Customs (CBIC), and the Chief Economic Adviser to the Government of India were also present, besides senior officers from the Ministry of Finance and the Ministry of Corporate Affairs, and associated departments. In a session on “AI, Ease of Doing Business & Financing for Viksit Bharat”, the discussions focused on strengthening institutional capacity and policymaking through the use of artificial intelligence, technology-enabled systems, and process reforms to improve Ease of Doing Business. Deliberations covered simplification of procedures, regulatory predictability, coordinated inter-departmental functioning, efficient fund flows, future-ready tax administration, financing pathways for sustained growth, and leveraging digital tools for transparency, efficiency, and accountability. In her remarks, FM Smt. Sitharaman reflected on the historical significance of the Vijayanagara region, noting that it represents one of the closest examples of an Indian empire at its peak barely 500 years ago, with its imprint visible across large parts of the subcontinent. She also drew attention to the contrast within the same district — where magnificent monuments coexist with drought-prone areas facing low agricultural productivity and human–animal conflict — underscoring the need to remain grounded in present-day developmental realities. Union Minister for Finance and Corporate Affairs Smt. @nsitharaman , along with Union Minister of State for Corporate Affairs Shri @hdmalhotra , chaired the Chintan Shivir of the Ministry of Finance @FinMinIndia and Ministry of Corporate Affairs @MCA21India , at Hampi in… pic.twitter.com/FN2Qxfx9Tu — Ministry of Finance (@FinMinIndia) December 20, 2025 **** NB/KMN (रिलीज़ आईडी: 2207055)",
    "scraped_at": "2025-12-20T17:34:09.475394"
  },
  {
    "id": "2206975",
    "ministry": "Ministry of Health and Family Welfare",
    "title": "Union Health Minister Shri J P Nadda Addresses 21st Convocation of King George’s Medical University, Uttar Pradesh",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206975",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Health and Family Welfare Union Health Minister Shri J P Nadda Addresses 21st Convocation of King George’s Medical University, Uttar Pradesh Union Health Minister Highlights Decade of Growth in Medical Infrastructure While the country had only one AIIMS at the end of the past century, today there are 23 AIIMS institutions across India, reflecting the government’s commitment to expanding quality healthcare and medical training to every region: Shri Nadda Shri Nadda urges KGMU graduates to uphold excellence and contribute to medical education and research 81 students and one faculty member honoured for their outstanding academic, clinical and research achievements in the MBBS, BDS, MD/MS, DM/M.Ch., MDS, M.Sc. Nursing and faculty categories प्रविष्टि तिथि:\r\n                20 DEC 2025 4:29PM by PIB Delhi Union Health Minister, Shri Jagat Prakash Nadda addressed the 21 st annual convocation ceremony of King George’s Medical University (KGMU), in Lucknow today. Smt. Anandiben Patel, Governor, Uttar Pradesh; Shri Brajesh Pathak, Deputy Chief Minister and Minister of Medical Education, Medical, Health and Family Welfare; Govt. of Uttar Pradesh; Shri Pankaj Kumar, Minister of State for Finance, Govt. of India; Shri Mayankeshwar Sharan Singh, Minister of State for Health and Family Welfare, Govt. of Uttar Pradesh and Prof. Ajay Kumar Sood, Principal Scientific Advisor to Government of India were also present. Addressing the gathering, Shri Nadda congratulated the graduating students and commended KGMU for its contribution towards advancing medical science education, and patient care in India. “KGMU is ranked 8 th in the 2025 NIRF rankings and 12 of its faculties have been listed in the top 2% scientists by Stanford University which is a remarkable achievement”, he stated. Highlighting the remarkable progress achieved in India’s healthcare and medical education sector over the past decade, Shri Nadda noted that while the country had only one AIIMS at the end of the past century, today there are 23 AIIMS institutions across India, reflecting the government’s commitment to expanding quality healthcare and medical training to every region. He further informed that in the last 11 years, the number of medical colleges in the country has increased from 387 to 819. Similarly, undergraduate medical seats have risen from 51,000 to 1,19,000, and postgraduate seats from 31,000 to 80,000. Shri Nadda added that till 2029, under the direction of Prime Minister Shri Narendra Modi, an additional 75,000 seats will be added across both undergraduate and postgraduate levels, of which more than 23,000 seats have already been added in one year. Shri Nadda highlighted that today there are more than 1.82 lakh Ayushman Arogya Mandirs operational in the country which are providing comprehensive primary care services to the people. He also informed that more than 62 crore people, accounting to over 40% of India’s population are being provided with health coverage up to Rs 5 lakh under the Ayushman Bharat – PMJAY scheme, the largest health coverage scheme in the world. The Union Health Minister said that “basic education is everyone’s birthright but professional education is a privilege that the society bestows on only a few”. Highlighting that the government spends between 30-35 lakh for every MBBS student, he urged the new doctors to shoulder more responsibilities towards society as they embark on their professional careers. Concluding his address, Shri Nadda urged the graduating students to actively contribute to academics and research, and to uphold the prestigious legacy of KGMU through excellence in their professional and ethical conduct. He encouraged them to remain lifelong learners and innovators, committed to advancing medical science and serving society with compassion. Congratulating the young doctors on their achievements, Shri Brajesh Pathak said, “for more than 120 years, KGMU has stood as a beacon of medical education, research and service to humanity.” He also highlighted the progress achieved in the medical sector in Uttar Pradesh, stating that “there were only 17 medical colleges in the government sector and 23 in the private sector in 2017 which has increased to a total of 81fully functional medical colleges in the state today.” “Today, all 75 districts have dialysis facilities and CT Scan machines available, Ayushman Arogya Mandirs have been set up through NHM in population clusters of more than 5,000, tertiary facilities have been strengthened through additional ICU beds”, he added. On this occasion, 81 students and one faculty member were honoured for their outstanding academic, clinical and research achievements in the MBBS, BDS, MD/MS, DM/M.Ch., MDS, M.Sc. Nursing and faculty categories. The awards include gold and silver medals, certificates of merit, book prizes, cash awards as well as awards for the best thesis and best resident. In addition, a senior faculty member was conferred with a special honour for outstanding contributions to medical and allied disciplines. Prof. Sonia Nityanand (Padma Shri awardee), Vice-Chancellor, KGMU; Prof. Apjeet Kaur, Dean, KGMU and Member of the University Assembly and Executive Council and senior officials of the Union Government and Government of Uttar Pradesh were present in the event. *** SR HFW- HFM KGMU Convocation Address/20 th December 2025/1 (रिलीज़ आईडी: 2206975) आगंतुक पटल  : 223 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Health and Family Welfare Union Health Minister Shri J P Nadda Addresses 21st Convocation of King George’s Medical University, Uttar Pradesh Union Health Minister Highlights Decade of Growth in Medical Infrastructure While the country had only one AIIMS at the end of the past century, today there are 23 AIIMS institutions across India, reflecting the government’s commitment to expanding quality healthcare and medical training to every region: Shri Nadda Shri Nadda urges KGMU graduates to uphold excellence and contribute to medical education and research 81 students and one faculty member honoured for their outstanding academic, clinical and research achievements in the MBBS, BDS, MD/MS, DM/M.Ch., MDS, M.Sc. Nursing and faculty categories प्रविष्टि तिथि:\r\n                        20 DEC 2025 4:29PM by PIB Delhi Union Health Minister, Shri Jagat Prakash Nadda addressed the 21 st annual convocation ceremony of King George’s Medical University (KGMU), in Lucknow today. Smt. Anandiben Patel, Governor, Uttar Pradesh; Shri Brajesh Pathak, Deputy Chief Minister and Minister of Medical Education, Medical, Health and Family Welfare; Govt. of Uttar Pradesh; Shri Pankaj Kumar, Minister of State for Finance, Govt. of India; Shri Mayankeshwar Sharan Singh, Minister of State for Health and Family Welfare, Govt. of Uttar Pradesh and Prof. Ajay Kumar Sood, Principal Scientific Advisor to Government of India were also present. Addressing the gathering, Shri Nadda congratulated the graduating students and commended KGMU for its contribution towards advancing medical science education, and patient care in India. “KGMU is ranked 8 th in the 2025 NIRF rankings and 12 of its faculties have been listed in the top 2% scientists by Stanford University which is a remarkable achievement”, he stated. Highlighting the remarkable progress achieved in India’s healthcare and medical education sector over the past decade, Shri Nadda noted that while the country had only one AIIMS at the end of the past century, today there are 23 AIIMS institutions across India, reflecting the government’s commitment to expanding quality healthcare and medical training to every region. He further informed that in the last 11 years, the number of medical colleges in the country has increased from 387 to 819. Similarly, undergraduate medical seats have risen from 51,000 to 1,19,000, and postgraduate seats from 31,000 to 80,000. Shri Nadda added that till 2029, under the direction of Prime Minister Shri Narendra Modi, an additional 75,000 seats will be added across both undergraduate and postgraduate levels, of which more than 23,000 seats have already been added in one year. Shri Nadda highlighted that today there are more than 1.82 lakh Ayushman Arogya Mandirs operational in the country which are providing comprehensive primary care services to the people. He also informed that more than 62 crore people, accounting to over 40% of India’s population are being provided with health coverage up to Rs 5 lakh under the Ayushman Bharat – PMJAY scheme, the largest health coverage scheme in the world. The Union Health Minister said that “basic education is everyone’s birthright but professional education is a privilege that the society bestows on only a few”. Highlighting that the government spends between 30-35 lakh for every MBBS student, he urged the new doctors to shoulder more responsibilities towards society as they embark on their professional careers. Concluding his address, Shri Nadda urged the graduating students to actively contribute to academics and research, and to uphold the prestigious legacy of KGMU through excellence in their professional and ethical conduct. He encouraged them to remain lifelong learners and innovators, committed to advancing medical science and serving society with compassion. Congratulating the young doctors on their achievements, Shri Brajesh Pathak said, “for more than 120 years, KGMU has stood as a beacon of medical education, research and service to humanity.” He also highlighted the progress achieved in the medical sector in Uttar Pradesh, stating that “there were only 17 medical colleges in the government sector and 23 in the private sector in 2017 which has increased to a total of 81fully functional medical colleges in the state today.” “Today, all 75 districts have dialysis facilities and CT Scan machines available, Ayushman Arogya Mandirs have been set up through NHM in population clusters of more than 5,000, tertiary facilities have been strengthened through additional ICU beds”, he added. On this occasion, 81 students and one faculty member were honoured for their outstanding academic, clinical and research achievements in the MBBS, BDS, MD/MS, DM/M.Ch., MDS, M.Sc. Nursing and faculty categories. The awards include gold and silver medals, certificates of merit, book prizes, cash awards as well as awards for the best thesis and best resident. In addition, a senior faculty member was conferred with a special honour for outstanding contributions to medical and allied disciplines. Prof. Sonia Nityanand (Padma Shri awardee), Vice-Chancellor, KGMU; Prof. Apjeet Kaur, Dean, KGMU and Member of the University Assembly and Executive Council and senior officials of the Union Government and Government of Uttar Pradesh were present in the event. *** SR HFW- HFM KGMU Convocation Address/20 th December 2025/1 (रिलीज़ आईडी: 2206975)",
    "scraped_at": "2025-12-20T17:34:11.777198"
  },
  {
    "id": "2207030",
    "ministry": "Ministry of Housing & Urban Affairs",
    "title": "Union Minister Shri Manohar Lal and CM Madhya Pradesh Dr Mohan Yadav inaugurates Bhopal Metro today.",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207030",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Housing & Urban Affairs Union Minister Shri Manohar Lal and CM  Madhya Pradesh Dr Mohan Yadav inaugurates  Bhopal Metro today. Bhopal becomes 26th city in India with operational Metro network; India’s total operational Metro length reaches 1,090 km Posted On:\r\n                20 DEC 2025 7:06PM by PIB Delhi With the commencement of Metro operations in Bhopal today, another milestone has been added to India’s urban transport journey. With Bhopal joining the list, Metro services are now operational in 26 cities across the country, taking the total operational Metro network in India to 1,090 km. The Bhopal Metro marks a major step forward for the capital city of Madhya Pradesh, aimed at making urban travel faster, cleaner and more convenient for citizens. Developed under the leadership of the Hon’ble Prime Minister, the project represents a significant achievement towards smart, green and sustainable mobility. The Bhopal Metro has a total length of 30.8 km, comprising two corridors and one depot: Orange Line: 16.74 km Blue Line: 14.16 km Designed to connect major commercial and residential areas of the city, the Metro is expected to reduce traffic congestion and enhance the overall quality of life for residents. Inauguration of the Priority Corridor The first phase of the Bhopal Metro, the Orange Line Priority Corridor, was inaugurated today. The priority stretch of approximately 7 km includes eight elevated stations: AIIMS, Alkapuri, DRM Office, Rani Kamlapati, MP Nagar, Board Office Chauraha, Kendriya Vidyalaya and Subhash Nagar. This corridor will ensure smoother traffic flow on some of the city’s busiest routes, help reduce pollution levels and provide a safe and comfortable commuting experience. Key Features of Bhopal Metro The Bhopal Metro is equipped with modern, user-friendly and safety-focused facilities, including: Modern Facilities: High-speed lifts and escalators at all stations Accessible for All: Dedicated wheelchair spaces and easy access for Divyangjan Safety First: AI-based CCTV surveillance, Emergency Communication Buttons, Platform Screen Doors and Grade-4 Signalling Systems Smart Technology: Audio-visual passenger information systems and a high-tech Operations Control Centre Passenger Comfort: Fully air-conditioned coaches with comfortable seating and mobile charging points The Bhopal Metro is a symbol of the city’s progress towards sustainable urban development. By promoting smart, safe and environment-friendly mobility, it will significantly ease daily commuting and contribute to a cleaner urban environment. With the launch of Metro services, Bhopal takes a decisive step towards becoming a modern, green and accessible capital city. **** SK (Release ID: 2207030) Visitor Counter : 169 Read this release in: Urdu , हिन्दी Ministry of Housing & Urban Affairs Union Minister Shri Manohar Lal and CM  Madhya Pradesh Dr Mohan Yadav inaugurates  Bhopal Metro today. Bhopal becomes 26th city in India with operational Metro network; India’s total operational Metro length reaches 1,090 km Posted On:\r\n                        20 DEC 2025 7:06PM by PIB Delhi With the commencement of Metro operations in Bhopal today, another milestone has been added to India’s urban transport journey. With Bhopal joining the list, Metro services are now operational in 26 cities across the country, taking the total operational Metro network in India to 1,090 km. The Bhopal Metro marks a major step forward for the capital city of Madhya Pradesh, aimed at making urban travel faster, cleaner and more convenient for citizens. Developed under the leadership of the Hon’ble Prime Minister, the project represents a significant achievement towards smart, green and sustainable mobility. The Bhopal Metro has a total length of 30.8 km, comprising two corridors and one depot: Orange Line: 16.74 km Blue Line: 14.16 km Designed to connect major commercial and residential areas of the city, the Metro is expected to reduce traffic congestion and enhance the overall quality of life for residents. Inauguration of the Priority Corridor The first phase of the Bhopal Metro, the Orange Line Priority Corridor, was inaugurated today. The priority stretch of approximately 7 km includes eight elevated stations: AIIMS, Alkapuri, DRM Office, Rani Kamlapati, MP Nagar, Board Office Chauraha, Kendriya Vidyalaya and Subhash Nagar. This corridor will ensure smoother traffic flow on some of the city’s busiest routes, help reduce pollution levels and provide a safe and comfortable commuting experience. Key Features of Bhopal Metro The Bhopal Metro is equipped with modern, user-friendly and safety-focused facilities, including: Modern Facilities: High-speed lifts and escalators at all stations Accessible for All: Dedicated wheelchair spaces and easy access for Divyangjan Safety First: AI-based CCTV surveillance, Emergency Communication Buttons, Platform Screen Doors and Grade-4 Signalling Systems Smart Technology: Audio-visual passenger information systems and a high-tech Operations Control Centre Passenger Comfort: Fully air-conditioned coaches with comfortable seating and mobile charging points The Bhopal Metro is a symbol of the city’s progress towards sustainable urban development. By promoting smart, safe and environment-friendly mobility, it will significantly ease daily commuting and contribute to a cleaner urban environment. With the launch of Metro services, Bhopal takes a decisive step towards becoming a modern, green and accessible capital city. **** SK (Release ID: 2207030)",
    "scraped_at": "2025-12-20T17:34:13.688189"
  },
  {
    "id": "2207029",
    "ministry": "Ministry of Housing & Urban Affairs",
    "title": "Third Regional Meeting of Urban Development Ministers of North-Central States held in Bhopal today",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207029",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Housing & Urban Affairs Third Regional Meeting of Urban Development Ministers of North-Central States held in Bhopal today India will be Viksit@2047 when every household, village, city, and state is Viksit and Atmanirbhar: Shri Manohar Lal प्रविष्टि तिथि:\r\n                20 DEC 2025 7:04PM by PIB Delhi The third regional meeting of Urban Development Ministers was held in Bhopal on December 20, 2025 under the chairmanship of Hon’ble Union Minister of Housing and Urban Affairs, Shri Manohar Lal. The national level meeting of the Urban Development Ministers held on July 17, 2025 in New Delhi laid the foundation of this consultation at the regional level. The deliberations centered around key issues, challenges, and opportunities in urban development to chart a collective way forward, in line with the first and second regional meetings held in Bengaluru on October 30, 2025, and Hyderabad on November 18, 2025 respectively. The meeting was attended by Shri Mohan Yadav, Hon’ble Chief Minister, Madhya Pradesh, Shri Kailash Vijayvargiya, Hon’ble Minister of Urban Development and Housing Department, Madhya Pradesh, Ms. Pratima Bagri, Hon’ble Minister of State for Urban Development and Housing, Madhya Pradesh, Shri Arun Sao, Hon’ble Deputy Chief Minister and Hon’ble Minister of Urban Administration and Development, Chhattisgarh, Shri Jhabar Singh Kharra, Hon’ble Minister of State of Urban Development and Local Self-Governance Development, Rajasthan, Shri Arvind Kumar Sharma, Hon’ble Minister of Urban Development, Urban Employment and Poverty Alleviation, Energy, Uttar Pradesh, Shri Rakesh Rathore, Hon’ble State Minister of Urban Development, Uttar Pradesh, along with senior officers from the respective State Governments. The meeting was attended by senior officers from the Ministry of Housing and Urban Affairs. The regional meeting was hosted by the Ministry of Housing and Urban Affairs, Government of India in collaboration with the Urban Development Department, Government of Madhya Pradesh. The meeting brought together Urban Development Ministers and senior-level officials, including Additional Chief Secretaries and Principal Secretaries from the North-Central States Chhattisgarh, Delhi, Madhya Pradesh, Rajasthan and Uttar Pradesh . In his opening remarks, Hon’ble Union Minister said “India will be Viksit@2047, when every household, village, city, and state is Viksit and Atmanirbhar”. The Hon’ble Union Minister released the Swachh Survekshan 2025–26 toolkit. Seven IT platforms of the Government of Madhya Pradesh were also video launched to strengthen simple, convenient, and effective citizen-centric service delivery. The Hon’ble Union Minister reviewed the progress of various central missions. Under the Swachh Bharat Mission-Urban (SBM-U), t he Hon’ble Minister emphasised the need for adoption of dumpsites under the Dumpsite Remediation Accelerator Programme (DRAP) framework by political and administrative leadership, with a focus on fast-tracking remediation efforts. All participating States were asked to ensure time-bound implementation of action plans prepared under Swachh Shehar Jodi (SSJ) through effective coordination between mentor and mentee cities. Under the Atal Mission for Rejuvenation and Urban Transformation (AMRUT), the Hon'ble Minister emphasised the need for strengthening on-ground implementation, improving the quality and sustainability of urban water and sanitation assets, and maximising the reuse of treated wastewater. All participating States were asked to accelerate project execution, enhance coordination, and achieve saturation in tap water supply and sewerage coverage. Under ‘Housing for All’ mission, completion of under construction Pradhan Mantri Awas Yojana - Urban (PMAY-U), houses and grounding of PMAY-2.0 houses was emphasised by Hon’ble Union Minister. He also encourages state officials to ensure the occupancy of AHP houses and making home loans available to beneficiaries. For this purpose, Angikaar campaign will be continued till March 2026 and public outreach will be carried out for convergence of various benefits to PMAY beneficiaries. Issues related to PM-eBus Sewa Scheme, were discussed along with densification of metro networks, and first-last mile connectivity under urban transport. The State Ministers appreciated MoHUA’s collaborative approach in engaging with states through such regional consultations. These regional meetings will be convened across other regions of the country to identify shared priorities, regional opportunities, and chart reform pathways for peer learning that can accelerate India’s urban transformation journey. The Hon’ble Union Minister also flagged off the new metro line and took the metro ride from Subhash Nagar metro station to AIIMS metro station with the Chief Minister of Madhya Pradesh. *** SK (रिलीज़ आईडी: 2207029) आगंतुक पटल  : 95 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी Ministry of Housing & Urban Affairs Third Regional Meeting of Urban Development Ministers of North-Central States held in Bhopal today India will be Viksit@2047 when every household, village, city, and state is Viksit and Atmanirbhar: Shri Manohar Lal प्रविष्टि तिथि:\r\n                        20 DEC 2025 7:04PM by PIB Delhi The third regional meeting of Urban Development Ministers was held in Bhopal on December 20, 2025 under the chairmanship of Hon’ble Union Minister of Housing and Urban Affairs, Shri Manohar Lal. The national level meeting of the Urban Development Ministers held on July 17, 2025 in New Delhi laid the foundation of this consultation at the regional level. The deliberations centered around key issues, challenges, and opportunities in urban development to chart a collective way forward, in line with the first and second regional meetings held in Bengaluru on October 30, 2025, and Hyderabad on November 18, 2025 respectively. The meeting was attended by Shri Mohan Yadav, Hon’ble Chief Minister, Madhya Pradesh, Shri Kailash Vijayvargiya, Hon’ble Minister of Urban Development and Housing Department, Madhya Pradesh, Ms. Pratima Bagri, Hon’ble Minister of State for Urban Development and Housing, Madhya Pradesh, Shri Arun Sao, Hon’ble Deputy Chief Minister and Hon’ble Minister of Urban Administration and Development, Chhattisgarh, Shri Jhabar Singh Kharra, Hon’ble Minister of State of Urban Development and Local Self-Governance Development, Rajasthan, Shri Arvind Kumar Sharma, Hon’ble Minister of Urban Development, Urban Employment and Poverty Alleviation, Energy, Uttar Pradesh, Shri Rakesh Rathore, Hon’ble State Minister of Urban Development, Uttar Pradesh, along with senior officers from the respective State Governments. The meeting was attended by senior officers from the Ministry of Housing and Urban Affairs. The regional meeting was hosted by the Ministry of Housing and Urban Affairs, Government of India in collaboration with the Urban Development Department, Government of Madhya Pradesh. The meeting brought together Urban Development Ministers and senior-level officials, including Additional Chief Secretaries and Principal Secretaries from the North-Central States Chhattisgarh, Delhi, Madhya Pradesh, Rajasthan and Uttar Pradesh . In his opening remarks, Hon’ble Union Minister said “India will be Viksit@2047, when every household, village, city, and state is Viksit and Atmanirbhar”. The Hon’ble Union Minister released the Swachh Survekshan 2025–26 toolkit. Seven IT platforms of the Government of Madhya Pradesh were also video launched to strengthen simple, convenient, and effective citizen-centric service delivery. The Hon’ble Union Minister reviewed the progress of various central missions. Under the Swachh Bharat Mission-Urban (SBM-U), t he Hon’ble Minister emphasised the need for adoption of dumpsites under the Dumpsite Remediation Accelerator Programme (DRAP) framework by political and administrative leadership, with a focus on fast-tracking remediation efforts. All participating States were asked to ensure time-bound implementation of action plans prepared under Swachh Shehar Jodi (SSJ) through effective coordination between mentor and mentee cities. Under the Atal Mission for Rejuvenation and Urban Transformation (AMRUT), the Hon'ble Minister emphasised the need for strengthening on-ground implementation, improving the quality and sustainability of urban water and sanitation assets, and maximising the reuse of treated wastewater. All participating States were asked to accelerate project execution, enhance coordination, and achieve saturation in tap water supply and sewerage coverage. Under ‘Housing for All’ mission, completion of under construction Pradhan Mantri Awas Yojana - Urban (PMAY-U), houses and grounding of PMAY-2.0 houses was emphasised by Hon’ble Union Minister. He also encourages state officials to ensure the occupancy of AHP houses and making home loans available to beneficiaries. For this purpose, Angikaar campaign will be continued till March 2026 and public outreach will be carried out for convergence of various benefits to PMAY beneficiaries. Issues related to PM-eBus Sewa Scheme, were discussed along with densification of metro networks, and first-last mile connectivity under urban transport. The State Ministers appreciated MoHUA’s collaborative approach in engaging with states through such regional consultations. These regional meetings will be convened across other regions of the country to identify shared priorities, regional opportunities, and chart reform pathways for peer learning that can accelerate India’s urban transformation journey. The Hon’ble Union Minister also flagged off the new metro line and took the metro ride from Subhash Nagar metro station to AIIMS metro station with the Chief Minister of Madhya Pradesh. *** SK (रिलीज़ आईडी: 2207029)",
    "scraped_at": "2025-12-20T17:34:15.804276"
  },
  {
    "id": "2207000",
    "ministry": "Ministry of Housing & Urban Affairs",
    "title": "MoHUA launches 10th Swachh Survekshan",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207000",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Housing & Urban Affairs MoHUA launches 10th Swachh Survekshan SS 2025-26 Theme: Swacchata Ki Nayi Pehel- Badhayein Haath, Karein Safai Saath Strengths Citizen Voice with Round-the-year Feedback New Award Categories Introduced for Swachh Survekshan 2025–26 प्रविष्टि तिथि:\r\n                20 DEC 2025 5:36PM by PIB Delhi Union Minister Shri  Manohar Lal, Minister for Housing and Urban Affairs, released the toolkit for the 10th edition of Swachh Survekshan in Bhopal, Madhya Pradesh today. Swachh Survekshan (SS), the world’s largest urban cleanliness survey, completes a decade. SS is not just an annual survey but a powerful management tool. With an aim to build Garbage Free Cities, it is catalysing change. This year the theme for Swachh Survekshan is: Swacchata Ki Nayi Pehel- Badhayein Haath, Karein Safai Saath (स्वच्छता की नई पहल - बढ़ाएं हाथ , करें सफाई साथ ). All States and Urban Local Bodies, including Municipal Commissioners and other State representatives, participated in the launch virtually. Fostering a healthy competition amongst cities, Swachh Survekshan has defined the matrix for swachhata . It has helped in benchmarking of assessment parameters , creating roadmap for Swachh Shehar, steps and components to become a Swachh Shehar and ultimately enabling cleaner cities through on-ground visible swachhata. Over the past 10 years, Swachh Survekshan has stood as a remarkable testament to collaboration and collective responsibility, reflecting the nation’s commitment to making cleanliness a way of life. — truly reflecting Swabhav Swachhata Sanskaar Swachhata . From 73 ULBs in 2016 to assessing 4900 UBLs in 2024, SS has been inspiring cities to raise sanitation standards and deliver quality services to their citizens. Over the years, citizens’ voice has become a strong tool for assessment in Swachh Survekshan. SS has consistently reflected the strength of citizens’ perception and engagement with swachhata, especially visible cleanliness. Further amplifying this, the 2025–26 toolkit has been designed to give citizens’ opinions greater power and weightage. Starting this year, citizens will be able to share feedback round the year through multiple platforms, including the Vote For My City App and Portal, MyGov App, Swachhata App, and QR codes. The citizen validation weightage has been increased considerably. Swachh Survekshan has been assessing Ganga towns as part of its urban cleanliness framework. Expanding its scope, the assessment will now include river towns across the country . A separate matrix has been introduced for coastal areas to bring it under the Swachh Survekshan ambit. MoHUA launched the largest time-bound and structured mentorship framework in urban waste management mentorship programme under SBM-U – Swachh Shehar Jodi (SSJ) , in Sept, 2025. 72 Mentor and 200 mentee cities signed MoUs to foster knowledge transfer, peer learning, and replication of best practices. To strengthen mentorship and peer learning, a new award category has been introduced to recognize Swachh Shehar Jodis, based on the average score of jodis, with recognition across each population category. To reinforce quality assurance and institutionalize strong feedback and grievance redressal, Swachh Survekshan has introduced a tightly monitored, protocol-driven assessment framework. A national oversight team anchors the process, complemented— for the first time—by a dedicated single-point-of-contact in-charge for each State/UT. Over 3,000 trained field assessors from across the country will conduct a 45-day, on-ground survey covering all ULBs, supported by real-time, GPS-enabled monitoring. The entire process—from evidence submission to verification—is fully digital, transparent, and rigorously quality-checked. Following the release of the toolkit, the field assessments are expected to begin from mid-February to March 2026. The GFC and ODF certification assessment will also commence from mid Feb., 2026. Swachh Bharat Mission–Urban stands as a testament to the world’s largest Jan Andolan , with Swachh Survekshan at its heart—amplifying the voice of every citizen. It has evolved beyond a city-ranking exercise into a powerful platform that empowers citizens as equal stakeholders, fostering ownership, accountability, and pride. As the race to become the cleanest city intensifies, Swachh Survekshan continues to strengthen a robust ecosystem of feedback and grievance redressal, transforming cleanliness into a shared national aspiration and a matter of collective pride. ***** SK (रिलीज़ आईडी: 2207000) आगंतुक पटल  : 347 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Gujarati , Urdu , हिन्दी , Marathi , Malayalam Ministry of Housing & Urban Affairs MoHUA launches 10th Swachh Survekshan SS 2025-26 Theme: Swacchata Ki Nayi Pehel- Badhayein Haath, Karein Safai Saath Strengths Citizen Voice with Round-the-year Feedback New Award Categories Introduced for Swachh Survekshan 2025–26 प्रविष्टि तिथि:\r\n                        20 DEC 2025 5:36PM by PIB Delhi Union Minister Shri  Manohar Lal, Minister for Housing and Urban Affairs, released the toolkit for the 10th edition of Swachh Survekshan in Bhopal, Madhya Pradesh today. Swachh Survekshan (SS), the world’s largest urban cleanliness survey, completes a decade. SS is not just an annual survey but a powerful management tool. With an aim to build Garbage Free Cities, it is catalysing change. This year the theme for Swachh Survekshan is: Swacchata Ki Nayi Pehel- Badhayein Haath, Karein Safai Saath (स्वच्छता की नई पहल - बढ़ाएं हाथ , करें सफाई साथ ). All States and Urban Local Bodies, including Municipal Commissioners and other State representatives, participated in the launch virtually. Fostering a healthy competition amongst cities, Swachh Survekshan has defined the matrix for swachhata . It has helped in benchmarking of assessment parameters , creating roadmap for Swachh Shehar, steps and components to become a Swachh Shehar and ultimately enabling cleaner cities through on-ground visible swachhata. Over the past 10 years, Swachh Survekshan has stood as a remarkable testament to collaboration and collective responsibility, reflecting the nation’s commitment to making cleanliness a way of life. — truly reflecting Swabhav Swachhata Sanskaar Swachhata . From 73 ULBs in 2016 to assessing 4900 UBLs in 2024, SS has been inspiring cities to raise sanitation standards and deliver quality services to their citizens. Over the years, citizens’ voice has become a strong tool for assessment in Swachh Survekshan. SS has consistently reflected the strength of citizens’ perception and engagement with swachhata, especially visible cleanliness. Further amplifying this, the 2025–26 toolkit has been designed to give citizens’ opinions greater power and weightage. Starting this year, citizens will be able to share feedback round the year through multiple platforms, including the Vote For My City App and Portal, MyGov App, Swachhata App, and QR codes. The citizen validation weightage has been increased considerably. Swachh Survekshan has been assessing Ganga towns as part of its urban cleanliness framework. Expanding its scope, the assessment will now include river towns across the country . A separate matrix has been introduced for coastal areas to bring it under the Swachh Survekshan ambit. MoHUA launched the largest time-bound and structured mentorship framework in urban waste management mentorship programme under SBM-U – Swachh Shehar Jodi (SSJ) , in Sept, 2025. 72 Mentor and 200 mentee cities signed MoUs to foster knowledge transfer, peer learning, and replication of best practices. To strengthen mentorship and peer learning, a new award category has been introduced to recognize Swachh Shehar Jodis, based on the average score of jodis, with recognition across each population category. To reinforce quality assurance and institutionalize strong feedback and grievance redressal, Swachh Survekshan has introduced a tightly monitored, protocol-driven assessment framework. A national oversight team anchors the process, complemented— for the first time—by a dedicated single-point-of-contact in-charge for each State/UT. Over 3,000 trained field assessors from across the country will conduct a 45-day, on-ground survey covering all ULBs, supported by real-time, GPS-enabled monitoring. The entire process—from evidence submission to verification—is fully digital, transparent, and rigorously quality-checked. Following the release of the toolkit, the field assessments are expected to begin from mid-February to March 2026. The GFC and ODF certification assessment will also commence from mid Feb., 2026. Swachh Bharat Mission–Urban stands as a testament to the world’s largest Jan Andolan , with Swachh Survekshan at its heart—amplifying the voice of every citizen. It has evolved beyond a city-ranking exercise into a powerful platform that empowers citizens as equal stakeholders, fostering ownership, accountability, and pride. As the race to become the cleanest city intensifies, Swachh Survekshan continues to strengthen a robust ecosystem of feedback and grievance redressal, transforming cleanliness into a shared national aspiration and a matter of collective pride. ***** SK (रिलीज़ आईडी: 2207000)",
    "scraped_at": "2025-12-20T17:34:18.326926"
  },
  {
    "id": "2206998",
    "ministry": "Ministry of Power",
    "title": "Union Minister Shri Manohar Lal chairs meeting of the Consultative Committee for Ministry of Power",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206998",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Power Union Minister Shri Manohar Lal chairs meeting of the Consultative Committee for Ministry of Power Detailed Discussions held on draft Electricity (Amendment ), Bill,2025 प्रविष्टि तिथि:\r\n                20 DEC 2025 5:33PM by PIB Delhi The Meeting of the Parliamentary Consultative Committee for the Ministry of Power was held in New Delhi on 18 th December,2025. Shri Manohar Lal, Union Minister for Power and Housing & Urban Affairs chaired the meeting, wherein Members of Parliament of various political parties from Lok Sabha and Rajya Sabha took part in the meeting. The meeting was called by the Minister of Power to consult the members on various proposals in the Draft Electricity (Amendment) Bill, 2025, which had been released by the ministry for consultation of stakeholders. Shri Manohar Lal highlighted that the Draft Electricity (Amendment) Bill, 2025 (“Bill”), is of great national importance as it seeks to strengthen the legislative foundation of India’s power sector in the context of the aspirations for Viksit Bharat @ 2047. After the enactment of the Act in 2003, the country has made commendable progress in all aspects of power sector. However, challenges, especially in the distribution segment in form of persistent financial stress continues. He informed that the provisions in the Bill have been proposed to mandate cost-reﬂective tariﬀs and to empower Commissions to act suo- motu when utilities delay tariff filings. He clarified that State Governments may continue to provide subsidies to priority consumer groups such as domestic and agricultural consumers and there may not be any increase in cost for such consumers. This ensures that ﬁnancial discipline and consumer welfare go hand in hand. The Bill also seeks to enhance economic competitiveness of the Indian industry. By reducing distortions caused by cross-subsidies and surcharges, the Bill aims to support Indian industry, including MSMEs, to grow, expand employment, and compete globally. He emphasised the need to make the cost of electricity reasonable for the industries for the benefit of all the citizens in the country. The Bill also proposes to empower SERCs, in consultation with the State Government, to exempt DISCOMs from the obligation to supply large consumers. These consumers can procure power at competitive rates from other sources. At the same time, the ﬁxed cost burden on DISCOMs associated with supplying electricity to these consumers will be reduced. This will benefit smaller consumers. He clarified that the large consumers will have choice to exit after giving  notice with reasonable time. He also noted that supporting the increased use of electricity from non-fossil sources is a collective responsibility. A minimum obligation for the use of non-fossil source electricity is proposed under the Bill. To ensure the availability of cost-competitive and adequate renewable energy, it is proposed that capacity addition will also be enabled through market mechanisms in addition to through agreements by the DISCOMs, which will also reduce burden on DISCOMs. He also informed that Government is committed to enhance ease of living and ease of doing business. The Bill proposes provisions to ensure better service for the general public, reduce ﬁnancial and compliance burden, and to create better environment for business. To strengthen regulatory governance, several provisions have been proposed under the draft Bill. The draft Bill also proposes to expand the strength of APTEL to handle increasing case loads. The Bill includes important operational reforms such as incorporating Right-of-Way provisions directly in the Act. The Bill also proposes enabling distribution network sharing to avoid duplication. He emphasised that by allowing sharing of network, the consumers will be benefitted. He clarified that the apprehensions about privatisation and increase in cost or adverse effect on employees has no basis. Suitable regulatory and policy measures will be taken to ensure that there will not be any adverse effect on any class of consumers or employees. The Bill envisages the establishment of the Electricity Council to foster cooperative federalism and national consensus on power sector reforms. The minister assured that Central Government will take necessary steps for reasonable compensation to farmers for their land used for laying of electric lines. He informed the members that Ministry of Power has already issued guidelines for determination of compensation linking it to market rate. Members of Parliament provided several suggestions concerning various provisions of the Bill. They also commended the initiatives and efforts of the power ministry towards building a future-ready power sector. Shri Manohar Lal concluded the meeting by expressing gratitude to the participants for their valuable contributions and sought support in finalising the Bill and passing the bill in Parliament for the benefit of the country. *** NR/AP (रिलीज़ आईडी: 2206998) आगंतुक पटल  : 180 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Power Union Minister Shri Manohar Lal chairs meeting of the Consultative Committee for Ministry of Power Detailed Discussions held on draft Electricity (Amendment ), Bill,2025 प्रविष्टि तिथि:\r\n                        20 DEC 2025 5:33PM by PIB Delhi The Meeting of the Parliamentary Consultative Committee for the Ministry of Power was held in New Delhi on 18 th December,2025. Shri Manohar Lal, Union Minister for Power and Housing & Urban Affairs chaired the meeting, wherein Members of Parliament of various political parties from Lok Sabha and Rajya Sabha took part in the meeting. The meeting was called by the Minister of Power to consult the members on various proposals in the Draft Electricity (Amendment) Bill, 2025, which had been released by the ministry for consultation of stakeholders. Shri Manohar Lal highlighted that the Draft Electricity (Amendment) Bill, 2025 (“Bill”), is of great national importance as it seeks to strengthen the legislative foundation of India’s power sector in the context of the aspirations for Viksit Bharat @ 2047. After the enactment of the Act in 2003, the country has made commendable progress in all aspects of power sector. However, challenges, especially in the distribution segment in form of persistent financial stress continues. He informed that the provisions in the Bill have been proposed to mandate cost-reﬂective tariﬀs and to empower Commissions to act suo- motu when utilities delay tariff filings. He clarified that State Governments may continue to provide subsidies to priority consumer groups such as domestic and agricultural consumers and there may not be any increase in cost for such consumers. This ensures that ﬁnancial discipline and consumer welfare go hand in hand. The Bill also seeks to enhance economic competitiveness of the Indian industry. By reducing distortions caused by cross-subsidies and surcharges, the Bill aims to support Indian industry, including MSMEs, to grow, expand employment, and compete globally. He emphasised the need to make the cost of electricity reasonable for the industries for the benefit of all the citizens in the country. The Bill also proposes to empower SERCs, in consultation with the State Government, to exempt DISCOMs from the obligation to supply large consumers. These consumers can procure power at competitive rates from other sources. At the same time, the ﬁxed cost burden on DISCOMs associated with supplying electricity to these consumers will be reduced. This will benefit smaller consumers. He clarified that the large consumers will have choice to exit after giving  notice with reasonable time. He also noted that supporting the increased use of electricity from non-fossil sources is a collective responsibility. A minimum obligation for the use of non-fossil source electricity is proposed under the Bill. To ensure the availability of cost-competitive and adequate renewable energy, it is proposed that capacity addition will also be enabled through market mechanisms in addition to through agreements by the DISCOMs, which will also reduce burden on DISCOMs. He also informed that Government is committed to enhance ease of living and ease of doing business. The Bill proposes provisions to ensure better service for the general public, reduce ﬁnancial and compliance burden, and to create better environment for business. To strengthen regulatory governance, several provisions have been proposed under the draft Bill. The draft Bill also proposes to expand the strength of APTEL to handle increasing case loads. The Bill includes important operational reforms such as incorporating Right-of-Way provisions directly in the Act. The Bill also proposes enabling distribution network sharing to avoid duplication. He emphasised that by allowing sharing of network, the consumers will be benefitted. He clarified that the apprehensions about privatisation and increase in cost or adverse effect on employees has no basis. Suitable regulatory and policy measures will be taken to ensure that there will not be any adverse effect on any class of consumers or employees. The Bill envisages the establishment of the Electricity Council to foster cooperative federalism and national consensus on power sector reforms. The minister assured that Central Government will take necessary steps for reasonable compensation to farmers for their land used for laying of electric lines. He informed the members that Ministry of Power has already issued guidelines for determination of compensation linking it to market rate. Members of Parliament provided several suggestions concerning various provisions of the Bill. They also commended the initiatives and efforts of the power ministry towards building a future-ready power sector. Shri Manohar Lal concluded the meeting by expressing gratitude to the participants for their valuable contributions and sought support in finalising the Bill and passing the bill in Parliament for the benefit of the country. *** NR/AP (रिलीज़ आईडी: 2206998)",
    "scraped_at": "2025-12-20T17:34:20.453365"
  },
  {
    "id": "2206974",
    "ministry": "Ministry of Science & Technology",
    "title": "Obesity Cannot Be Treated with Shortcuts; Curb Misinformation, Use Weight-Reducing Drugs Judiciously: Dr Jitendra Singh",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206974",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Science & Technology Obesity Cannot Be Treated with Shortcuts; Curb Misinformation, Use Weight-Reducing Drugs Judiciously: Dr Jitendra Singh Minister addresses the inaugural session of the 2-day \"Asia Oceania Conference on Obesity\" (AOCO), attended by some of the leading experts in the field including Dr Kyoung Kon Kim, Dr Volkan Yumuk, Dr Mahendra Narwaria and others; Obesity Too Serious an issue to Be Left to a Doctor Alone; Every Citizen Has a Role to Play, Says the Minister 63% Deaths in India Linked to Non-Communicable Diseases which are, one way or another, related to Obesity; Time for Society-Wide Awakening,” says Dr Jitendra Singh FIT India, Khelo India and PM Narendra Modi’s Focus on Diet Highlight National Health Priority: Dr Jitendra Singh प्रविष्टि तिथि:\r\n                20 DEC 2025 4:27PM by PIB Delhi Union Minister of State (Independent Charge) for Science & Technology, Earth Sciences and MoS PMO, Personnel, Public Grievances, Pensions, Atomic Energy and Space, Dr Jitendra Singh, today said that weight reducing or anti-obesity drugs, currently available, ought to be used very judiciously. The Minister, who is himself a noted Diabetologist and Professor of Medicine, said that obesity is a complex, chronic and relapsing disorder, and not merely a cosmetic or lifestyle concern, calling for a whole-of-society approach to effectively combat what has emerged as one of India’s most pressing public health challenges. Addressing the inaugural session of the 2-day \"Asia Oceania Conference on Obesity\" (AOCO), attended by some of the  leading  experts in the field including Dr Kyoung Kon Kim,, Dr Volkan Yumuk, Dr Mahendra Narwaria, Dr B.M. Makkar, Dr Banshi Saboo and others, the Minister said the very fact that doctors, researchers, policymakers, and other stakeholders were coming together under one roof reflected the growing seriousness of the obesity epidemic in India. Drawing an analogy, he remarked that just as economics is too serious a subject to be left to an economist alone, obesity is too serious a subject to be left to a physician or epidemiologist alone, as it has deep social, cultural, and environmental roots. Dr Jitendra Singh highlighted that India is witnessing a worrying rise in Non-Communicable Diseases, which are linked to obesity in one way or another, and which account for nearly 63 per cent of overall mortality. He pointed out that conditions such as type 2 diabetes, cardiovascular diseases and certain cancers are linked to obesity, including central or visceral obesity, which is particularly prevalent among Indians and poses independent health risks even beyond overall body weight. Referring to the leadership of Narendra Modi, the Minister said it is unprecedented in the Indian context for a Prime Minister to repeatedly speak about obesity and lifestyle-related diseases from national platforms. He highlighted that the Prime Minister’s emphasis on small, sustainable changes in food habits and daily routines reflects a clear recognition of obesity as a national priority, closely aligned with initiatives such as FIT India, Khelo India and the broader vision of preventive healthcare. Dr Jitendra Singh said that since 2014, health has moved to the centre of national policymaking, with the government focusing on prevention, affordability, and early intervention. He cited Ayushman Bharat, mass screening programmes and India’s growing global leadership in preventive healthcare, including the development of indigenous vaccines, as examples of this shift. He also highlighted the government’s emphasis on integrating traditional systems of medicine through a dedicated Ministry of AYUSH. The Minister cautioned against the growing commercialization and misinformation surrounding obesity management, warning that unscientific claims and so-called quick-fix solutions often mislead people and distract them from evidence-based care. He stressed that formal approvals alone do not always tell the full story in clinical practice, recalling how the widespread adoption of refined oils in earlier decades led to unintended long-term health consequences. Emphasising the need to protect public interest, he called for sustained efforts to counter myths and disinformation, particularly through the responsible use of modern media and digital platforms. Emphasising the need to reach younger generations, Dr Jitendra Singh said public awareness must go beyond medical conferences and expert discussions. “We must talk not only to those who know, but also to those who do not know that they do not know,” he remarked, adding that safeguarding the health and energy of India’s youth is essential to realise the vision of a developed India by 2047. During the event, the Minister also launched the AIAARO Obesity Registry, a significant initiative aimed at strengthening India’s obesity research ecosystem through systematic data collection, evidence-based insights, and long-term policy support. The two-day Asia Oceania Conference on Obesity (AOCO) is the flagship conference of the Asia Oceania Association for the Study of Obesity (AOASO), a regional body representing obesity societies across Asia and Oceania. In India, the conference is being organised by the All-India Association for Advancing Research in Obesity (AIAARO), the national obesity society and a member of AOASO, in association with AOASO and with the support of IAEPEN India and OSSI. The conference aims to empower physicians, researchers, and policymakers by sharing global best practices, advancing research collaboration, and strengthening evidence-based management of obesity. By bringing together national and international experts, AOCO seeks to address obesity not only as a medical condition, but as a societal challenge requiring coordinated action, sustained awareness, and informed public participation. ***** NKR/AK/MJ (रिलीज़ आईडी: 2206974) आगंतुक पटल  : 250 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Tamil , Malayalam Ministry of Science & Technology Obesity Cannot Be Treated with Shortcuts; Curb Misinformation, Use Weight-Reducing Drugs Judiciously: Dr Jitendra Singh Minister addresses the inaugural session of the 2-day \"Asia Oceania Conference on Obesity\" (AOCO), attended by some of the leading experts in the field including Dr Kyoung Kon Kim, Dr Volkan Yumuk, Dr Mahendra Narwaria and others; Obesity Too Serious an issue to Be Left to a Doctor Alone; Every Citizen Has a Role to Play, Says the Minister 63% Deaths in India Linked to Non-Communicable Diseases which are, one way or another, related to Obesity; Time for Society-Wide Awakening,” says Dr Jitendra Singh FIT India, Khelo India and PM Narendra Modi’s Focus on Diet Highlight National Health Priority: Dr Jitendra Singh प्रविष्टि तिथि:\r\n                        20 DEC 2025 4:27PM by PIB Delhi Union Minister of State (Independent Charge) for Science & Technology, Earth Sciences and MoS PMO, Personnel, Public Grievances, Pensions, Atomic Energy and Space, Dr Jitendra Singh, today said that weight reducing or anti-obesity drugs, currently available, ought to be used very judiciously. The Minister, who is himself a noted Diabetologist and Professor of Medicine, said that obesity is a complex, chronic and relapsing disorder, and not merely a cosmetic or lifestyle concern, calling for a whole-of-society approach to effectively combat what has emerged as one of India’s most pressing public health challenges. Addressing the inaugural session of the 2-day \"Asia Oceania Conference on Obesity\" (AOCO), attended by some of the  leading  experts in the field including Dr Kyoung Kon Kim,, Dr Volkan Yumuk, Dr Mahendra Narwaria, Dr B.M. Makkar, Dr Banshi Saboo and others, the Minister said the very fact that doctors, researchers, policymakers, and other stakeholders were coming together under one roof reflected the growing seriousness of the obesity epidemic in India. Drawing an analogy, he remarked that just as economics is too serious a subject to be left to an economist alone, obesity is too serious a subject to be left to a physician or epidemiologist alone, as it has deep social, cultural, and environmental roots. Dr Jitendra Singh highlighted that India is witnessing a worrying rise in Non-Communicable Diseases, which are linked to obesity in one way or another, and which account for nearly 63 per cent of overall mortality. He pointed out that conditions such as type 2 diabetes, cardiovascular diseases and certain cancers are linked to obesity, including central or visceral obesity, which is particularly prevalent among Indians and poses independent health risks even beyond overall body weight. Referring to the leadership of Narendra Modi, the Minister said it is unprecedented in the Indian context for a Prime Minister to repeatedly speak about obesity and lifestyle-related diseases from national platforms. He highlighted that the Prime Minister’s emphasis on small, sustainable changes in food habits and daily routines reflects a clear recognition of obesity as a national priority, closely aligned with initiatives such as FIT India, Khelo India and the broader vision of preventive healthcare. Dr Jitendra Singh said that since 2014, health has moved to the centre of national policymaking, with the government focusing on prevention, affordability, and early intervention. He cited Ayushman Bharat, mass screening programmes and India’s growing global leadership in preventive healthcare, including the development of indigenous vaccines, as examples of this shift. He also highlighted the government’s emphasis on integrating traditional systems of medicine through a dedicated Ministry of AYUSH. The Minister cautioned against the growing commercialization and misinformation surrounding obesity management, warning that unscientific claims and so-called quick-fix solutions often mislead people and distract them from evidence-based care. He stressed that formal approvals alone do not always tell the full story in clinical practice, recalling how the widespread adoption of refined oils in earlier decades led to unintended long-term health consequences. Emphasising the need to protect public interest, he called for sustained efforts to counter myths and disinformation, particularly through the responsible use of modern media and digital platforms. Emphasising the need to reach younger generations, Dr Jitendra Singh said public awareness must go beyond medical conferences and expert discussions. “We must talk not only to those who know, but also to those who do not know that they do not know,” he remarked, adding that safeguarding the health and energy of India’s youth is essential to realise the vision of a developed India by 2047. During the event, the Minister also launched the AIAARO Obesity Registry, a significant initiative aimed at strengthening India’s obesity research ecosystem through systematic data collection, evidence-based insights, and long-term policy support. The two-day Asia Oceania Conference on Obesity (AOCO) is the flagship conference of the Asia Oceania Association for the Study of Obesity (AOASO), a regional body representing obesity societies across Asia and Oceania. In India, the conference is being organised by the All-India Association for Advancing Research in Obesity (AIAARO), the national obesity society and a member of AOASO, in association with AOASO and with the support of IAEPEN India and OSSI. The conference aims to empower physicians, researchers, and policymakers by sharing global best practices, advancing research collaboration, and strengthening evidence-based management of obesity. By bringing together national and international experts, AOCO seeks to address obesity not only as a medical condition, but as a societal challenge requiring coordinated action, sustained awareness, and informed public participation. ***** NKR/AK/MJ (रिलीज़ आईडी: 2206974)",
    "scraped_at": "2025-12-20T17:34:22.607296"
  },
  {
    "id": "2207097",
    "ministry": "Ministry of Ports, Shipping and Waterways",
    "title": "“PM Narendra Modi is the torchbearer and architect of Assam and Northeast’s development:” Sarbananda Sonowal",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207097",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Ports, Shipping and Waterways “PM Narendra Modi is the torchbearer and architect of Assam and Northeast’s development:” Sarbananda Sonowal Union Minister Sarbananda Sonowal joins PM Narendra Modi as he inaugurated new terminal at Lokpriya Gopinath Bordoloi International Airport PM Narendra Modi unveiled a statue of Bharat Ratna Lokpriya Gopinath Bordoloi at the airport प्रविष्टि तिथि:\r\n                20 DEC 2025 9:11PM by PIB Delhi New Delhi , December 20, 202 5: The Union Minister of Ports, Shipping & Waterways (MoPSW), Sarbananda Sonowal said that Prime Minister Narendra Modi is the torchbearer and architect of Assam and the Northeast’s transformation, as the prime minister inaugurated the new terminal building of Lokpriya Gopinath Bordoloi International Airport in Guwahati. Union Minister Sarbananda Sonowal accompanied the Prime Minister Narendra Modi during the inauguration ceremony in the presence of dignitaries. Modi also unveiled a statue of Bharat Ratna Lokpriya Gopinath Bordoloi at the airport. Recalling the Prime Minister’s visit to Assam, Sonowal said that since 2014, the development landscape of Assam and the entire Northeast has undergone a rapid transformation under Modi’s dynamic leadership. A region that was once neglected during previous Congress governments has now emerged as one of the driving forces of India’s economic growth, he said, adding that the Northeast has risen as the nation’s “Ashtalakshmi” and a new engine of New India. “The inauguration of the new terminal marks the beginning of a new chapter for international air connectivity in Assam. The decision to construct this terminal was taken through a memorandum of understanding signed during the first Advantage Assam summit in 2018, under the guidance of Prime Minister Narendra Modi, and the foundation stone for the project was also laid that year,” said Union Minister Sarbananda Sonowal. Referring to Modi’s emphasis on “transformation through transport,” Sonowal said the new terminal building inaugurated today will serve as a major milestone in Assam’s journey toward prosperity and progress. For more than six decades, the state’s principal airport operated with limited capacity, he said, adding that Guwahati’s growing role as a gateway to Southeast Asia has made this expansion critical for strengthening connectivity and mobility. Spread over 1.40 lakh square meters and nearly seven times larger than the previous terminal, the new facility will increase the airport’s annual passenger handling capacity from 3.4 million to more than 13 million. Built at a cost of nearly ₹4,000 crore, the terminal connects Guwahati with world-class aviation services, Sonowal said. The minister also welcomed the unveiling of the statue of Bharat Ratna Lokpriya Gopinath Bordoloi at the airport in Guwahati. Bordoloi’s vision, courage and decisive leadership safeguarded Assam’s identity and existence during the most challenging phase of India’s freedom struggle, while strengthening the country’s unity and integrity. “The great leader who secured Assam’s future now stands as a powerful symbol at India’s gateway to Southeast Asia,” Sarbananda Sonowal said, adding that Bordoloi’s exemplary service to national unity, integrity and development will continue to inspire generations in building a strong and developed India. **** PN/IY (रिलीज़ आईडी: 2207097) आगंतुक पटल  : 111 Ministry of Ports, Shipping and Waterways “PM Narendra Modi is the torchbearer and architect of Assam and Northeast’s development:” Sarbananda Sonowal Union Minister Sarbananda Sonowal joins PM Narendra Modi as he inaugurated new terminal at Lokpriya Gopinath Bordoloi International Airport PM Narendra Modi unveiled a statue of Bharat Ratna Lokpriya Gopinath Bordoloi at the airport प्रविष्टि तिथि:\r\n                        20 DEC 2025 9:11PM by PIB Delhi New Delhi , December 20, 202 5: The Union Minister of Ports, Shipping & Waterways (MoPSW), Sarbananda Sonowal said that Prime Minister Narendra Modi is the torchbearer and architect of Assam and the Northeast’s transformation, as the prime minister inaugurated the new terminal building of Lokpriya Gopinath Bordoloi International Airport in Guwahati. Union Minister Sarbananda Sonowal accompanied the Prime Minister Narendra Modi during the inauguration ceremony in the presence of dignitaries. Modi also unveiled a statue of Bharat Ratna Lokpriya Gopinath Bordoloi at the airport. Recalling the Prime Minister’s visit to Assam, Sonowal said that since 2014, the development landscape of Assam and the entire Northeast has undergone a rapid transformation under Modi’s dynamic leadership. A region that was once neglected during previous Congress governments has now emerged as one of the driving forces of India’s economic growth, he said, adding that the Northeast has risen as the nation’s “Ashtalakshmi” and a new engine of New India. “The inauguration of the new terminal marks the beginning of a new chapter for international air connectivity in Assam. The decision to construct this terminal was taken through a memorandum of understanding signed during the first Advantage Assam summit in 2018, under the guidance of Prime Minister Narendra Modi, and the foundation stone for the project was also laid that year,” said Union Minister Sarbananda Sonowal. Referring to Modi’s emphasis on “transformation through transport,” Sonowal said the new terminal building inaugurated today will serve as a major milestone in Assam’s journey toward prosperity and progress. For more than six decades, the state’s principal airport operated with limited capacity, he said, adding that Guwahati’s growing role as a gateway to Southeast Asia has made this expansion critical for strengthening connectivity and mobility. Spread over 1.40 lakh square meters and nearly seven times larger than the previous terminal, the new facility will increase the airport’s annual passenger handling capacity from 3.4 million to more than 13 million. Built at a cost of nearly ₹4,000 crore, the terminal connects Guwahati with world-class aviation services, Sonowal said. The minister also welcomed the unveiling of the statue of Bharat Ratna Lokpriya Gopinath Bordoloi at the airport in Guwahati. Bordoloi’s vision, courage and decisive leadership safeguarded Assam’s identity and existence during the most challenging phase of India’s freedom struggle, while strengthening the country’s unity and integrity. “The great leader who secured Assam’s future now stands as a powerful symbol at India’s gateway to Southeast Asia,” Sarbananda Sonowal said, adding that Bordoloi’s exemplary service to national unity, integrity and development will continue to inspire generations in building a strong and developed India. **** PN/IY (रिलीज़ आईडी: 2207097)",
    "scraped_at": "2025-12-20T17:34:24.244629"
  },
  {
    "id": "2207072",
    "ministry": "Ministry of Textiles",
    "title": "Ministry of Textiles convenes the first Coordination Committee Meeting of Textile Research Associations (TRAs).",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207072",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Textiles Ministry of Textiles convenes the first Coordination Committee Meeting of Textile Research Associations (TRAs). प्रविष्टि तिथि:\r\n                20 DEC 2025 8:20PM by PIB Delhi The Ministry of Textiles today convened the 1 st Coordination Committee Meeting of Textile Research Associations (TRAs) at Vigyan Bhawan, New Delhi under the gracious presence of Union Minister of Textiles Shri. Giriraj Singh and under the chairpersonship of Secretary (Textiles) Smt. Neelam Shami Rao, marking a significant step towards strengthening coordination, effectiveness, and outcome orientation of textile research and development activities in the country. The meeting was attended by senior officers of the Ministry, senior representatives of Textile Research Associations, EPCs, IIT Delhi, amongst others. It was a full day rigorously brainstorming meeting. The Committee deliberated on the strategic role of Textile Research Associations (TRAs) in advancing fibre science, technical textiles, sustainability and innovation-led growth. Emphasis was placed on a “Research for Industry” approach, with focused discussions on strengthening Centres of Excellence (CoEs), particularly in the areas of sustainability and recycling. Key areas included upgradation of laboratory infrastructure to global standards, promotion of industry-driven and application-oriented research, development of sustainable and circular textile solutions, and formulation of a coordinated national textile research framework. The Ministry also highlighted the growing importance of smart textiles and emphasized enhanced research through convergence with other Government R&D initiatives, including schemes under CSIR, and collaboration with academic institutions for effective knowledge dissemination. Emerging applications such as predictive modelling, eco-efficient material blends, electronic fibres, and advanced e-textile systems for healthcare, defence, and intelligent environments were discussed. Flagship Government initiatives such as the National Technical Textiles Mission (NTTM), PM MITRA Parks, and various export promotion and support schemes were highlighted as key enablers for driving innovation, improving competitiveness, and positioning India as a global leader in the textile sector. The meeting concluded with a shared resolve to strengthen coordination among TRAs and to leverage research, innovation, and collaboration to support the long-term growth and global positioning of the Indian textile industry. ******************* MAM/VN (रिलीज़ आईडी: 2207072) आगंतुक पटल  : 87 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu Ministry of Textiles Ministry of Textiles convenes the first Coordination Committee Meeting of Textile Research Associations (TRAs). प्रविष्टि तिथि:\r\n                        20 DEC 2025 8:20PM by PIB Delhi The Ministry of Textiles today convened the 1 st Coordination Committee Meeting of Textile Research Associations (TRAs) at Vigyan Bhawan, New Delhi under the gracious presence of Union Minister of Textiles Shri. Giriraj Singh and under the chairpersonship of Secretary (Textiles) Smt. Neelam Shami Rao, marking a significant step towards strengthening coordination, effectiveness, and outcome orientation of textile research and development activities in the country. The meeting was attended by senior officers of the Ministry, senior representatives of Textile Research Associations, EPCs, IIT Delhi, amongst others. It was a full day rigorously brainstorming meeting. The Committee deliberated on the strategic role of Textile Research Associations (TRAs) in advancing fibre science, technical textiles, sustainability and innovation-led growth. Emphasis was placed on a “Research for Industry” approach, with focused discussions on strengthening Centres of Excellence (CoEs), particularly in the areas of sustainability and recycling. Key areas included upgradation of laboratory infrastructure to global standards, promotion of industry-driven and application-oriented research, development of sustainable and circular textile solutions, and formulation of a coordinated national textile research framework. The Ministry also highlighted the growing importance of smart textiles and emphasized enhanced research through convergence with other Government R&D initiatives, including schemes under CSIR, and collaboration with academic institutions for effective knowledge dissemination. Emerging applications such as predictive modelling, eco-efficient material blends, electronic fibres, and advanced e-textile systems for healthcare, defence, and intelligent environments were discussed. Flagship Government initiatives such as the National Technical Textiles Mission (NTTM), PM MITRA Parks, and various export promotion and support schemes were highlighted as key enablers for driving innovation, improving competitiveness, and positioning India as a global leader in the textile sector. The meeting concluded with a shared resolve to strengthen coordination among TRAs and to leverage research, innovation, and collaboration to support the long-term growth and global positioning of the Indian textile industry. ******************* MAM/VN (रिलीज़ आईडी: 2207072)",
    "scraped_at": "2025-12-20T17:34:26.261769"
  },
  {
    "id": "2206995",
    "ministry": "PIB Headquarters",
    "title": "SVANidhi: Empowering Street Vendors",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206995",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters SVANidhi: Empowering Street Vendors प्रविष्टि तिथि:\r\n                20 DEC 2025 5:13PM by PIB Delhi Key Takeaways Restructured PM SVANidhi Scheme aims to benefit 1.15 crore street vendors, including 50 lakh new beneficiaries. Lending period extended until March 31, 2030 . Introduction: Empowering the Enablers Street vendors are an important part of any city's informal economy. Street vending, a source of self-employment, has a prominent place in the urban supply chain as it provides convenient access to goods and services to all segments of the population close to their doorstep. Lack of recognition, limited access to formal credit, low levels of education and skills, lack of designated areas, and limited access to emerging market opportunities are a few constraints faced by the street vendors. On account of being unorganized and self-employed, street vendors and their families often lack linkages to social security, welfare, and assistance schemes and initiatives of the government. This makes street vendors and their families vulnerable in difficult times or when they may require assistance for unforeseen circumstances. Launched in June 2020, the PM SVANidhi scheme was formulated to assist the street vendors to overcome the adverse effects of financial constraints and to restart their lost businesses during the pandemic. However, since the inception of the scheme, it has proved to be more than financial support for street vendors and has given them a sense of identity & formal recognition for their contribution to the economy. On August 27, 2025, the Union Cabinet, chaired by Prime Minister Shri Narendra Modi, approved the “ Restructuring and extension of the lending period beyond 31.12.2024 of Prime Minister Street Vendor’s Atma Nirbhar Nidhi (PM SVANidhi) Scheme ”. The lending period has now been extended until March 31, 2030. The total outlay for the scheme is ₹7,332 crore . The restructured scheme aims to benefit 1.15 crore beneficiaries, including 50 lakh new beneficiaries . Loans Disbursal and Welfare Linkages The key features of the restructured scheme include enhanced loan amount across the first & second tranche, provision of UPI-linked RuPay Credit Card for beneficiaries who have timely repaid the second loan, and digital cashback incentives for retail & wholesale transactions. The scheme’s coverage is being expanded beyond statutory towns to census towns, peri-urban areas, etc., in a graded manner. The enhanced loan structure includes first tranche loans increased up to ₹15,000 (from ₹10,000) and second tranche loans increased up to ₹25,000 (from ₹20,000), while the third tranche is at ₹50,000. The introduction of UPI-linked RUPAY Credit Card would provide immediate access to credit to the street vendors in order to meet any emergent business and personal requirements. Further, in order to give a boost to digital adoption, the street vendors can avail a cashback on digital transactions: Cashback upto ₹1,200 on regular sales with maximum ₹100 per month Cashback upto ₹400 on wholesale purchases of ₹2,000 or more ( ₹20 per transaction with maximum ₹100 per quarter). The scheme has received national recognition, winning the Prime Minister’s Award for Excellence in Public Administration (2023) for Innovation (Central Level) for its outstanding contribution to boosting the economy, promoting livelihoods, advancing financial inclusion, and driving digital empowerment, and the Silver Award for Excellence in Government Process Re-engineering for Digital Transformation (2022). From Relief to Growth: The Restructured PM SVANidhi Scheme Started as micro-credit support during the COVID pandemic in 2020, the restructured scheme envisages the holistic development of street vendors by offering a reliable source of finance to support business expansion and opportunities for sustainable growth. The scheme not only fosters inclusive economic growth but also focuses on the socio-economic upliftment of street vendors and their families, enhancing their livelihoods and ultimately transforming urban spaces into a vibrant, self-sustaining ecosystem. The scheme also focuses on building the capacity of the street vendors with a focus on entrepreneurship, financial literacy, digital skills, and marketing through convergence. Standard hygiene and food safety training would be conducted for street food vendors, in partnership with FSSAI. Institutional Roles in Delivering PM SVANidhi Benefits Implementation of the scheme would be the joint responsibility of the Ministry of Housing & Urban Affairs (MoHUA) and Department of Financial Services (DFS) , with DFS being responsible for facilitating access to loans/ credit cards through banks/financial institution and their ground-level functionaries. Though PM SVANidhi is a Central Government initiative , its effective implementation is made possible through close collaboration with States, Banks, and Urban Local Bodies (ULBs) . State governments and ULBs play a key role by identifying street vendors, facilitating loan processes, and linking beneficiaries to welfare schemes. Banks ensure smooth loan disbursal, timely interest subsidy processing, and promote digital transactions. Together, these partners bring the scheme from policy to reality, creating opportunities and dignity for street vendors across the country. Boosting Outreach and Loan Disbursement through Lok Kalyan Mela and SVANidhi Sankalp Abhiyaan To further advance the holistic welfare and development of street vendors and their families, the ‘ SVANidhi se Samriddhi’ component is being strengthened through periodic Lok Kalyan Melas . The objective is to ensure that the benefits of various Government of India schemes reach vendors and their families in a saturation approach , fostering a more inclusive and supportive ecosystem for their growth and well-being. As part of the Special Campaign, “ Lok Kalyan Melas \" were conducted from 17 September to 15 October 2025 across all Urban Local Bodies (ULBs) and monitored through a dedicated Lok Kalyan Portal. These Melas facilitated vendor mobilization, submission of loan applications, accelerated disbursement of loans, and digital onboarding of beneficiaries. Achievements of PM SVANidhi Scheme Svanidhi Se Samriddhi: ‘ SVANidhi se Samriddhi ' has connected beneficiaries to 8 welfare schemes of the Government of India. Profiling of more than 47 lakh street vendors and families has been completed, and more than 1.46 crore schemes have been sanctioned as of 9th December 2025. Conclusion: The extension of the PM SVANidhi Scheme not only ensures financial stability for street vendors but also reflects a broader vision of inclusive urban development. By integrating street vendors into the formal financial system through collateral-free bank credit, credit history creation, and access to UPI-enabled digital payment platforms, the scheme facilitates a transition from informal livelihoods to sustainable micro-entrepreneurship. At the same time, the scheme promotes access to social security and welfare linkages, reducing vulnerability and enhancing long-term livelihood security for vendors and their families. Through sustained digital inclusion, financial literacy, and capacity-building support, PM SVANidhi empowers one of the most vital segments of the urban informal economy, reaffirming the Central Government’s commitment to a resilient, self-reliant, and inclusive growth trajectory where every citizen has the opportunity to thrive. References: Ministry of Housing and Urban Affairs https://pmsvanidhi.mohua.gov.in/ https://pmsvanidhi.qcin.org/account/landing-page https://pmsvanidhi.mohua.gov.in/Default/ViewFile/?id=3yearsJourney.pdf&path=UT https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2123286 https://www.pib.gov.in/PressReleseDetailm.aspx?PRID=2034095 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2182258 https://pmsvanidhi.qcin.org/assets/documents/NULM%20PM%20SVANidhi%20Socio-Economic%20Guidelines.pdf https://mohua.gov.in/pm_svandhi/FAQs_English.pdf https://pmsvanidhi.qcin.org/account/landing-page Ministry of Ports, Shipping and Waterways https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2162517 Union Cabinet https://www.pib.gov.in/PressReleasePage.aspx?PRID=2161157 National Portal of India https://www.india.gov.in/spotlight/pm-street-vendors-atmanirbhar-nidhi-pm-svanidhi Press Information Bureau https://static.pib.gov.in/WriteReadData/specificdocs/documents/2024/mar/doc2024315325201.pdf Click here to see PDF ******** PIB Research (रिलीज़ आईडी: 2206995) आगंतुक पटल  : 399 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी PIB Headquarters SVANidhi: Empowering Street Vendors प्रविष्टि तिथि:\r\n                        20 DEC 2025 5:13PM by PIB Delhi Key Takeaways Restructured PM SVANidhi Scheme aims to benefit 1.15 crore street vendors, including 50 lakh new beneficiaries. Lending period extended until March 31, 2030 . Introduction: Empowering the Enablers Street vendors are an important part of any city's informal economy. Street vending, a source of self-employment, has a prominent place in the urban supply chain as it provides convenient access to goods and services to all segments of the population close to their doorstep. Lack of recognition, limited access to formal credit, low levels of education and skills, lack of designated areas, and limited access to emerging market opportunities are a few constraints faced by the street vendors. On account of being unorganized and self-employed, street vendors and their families often lack linkages to social security, welfare, and assistance schemes and initiatives of the government. This makes street vendors and their families vulnerable in difficult times or when they may require assistance for unforeseen circumstances. Launched in June 2020, the PM SVANidhi scheme was formulated to assist the street vendors to overcome the adverse effects of financial constraints and to restart their lost businesses during the pandemic. However, since the inception of the scheme, it has proved to be more than financial support for street vendors and has given them a sense of identity & formal recognition for their contribution to the economy. On August 27, 2025, the Union Cabinet, chaired by Prime Minister Shri Narendra Modi, approved the “ Restructuring and extension of the lending period beyond 31.12.2024 of Prime Minister Street Vendor’s Atma Nirbhar Nidhi (PM SVANidhi) Scheme ”. The lending period has now been extended until March 31, 2030. The total outlay for the scheme is ₹7,332 crore . The restructured scheme aims to benefit 1.15 crore beneficiaries, including 50 lakh new beneficiaries . Loans Disbursal and Welfare Linkages The key features of the restructured scheme include enhanced loan amount across the first & second tranche, provision of UPI-linked RuPay Credit Card for beneficiaries who have timely repaid the second loan, and digital cashback incentives for retail & wholesale transactions. The scheme’s coverage is being expanded beyond statutory towns to census towns, peri-urban areas, etc., in a graded manner. The enhanced loan structure includes first tranche loans increased up to ₹15,000 (from ₹10,000) and second tranche loans increased up to ₹25,000 (from ₹20,000), while the third tranche is at ₹50,000. The introduction of UPI-linked RUPAY Credit Card would provide immediate access to credit to the street vendors in order to meet any emergent business and personal requirements. Further, in order to give a boost to digital adoption, the street vendors can avail a cashback on digital transactions: Cashback upto ₹1,200 on regular sales with maximum ₹100 per month Cashback upto ₹400 on wholesale purchases of ₹2,000 or more ( ₹20 per transaction with maximum ₹100 per quarter). The scheme has received national recognition, winning the Prime Minister’s Award for Excellence in Public Administration (2023) for Innovation (Central Level) for its outstanding contribution to boosting the economy, promoting livelihoods, advancing financial inclusion, and driving digital empowerment, and the Silver Award for Excellence in Government Process Re-engineering for Digital Transformation (2022). From Relief to Growth: The Restructured PM SVANidhi Scheme Started as micro-credit support during the COVID pandemic in 2020, the restructured scheme envisages the holistic development of street vendors by offering a reliable source of finance to support business expansion and opportunities for sustainable growth. The scheme not only fosters inclusive economic growth but also focuses on the socio-economic upliftment of street vendors and their families, enhancing their livelihoods and ultimately transforming urban spaces into a vibrant, self-sustaining ecosystem. The scheme also focuses on building the capacity of the street vendors with a focus on entrepreneurship, financial literacy, digital skills, and marketing through convergence. Standard hygiene and food safety training would be conducted for street food vendors, in partnership with FSSAI. Institutional Roles in Delivering PM SVANidhi Benefits Implementation of the scheme would be the joint responsibility of the Ministry of Housing & Urban Affairs (MoHUA) and Department of Financial Services (DFS) , with DFS being responsible for facilitating access to loans/ credit cards through banks/financial institution and their ground-level functionaries. Though PM SVANidhi is a Central Government initiative , its effective implementation is made possible through close collaboration with States, Banks, and Urban Local Bodies (ULBs) . State governments and ULBs play a key role by identifying street vendors, facilitating loan processes, and linking beneficiaries to welfare schemes. Banks ensure smooth loan disbursal, timely interest subsidy processing, and promote digital transactions. Together, these partners bring the scheme from policy to reality, creating opportunities and dignity for street vendors across the country. Boosting Outreach and Loan Disbursement through Lok Kalyan Mela and SVANidhi Sankalp Abhiyaan To further advance the holistic welfare and development of street vendors and their families, the ‘ SVANidhi se Samriddhi’ component is being strengthened through periodic Lok Kalyan Melas . The objective is to ensure that the benefits of various Government of India schemes reach vendors and their families in a saturation approach , fostering a more inclusive and supportive ecosystem for their growth and well-being. As part of the Special Campaign, “ Lok Kalyan Melas \" were conducted from 17 September to 15 October 2025 across all Urban Local Bodies (ULBs) and monitored through a dedicated Lok Kalyan Portal. These Melas facilitated vendor mobilization, submission of loan applications, accelerated disbursement of loans, and digital onboarding of beneficiaries. Achievements of PM SVANidhi Scheme Svanidhi Se Samriddhi: ‘ SVANidhi se Samriddhi ' has connected beneficiaries to 8 welfare schemes of the Government of India. Profiling of more than 47 lakh street vendors and families has been completed, and more than 1.46 crore schemes have been sanctioned as of 9th December 2025. Conclusion: The extension of the PM SVANidhi Scheme not only ensures financial stability for street vendors but also reflects a broader vision of inclusive urban development. By integrating street vendors into the formal financial system through collateral-free bank credit, credit history creation, and access to UPI-enabled digital payment platforms, the scheme facilitates a transition from informal livelihoods to sustainable micro-entrepreneurship. At the same time, the scheme promotes access to social security and welfare linkages, reducing vulnerability and enhancing long-term livelihood security for vendors and their families. Through sustained digital inclusion, financial literacy, and capacity-building support, PM SVANidhi empowers one of the most vital segments of the urban informal economy, reaffirming the Central Government’s commitment to a resilient, self-reliant, and inclusive growth trajectory where every citizen has the opportunity to thrive. References: Ministry of Housing and Urban Affairs https://pmsvanidhi.mohua.gov.in/ https://pmsvanidhi.qcin.org/account/landing-page https://pmsvanidhi.mohua.gov.in/Default/ViewFile/?id=3yearsJourney.pdf&path=UT https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2123286 https://www.pib.gov.in/PressReleseDetailm.aspx?PRID=2034095 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2182258 https://pmsvanidhi.qcin.org/assets/documents/NULM%20PM%20SVANidhi%20Socio-Economic%20Guidelines.pdf https://mohua.gov.in/pm_svandhi/FAQs_English.pdf https://pmsvanidhi.qcin.org/account/landing-page Ministry of Ports, Shipping and Waterways https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2162517 Union Cabinet https://www.pib.gov.in/PressReleasePage.aspx?PRID=2161157 National Portal of India https://www.india.gov.in/spotlight/pm-street-vendors-atmanirbhar-nidhi-pm-svanidhi Press Information Bureau https://static.pib.gov.in/WriteReadData/specificdocs/documents/2024/mar/doc2024315325201.pdf Click here to see PDF ******** PIB Research (रिलीज़ आईडी: 2206995)",
    "scraped_at": "2025-12-20T17:34:29.397115"
  }
]