[
  {
    "id": "2208453",
    "ministry": "President's Secretariat",
    "title": "PRESIDENT OF INDIA RELEASES THE CONSTITUTION OF INDIA IN THE SANTHALI LANGUAGE",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208453",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau President's Secretariat PRESIDENT OF INDIA RELEASES THE CONSTITUTION OF INDIA IN THE SANTHALI LANGUAGE प्रविष्टि तिथि:\r\n                25 DEC 2025 1:35PM by PIB Delhi The President of India, Smt Droupadi Murmu, released the Constitution of India in the Santhali language at a function held at Rashtrapati Bhavan today (December 25, 2025). Speaking on the occasion, the President said that it is a matter of pride and joy for all the Santhali people that the Constitution of India is now available in the Santhali language, written in the Ol Chiki script. It will make them able to read and understand the Constitution in their own language. The President said that this year, we are celebrating the centenary of the Ol Chiki script. She appreciated the Union Minister of Law and Justice and his team for bringing the Constitution of India in Ol Chiki script in its centenary year. Among the dignitaries present on the occasion were the Vice President of India, Shri C. P. Radhakrishnan and the Union Minister of State for Law and Justice, Shri Arjun Ram Meghwal. The Santhali language, which was included in the Eighth Schedule of the Constitution through the 92nd Amendment Act, 2003, is one of the most ancient living languages of India. It is spoken by a significant number of tribal people in Jharkhand, Odisha, West Bengal and Bihar. **** MJPS/SR (रिलीज़ आईडी: 2208453) आगंतुक पटल  : 231 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी , Marathi President's Secretariat PRESIDENT OF INDIA RELEASES THE CONSTITUTION OF INDIA IN THE SANTHALI LANGUAGE प्रविष्टि तिथि:\r\n                        25 DEC 2025 1:35PM by PIB Delhi The President of India, Smt Droupadi Murmu, released the Constitution of India in the Santhali language at a function held at Rashtrapati Bhavan today (December 25, 2025). Speaking on the occasion, the President said that it is a matter of pride and joy for all the Santhali people that the Constitution of India is now available in the Santhali language, written in the Ol Chiki script. It will make them able to read and understand the Constitution in their own language. The President said that this year, we are celebrating the centenary of the Ol Chiki script. She appreciated the Union Minister of Law and Justice and his team for bringing the Constitution of India in Ol Chiki script in its centenary year. Among the dignitaries present on the occasion were the Vice President of India, Shri C. P. Radhakrishnan and the Union Minister of State for Law and Justice, Shri Arjun Ram Meghwal. The Santhali language, which was included in the Eighth Schedule of the Constitution through the 92nd Amendment Act, 2003, is one of the most ancient living languages of India. It is spoken by a significant number of tribal people in Jharkhand, Odisha, West Bengal and Bihar. **** MJPS/SR (रिलीज़ आईडी: 2208453)",
    "scraped_at": "2025-12-25T09:47:10.841774"
  },
  {
    "id": "2208388",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister pays tributes to Shri Atal Bihari Vajpayee ji at ‘Sadaiv Atal’",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208388",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister pays tributes to Shri Atal Bihari Vajpayee ji at ‘Sadaiv Atal’ प्रविष्टि तिथि:\r\n                25 DEC 2025 11:21AM by PIB Delhi The Prime Minister, Shri Narendra Modi paid tributes at ‘Sadaiv Atal’, the memorial site of former Prime Minister, Atal Bihari Vajpayee ji, on his birth anniversary, today. Shri Modi stated that Atal ji's  life was dedicated to public service and national service and he will always continue to inspire the people of the country. The Prime Minister posted on X: \"पूर्व प्रधानमंत्री श्रद्धेय अटल बिहारी वाजपेयी जी की जयंती पर आज दिल्ली में उनके स्मृति स्थल ‘सदैव अटल’ जाकर उन्हें श्रद्धांजलि अर्पित करने का सौभाग्य मिला। जनसेवा और राष्ट्रसेवा को समर्पित उनका जीवन देशवासियों को हमेशा प्रेरित करता रहेगा।\" पूर्व प्रधानमंत्री श्रद्धेय अटल बिहारी वाजपेयी जी की जयंती पर आज दिल्ली में उनके स्मृति स्थल ‘सदैव अटल’ जाकर उन्हें श्रद्धांजलि अर्पित करने का सौभाग्य मिला। जनसेवा और राष्ट्रसेवा को समर्पित उनका जीवन देशवासियों को हमेशा प्रेरित करता रहेगा। pic.twitter.com/ttQvNyrxGW — Narendra Modi (@narendramodi) December 25, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2208388) आगंतुक पटल  : 243 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Malayalam , Kannada , Urdu , Marathi , हिन्दी , Bengali , Gujarati , Telugu Prime Minister's Office Prime Minister pays tributes to Shri Atal Bihari Vajpayee ji at ‘Sadaiv Atal’ प्रविष्टि तिथि:\r\n                        25 DEC 2025 11:21AM by PIB Delhi The Prime Minister, Shri Narendra Modi paid tributes at ‘Sadaiv Atal’, the memorial site of former Prime Minister, Atal Bihari Vajpayee ji, on his birth anniversary, today. Shri Modi stated that Atal ji's  life was dedicated to public service and national service and he will always continue to inspire the people of the country. The Prime Minister posted on X: \"पूर्व प्रधानमंत्री श्रद्धेय अटल बिहारी वाजपेयी जी की जयंती पर आज दिल्ली में उनके स्मृति स्थल ‘सदैव अटल’ जाकर उन्हें श्रद्धांजलि अर्पित करने का सौभाग्य मिला। जनसेवा और राष्ट्रसेवा को समर्पित उनका जीवन देशवासियों को हमेशा प्रेरित करता रहेगा।\" पूर्व प्रधानमंत्री श्रद्धेय अटल बिहारी वाजपेयी जी की जयंती पर आज दिल्ली में उनके स्मृति स्थल ‘सदैव अटल’ जाकर उन्हें श्रद्धांजलि अर्पित करने का सौभाग्य मिला। जनसेवा और राष्ट्रसेवा को समर्पित उनका जीवन देशवासियों को हमेशा प्रेरित करता रहेगा। pic.twitter.com/ttQvNyrxGW — Narendra Modi (@narendramodi) December 25, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2208388)",
    "scraped_at": "2025-12-25T09:47:12.863389"
  },
  {
    "id": "2208361",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister attends Christmas morning service",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208361",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister attends Christmas morning service प्रविष्टि तिथि:\r\n                25 DEC 2025 10:43AM by PIB Delhi The Prime Minister, Shri Narendra Modi attended the Christmas morning service at 'The Cathedral Church of the Redemption' in Delhi, today.\"The service reflected the timeless message of love, peace and compassion. May the spirit of Christmas inspire harmony and goodwill in our society\", Shri Modi stated. The Prime Minister posted on X: \"Attended the Christmas morning service at The Cathedral Church of the Redemption in Delhi. The service reflected the timeless message of love, peace and compassion. May the spirit of Christmas inspire harmony and goodwill in our society.\" Attended the Christmas morning service at The Cathedral Church of the Redemption in Delhi. The service reflected the timeless message of love, peace and compassion. May the spirit of Christmas inspire harmony and goodwill in our society. pic.twitter.com/humdgbxR9o — Narendra Modi (@narendramodi) December 25, 2025 \"Here are some more glimpses from the Christmas morning service at The Cathedral Church of the Redemption.\" Here are some more glimpses from the Christmas morning service at The Cathedral Church of the Redemption. pic.twitter.com/ta5vTyYEJU — Narendra Modi (@narendramodi) December 25, 2025 May Christmas bring renewed hope, warmth and a shared commitment to kindness. \"Here are highlights from the Christmas morning service at The Cathedral Church of the Redemption.\" May Christmas bring renewed hope, warmth and a shared commitment to kindness. Here are highlights from the Christmas morning service at The Cathedral Church of the Redemption. pic.twitter.com/BzvKYQ8N0H — Narendra Modi (@narendramodi) December 25, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2208361) आगंतुक पटल  : 228 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Bengali , Gujarati , Telugu , Kannada , Malayalam Prime Minister's Office Prime Minister attends Christmas morning service प्रविष्टि तिथि:\r\n                        25 DEC 2025 10:43AM by PIB Delhi The Prime Minister, Shri Narendra Modi attended the Christmas morning service at 'The Cathedral Church of the Redemption' in Delhi, today.\"The service reflected the timeless message of love, peace and compassion. May the spirit of Christmas inspire harmony and goodwill in our society\", Shri Modi stated. The Prime Minister posted on X: \"Attended the Christmas morning service at The Cathedral Church of the Redemption in Delhi. The service reflected the timeless message of love, peace and compassion. May the spirit of Christmas inspire harmony and goodwill in our society.\" Attended the Christmas morning service at The Cathedral Church of the Redemption in Delhi. The service reflected the timeless message of love, peace and compassion. May the spirit of Christmas inspire harmony and goodwill in our society. pic.twitter.com/humdgbxR9o — Narendra Modi (@narendramodi) December 25, 2025 \"Here are some more glimpses from the Christmas morning service at The Cathedral Church of the Redemption.\" Here are some more glimpses from the Christmas morning service at The Cathedral Church of the Redemption. pic.twitter.com/ta5vTyYEJU — Narendra Modi (@narendramodi) December 25, 2025 May Christmas bring renewed hope, warmth and a shared commitment to kindness. \"Here are highlights from the Christmas morning service at The Cathedral Church of the Redemption.\" May Christmas bring renewed hope, warmth and a shared commitment to kindness. Here are highlights from the Christmas morning service at The Cathedral Church of the Redemption. pic.twitter.com/BzvKYQ8N0H — Narendra Modi (@narendramodi) December 25, 2025 *** MJPS/VJ (रिलीज़ आईडी: 2208361)",
    "scraped_at": "2025-12-25T09:47:14.895007"
  },
  {
    "id": "2208375",
    "ministry": "Ministry of Commerce & Industry",
    "title": "India to assume prestigious Chairpersonship of Kimberly Process from Jan 1 2026",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208375",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Commerce & Industry India to assume prestigious Chairpersonship of Kimberly Process from Jan 1 2026 Initiative involves governments, international diamond industry, and civil society to prevent trade in “conflict diamonds” प्रविष्टि तिथि:\r\n                25 DEC 2025 11:07AM by PIB Delhi The Kimberley Process (KP) Plenary has selected India to assume the chairpersonship of the Kimberley Process from 1 January 2026. The Kimberley Process is a tripartite initiative involving governments, the international diamond industry and civil society, aimed at preventing the trade in “conflict diamonds”—rough diamonds used by rebel groups or their allies to finance conflicts that undermine legitimate governments, as defined in United Nations Security Council resolutions. India will take over as KP Vice Chair from 25 December 2025, before assuming the chairpersonship in the new year. This will be the third time India has been entrusted with the chair of the Kimberley Process. Welcoming the decision, Minister of Commerce and Industry, Shri Piyush Goyal, said that India’s selection reflects global trust in the Modi government’s commitment to promoting integrity and transparency in international trade. The Kimberley Process Certification Scheme (KPCS), established pursuant to a UN resolution, came into effect on 1 January 2003 and has since evolved into an effective mechanism for curbing the trade in conflict diamonds. The Kimberley Process currently has 60 participants, with the European Union and its Member States counted as a single participant. Together, KP participants account for over 99 per cent of global rough diamond trade, making it the most comprehensive international mechanism governing this sector. As a leading global hub for diamond manufacturing and trade, India’s leadership comes at a time of shifting geopolitics and growing emphasis on sustainable and responsible sourcing. During its tenure, India will focus on strengthening governance and compliance, advancing digital certification and traceability, enhancing transparency through data-driven monitoring, and building consumer trust in conflict-free diamonds. As Vice Chair in 2025 and Chair in 2026, India will work closely with all participants and observers to reinforce confidence in the Kimberley Process, ensure rule-based compliance, and enhance its credibility, in line with its core objectives and evolving global expectations, while working towards making the KP a more inclusive and effective multilateral framework. *** Abhishek Dayal/ Shabbir Azad/ Ishita Biswas (रिलीज़ आईडी: 2208375) आगंतुक पटल  : 443 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Marathi , Urdu , हिन्दी Ministry of Commerce & Industry India to assume prestigious Chairpersonship of Kimberly Process from Jan 1 2026 Initiative involves governments, international diamond industry, and civil society to prevent trade in “conflict diamonds” प्रविष्टि तिथि:\r\n                        25 DEC 2025 11:07AM by PIB Delhi The Kimberley Process (KP) Plenary has selected India to assume the chairpersonship of the Kimberley Process from 1 January 2026. The Kimberley Process is a tripartite initiative involving governments, the international diamond industry and civil society, aimed at preventing the trade in “conflict diamonds”—rough diamonds used by rebel groups or their allies to finance conflicts that undermine legitimate governments, as defined in United Nations Security Council resolutions. India will take over as KP Vice Chair from 25 December 2025, before assuming the chairpersonship in the new year. This will be the third time India has been entrusted with the chair of the Kimberley Process. Welcoming the decision, Minister of Commerce and Industry, Shri Piyush Goyal, said that India’s selection reflects global trust in the Modi government’s commitment to promoting integrity and transparency in international trade. The Kimberley Process Certification Scheme (KPCS), established pursuant to a UN resolution, came into effect on 1 January 2003 and has since evolved into an effective mechanism for curbing the trade in conflict diamonds. The Kimberley Process currently has 60 participants, with the European Union and its Member States counted as a single participant. Together, KP participants account for over 99 per cent of global rough diamond trade, making it the most comprehensive international mechanism governing this sector. As a leading global hub for diamond manufacturing and trade, India’s leadership comes at a time of shifting geopolitics and growing emphasis on sustainable and responsible sourcing. During its tenure, India will focus on strengthening governance and compliance, advancing digital certification and traceability, enhancing transparency through data-driven monitoring, and building consumer trust in conflict-free diamonds. As Vice Chair in 2025 and Chair in 2026, India will work closely with all participants and observers to reinforce confidence in the Kimberley Process, ensure rule-based compliance, and enhance its credibility, in line with its core objectives and evolving global expectations, while working towards making the KP a more inclusive and effective multilateral framework. *** Abhishek Dayal/ Shabbir Azad/ Ishita Biswas (रिलीज़ आईडी: 2208375)",
    "scraped_at": "2025-12-25T09:47:17.031042"
  },
  {
    "id": "2208482",
    "ministry": "Ministry of Consumer Affairs, Food & Public Distribution",
    "title": "CCPA imposes ₹11 lakh penalty on Coaching Institute for misleading advertisements on UPSC Civil Services Examination results",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208482",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Consumer Affairs, Food & Public Distribution CCPA imposes ₹11 lakh penalty on Coaching Institute for misleading advertisements on UPSC Civil Services Examination results प्रविष्टि तिथि:\r\n                25 DEC 2025 3:04PM by PIB Delhi The Central Consumer Protection Authority (CCPA) has imposed a penalty of ₹11 lakh on Vision IAS (AjayVision Education Private Limited) for publishing misleading advertisements on its official website concerning the results of the UPSC Civil Services Examination (CSE) 2022 and 2023, in violation of the Consumer Protection Act, 2019 . The institute had advertised claims such as “7 in Top 10 & 79 in Top 100 selections in CSE 2023” and “39 in Top 50 selections in CSE 2022”, prominently featuring the names, photographs and ranks of successful candidates. Upon examination, the CCPA found that while the institute disclosed the specific course opted by Mr. Shubham Kumar (AIR 1, UPSC CSE 2020) namely, GS Foundation Batch (Classroom Student), it deliberately concealed information regarding the courses chosen by other successful candidates whose names and photographs were displayed alongside him on the same webpage. This concealment created a misleading impression that all the remaining candidates were also enrolled in the GS Foundation Batch Classroom Course, which was not the case. Additionally, in the same advertisement, the institute prominently promoted its “Foundation Course,” which involves fees running into lakhs of rupees. Such conduct had the effect of inducing students to enroll in the institute’s programmes on the basis of false, inflated, and unverified claims. After a detailed investigation, the CCPA found that the institute claimed 119+ successful candidates in UPSC CSE 2022 and 2023. However, only three candidates had enrolled in foundation courses, while the remaining 116 candidates had opted for services such as Test Series for Preliminary and Mains examinations, Abhyaas tests (one-time tests), and Mock Interview programmes. This deliberate concealment of material information misled aspirants and parents into believing that Vision IAS was responsible for the candidates’ success across all stages of the UPSC Civil Services Examination, thereby constituting a misleading advertisement under Section 2(28) of the Consumer Protection Act, 2019. The Authority further observed that the institute’s advertisements on its official website, featuring successful candidates’ names and photographs along with tall claims, were misleading. By projecting such claims without proper authorisation or consent from the students, the institute misled prospective aspirants. Unlike print media, a website is accessible globally and remains available for an extended period. It is also the primary platform through which aspirants, particularly in the digital era, research coaching institutes, evaluate their claims, and make informed choices. CCPA also noted that Vision IAS had earlier been proceeded against for publishing misleading advertisements. Despite regulatory intervention and caution, the institute continued to make similar claims in its subsequent advertisements, demonstrating a lack of due diligence and regulatory compliance. In view of the recurring nature of the violation, the present instance was treated as a subsequent contravention, warranting the imposition of a higher penalty in the interest of protecting consumers. The Authority further noted that in highly competitive examinations such as the UPSC Civil Services Examination where lakhs of aspirants invest substantial time, effort, and financial resources such incomplete and selective disclosures mislead students and parents by creating false expectations regarding outcomes and the effectiveness of coaching services. So far, the CCPA has issued 57 notices to various coaching institutes for misleading advertisements and unfair trade practices. Penalties amounting to ₹1,09,60,000 have been imposed on 28 coaching institutes, along with directions to discontinue such misleading claims. The Authority has emphasized that all coaching institutes must strictly ensure truthful and transparent disclosure of information in their advertisements , enabling students to make fair and informed academic decisions . (Final Order is available on the Central Consumer Protection Authority website: https://doca.gov.in/ccpa/orders-advisories.php?page_no=1 ) ******* RT (रिलीज़ आईडी: 2208482) आगंतुक पटल  : 39 Ministry of Consumer Affairs, Food & Public Distribution CCPA imposes ₹11 lakh penalty on Coaching Institute for misleading advertisements on UPSC Civil Services Examination results प्रविष्टि तिथि:\r\n                        25 DEC 2025 3:04PM by PIB Delhi The Central Consumer Protection Authority (CCPA) has imposed a penalty of ₹11 lakh on Vision IAS (AjayVision Education Private Limited) for publishing misleading advertisements on its official website concerning the results of the UPSC Civil Services Examination (CSE) 2022 and 2023, in violation of the Consumer Protection Act, 2019 . The institute had advertised claims such as “7 in Top 10 & 79 in Top 100 selections in CSE 2023” and “39 in Top 50 selections in CSE 2022”, prominently featuring the names, photographs and ranks of successful candidates. Upon examination, the CCPA found that while the institute disclosed the specific course opted by Mr. Shubham Kumar (AIR 1, UPSC CSE 2020) namely, GS Foundation Batch (Classroom Student), it deliberately concealed information regarding the courses chosen by other successful candidates whose names and photographs were displayed alongside him on the same webpage. This concealment created a misleading impression that all the remaining candidates were also enrolled in the GS Foundation Batch Classroom Course, which was not the case. Additionally, in the same advertisement, the institute prominently promoted its “Foundation Course,” which involves fees running into lakhs of rupees. Such conduct had the effect of inducing students to enroll in the institute’s programmes on the basis of false, inflated, and unverified claims. After a detailed investigation, the CCPA found that the institute claimed 119+ successful candidates in UPSC CSE 2022 and 2023. However, only three candidates had enrolled in foundation courses, while the remaining 116 candidates had opted for services such as Test Series for Preliminary and Mains examinations, Abhyaas tests (one-time tests), and Mock Interview programmes. This deliberate concealment of material information misled aspirants and parents into believing that Vision IAS was responsible for the candidates’ success across all stages of the UPSC Civil Services Examination, thereby constituting a misleading advertisement under Section 2(28) of the Consumer Protection Act, 2019. The Authority further observed that the institute’s advertisements on its official website, featuring successful candidates’ names and photographs along with tall claims, were misleading. By projecting such claims without proper authorisation or consent from the students, the institute misled prospective aspirants. Unlike print media, a website is accessible globally and remains available for an extended period. It is also the primary platform through which aspirants, particularly in the digital era, research coaching institutes, evaluate their claims, and make informed choices. CCPA also noted that Vision IAS had earlier been proceeded against for publishing misleading advertisements. Despite regulatory intervention and caution, the institute continued to make similar claims in its subsequent advertisements, demonstrating a lack of due diligence and regulatory compliance. In view of the recurring nature of the violation, the present instance was treated as a subsequent contravention, warranting the imposition of a higher penalty in the interest of protecting consumers. The Authority further noted that in highly competitive examinations such as the UPSC Civil Services Examination where lakhs of aspirants invest substantial time, effort, and financial resources such incomplete and selective disclosures mislead students and parents by creating false expectations regarding outcomes and the effectiveness of coaching services. So far, the CCPA has issued 57 notices to various coaching institutes for misleading advertisements and unfair trade practices. Penalties amounting to ₹1,09,60,000 have been imposed on 28 coaching institutes, along with directions to discontinue such misleading claims. The Authority has emphasized that all coaching institutes must strictly ensure truthful and transparent disclosure of information in their advertisements , enabling students to make fair and informed academic decisions . (Final Order is available on the Central Consumer Protection Authority website: https://doca.gov.in/ccpa/orders-advisories.php?page_no=1 ) ******* RT (रिलीज़ आईडी: 2208482)",
    "scraped_at": "2025-12-25T09:47:19.160342"
  },
  {
    "id": "2208403",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home and Cooperation Minister Shri Amit Shah pays tribute to Bharat Ratna Mahamana Pandit Madan Mohan Malaviya, the founder of Banaras Hindu University and a great social reformer, on his birth anniversary",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208403",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home and Cooperation Minister Shri Amit Shah pays tribute to Bharat Ratna Mahamana Pandit Madan Mohan Malaviya, the founder of Banaras Hindu University and a great social reformer, on his birth anniversary Considering education as the fundamental principle of social reform, Malaviya ji inspired the youth to pursue modern education based on Indian cultural values ​​through the establishment of Banaras Hindu University He and also made a significant contribution to making the press a medium for nation-building Mahamana's lifelong commitment to the eradication of untouchability and his pro-farmer initiatives will always be remembered प्रविष्टि तिथि:\r\n                25 DEC 2025 12:07PM by PIB Delhi Union Home and Cooperation Minister Shri Amit Shah paid tribute to Bharat Ratna Mahamana Pandit Madan Mohan Malaviya, the founder of Banaras Hindu University and a great social reformer, on his birth anniversary. In a post on ‘X’, Union Home Minister Shri Amit Shah said that considering education as the fundamental principle of social reform, Malaviya ji inspired the youth to pursue modern education based on Indian cultural values ​​through the establishment of Banaras Hindu University. He aaid that Mahamana also made a significant contribution to making the press a medium for nation-building. Shri Shah said that Mahamana's lifelong commitment to the eradication of untouchability and his pro-farmer initiatives will always be remembered बनारस हिंदू विश्वविद्यालय के संस्थापक और महान समाज सुधारक भारत रत्न महामना पंडित मदन मोहन मालवीय जी को उनकी जयंती पर नमन। शिक्षा को समाज सुधार का मूल मंत्र मानने वाले मालवीय जी ने बनारस हिंदू विश्वविद्यालय की स्थापना से भारतीय सांस्कृतिक मूल्यों पर आधारित आधुनिक शिक्षा के लिए… pic.twitter.com/cYjvseSF3W — Amit Shah (@AmitShah) December 25, 2025 *** RK / RR (रिलीज़ आईडी: 2208403) आगंतुक पटल  : 155 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Bengali , Gujarati Ministry of Home Affairs Union Home and Cooperation Minister Shri Amit Shah pays tribute to Bharat Ratna Mahamana Pandit Madan Mohan Malaviya, the founder of Banaras Hindu University and a great social reformer, on his birth anniversary Considering education as the fundamental principle of social reform, Malaviya ji inspired the youth to pursue modern education based on Indian cultural values ​​through the establishment of Banaras Hindu University He and also made a significant contribution to making the press a medium for nation-building Mahamana's lifelong commitment to the eradication of untouchability and his pro-farmer initiatives will always be remembered प्रविष्टि तिथि:\r\n                        25 DEC 2025 12:07PM by PIB Delhi Union Home and Cooperation Minister Shri Amit Shah paid tribute to Bharat Ratna Mahamana Pandit Madan Mohan Malaviya, the founder of Banaras Hindu University and a great social reformer, on his birth anniversary. In a post on ‘X’, Union Home Minister Shri Amit Shah said that considering education as the fundamental principle of social reform, Malaviya ji inspired the youth to pursue modern education based on Indian cultural values ​​through the establishment of Banaras Hindu University. He aaid that Mahamana also made a significant contribution to making the press a medium for nation-building. Shri Shah said that Mahamana's lifelong commitment to the eradication of untouchability and his pro-farmer initiatives will always be remembered बनारस हिंदू विश्वविद्यालय के संस्थापक और महान समाज सुधारक भारत रत्न महामना पंडित मदन मोहन मालवीय जी को उनकी जयंती पर नमन। शिक्षा को समाज सुधार का मूल मंत्र मानने वाले मालवीय जी ने बनारस हिंदू विश्वविद्यालय की स्थापना से भारतीय सांस्कृतिक मूल्यों पर आधारित आधुनिक शिक्षा के लिए… pic.twitter.com/cYjvseSF3W — Amit Shah (@AmitShah) December 25, 2025 *** RK / RR (रिलीज़ आईडी: 2208403)",
    "scraped_at": "2025-12-25T09:47:21.179592"
  },
  {
    "id": "2208400",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home and Cooperation Minister Shri Amit Shah pays tribute to former Prime Minister and BJP founder Bharat Ratna, the revered Atal Bihari Vajpayee, on his birth anniversary, on behalf of a grateful nation",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208400",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home and Cooperation Minister Shri Amit Shah pays tribute to former Prime Minister and BJP founder Bharat Ratna, the revered Atal Bihari Vajpayee, on his birth anniversary, on behalf of a grateful nation Through the founding of the BJP, Atal Ji provided Indian politics with a political alternative that prioritized national interest and cultural nationalism Whether it was making India a nuclear power or realizing good governance, under his leadership, the NDA government presented the country with a governance model that advanced both heritage and science simultaneously Atal Ji is such a powerful and unforgettable figure in Indian politics, known for his dedication to public service and organizational strength प्रविष्टि तिथि:\r\n                25 DEC 2025 12:04PM by PIB Delhi Union Home and Cooperation Minister Shri Amit Shah paid tribute to former Prime Minister and BJP founder Bharat Ratna, the revered Atal Bihari Vajpayee, on his birth anniversary, on behalf of a grateful nation. In a post on ‘X’, Union Home Minister Shri Amit Shah said that through the founding of the BJP, Atal Ji provided Indian politics with a political alternative that prioritized national interest and cultural nationalism. He said that whether it was making India a nuclear power or realizing good governance, under his leadership, the NDA government presented the country with a governance model that advanced both heritage and science simultaneously. Shri Shah said that Atal Ji is such a powerful and unforgettable figure in Indian politics, known for his dedication to public service and organizational strength. पूर्व प्रधानमंत्री व भाजपा के संस्थापक भारत रत्न श्रद्धेय अटल बिहारी वाजपेयी जी की जयंती पर उन्हे कृतज्ञ राष्ट्र की ओर से नमन करता हूँ। अटल जी ने भाजपा की स्थापना से भारतीय राजनीति को देशहित और सांस्कृतिक राष्ट्रवाद को सर्वोपरि रखने वाला राजनीतिक विकल्प दिया। भारत को परमाणु… pic.twitter.com/pkhVEfjxm3 — Amit Shah (@AmitShah) December 25, 2025 *** RK / RR (रिलीज़ आईडी: 2208400) आगंतुक पटल  : 109 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Bengali , Gujarati , Malayalam Ministry of Home Affairs Union Home and Cooperation Minister Shri Amit Shah pays tribute to former Prime Minister and BJP founder Bharat Ratna, the revered Atal Bihari Vajpayee, on his birth anniversary, on behalf of a grateful nation Through the founding of the BJP, Atal Ji provided Indian politics with a political alternative that prioritized national interest and cultural nationalism Whether it was making India a nuclear power or realizing good governance, under his leadership, the NDA government presented the country with a governance model that advanced both heritage and science simultaneously Atal Ji is such a powerful and unforgettable figure in Indian politics, known for his dedication to public service and organizational strength प्रविष्टि तिथि:\r\n                        25 DEC 2025 12:04PM by PIB Delhi Union Home and Cooperation Minister Shri Amit Shah paid tribute to former Prime Minister and BJP founder Bharat Ratna, the revered Atal Bihari Vajpayee, on his birth anniversary, on behalf of a grateful nation. In a post on ‘X’, Union Home Minister Shri Amit Shah said that through the founding of the BJP, Atal Ji provided Indian politics with a political alternative that prioritized national interest and cultural nationalism. He said that whether it was making India a nuclear power or realizing good governance, under his leadership, the NDA government presented the country with a governance model that advanced both heritage and science simultaneously. Shri Shah said that Atal Ji is such a powerful and unforgettable figure in Indian politics, known for his dedication to public service and organizational strength. पूर्व प्रधानमंत्री व भाजपा के संस्थापक भारत रत्न श्रद्धेय अटल बिहारी वाजपेयी जी की जयंती पर उन्हे कृतज्ञ राष्ट्र की ओर से नमन करता हूँ। अटल जी ने भाजपा की स्थापना से भारतीय राजनीति को देशहित और सांस्कृतिक राष्ट्रवाद को सर्वोपरि रखने वाला राजनीतिक विकल्प दिया। भारत को परमाणु… pic.twitter.com/pkhVEfjxm3 — Amit Shah (@AmitShah) December 25, 2025 *** RK / RR (रिलीज़ आईडी: 2208400)",
    "scraped_at": "2025-12-25T09:47:23.232664"
  },
  {
    "id": "2208484",
    "ministry": "Ministry of Law and Justice",
    "title": "Constitution of India translated into Santhali language, published for the first time by Legislative Department, Ministry of Law and Justice released by the Hon’ble President of India, Smt. Draupadi Murmu",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208484",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Law and Justice Constitution of India translated into Santhali language, published for the first time by Legislative Department, Ministry of Law and Justice released by the Hon’ble President of India, Smt. Draupadi Murmu प्रविष्टि तिथि:\r\n                25 DEC 2025 3:07PM by PIB Delhi On 25 th December, 2025, on the occasion of the Good Governance Day and the Birth Centenary year of the Ol Chiki script developed by Pandit Raghunath Murmu in 1925, the Constitution of India translated into the Santhali language, published for the first time by the Legislative Department, Ministry of Law and Justice has been released by the Hon’ble President of India, Smt. Draupadi Murmu at Rashtrapati Bhawan, New Delhi. The Santhali language, which was included in the Eighth Schedule of the Constitution through the 92nd Amendment Act, 2003, is one of the most ancient living languages of India. It is spoken by a significant number of tribal people in Jharkhand, Odisha, West Bengal and Bihar. Shri. C.P. Radhakrishnan, Hon’ble Vice-President of India, Shri. Arjun Ram Meghwal, Hon’ble Minister of State (I/C), Ministry of Law and Justice and other invitees including the Members of the Santhali speaking community graced the occasion. ***** Samrat/ (रिलीज़ आईडी: 2208484) आगंतुक पटल  : 6 Ministry of Law and Justice Constitution of India translated into Santhali language, published for the first time by Legislative Department, Ministry of Law and Justice released by the Hon’ble President of India, Smt. Draupadi Murmu प्रविष्टि तिथि:\r\n                        25 DEC 2025 3:07PM by PIB Delhi On 25 th December, 2025, on the occasion of the Good Governance Day and the Birth Centenary year of the Ol Chiki script developed by Pandit Raghunath Murmu in 1925, the Constitution of India translated into the Santhali language, published for the first time by the Legislative Department, Ministry of Law and Justice has been released by the Hon’ble President of India, Smt. Draupadi Murmu at Rashtrapati Bhawan, New Delhi. The Santhali language, which was included in the Eighth Schedule of the Constitution through the 92nd Amendment Act, 2003, is one of the most ancient living languages of India. It is spoken by a significant number of tribal people in Jharkhand, Odisha, West Bengal and Bihar. Shri. C.P. Radhakrishnan, Hon’ble Vice-President of India, Shri. Arjun Ram Meghwal, Hon’ble Minister of State (I/C), Ministry of Law and Justice and other invitees including the Members of the Santhali speaking community graced the occasion. ***** Samrat/ (रिलीज़ आईडी: 2208484)",
    "scraped_at": "2025-12-25T09:47:25.353119"
  },
  {
    "id": "2208464",
    "ministry": "Ministry of Personnel, Public Grievances & Pensions",
    "title": "Union Minister Dr. Jitendra Singh Launches Five Transformative Digital Reforms to Strengthen Transparent, Citizen-Centric Administration",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208464",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Personnel, Public Grievances & Pensions Union Minister Dr. Jitendra Singh Launches Five Transformative Digital Reforms to Strengthen Transparent, Citizen-Centric Administration Dr. Jitendra Singh Unveils- Ex-Servicemen Reservation Compendium, AI Recruitment Tool, e-HRMS 2.0 App, iGOT AI Platforms and Karmayogi Digital Learning Lab 2.0 Atal Bihari Vajpayee’s Vision of Good Governance realised in letter and spirit Under PM Modi’s Leadership: Dr. Jitendra Singh प्रविष्टि तिथि:\r\n                25 DEC 2025 1:51PM by PIB Delhi Union Minister of State (Independent Charge) for Science & Technology, Earth Sciences, and Minister of State in the PMO, Personnel, Public Grievances, Pensions, Atomic Energy and Space, Dr Jitendra Singh, today inaugurated the National Workshop on Good Governance Practices 2025 in Delhi. Addressing senior officers of Govt of India, policymakers and stakeholders on the occasion of Good Governance Day, observed annually on 25th December, the Minister highlighted that good governance is not an abstract ideal but a daily administrative responsibility rooted in transparency, accountability and citizen-centric delivery. The Minister noted that Good Governance Day holds special significance as the nation commemorates the birth anniversary of former Prime Minister Atal Bihari Vajpayee, who institutionalised the concept of probity in public life and laid the foundations of people-first governance. He said that while the idea of good governance was articulated earlier, it was after 2014 that it began to be implemented in letter and spirit under the leadership of Prime Minister Narendra Modi, guided by the mantra of “Minimum Government, Maximum Governance”. The Minister said the Department of Personnel and Training (DoPT) is launching five major initiatives on this Good Governance Day, aimed at strengthening core governance processes, supporting key stakeholder groups and equipping civil servants for the challenges of a fast-evolving administrative landscape. The first initiative is a Compendium of Guidelines on Reservation for Ex-Servicemen in Central Government, which consolidates all existing instructions into a single, updated and user-friendly reference. Dr Jitendra Singh said this step reflects the Government’s commitment to honouring the service of Ex-Servicemen by ensuring clarity, uniformity and timely delivery of reservation-related benefits, while also reducing ambiguity and errors in implementation across Ministries and Departments. The second initiative is an AI-powered Recruitment Rules Generator Tool, integrated with the Recruitment Rules Formulation, Amendment and Monitoring System (RRFAMS) portal. The Minister explained that Recruitment Rules are the backbone of fair recruitment and career progression, and the new AI-enabled tool will significantly reduce delays and inconsistencies by guiding users through simple questions, suggesting appropriate recruitment methods and automatically generating draft rules in the prescribed format, fully aligned with DoPT guidelines. The third launch is the mobile application for e-HRMS 2.0, available on Android and iOS, which places key human resource services directly in the hands of government employees. Developed as a core pillar of Mission Karmayogi, e-HRMS 2.0 integrates service records and HR processes such as promotions, transfers, deputations, training and superannuation, along with linkages to platforms like SPARROW, PFMS and Bhavishya. Dr Jitendra Singh said the mobile app will reduce paperwork, speed up approvals and enhance transparency in personnel management. The fourth set of initiatives relates to new AI-enabled features on the iGOT Karmayogi platform. These include iGOT AI Sarthi for intelligent discovery of relevant learning resources, iGOT AI Tutor for personalised in-course support, the iGOT Specialisation Programme offering structured learning pathways in critical domains, and an AI-based Capacity Building Plan Tool to help Ministries and States systematically map roles, competencies and training needs. The fifth initiative is the Karmayogi Digital Learning Lab 2.0, a next-generation facility designed to produce high-quality digital learning content using modern technologies such as AR/VR, gamification and interactive simulations. The Minister said the upgraded lab will enable faster and wider dissemination of best practices, reforms and critical skills across the civil services, strengthening implementation capacity on the ground. Secretary, Department of Personnel and Training, Ms. Rachna Shah, in her address, said that Good Governance Day serves as a reminder of the enduring vision of Atal Bihari Vajpayee that governance must be efficient, transparent and humane. Highlighting the nationwide Prashasan Gaon Ki Ore campaign conducted during Good Governance Week, she said the initiative has covered over 700 districts, with thousands of camps organised to ensure grievance redressal, service delivery and documentation of best practices at the grassroots level. She noted that the Special Campaigns launched since 2021 have transformed administrative culture from pendency-driven processes to outcome-oriented governance, delivering measurable results in efficiency, space optimisation and revenue generation. Concluding his address, Dr Jitendra Singh said that taken together, these initiatives reflect a coherent, future-oriented approach to governance reform, one that leverages technology, strengthens institutions and places citizens and civil servants at the centre of change. On Good Governance Day, he expressed confidence that these measures will further advance India’s journey towards a more responsive, accountable and future-ready governance framework, in the true spirit of Atal Bihari Vajpayee’s legacy. ***** NKR/AK (रिलीज़ आईडी: 2208464) आगंतुक पटल  : 151 Ministry of Personnel, Public Grievances & Pensions Union Minister Dr. Jitendra Singh Launches Five Transformative Digital Reforms to Strengthen Transparent, Citizen-Centric Administration Dr. Jitendra Singh Unveils- Ex-Servicemen Reservation Compendium, AI Recruitment Tool, e-HRMS 2.0 App, iGOT AI Platforms and Karmayogi Digital Learning Lab 2.0 Atal Bihari Vajpayee’s Vision of Good Governance realised in letter and spirit Under PM Modi’s Leadership: Dr. Jitendra Singh प्रविष्टि तिथि:\r\n                        25 DEC 2025 1:51PM by PIB Delhi Union Minister of State (Independent Charge) for Science & Technology, Earth Sciences, and Minister of State in the PMO, Personnel, Public Grievances, Pensions, Atomic Energy and Space, Dr Jitendra Singh, today inaugurated the National Workshop on Good Governance Practices 2025 in Delhi. Addressing senior officers of Govt of India, policymakers and stakeholders on the occasion of Good Governance Day, observed annually on 25th December, the Minister highlighted that good governance is not an abstract ideal but a daily administrative responsibility rooted in transparency, accountability and citizen-centric delivery. The Minister noted that Good Governance Day holds special significance as the nation commemorates the birth anniversary of former Prime Minister Atal Bihari Vajpayee, who institutionalised the concept of probity in public life and laid the foundations of people-first governance. He said that while the idea of good governance was articulated earlier, it was after 2014 that it began to be implemented in letter and spirit under the leadership of Prime Minister Narendra Modi, guided by the mantra of “Minimum Government, Maximum Governance”. The Minister said the Department of Personnel and Training (DoPT) is launching five major initiatives on this Good Governance Day, aimed at strengthening core governance processes, supporting key stakeholder groups and equipping civil servants for the challenges of a fast-evolving administrative landscape. The first initiative is a Compendium of Guidelines on Reservation for Ex-Servicemen in Central Government, which consolidates all existing instructions into a single, updated and user-friendly reference. Dr Jitendra Singh said this step reflects the Government’s commitment to honouring the service of Ex-Servicemen by ensuring clarity, uniformity and timely delivery of reservation-related benefits, while also reducing ambiguity and errors in implementation across Ministries and Departments. The second initiative is an AI-powered Recruitment Rules Generator Tool, integrated with the Recruitment Rules Formulation, Amendment and Monitoring System (RRFAMS) portal. The Minister explained that Recruitment Rules are the backbone of fair recruitment and career progression, and the new AI-enabled tool will significantly reduce delays and inconsistencies by guiding users through simple questions, suggesting appropriate recruitment methods and automatically generating draft rules in the prescribed format, fully aligned with DoPT guidelines. The third launch is the mobile application for e-HRMS 2.0, available on Android and iOS, which places key human resource services directly in the hands of government employees. Developed as a core pillar of Mission Karmayogi, e-HRMS 2.0 integrates service records and HR processes such as promotions, transfers, deputations, training and superannuation, along with linkages to platforms like SPARROW, PFMS and Bhavishya. Dr Jitendra Singh said the mobile app will reduce paperwork, speed up approvals and enhance transparency in personnel management. The fourth set of initiatives relates to new AI-enabled features on the iGOT Karmayogi platform. These include iGOT AI Sarthi for intelligent discovery of relevant learning resources, iGOT AI Tutor for personalised in-course support, the iGOT Specialisation Programme offering structured learning pathways in critical domains, and an AI-based Capacity Building Plan Tool to help Ministries and States systematically map roles, competencies and training needs. The fifth initiative is the Karmayogi Digital Learning Lab 2.0, a next-generation facility designed to produce high-quality digital learning content using modern technologies such as AR/VR, gamification and interactive simulations. The Minister said the upgraded lab will enable faster and wider dissemination of best practices, reforms and critical skills across the civil services, strengthening implementation capacity on the ground. Secretary, Department of Personnel and Training, Ms. Rachna Shah, in her address, said that Good Governance Day serves as a reminder of the enduring vision of Atal Bihari Vajpayee that governance must be efficient, transparent and humane. Highlighting the nationwide Prashasan Gaon Ki Ore campaign conducted during Good Governance Week, she said the initiative has covered over 700 districts, with thousands of camps organised to ensure grievance redressal, service delivery and documentation of best practices at the grassroots level. She noted that the Special Campaigns launched since 2021 have transformed administrative culture from pendency-driven processes to outcome-oriented governance, delivering measurable results in efficiency, space optimisation and revenue generation. Concluding his address, Dr Jitendra Singh said that taken together, these initiatives reflect a coherent, future-oriented approach to governance reform, one that leverages technology, strengthens institutions and places citizens and civil servants at the centre of change. On Good Governance Day, he expressed confidence that these measures will further advance India’s journey towards a more responsive, accountable and future-ready governance framework, in the true spirit of Atal Bihari Vajpayee’s legacy. ***** NKR/AK (रिलीज़ आईडी: 2208464)",
    "scraped_at": "2025-12-25T09:47:27.493657"
  },
  {
    "id": "2208359",
    "ministry": "Ministry of Women and Child Development",
    "title": "Ministry of Women and Child Development to observe 'Veer Bal Diwas' at national level & 'Pradhan Mantri Rashtriya Bal Puraskar' to be conferred tomorrow",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208359",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Women and Child Development Ministry of Women and Child Development to observe 'Veer Bal Diwas' at national level & 'Pradhan Mantri Rashtriya Bal Puraskar' to be conferred tomorrow President of India to confer 'Pradhan Mantri Rashtriya Bal Puraskar’ 20 children from 18 States & UTs who have demonstrated outstanding achievements in diverse fields selected for ‘Pradhan Mantri Rashtriya Bal Puraskar’ National level programme of Veer Bal Diwas to be graced by Prime Minister Programme to commemorate the courage, sacrifice, and exemplary values of India's young heroes Union Minister of Women and Child Development to deliver  welcome  address प्रविष्टि तिथि:\r\n                25 DEC 2025 10:07AM by PIB Delhi The Ministry of Women and Child Development, Government of India, will observe Veer Bal Diwas at the national level tomorrow ( 26 December 2025), to commemorate the courage, sacrifice, and exemplary values of India's young heroes. On the same day, the Pradhan Mantri Rashtriya Bal Puraskar (PMRBP) will be conferred upon children who have demonstrated outstanding achievements in diverse fields. The Pradhan Mantri Rashtriya Bal Puraskar is a prestigious national honour conferred annually by the Government of India on children for exceptional excellence in Bravery, Art & Culture, Environment, Social Service, Science & Technology, and Sports. In 2025, 20 children from 18 States and Union Territories have been selected for this honour. The awards will be conferred by the President of India, Smt. Droupadi Murmu, during a special ceremony on 26 December 2025 at 10:00 AM at Vigyan Bhawan, New Delhi. National level programme of Veer Bal Diwas 2025 will be organised at Bharat Mandapam, New Delhi on 26 December 2025. The national observance will be graced by the Prime Minister Shri Narendra Modi, who will address the children and youth of India and underscore the role of young citizens in nation-building. The programme will highlight stories of bravery, resilience, and selfless service to inspire children and youth, reaffirming the Government of India's commitment to nurturing empowered and responsible citizens in line with Viksit Bharat@2047. Union Minister for Women and Child Development, Smt. Annpurna Devi, will deliver the welcome address. The programme will witness participation from school children, PMRBP awardees, and dignitaries from across the country. Cultural performances showcasing India's rich civilisational heritage and the spirit of bravery will form an integral part of the celebrations. Veer Bal Diwas 2025-A national-level programme, will be telecast live from 12:30 PM onwards on 26 December 2025 on NIC Webcast, DD News, and the Ministry of Women and Child Development's YouTube channel, enabling nationwide participation. **** SS/PC (रिलीज़ आईडी: 2208359) आगंतुक पटल  : 526 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Gujarati , Kannada , Malayalam Ministry of Women and Child Development Ministry of Women and Child Development to observe 'Veer Bal Diwas' at national level & 'Pradhan Mantri Rashtriya Bal Puraskar' to be conferred tomorrow President of India to confer 'Pradhan Mantri Rashtriya Bal Puraskar’ 20 children from 18 States & UTs who have demonstrated outstanding achievements in diverse fields selected for ‘Pradhan Mantri Rashtriya Bal Puraskar’ National level programme of Veer Bal Diwas to be graced by Prime Minister Programme to commemorate the courage, sacrifice, and exemplary values of India's young heroes Union Minister of Women and Child Development to deliver  welcome  address प्रविष्टि तिथि:\r\n                        25 DEC 2025 10:07AM by PIB Delhi The Ministry of Women and Child Development, Government of India, will observe Veer Bal Diwas at the national level tomorrow ( 26 December 2025), to commemorate the courage, sacrifice, and exemplary values of India's young heroes. On the same day, the Pradhan Mantri Rashtriya Bal Puraskar (PMRBP) will be conferred upon children who have demonstrated outstanding achievements in diverse fields. The Pradhan Mantri Rashtriya Bal Puraskar is a prestigious national honour conferred annually by the Government of India on children for exceptional excellence in Bravery, Art & Culture, Environment, Social Service, Science & Technology, and Sports. In 2025, 20 children from 18 States and Union Territories have been selected for this honour. The awards will be conferred by the President of India, Smt. Droupadi Murmu, during a special ceremony on 26 December 2025 at 10:00 AM at Vigyan Bhawan, New Delhi. National level programme of Veer Bal Diwas 2025 will be organised at Bharat Mandapam, New Delhi on 26 December 2025. The national observance will be graced by the Prime Minister Shri Narendra Modi, who will address the children and youth of India and underscore the role of young citizens in nation-building. The programme will highlight stories of bravery, resilience, and selfless service to inspire children and youth, reaffirming the Government of India's commitment to nurturing empowered and responsible citizens in line with Viksit Bharat@2047. Union Minister for Women and Child Development, Smt. Annpurna Devi, will deliver the welcome address. The programme will witness participation from school children, PMRBP awardees, and dignitaries from across the country. Cultural performances showcasing India's rich civilisational heritage and the spirit of bravery will form an integral part of the celebrations. Veer Bal Diwas 2025-A national-level programme, will be telecast live from 12:30 PM onwards on 26 December 2025 on NIC Webcast, DD News, and the Ministry of Women and Child Development's YouTube channel, enabling nationwide participation. **** SS/PC (रिलीज़ आईडी: 2208359)",
    "scraped_at": "2025-12-25T09:47:29.671260"
  },
  {
    "id": "2208381",
    "ministry": "PIB Headquarters",
    "title": "Celebrating 25th Anniversary:",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208381",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters Celebrating 25th Anniversary: Pradhan Mantri Gram Sadak Yojana (PMGSY) Transforming Rural Connectivity in India प्रविष्टि तिथि:\r\n                25 DEC 2025 11:11AM by PIB Delhi Key Takeaways Since Its Inception, 8,25,114 km of rural roads have been sanctioned under PMGSY, with 7,87,520 km completed. Under PMGSY–III, 1,22,393 km were sanctioned, and 1,01,623 km were constructed. Under PMGSY–IV (2024–29), 25,000 habitations to be connected through 62,500 km of roads with an outlay of Rs 70,125 crore . Real-time monitoring through OMMAS, e-MARG, GPS tracking, and a three-tier quality system ensures accountability and durability. Introduction Road infrastructure constitutes a fundamental pillar of rural development, enabling access to economic and social services, enhancing agricultural incomes, creating productive employment opportunities, and making a significant contribution to poverty reduction.  Celebrating 25 years in 2025, the Pradhan Mantri Gram Sadak Yojana (PMGSY) stands out as one of India’s most impactful rural infrastructure initiatives. Launched on 25 December 2000 to ensure all-weather connectivity to previously unconnected rural habitations, the programme has emerged as a key enabler of agricultural growth, employment generation, improved access to education and health services, and poverty alleviation. Over time, PMGSY has evolved into a key driver of socio-economic transformation, strengthening market integration, facilitating better price realization for farmers, and supporting both farm and non-farm livelihoods. Collectively, these outcomes underscore the programme’s central role in advancing inclusive and sustainable rural development. From Connectivity to Consolidation: Phased Progress under PMGSY Since its inception, the Pradhan Mantri Gram Sadak Yojana (PMGSY) has sanctioned a total of 8,25,114 km of rural roads, of which 7,87,520 km have been completed, reflecting nearly 95  percent physical progress as of December 2025. Budgetary allocations to the Pradhan Mantri Gram Sadak Yojana ( PMGSY ) in recent years reflect the government’s sustained emphasis on strengthening rural road connectivity. For the financial year 2025–26 , the programme has been allocated Rs. 19,000 crore , underscoring the continued support for enhancing rural infrastructure, ensuring all-weather road connectivity, and boosting economic opportunities in rural areas. Pradhan Mantri Gram Sadak Yojana (PMGSY) Phase – I (2000) Launched in 2000, Phase I of the programme served as the flagship initiative to provide all-weather road connectivity to eligible, previously unconnected rural habitations. It established the foundation for universal rural access by linking villages with markets, educational institutions, and healthcare facilities. Road connectivity projects for a total of 1,63,339 rural habitations have been sanctioned nationwide under Phase I. PMGSY Phase - II (2013) Introduced in 2013 , Phase II of the programme focused on strengthening and consolidating the existing rural road network. It prioritized the upgradation of economically important routes linking rural markets, growth centers, and service hubs, with the objective of improving transportation efficiency and accelerating rural economic development. Road Connectivity Project for Left Wing Extremism Affected Areas (RCPLWEA) – (2016) Launched in 2016, the road connectivity project for Left Wing Extremism Affected Area (RCPLWEA) is a targeted intervention for infrastructure development covering 44 most severely affected Left Wing Extremism (LWE) districts and adjoining areas across nine States - Andhra Pradesh, Bihar, Chhattisgarh, Jharkhand, Madhya Pradesh, Maharashtra, Odisha, Telangana, and Uttar Pradesh. The scheme serves a dual objective: Strengthen security operations by enhancing the mobility of security forces. Promote socio-economic development by improving access to markets, educational institutions, and healthcare services in remote and underserved regions. PMGSY Phase III- (2019) Launched in 2019, Phase III of the programme focuses on upgrading 1,25,000 km of Through Routes and Major Rural Links to strengthen connectivity between rural habitations and key socio-economic institutions, including Gramin Agricultural Markets (GrAMs), higher secondary schools, and healthcare facilities. As of December 2025, out of the total target, 1,22,393 km of road have been sanctioned, and 1,01,623 km (83%) have been constructed nationwide. The PMGSY-III has significantly improved mobility, enhanced access to education and healthcare, facilitated better integration with agricultural markets, increased employment opportunities, and contributed to broader rural socio-economic transformation. PMGSY Phase – IV (2024) A total road length of 62,500 kilometres is proposed to be constructed during the implementation period from FY 2024–25 to 2028–29, with an overall financial outlay of Rs. 70,125 crore. Phase IV of the Pradhan Mantri Gram Sadak Yojana (PMGSY) aims to provide all-weather road connectivity to 25,000 unconnected rural habitations, based on Census 2011 population criteria: Habitats with a population of 500 and above in plain areas, 250 and above in North-Eastern and Himalayan States/UTs, and Habitations located in special category areas, including Tribal (Schedule V) regions, Aspirational Districts/Blocks, and Desert areas. Application of Advanced Technologies in Rural Road Development The Government’s systematic measures have significantly improved the quality, durability, and sustainability of rural roads constructed under PMGSY. Progress and performance of PMGSY road projects are closely monitored using advanced digital technologies and online platforms, ensuring greater efficiency, transparency, and accountability. Online Management, Monitoring, and Accounting System (OMMAS) The Online Management, Monitoring, and Accounting System ( OMMAS) enables real-time monitoring of all works under the Pradhan Mantri Gram Sadak Yojana, ensuring that physical and financial progress remains aligned with the targets assigned to states. To further strengthen the Project Management Information System (PMIS) , it has been integrated within OMMAS to facilitate more effective management of construction activities for each road sanctioned under PMGSY-III. OMMAS also supports quality assurance by capturing assessments carried out by independent quality monitors. Inspections conducted by National Quality Monitors (NQMs) and State Quality Monitors (SQMs) are uploaded through the Quality Monitoring System (QMS) mobile application, along with geo-tagged photographs from the field, and are subsequently reflected on the OMMAS portal. This framework enables real-time quality monitoring and enhances transparency in the delivery of durable rural infrastructure. e-MARG (electronic Maintenance of Rural Roads) The Electronic Maintenance of PMGSY Roads (e-MARG) platform has been implemented across all States to ensure systematic monitoring of PMGSY road maintenance for a period of five years from the date of completion, corresponding to the Defect Liability Period (DLP). With the introduction of e-MARG as a dedicated software module for maintenance payments, contractor payments during the DLP are now directly linked to road performance and quality outcomes. This performance-based contract management system has significantly strengthened accountability, improved maintenance standards, and enhanced the long-term durability of PMGSY assets. Use of Global Positioning System (GPS) To strengthen transparency and accountability in road construction, the mandatory installation of a GPS-enabled Vehicle Tracking System (VTS) on all vehicles, machinery, and equipment deployed by contractors and Programme Implementation Units (PIUs) for PMGSY III works has been enforced since May 2022. This mechanism enables continuous monitoring of equipment deployment and operational duration, thereby ensuring adherence to prescribed construction processes and contributing to the attainment of stipulated road quality standards. D. Robust Technical Standards The adoption of environmentally sustainable materials and advanced construction technologies in road development is actively promoted. Drawing on international best practices and evidence from indigenous research, the Indian Roads Congress (IRC) has formulated new standards and periodically revised existing guidelines to facilitate the adoption of such innovations. Accordingly, a wide range of eco-friendly materials, including fly ash, slag, construction and demolition waste, waste plastic, crumb rubber modified bitumen, geosynthetics, bio-bitumen, and bio-engineering measures, are being deployed in national Highway projects, subject to their availability and technical feasibility. Innovation and Climate Resilience The adoption of innovative construction technologies, including the utilization of waste plastic, cold mix techniques, and Full Depth Reclamation, has enhanced the durability of rural roads while mitigating environmental impacts. As of July 2025, these sustainable methods have been employed in the construction of more than 1.24 lakh Km of roads, reflecting a strategic shift towards resilient and eco-friendly rural infrastructure development. Three-Tier Quality Monitoring To ensure the quality and long-term durability of rural roads, a robust three-tier Quality Monitoring System has been institutionalized. Tier 1 : Field-level quality checks by the executing agencies. Tier 2 : Inspections by independent State Quality Monitors (SQMs). Tier 3 : Surprise audits by National Quality Monitors (NQMs) deputed by the Ministry. All Progress and quality assessments are monitored in real-time through the Online Management, Monitoring, and Accounting System (OMMAS). Conclusion As the Pradhan Mantri Gram Sadak Yojana (PMGSY) marks 25 years of transformative impact in 2025 , it stands as a defining pillar of India’s rural development journey. With nearly 96 percent of the sanctioned rural road length completed, the programme has significantly enhanced rural accessibility, strengthened market linkages, improved access to education and healthcare, and accelerated inclusive economic growth. The phased evolution of PMGSY, from ensuring basic connectivity to consolidating networks, developing strategic rural links, and advancing universal last-mile access under Phase IV. The integration of advanced digital monitoring systems such as OMMAS, e-MARG, GPS-enabled tracking, and a robust three-tier quality assurance mechanism has ensured transparency, accountability, durability, and climate resilience. Aligned with the Sustainable Development Goals, PMGSY extends beyond infrastructure creation to promote environmental sustainability, poverty reduction, and inclusive rural transformation. References Press Information Bureau https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=155199&ModuleId=3&reg=3&lang=1 Lok Sabha and Rajya Sabha Questions https://sansad.in/getFile/annex/269/AU721_d4mLjX.pdf?source=pqars https://sansad.in/getFile/loksabhaquestions/annex/185/AS321_1O3k2I.pdf?source=pqals Ministry of Rural Development https://www.civilapps.in/files/PMGSY/PMGSY-IV/1-Overview.pdf https://pmgsy.nic.in/sites/default/files/circular/GuidelinesfirsttierQM.pdf https://omms.nic.in/dbweb/ https://pmgsy.dord.gov.in/dbweb/Home/PMGSYIII https://pmgsy.dord.gov.in/dbweb/Home/HabitationCoverage https://pmgsy.dord.gov.in/dbweb/Home/TableView Click here for pdf file. *** PIB Research (रिलीज़ आईडी: 2208381) आगंतुक पटल  : 294 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Bengali PIB Headquarters Celebrating 25th Anniversary: Pradhan Mantri Gram Sadak Yojana (PMGSY) Transforming Rural Connectivity in India प्रविष्टि तिथि:\r\n                        25 DEC 2025 11:11AM by PIB Delhi Key Takeaways Since Its Inception, 8,25,114 km of rural roads have been sanctioned under PMGSY, with 7,87,520 km completed. Under PMGSY–III, 1,22,393 km were sanctioned, and 1,01,623 km were constructed. Under PMGSY–IV (2024–29), 25,000 habitations to be connected through 62,500 km of roads with an outlay of Rs 70,125 crore . Real-time monitoring through OMMAS, e-MARG, GPS tracking, and a three-tier quality system ensures accountability and durability. Introduction Road infrastructure constitutes a fundamental pillar of rural development, enabling access to economic and social services, enhancing agricultural incomes, creating productive employment opportunities, and making a significant contribution to poverty reduction.  Celebrating 25 years in 2025, the Pradhan Mantri Gram Sadak Yojana (PMGSY) stands out as one of India’s most impactful rural infrastructure initiatives. Launched on 25 December 2000 to ensure all-weather connectivity to previously unconnected rural habitations, the programme has emerged as a key enabler of agricultural growth, employment generation, improved access to education and health services, and poverty alleviation. Over time, PMGSY has evolved into a key driver of socio-economic transformation, strengthening market integration, facilitating better price realization for farmers, and supporting both farm and non-farm livelihoods. Collectively, these outcomes underscore the programme’s central role in advancing inclusive and sustainable rural development. From Connectivity to Consolidation: Phased Progress under PMGSY Since its inception, the Pradhan Mantri Gram Sadak Yojana (PMGSY) has sanctioned a total of 8,25,114 km of rural roads, of which 7,87,520 km have been completed, reflecting nearly 95  percent physical progress as of December 2025. Budgetary allocations to the Pradhan Mantri Gram Sadak Yojana ( PMGSY ) in recent years reflect the government’s sustained emphasis on strengthening rural road connectivity. For the financial year 2025–26 , the programme has been allocated Rs. 19,000 crore , underscoring the continued support for enhancing rural infrastructure, ensuring all-weather road connectivity, and boosting economic opportunities in rural areas. Pradhan Mantri Gram Sadak Yojana (PMGSY) Phase – I (2000) Launched in 2000, Phase I of the programme served as the flagship initiative to provide all-weather road connectivity to eligible, previously unconnected rural habitations. It established the foundation for universal rural access by linking villages with markets, educational institutions, and healthcare facilities. Road connectivity projects for a total of 1,63,339 rural habitations have been sanctioned nationwide under Phase I. PMGSY Phase - II (2013) Introduced in 2013 , Phase II of the programme focused on strengthening and consolidating the existing rural road network. It prioritized the upgradation of economically important routes linking rural markets, growth centers, and service hubs, with the objective of improving transportation efficiency and accelerating rural economic development. Road Connectivity Project for Left Wing Extremism Affected Areas (RCPLWEA) – (2016) Launched in 2016, the road connectivity project for Left Wing Extremism Affected Area (RCPLWEA) is a targeted intervention for infrastructure development covering 44 most severely affected Left Wing Extremism (LWE) districts and adjoining areas across nine States - Andhra Pradesh, Bihar, Chhattisgarh, Jharkhand, Madhya Pradesh, Maharashtra, Odisha, Telangana, and Uttar Pradesh. The scheme serves a dual objective: Strengthen security operations by enhancing the mobility of security forces. Promote socio-economic development by improving access to markets, educational institutions, and healthcare services in remote and underserved regions. PMGSY Phase III- (2019) Launched in 2019, Phase III of the programme focuses on upgrading 1,25,000 km of Through Routes and Major Rural Links to strengthen connectivity between rural habitations and key socio-economic institutions, including Gramin Agricultural Markets (GrAMs), higher secondary schools, and healthcare facilities. As of December 2025, out of the total target, 1,22,393 km of road have been sanctioned, and 1,01,623 km (83%) have been constructed nationwide. The PMGSY-III has significantly improved mobility, enhanced access to education and healthcare, facilitated better integration with agricultural markets, increased employment opportunities, and contributed to broader rural socio-economic transformation. PMGSY Phase – IV (2024) A total road length of 62,500 kilometres is proposed to be constructed during the implementation period from FY 2024–25 to 2028–29, with an overall financial outlay of Rs. 70,125 crore. Phase IV of the Pradhan Mantri Gram Sadak Yojana (PMGSY) aims to provide all-weather road connectivity to 25,000 unconnected rural habitations, based on Census 2011 population criteria: Habitats with a population of 500 and above in plain areas, 250 and above in North-Eastern and Himalayan States/UTs, and Habitations located in special category areas, including Tribal (Schedule V) regions, Aspirational Districts/Blocks, and Desert areas. Application of Advanced Technologies in Rural Road Development The Government’s systematic measures have significantly improved the quality, durability, and sustainability of rural roads constructed under PMGSY. Progress and performance of PMGSY road projects are closely monitored using advanced digital technologies and online platforms, ensuring greater efficiency, transparency, and accountability. Online Management, Monitoring, and Accounting System (OMMAS) The Online Management, Monitoring, and Accounting System ( OMMAS) enables real-time monitoring of all works under the Pradhan Mantri Gram Sadak Yojana, ensuring that physical and financial progress remains aligned with the targets assigned to states. To further strengthen the Project Management Information System (PMIS) , it has been integrated within OMMAS to facilitate more effective management of construction activities for each road sanctioned under PMGSY-III. OMMAS also supports quality assurance by capturing assessments carried out by independent quality monitors. Inspections conducted by National Quality Monitors (NQMs) and State Quality Monitors (SQMs) are uploaded through the Quality Monitoring System (QMS) mobile application, along with geo-tagged photographs from the field, and are subsequently reflected on the OMMAS portal. This framework enables real-time quality monitoring and enhances transparency in the delivery of durable rural infrastructure. e-MARG (electronic Maintenance of Rural Roads) The Electronic Maintenance of PMGSY Roads (e-MARG) platform has been implemented across all States to ensure systematic monitoring of PMGSY road maintenance for a period of five years from the date of completion, corresponding to the Defect Liability Period (DLP). With the introduction of e-MARG as a dedicated software module for maintenance payments, contractor payments during the DLP are now directly linked to road performance and quality outcomes. This performance-based contract management system has significantly strengthened accountability, improved maintenance standards, and enhanced the long-term durability of PMGSY assets. Use of Global Positioning System (GPS) To strengthen transparency and accountability in road construction, the mandatory installation of a GPS-enabled Vehicle Tracking System (VTS) on all vehicles, machinery, and equipment deployed by contractors and Programme Implementation Units (PIUs) for PMGSY III works has been enforced since May 2022. This mechanism enables continuous monitoring of equipment deployment and operational duration, thereby ensuring adherence to prescribed construction processes and contributing to the attainment of stipulated road quality standards. D. Robust Technical Standards The adoption of environmentally sustainable materials and advanced construction technologies in road development is actively promoted. Drawing on international best practices and evidence from indigenous research, the Indian Roads Congress (IRC) has formulated new standards and periodically revised existing guidelines to facilitate the adoption of such innovations. Accordingly, a wide range of eco-friendly materials, including fly ash, slag, construction and demolition waste, waste plastic, crumb rubber modified bitumen, geosynthetics, bio-bitumen, and bio-engineering measures, are being deployed in national Highway projects, subject to their availability and technical feasibility. Innovation and Climate Resilience The adoption of innovative construction technologies, including the utilization of waste plastic, cold mix techniques, and Full Depth Reclamation, has enhanced the durability of rural roads while mitigating environmental impacts. As of July 2025, these sustainable methods have been employed in the construction of more than 1.24 lakh Km of roads, reflecting a strategic shift towards resilient and eco-friendly rural infrastructure development. Three-Tier Quality Monitoring To ensure the quality and long-term durability of rural roads, a robust three-tier Quality Monitoring System has been institutionalized. Tier 1 : Field-level quality checks by the executing agencies. Tier 2 : Inspections by independent State Quality Monitors (SQMs). Tier 3 : Surprise audits by National Quality Monitors (NQMs) deputed by the Ministry. All Progress and quality assessments are monitored in real-time through the Online Management, Monitoring, and Accounting System (OMMAS). Conclusion As the Pradhan Mantri Gram Sadak Yojana (PMGSY) marks 25 years of transformative impact in 2025 , it stands as a defining pillar of India’s rural development journey. With nearly 96 percent of the sanctioned rural road length completed, the programme has significantly enhanced rural accessibility, strengthened market linkages, improved access to education and healthcare, and accelerated inclusive economic growth. The phased evolution of PMGSY, from ensuring basic connectivity to consolidating networks, developing strategic rural links, and advancing universal last-mile access under Phase IV. The integration of advanced digital monitoring systems such as OMMAS, e-MARG, GPS-enabled tracking, and a robust three-tier quality assurance mechanism has ensured transparency, accountability, durability, and climate resilience. Aligned with the Sustainable Development Goals, PMGSY extends beyond infrastructure creation to promote environmental sustainability, poverty reduction, and inclusive rural transformation. References Press Information Bureau https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=155199&ModuleId=3&reg=3&lang=1 Lok Sabha and Rajya Sabha Questions https://sansad.in/getFile/annex/269/AU721_d4mLjX.pdf?source=pqars https://sansad.in/getFile/loksabhaquestions/annex/185/AS321_1O3k2I.pdf?source=pqals Ministry of Rural Development https://www.civilapps.in/files/PMGSY/PMGSY-IV/1-Overview.pdf https://pmgsy.nic.in/sites/default/files/circular/GuidelinesfirsttierQM.pdf https://omms.nic.in/dbweb/ https://pmgsy.dord.gov.in/dbweb/Home/PMGSYIII https://pmgsy.dord.gov.in/dbweb/Home/HabitationCoverage https://pmgsy.dord.gov.in/dbweb/Home/TableView Click here for pdf file. *** PIB Research (रिलीज़ आईडी: 2208381)",
    "scraped_at": "2025-12-25T09:47:32.553100"
  }
]