[
  {
    "id": "2206902",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister extends greetings to Sashastra Seema Bal personnel on Raising Day",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206902",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister extends greetings to Sashastra Seema Bal personnel on Raising Day प्रविष्टि तिथि:\r\n                20 DEC 2025 11:29AM by PIB Delhi The Prime Minister, Narendra Modi, has extended his greetings to all personnel associated with the Sashastra Seema Bal on their Raising Day. The Prime Minister said that the SSB’s unwavering dedication reflects the highest traditions of service and that their sense of duty remains a strong pillar of the nation’s safety. He noted that from challenging terrains to demanding operational conditions, the SSB stands ever vigilant. The Prime Minister wrote on X; “On the Raising Day of the Sashastra Seema Bal, I extend my greetings to all personnel associated with this force. SSB’s unwavering dedication reflects the highest traditions of service. Their sense of duty remains a strong pillar of our nation’s safety. From challenging terrains to demanding operational conditions, the SSB stands ever vigilant. Wishing them the very best in their endeavours ahead. @SSB_INDIA” On the Raising Day of the Sashastra Seema Bal, I extend my greetings to all personnel associated with this force. SSB’s unwavering dedication reflects the highest traditions of service. Their sense of duty remains a strong pillar of our nation’s safety. From challenging terrains… pic.twitter.com/ic6CEYt3Kw — Narendra Modi (@narendramodi) December 20, 2025 *********** MJPS/ST (रिलीज़ आईडी: 2206902) आगंतुक पटल  : 246 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Bengali , Gujarati , Malayalam Prime Minister's Office Prime Minister extends greetings to Sashastra Seema Bal personnel on Raising Day प्रविष्टि तिथि:\r\n                        20 DEC 2025 11:29AM by PIB Delhi The Prime Minister, Narendra Modi, has extended his greetings to all personnel associated with the Sashastra Seema Bal on their Raising Day. The Prime Minister said that the SSB’s unwavering dedication reflects the highest traditions of service and that their sense of duty remains a strong pillar of the nation’s safety. He noted that from challenging terrains to demanding operational conditions, the SSB stands ever vigilant. The Prime Minister wrote on X; “On the Raising Day of the Sashastra Seema Bal, I extend my greetings to all personnel associated with this force. SSB’s unwavering dedication reflects the highest traditions of service. Their sense of duty remains a strong pillar of our nation’s safety. From challenging terrains to demanding operational conditions, the SSB stands ever vigilant. Wishing them the very best in their endeavours ahead. @SSB_INDIA” On the Raising Day of the Sashastra Seema Bal, I extend my greetings to all personnel associated with this force. SSB’s unwavering dedication reflects the highest traditions of service. Their sense of duty remains a strong pillar of our nation’s safety. From challenging terrains… pic.twitter.com/ic6CEYt3Kw — Narendra Modi (@narendramodi) December 20, 2025 *********** MJPS/ST (रिलीज़ आईडी: 2206902)",
    "scraped_at": "2025-12-20T09:35:09.572473"
  },
  {
    "id": "2206863",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister and Minister of Cooperation Shri Amit Shah extends greetings to Sashastra Seema Bal (SSB) personnel and their families on Raising Day",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206863",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah extends greetings to Sashastra Seema Bal (SSB) personnel and their families on Raising Day From safeguarding our frontiers to standing shoulder-to-shoulder with citizens in times of crisis, the Sashastra Seema Bal (SSB) has always made the nation proud Salutations to martyrs who made the ultimate sacrifice in the line of duty प्रविष्टि तिथि:\r\n                20 DEC 2025 9:23AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has extended greetings to Sashastra Seema Bal (SSB) personnel and their families on Raising Day. In a post on ‘X’, Union Home Minister Shri Amit Shah said “Greetings to SSB personnel and their families on Raising Day. From safeguarding our frontiers to standing shoulder-to-shoulder with citizens in times of crisis, the Sashastra Seema Bal (SSB) has always made the nation proud. Salutations to martyrs who made the ultimate sacrifice in the line of duty.” Greetings to SSB personnel and their families on Raising Day. From safeguarding our frontiers to standing shoulder-to-shoulder with citizens in times of crisis, the @SSB_INDIA has always made the nation proud. Salutations to martyrs who made the ultimate sacrifice in the line of… pic.twitter.com/RNrGs7HSYY — Amit Shah (@AmitShah) December 20, 2025 *** RR / PS (रिलीज़ आईडी: 2206863) आगंतुक पटल  : 319 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Marathi , हिन्दी , Gujarati , Malayalam Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah extends greetings to Sashastra Seema Bal (SSB) personnel and their families on Raising Day From safeguarding our frontiers to standing shoulder-to-shoulder with citizens in times of crisis, the Sashastra Seema Bal (SSB) has always made the nation proud Salutations to martyrs who made the ultimate sacrifice in the line of duty प्रविष्टि तिथि:\r\n                        20 DEC 2025 9:23AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has extended greetings to Sashastra Seema Bal (SSB) personnel and their families on Raising Day. In a post on ‘X’, Union Home Minister Shri Amit Shah said “Greetings to SSB personnel and their families on Raising Day. From safeguarding our frontiers to standing shoulder-to-shoulder with citizens in times of crisis, the Sashastra Seema Bal (SSB) has always made the nation proud. Salutations to martyrs who made the ultimate sacrifice in the line of duty.” Greetings to SSB personnel and their families on Raising Day. From safeguarding our frontiers to standing shoulder-to-shoulder with citizens in times of crisis, the @SSB_INDIA has always made the nation proud. Salutations to martyrs who made the ultimate sacrifice in the line of… pic.twitter.com/RNrGs7HSYY — Amit Shah (@AmitShah) December 20, 2025 *** RR / PS (रिलीज़ आईडी: 2206863)",
    "scraped_at": "2025-12-20T09:35:12.343352"
  },
  {
    "id": "2206938",
    "ministry": "Ministry of Minority Affairs",
    "title": "National Commission for Minorities has played a pivotal role in ensuring the protection, welfare, and empowerment of religious minorities.",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206938",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Minority Affairs National Commission for Minorities has played a pivotal role in ensuring the protection, welfare, and empowerment of religious minorities. प्रविष्टि तिथि:\r\n                20 DEC 2025 2:44PM by PIB Delhi National Commission for Minorities celebrated the Minorities Day on December 18 th 2025. The community leaders from six minority communities – Muslims, Sikhs, Christians, Buddhists, Jains, and Zoroastrian (Parsi) spoke on the occasion. The Guest Speaker Dr. Michael V. Williams of Mount Carmel School reminded the gathering why Minority Day matters, underlining the Christian community’s long and quiet contribution to nation-building through education and healthcare—institutions that serve far beyond denominational boundaries. Md. Tauhid Alam of Jamia Hamdardset minority welfare within the broader framework of Sabka Saath, Sabka Vishwas, Sabka Vikas, and emphasized that governance today is all about inclusion. Prof. Harbans Singh of Khalsa College drew message from Gurubani to explain how coexistence and collective prosperity are not slogans but lived traditions. Acharya Yeshi Phuntsok and Dr. Indu Jain spoke candidly about the challenges faced by Buddhist and Jain communities, seeking responsive redressal from the National Commission for Minorities. Veteran Parsi leader Shri Marazban Nariman Zaiwalla closed by detailing minority-focused programmes and the NCM’s role as a bridge—bringing India’s many communities onto a shared civic platform. Open Session for Minority Community A sizeable gathering from minority communities participated actively in the event. During the open session, several queries were raised, covering issues ranging from Minority Certificates to the implementation of various government schemes. The interaction reflected strong engagement and a shared commitment to addressing concerns through dialogue. Creating an Inclusive Society Ms Alka Upadhyaya,Secretary, NCM, elaborated on the government schemes aimed at uplifting minority communities. She stated that minority communities have made invaluable contributions to the nation’s rich social, cultural, and economic fabric. National Commission for Minorities has been working tirelessly to build an inclusive and equitable society. She spoke about the various initiatives for the upliftment of minority communities, including schemes related to education, skill development, financial support, and empowerment. She emphasized that government actions are guided by the vision of ensuring that no one is left behind and that all communities, irrespective of their background, have equal opportunities for progress and prosperity. She also underlined the importance of continuous dialogue among different communities. Ms Upadhyaya, Secretary, NCM further stated that since its inception, the National Commission for Minorities has played a pivotal role in ensuring the protection, welfare, and empowerment of religious minorities in India. She assured that the voices of minorities are heard, their issues addressed, and their aspirations fulfilled through continuous engagement with State Governments, stakeholders, and minority communities. *** AK/MR (रिलीज़ आईडी: 2206938) आगंतुक पटल  : 36 Ministry of Minority Affairs National Commission for Minorities has played a pivotal role in ensuring the protection, welfare, and empowerment of religious minorities. प्रविष्टि तिथि:\r\n                        20 DEC 2025 2:44PM by PIB Delhi National Commission for Minorities celebrated the Minorities Day on December 18 th 2025. The community leaders from six minority communities – Muslims, Sikhs, Christians, Buddhists, Jains, and Zoroastrian (Parsi) spoke on the occasion. The Guest Speaker Dr. Michael V. Williams of Mount Carmel School reminded the gathering why Minority Day matters, underlining the Christian community’s long and quiet contribution to nation-building through education and healthcare—institutions that serve far beyond denominational boundaries. Md. Tauhid Alam of Jamia Hamdardset minority welfare within the broader framework of Sabka Saath, Sabka Vishwas, Sabka Vikas, and emphasized that governance today is all about inclusion. Prof. Harbans Singh of Khalsa College drew message from Gurubani to explain how coexistence and collective prosperity are not slogans but lived traditions. Acharya Yeshi Phuntsok and Dr. Indu Jain spoke candidly about the challenges faced by Buddhist and Jain communities, seeking responsive redressal from the National Commission for Minorities. Veteran Parsi leader Shri Marazban Nariman Zaiwalla closed by detailing minority-focused programmes and the NCM’s role as a bridge—bringing India’s many communities onto a shared civic platform. Open Session for Minority Community A sizeable gathering from minority communities participated actively in the event. During the open session, several queries were raised, covering issues ranging from Minority Certificates to the implementation of various government schemes. The interaction reflected strong engagement and a shared commitment to addressing concerns through dialogue. Creating an Inclusive Society Ms Alka Upadhyaya,Secretary, NCM, elaborated on the government schemes aimed at uplifting minority communities. She stated that minority communities have made invaluable contributions to the nation’s rich social, cultural, and economic fabric. National Commission for Minorities has been working tirelessly to build an inclusive and equitable society. She spoke about the various initiatives for the upliftment of minority communities, including schemes related to education, skill development, financial support, and empowerment. She emphasized that government actions are guided by the vision of ensuring that no one is left behind and that all communities, irrespective of their background, have equal opportunities for progress and prosperity. She also underlined the importance of continuous dialogue among different communities. Ms Upadhyaya, Secretary, NCM further stated that since its inception, the National Commission for Minorities has played a pivotal role in ensuring the protection, welfare, and empowerment of religious minorities in India. She assured that the voices of minorities are heard, their issues addressed, and their aspirations fulfilled through continuous engagement with State Governments, stakeholders, and minority communities. *** AK/MR (रिलीज़ आईडी: 2206938)",
    "scraped_at": "2025-12-20T09:35:14.295835"
  },
  {
    "id": "2206929",
    "ministry": "Ministry of Railways",
    "title": "38 Projects of New Lines, Gauge Conversion and Doubling of 5,098 Km Costing ₹89,780 Crore Sanctioned in Maharashtra",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206929",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Railways 38 Projects of New Lines, Gauge Conversion and Doubling of 5,098 Km Costing ₹89,780 Crore Sanctioned in Maharashtra 98 Surveys of New Line, Gauge Conversion and Doubling of 8,603 Km Sanctioned in Maharashtra During 2022-23 to 2025-26 To Enhance Passenger Carrying Capacity, 238 Rakes of 12 Cars with Doors Sanctioned under MUTP-III & IIIA at a Cost of ₹19,293 Crore प्रविष्टि तिथि:\r\n                20 DEC 2025 2:20PM by PIB Delhi Budget allocation during the last five years has increased significantly. Budget allocation for infrastructure projects and safety works, falling fully/partly in the State of Maharashtra is as under: Period Outlay 2009-14 ₹1,171 crore/year 2025-26 ₹23,778 crore (More than 20 times) The details of commissioning/laying of new track falling fully/partly in the State of Maharashtra during 2009-14 and 2014-25 is as under: Period New track Commissioned Average commissioning of new tracks 2009-14 292 Km 58.4 Km/year 2014-25 2,292 Km 208.36 Km/year (More than 3 times) Capacity Augmentation works for Mumbai Suburban area Presently, about 120 originating Mail/Express trains and about 3200 sub urban trains are handled daily in Mumbai area. To increase capacity and improve safety, several steps have been taken by Indian Railways as under: To increase train handling capacity at various stations in Mumbai area, following works have been completed/taken up/planned at various stations: SN Location Details 1 Bandra Terminus 3 Pit Lines have been completed 2 Mumbai Central Platform extension for 24 LHB coaches 3 Jogeshwari 2 additional platforms 4 Dadar 1 additional platform 5 Vasai road 6 platforms, 3 pit lines and 5 stabling lines 6 Panvel-Kalamboli 5 platforms, 4 pit lines and 2 sick lines 7 Kalyan 6 platforms and 4 pit lines 8 LTT 4 platforms and 2 pit lines 9 Parel 6 platforms, 5 pit lines, 6 stabling lines 10 Virar 25 stabling lines 11 Dahanu road 11 stabling lines 12 Mira road 25 stabling lines In addition to above, Platform extension work at 34 stations to accommodate 15 car EMUs have been taken up. To improve the capacity of rail network in Mumbai suburban area, Mumbai Urban Transport Project (MUTP)-II costing ₹8,087 crore, MUTP-III costing ₹10,947 crore and MUTP-IIIA costing ₹33,690 crore have been sanctioned. These projects include following works in Mumbai Suburban Area: SN Name of Project Cost (in Cr.) 1 CSMT-Kurla 5 th & 6 th Line (MUTP-II) (17.5 km) 891 2 Mumbai Central-Borivali 6 th Line (MUTP-II) (30 km) 919 3 Extension of Harbour Line from Goregaon-Borivali (MUTP-IIIA) (7 km) 826 4 Borivali-Virar 5 th & 6 th Line (MUTP-IIIA) (26 km) 2,184 5 Virar-Dahanu Road 3 rd & 4 th Line (MUTP-III) (64 km) 3,587 6 Panvel-Karjat Suburban Corridor (MUTP-III) (29.6 km) 2,782 7 Airoli-Kalwa (elevated) Suburban Corridor link (MUTP-III) (3.3 km) 476 8 Kalyan-Asangaon 4 th Line (MUTP-IIIA) (32 km) 1,759 9 Kalyan-Badlapur 3 rd & 4 th line (MUTP-IIIA) (14 km) 1,510 10 Kalyan-Kasara 3 rd Line (67 km) 793 11 Naigaon-Juichandra double chord Line (6 km) 176 12 Nilaje-Kopar double chord Line (5 km) 338 13 Kalyan Yard remodeling work 866 To enhance passenger carrying capacity, 238 rakes of 12 cars each with doors have been sanctioned under MUTP-III & IIIA at a cost of ₹19,293 crore. The process for procurement of these rakes has been taken up. As on 01.04.2025, 38 projects (11 New Lines, 02 Gauge Conversion and 25 Doubling), of a total length of 5,098 Km, costing ₹89,780 crore, falling fully/partly in Maharashtra, are sanctioned. The summary is as under:- Category No. of sanctioned Projects Total Length (in Km) Length Commissioned Upto Mar'25 (Km) Exp. upto Mar'25 ( ₹ in Cr.) New Line 11 1,355 234 10,504 Gauge Conversion 02 609 334 4,286 Doubling/ Multitracking 25 3,134 1,792 24,617 Total 38 5,098 2,360 39,407 Details of some of the recently completed projects falling fully/partly in Maharashtra are as under: S.No. Project Cost (₹ in crore) 1 Pune-Miraj-Londa Doubling (467 Km) 4,670 2 Manmad-Jalgaon 3rd line (160 Km) 2,574 3 Jabalpur-Gondia Gauge Conversion (300 Km) 2,005 4 Chhindwara-Nagpur Gauge Conversion (150 Km) 1,512 5 Panvel-Pen Doubling (35 Km) 263 6 Pen-Roha Doubling (40 Km) 330 7 Udhna-Jalgaon Doubling (307 Km) 2,448 8 Mudkhed-Parbhani Doubling (81 Km) 673 9 Bhusawal-Jalgaon 3rd line (24 Km) 325 10 Jalgaon-Bhusawal 4th line (24 Km) 261 11 Daund-Gulbarga Doubling (225 Km) 3,182 Some of the main projects falling fully/partly in the Maharashtra which have been taken up are as under: S.No. Name of the project Cost (₹ In crore) 1 Gondia-Ballarshah (Chanda Fort) doubling (240 Km) 4,373 2 Hotgi Byepass line (6 Km) 177 3 Panvel-Chouk doubling section (17 Km) 491 4 Panvel-Somtane Chord line and Panvel-Chikhli Chord line (8 Km) 445 5 Miraj Chord line (2 Km) 129 6 Wardha-Balharshah quadrupling (135 Km) 2,226 7 Puntamba-Sainagar Shirdi doubling (17 Km) 227 8 Itarsi-Nagpur 4 th line (297 Km) 5,010 9 Chhatrapati Sambhajinagar-Parbhani doubling (177 Km) 2,006 10 Gondia-Dongargarh 4th line (84 Km) 1,985 11 Wardha-Bhusawal 3 rd & 4 th line (314 Km) 8,199 12 Jalgaon-Bhadli 5 th line (9 Km) 114 13 Gondia bypass line (19 Km) 354 14 Jalgaon-Manmad 4 th line (160 km) 2,574 15 Bhusawal-Khandwa 3 rd & 4 th line (131 Km) 3,285 16 Mudkhed-Medchal & Mahbubnagar-Dhone doubling (417 Km) 4,686 17 Chhatrapati Sambhajinagar-Ankai doubling (98 Km) 961 18 Nilaje and Kopar double chord Line (5 Km) 338 19 Mudkhed junction bypass line (3 Km) 62 20 Purna bypass line (3 Km) 72 21 Ankai bypass Line (2 Km) 29 22 Parbhani-Parli Vaijanath doubling (65 Km) 770 23 Latur Road Station bypass line (2 Km) 47 24 Parli-Vaijanath Station bypass line (2 Km) 56 25 Pachora-Jamner gauge conversion with extension upto Malkapur (84 Km) 955 26 Vadhavan Port-New Palghar doubling (22 Km) 1,423 27 Ahilyanagar-Beed-Parli Vaijnath new line (261 Km) 4,957 28 Baramati-Lonand new line (64 Km) 1,844 29 Wardha-Nanded new line (284 Km) 3,445 30 Indore-Manmad new line (360 Km) 18,529 31 Wadsa-Gadchiroli new line (52 Km) 1,886 32 Jalna-Jalgaon new line (174 Km) 5,804 33 Daund-Manmad doubling (236 Km) 3,037 34 Kalyan-Kasara 3rd line (68 Km) 1,433 35 Wardha-Nagpur 3rd line (76 Km) 698 36 Wardha-Ballarshah 3rd line (132 Km) 1,385 37 Itarsi-Nagpur 3rd line (280 Km) 2,450 38 Rajnandgaon-Nagpur 3rd line (228 Km) 3,545 39 Wardha-Nagpur 4th line (79 Km) 1,137 Further, construction works on the flagship High speed bullet train project have gathered momentum in Maharashtra. Now 100% land acquisition has been completed. Works of bridges, aqueducts etc. have been taken up. Western DFC also passes through Maharashtra. About 178 route Km of western DFC is situated in Maharashtra which is about 12% of overall route length of western DFC. 76 Km of this project from New Gholvad to New Vaitarna in Maharashtra has already been commissioned. Balance works have been taken up. Connectivity of WDFC to JNPT will boost the capacity to handle cargo and container traffic from port to Delhi NCR. During the last three years i.e. 2022-23, 2023-24, 2024-25 and the current financial year 2025-26, 98 surveys (29 New Line, 2 Gauge Conversion and 67 Doubling) of total length 8,603 Km falling fully/ partly in the State of Maharashtra, have been sanctioned. Railway projects are sanctioned Zonal Railway-wise and not State-wise or Region-wise as Indian Railways’ projects may span across State boundaries. Railway infrastructure projects falling fully/partly in the State of Maharashtra are covered under Central Railway, South Central Railway, South East Central Railway, South Western Railway and Western Railway Zones of Indian Railways. Zonal Railway wise details of Railway projects are made available in public domain on Indian Railway’s website. Sanction of any railway project depends upon many parameters/factors which include the following: Anticipated traffic projections and remunerativeness of the proposed route First and last mile connectivity provided by the project Connection of missing links and providing additional route Augmentation of congested/saturated lines Demands raised by State Governments/Central Ministries/Public representatives, Railway’s operational requirements Socio-economic considerations Overall availability of funds Completion of Railway project/s depends on various factors which include the following: Land acquisition Forest clearance Shifting of infringing utilities Statutory clearances from various authorities Geological and topographical conditions of area Law and order situation in the area of project site Number of working months in a year for particular project site etc. ***** Dharmendra Tewari/ Ritu Raj (रिलीज़ आईडी: 2206929) आगंतुक पटल  : 87 Ministry of Railways 38 Projects of New Lines, Gauge Conversion and Doubling of 5,098 Km Costing ₹89,780 Crore Sanctioned in Maharashtra 98 Surveys of New Line, Gauge Conversion and Doubling of 8,603 Km Sanctioned in Maharashtra During 2022-23 to 2025-26 To Enhance Passenger Carrying Capacity, 238 Rakes of 12 Cars with Doors Sanctioned under MUTP-III & IIIA at a Cost of ₹19,293 Crore प्रविष्टि तिथि:\r\n                        20 DEC 2025 2:20PM by PIB Delhi Budget allocation during the last five years has increased significantly. Budget allocation for infrastructure projects and safety works, falling fully/partly in the State of Maharashtra is as under: Period Outlay 2009-14 ₹1,171 crore/year 2025-26 ₹23,778 crore (More than 20 times) The details of commissioning/laying of new track falling fully/partly in the State of Maharashtra during 2009-14 and 2014-25 is as under: Period New track Commissioned Average commissioning of new tracks 2009-14 292 Km 58.4 Km/year 2014-25 2,292 Km 208.36 Km/year (More than 3 times) Capacity Augmentation works for Mumbai Suburban area Presently, about 120 originating Mail/Express trains and about 3200 sub urban trains are handled daily in Mumbai area. To increase capacity and improve safety, several steps have been taken by Indian Railways as under: To increase train handling capacity at various stations in Mumbai area, following works have been completed/taken up/planned at various stations: SN Location Details 1 Bandra Terminus 3 Pit Lines have been completed 2 Mumbai Central Platform extension for 24 LHB coaches 3 Jogeshwari 2 additional platforms 4 Dadar 1 additional platform 5 Vasai road 6 platforms, 3 pit lines and 5 stabling lines 6 Panvel-Kalamboli 5 platforms, 4 pit lines and 2 sick lines 7 Kalyan 6 platforms and 4 pit lines 8 LTT 4 platforms and 2 pit lines 9 Parel 6 platforms, 5 pit lines, 6 stabling lines 10 Virar 25 stabling lines 11 Dahanu road 11 stabling lines 12 Mira road 25 stabling lines In addition to above, Platform extension work at 34 stations to accommodate 15 car EMUs have been taken up. To improve the capacity of rail network in Mumbai suburban area, Mumbai Urban Transport Project (MUTP)-II costing ₹8,087 crore, MUTP-III costing ₹10,947 crore and MUTP-IIIA costing ₹33,690 crore have been sanctioned. These projects include following works in Mumbai Suburban Area: SN Name of Project Cost (in Cr.) 1 CSMT-Kurla 5 th & 6 th Line (MUTP-II) (17.5 km) 891 2 Mumbai Central-Borivali 6 th Line (MUTP-II) (30 km) 919 3 Extension of Harbour Line from Goregaon-Borivali (MUTP-IIIA) (7 km) 826 4 Borivali-Virar 5 th & 6 th Line (MUTP-IIIA) (26 km) 2,184 5 Virar-Dahanu Road 3 rd & 4 th Line (MUTP-III) (64 km) 3,587 6 Panvel-Karjat Suburban Corridor (MUTP-III) (29.6 km) 2,782 7 Airoli-Kalwa (elevated) Suburban Corridor link (MUTP-III) (3.3 km) 476 8 Kalyan-Asangaon 4 th Line (MUTP-IIIA) (32 km) 1,759 9 Kalyan-Badlapur 3 rd & 4 th line (MUTP-IIIA) (14 km) 1,510 10 Kalyan-Kasara 3 rd Line (67 km) 793 11 Naigaon-Juichandra double chord Line (6 km) 176 12 Nilaje-Kopar double chord Line (5 km) 338 13 Kalyan Yard remodeling work 866 To enhance passenger carrying capacity, 238 rakes of 12 cars each with doors have been sanctioned under MUTP-III & IIIA at a cost of ₹19,293 crore. The process for procurement of these rakes has been taken up. As on 01.04.2025, 38 projects (11 New Lines, 02 Gauge Conversion and 25 Doubling), of a total length of 5,098 Km, costing ₹89,780 crore, falling fully/partly in Maharashtra, are sanctioned. The summary is as under:- Category No. of sanctioned Projects Total Length (in Km) Length Commissioned Upto Mar'25 (Km) Exp. upto Mar'25 ( ₹ in Cr.) New Line 11 1,355 234 10,504 Gauge Conversion 02 609 334 4,286 Doubling/ Multitracking 25 3,134 1,792 24,617 Total 38 5,098 2,360 39,407 Details of some of the recently completed projects falling fully/partly in Maharashtra are as under: S.No. Project Cost (₹ in crore) 1 Pune-Miraj-Londa Doubling (467 Km) 4,670 2 Manmad-Jalgaon 3rd line (160 Km) 2,574 3 Jabalpur-Gondia Gauge Conversion (300 Km) 2,005 4 Chhindwara-Nagpur Gauge Conversion (150 Km) 1,512 5 Panvel-Pen Doubling (35 Km) 263 6 Pen-Roha Doubling (40 Km) 330 7 Udhna-Jalgaon Doubling (307 Km) 2,448 8 Mudkhed-Parbhani Doubling (81 Km) 673 9 Bhusawal-Jalgaon 3rd line (24 Km) 325 10 Jalgaon-Bhusawal 4th line (24 Km) 261 11 Daund-Gulbarga Doubling (225 Km) 3,182 Some of the main projects falling fully/partly in the Maharashtra which have been taken up are as under: S.No. Name of the project Cost (₹ In crore) 1 Gondia-Ballarshah (Chanda Fort) doubling (240 Km) 4,373 2 Hotgi Byepass line (6 Km) 177 3 Panvel-Chouk doubling section (17 Km) 491 4 Panvel-Somtane Chord line and Panvel-Chikhli Chord line (8 Km) 445 5 Miraj Chord line (2 Km) 129 6 Wardha-Balharshah quadrupling (135 Km) 2,226 7 Puntamba-Sainagar Shirdi doubling (17 Km) 227 8 Itarsi-Nagpur 4 th line (297 Km) 5,010 9 Chhatrapati Sambhajinagar-Parbhani doubling (177 Km) 2,006 10 Gondia-Dongargarh 4th line (84 Km) 1,985 11 Wardha-Bhusawal 3 rd & 4 th line (314 Km) 8,199 12 Jalgaon-Bhadli 5 th line (9 Km) 114 13 Gondia bypass line (19 Km) 354 14 Jalgaon-Manmad 4 th line (160 km) 2,574 15 Bhusawal-Khandwa 3 rd & 4 th line (131 Km) 3,285 16 Mudkhed-Medchal & Mahbubnagar-Dhone doubling (417 Km) 4,686 17 Chhatrapati Sambhajinagar-Ankai doubling (98 Km) 961 18 Nilaje and Kopar double chord Line (5 Km) 338 19 Mudkhed junction bypass line (3 Km) 62 20 Purna bypass line (3 Km) 72 21 Ankai bypass Line (2 Km) 29 22 Parbhani-Parli Vaijanath doubling (65 Km) 770 23 Latur Road Station bypass line (2 Km) 47 24 Parli-Vaijanath Station bypass line (2 Km) 56 25 Pachora-Jamner gauge conversion with extension upto Malkapur (84 Km) 955 26 Vadhavan Port-New Palghar doubling (22 Km) 1,423 27 Ahilyanagar-Beed-Parli Vaijnath new line (261 Km) 4,957 28 Baramati-Lonand new line (64 Km) 1,844 29 Wardha-Nanded new line (284 Km) 3,445 30 Indore-Manmad new line (360 Km) 18,529 31 Wadsa-Gadchiroli new line (52 Km) 1,886 32 Jalna-Jalgaon new line (174 Km) 5,804 33 Daund-Manmad doubling (236 Km) 3,037 34 Kalyan-Kasara 3rd line (68 Km) 1,433 35 Wardha-Nagpur 3rd line (76 Km) 698 36 Wardha-Ballarshah 3rd line (132 Km) 1,385 37 Itarsi-Nagpur 3rd line (280 Km) 2,450 38 Rajnandgaon-Nagpur 3rd line (228 Km) 3,545 39 Wardha-Nagpur 4th line (79 Km) 1,137 Further, construction works on the flagship High speed bullet train project have gathered momentum in Maharashtra. Now 100% land acquisition has been completed. Works of bridges, aqueducts etc. have been taken up. Western DFC also passes through Maharashtra. About 178 route Km of western DFC is situated in Maharashtra which is about 12% of overall route length of western DFC. 76 Km of this project from New Gholvad to New Vaitarna in Maharashtra has already been commissioned. Balance works have been taken up. Connectivity of WDFC to JNPT will boost the capacity to handle cargo and container traffic from port to Delhi NCR. During the last three years i.e. 2022-23, 2023-24, 2024-25 and the current financial year 2025-26, 98 surveys (29 New Line, 2 Gauge Conversion and 67 Doubling) of total length 8,603 Km falling fully/ partly in the State of Maharashtra, have been sanctioned. Railway projects are sanctioned Zonal Railway-wise and not State-wise or Region-wise as Indian Railways’ projects may span across State boundaries. Railway infrastructure projects falling fully/partly in the State of Maharashtra are covered under Central Railway, South Central Railway, South East Central Railway, South Western Railway and Western Railway Zones of Indian Railways. Zonal Railway wise details of Railway projects are made available in public domain on Indian Railway’s website. Sanction of any railway project depends upon many parameters/factors which include the following: Anticipated traffic projections and remunerativeness of the proposed route First and last mile connectivity provided by the project Connection of missing links and providing additional route Augmentation of congested/saturated lines Demands raised by State Governments/Central Ministries/Public representatives, Railway’s operational requirements Socio-economic considerations Overall availability of funds Completion of Railway project/s depends on various factors which include the following: Land acquisition Forest clearance Shifting of infringing utilities Statutory clearances from various authorities Geological and topographical conditions of area Law and order situation in the area of project site Number of working months in a year for particular project site etc. ***** Dharmendra Tewari/ Ritu Raj (रिलीज़ आईडी: 2206929)",
    "scraped_at": "2025-12-20T09:35:20.090789"
  },
  {
    "id": "2206921",
    "ministry": "PIB Headquarters",
    "title": "Bridges of India: Architecture Against the Odds",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206921",
    "date": "20 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters Bridges of India: Architecture Against the Odds Posted On:\r\n                20 DEC 2025 1:19PM by PIB Delhi Spanning over turbulent rivers, deep gorges, and restless seas, India’s bridges stand as silent testimonies to the country’s engineering ambition. They connect not just towns and regions, but people, cultures, and economies, often in places where geography had long dictated isolation. Across India, bridges shape everyday life in ways most of us barely notice. They shorten distances that once took days to cross, open access to remote communities, and withstand nature at its fiercest. Among the countless bridges that form a vast network throughout the country, several key bridges exemplify the scale and vision of India’s infrastructure. Each one carries its own tale, of daring design, relentless weather, and the human resolve to overcome terrain. Bridges That Define India’s Connectivity Atal Bihari Vajpayee Sewri-Nhava Sheva Atal Setu Stretching across the Arabian Sea like a bold stroke on the city’s canvas, the Atal Setu , also known as the Mumbai Trans Harbour Link (MTHL) , marks Mumbai’s biggest step towards a horizon unrestrained by traffic and time. It has been developed to ease the heavy traffic burden of Mumbai’s island city. Built using advanced construction and safety systems, the bridge offers a faster and safer route across the bay, reducing accident risks and improving the daily travel experience for commuters. Its impact, however, extends beyond transportation. The MTHL has helped boost tourism in Mumbai and nearby regions, while also enhancing connectivity for trade and industry, contributing to the growth of the local economy. Spanning 16.5 kilometres over the sea and extending another 5.5 kilometres on land , the project was approved at a cost of Rs. 17,843 crore and stands as India’s longest sea bridge . Even amid the unprecedented challenges posed by the Covid-19 pandemic, the project managed to stay on track and meet its planned deadline. Chenab Bridge India’s engineering prowess has reached a new pinnacle with the completion of the Chenab Bridge, the world’s highest railway arch bridge . It has been hailed as a testament to the brilliance and commitment of the country’s engineers and workers as the project confronted hurdles, from difficult terrain and extreme weather to falling rocks in the mountains, making construction exceptionally demanding. While millions travel to Paris to admire the Eiffel Tower, the Chenab Bridge rises 35 metres higher , positioning itself not only as a vital infrastructural asset but also as an emerging tourist landmark. Perched 359 metres above the Chenab River, the bridge forms a crucial segment of the Udhampur–Srinagar–Baramulla Railway Link (USBRL) . With Vande Bharat trains set to operate on the route, travel time between Katra and Srinagar will reduce to just about three hours. The 1,315-metre-long steel arch structure has been designed to withstand wind speeds up to 260 kmph and built with a projected lifespan of 120 years. Constructed at a cost of Rs. 1,486 crore , the Chenab Rail Bridge stands as a symbol of India’s ambition, technical excellence, and advancing infrastructure capabilities. New Pamban Bridge The newly constructed Pamban Bridge, connecting Rameswaram with the mainland, is India’s first vertical lift railway sea bridge . It has emerged as a standout symbol of modern Indian infrastructure on the world map. Built at a cost exceeding Rs. 700 crore , the 2.07 km structure includes a 72.5-metre vertical lift section that can rise 17 metres , allowing ships to pass safely without halting train movement. The new Pamban Bridge’s construction encountered major environmental and logistical challenges, including turbulent waters, strong winds, cyclones and seismic risks, and the difficulty of transporting heavy materials to the remote site within tight tidal windows. Through innovative engineering and advanced technology, over 1,400 tons of fabrication, lift-span launches, 99 girders, and extensive track and electrification work at sea were completed with zero injuries . Crafted with stainless reinforcement, high-performance protective coatings, and fully welded joints, the bridge promises greater longevity and lower upkeep. It has also been prepared for future growth, with space for a second railway line. A specialised polysiloxane finish shields the structure from corrosion, an essential safeguard given the demanding coastal conditions. Dhola–Sadiya Bridge The Dhola–Sadiya Bridge, also known as the Bhupen Hazarika Setu , is a vital link between Assam and Arunachal Pradesh, providing the first permanent road connection between northern Assam and eastern Arunachal Pradesh. Built as a beam bridge, it sweeps over the Lohit River , one of the Brahmaputra’s major tributaries, connecting Dhola in Tinsukia district to Sadiya in the north. Stretching 9.15 kilometres , it is built to withstand the load of 60-tonne military tanks, including the Indian Army’s Arjun and T-72 models. This capability adds significant strategic value to the structure. Anji Khad Bridge The Anji Khad Bridge pierces the Himalayan landscape with an elegance and scale unmatched, emerging as India’s first cable-stayed railway bridge and a key link in the Katra–Banihal section of the Udhampur–Srinagar–Baramulla Rail Line . Located about 80 kilometres from Jammu and set against snow-capped peaks, the bridge soars 331 metres above the Anji River valley and extends 725 metres across the gorge. Its defining feature is an inverted Y-shaped pylon rising 193 metres above its foundation, supported by 96 high-tensile cables . More than 8,200 metric tonnes of structural steel reinforce the bridge, enabling it to withstand seismic activity. The Anji Khad Bridge was built through extremely rugged Himalayan conditions marked by cherty limestone formations and unstable hill-wash debris with large limestone boulders. To protect the mountain ecology, extensive slope-stabilisation measures were implemented throughout construction. Beyond its technical sophistication, the Anji Khad Bridge stands as a symbol of persistence and vision, with completion in just 11 months. As part of the broader rail link connecting the Kashmir Valley with the rest of India, it is set to improve travel efficiency, enhance regional connectivity, and unlock new economic opportunities. Conclusion India’s bridges are more than infrastructure; they are statements of intent, connecting a nation defined by scale and contrast. They rise from mountainsides, pierce through monsoon clouds, and skim the surface of some of the subcontinent’s most volatile waters. Through every corner of this vast terrain, various bridges continue to reflect India’s drive and determination. The Bogibeel Bridge and the New Saraighat Bridge in Assam, across the mighty Brahmaputra, carry both road and rail to strengthen connectivity. Similarly, the Digha–Sonpur Bridge in Bihar enhances movement across the river Ganga with its robust rail-cum-road design. In their shadows lie stories of innovation, perseverance, and the complex landscapes they dared to conquer. They reshape economies, redraw maps, and reimagine how people move, live, and dream. Each new span reflects not just engineering progress, but the nation’s willingness to push beyond the limitations of region, time, and history. As India continues to grow, its bridges will remain among the clearest expressions of a country in motion, always reaching forward, always building its own path. References Ministry of Railways https://www.pib.gov.in/PressReleasePage.aspx?PRID=2118895 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2119836 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2153252&reg=3&lang=2 Ministry of Road Transport and Highways https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1990763&reg=3&lang=2 Prime Minister's Office https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1995649 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2134513 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2118700 Press Information Bureau https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=154553&ModuleId=3 Other Links https://mmrda.maharashtra.gov.in/en/projects/transport/mumbai-trans-harbour-link/overview https://tinsukia.assam.gov.in/tourist-place-detail/275 https://dibrugarh.assam.gov.in/tourist-place-detail/276 https://morth.nic.in/sites/default/files/PragatiKiNayiGati/assam/files/assets/common/downloads/MAKING%20ASSAM%20ACCESSIBLE.pdf https://www.iricen.gov.in/iricen/ipwe_seminar/2017/Nov%202023%20Vol-2/Construction%20of%20Central%20Embankment.pdf Click here to see pdf **** PIB Research (Release ID: 2206921) Visitor Counter : 150 Read this release in: हिन्दी PIB Headquarters Bridges of India: Architecture Against the Odds Posted On:\r\n                        20 DEC 2025 1:19PM by PIB Delhi Spanning over turbulent rivers, deep gorges, and restless seas, India’s bridges stand as silent testimonies to the country’s engineering ambition. They connect not just towns and regions, but people, cultures, and economies, often in places where geography had long dictated isolation. Across India, bridges shape everyday life in ways most of us barely notice. They shorten distances that once took days to cross, open access to remote communities, and withstand nature at its fiercest. Among the countless bridges that form a vast network throughout the country, several key bridges exemplify the scale and vision of India’s infrastructure. Each one carries its own tale, of daring design, relentless weather, and the human resolve to overcome terrain. Bridges That Define India’s Connectivity Atal Bihari Vajpayee Sewri-Nhava Sheva Atal Setu Stretching across the Arabian Sea like a bold stroke on the city’s canvas, the Atal Setu , also known as the Mumbai Trans Harbour Link (MTHL) , marks Mumbai’s biggest step towards a horizon unrestrained by traffic and time. It has been developed to ease the heavy traffic burden of Mumbai’s island city. Built using advanced construction and safety systems, the bridge offers a faster and safer route across the bay, reducing accident risks and improving the daily travel experience for commuters. Its impact, however, extends beyond transportation. The MTHL has helped boost tourism in Mumbai and nearby regions, while also enhancing connectivity for trade and industry, contributing to the growth of the local economy. Spanning 16.5 kilometres over the sea and extending another 5.5 kilometres on land , the project was approved at a cost of Rs. 17,843 crore and stands as India’s longest sea bridge . Even amid the unprecedented challenges posed by the Covid-19 pandemic, the project managed to stay on track and meet its planned deadline. Chenab Bridge India’s engineering prowess has reached a new pinnacle with the completion of the Chenab Bridge, the world’s highest railway arch bridge . It has been hailed as a testament to the brilliance and commitment of the country’s engineers and workers as the project confronted hurdles, from difficult terrain and extreme weather to falling rocks in the mountains, making construction exceptionally demanding. While millions travel to Paris to admire the Eiffel Tower, the Chenab Bridge rises 35 metres higher , positioning itself not only as a vital infrastructural asset but also as an emerging tourist landmark. Perched 359 metres above the Chenab River, the bridge forms a crucial segment of the Udhampur–Srinagar–Baramulla Railway Link (USBRL) . With Vande Bharat trains set to operate on the route, travel time between Katra and Srinagar will reduce to just about three hours. The 1,315-metre-long steel arch structure has been designed to withstand wind speeds up to 260 kmph and built with a projected lifespan of 120 years. Constructed at a cost of Rs. 1,486 crore , the Chenab Rail Bridge stands as a symbol of India’s ambition, technical excellence, and advancing infrastructure capabilities. New Pamban Bridge The newly constructed Pamban Bridge, connecting Rameswaram with the mainland, is India’s first vertical lift railway sea bridge . It has emerged as a standout symbol of modern Indian infrastructure on the world map. Built at a cost exceeding Rs. 700 crore , the 2.07 km structure includes a 72.5-metre vertical lift section that can rise 17 metres , allowing ships to pass safely without halting train movement. The new Pamban Bridge’s construction encountered major environmental and logistical challenges, including turbulent waters, strong winds, cyclones and seismic risks, and the difficulty of transporting heavy materials to the remote site within tight tidal windows. Through innovative engineering and advanced technology, over 1,400 tons of fabrication, lift-span launches, 99 girders, and extensive track and electrification work at sea were completed with zero injuries . Crafted with stainless reinforcement, high-performance protective coatings, and fully welded joints, the bridge promises greater longevity and lower upkeep. It has also been prepared for future growth, with space for a second railway line. A specialised polysiloxane finish shields the structure from corrosion, an essential safeguard given the demanding coastal conditions. Dhola–Sadiya Bridge The Dhola–Sadiya Bridge, also known as the Bhupen Hazarika Setu , is a vital link between Assam and Arunachal Pradesh, providing the first permanent road connection between northern Assam and eastern Arunachal Pradesh. Built as a beam bridge, it sweeps over the Lohit River , one of the Brahmaputra’s major tributaries, connecting Dhola in Tinsukia district to Sadiya in the north. Stretching 9.15 kilometres , it is built to withstand the load of 60-tonne military tanks, including the Indian Army’s Arjun and T-72 models. This capability adds significant strategic value to the structure. Anji Khad Bridge The Anji Khad Bridge pierces the Himalayan landscape with an elegance and scale unmatched, emerging as India’s first cable-stayed railway bridge and a key link in the Katra–Banihal section of the Udhampur–Srinagar–Baramulla Rail Line . Located about 80 kilometres from Jammu and set against snow-capped peaks, the bridge soars 331 metres above the Anji River valley and extends 725 metres across the gorge. Its defining feature is an inverted Y-shaped pylon rising 193 metres above its foundation, supported by 96 high-tensile cables . More than 8,200 metric tonnes of structural steel reinforce the bridge, enabling it to withstand seismic activity. The Anji Khad Bridge was built through extremely rugged Himalayan conditions marked by cherty limestone formations and unstable hill-wash debris with large limestone boulders. To protect the mountain ecology, extensive slope-stabilisation measures were implemented throughout construction. Beyond its technical sophistication, the Anji Khad Bridge stands as a symbol of persistence and vision, with completion in just 11 months. As part of the broader rail link connecting the Kashmir Valley with the rest of India, it is set to improve travel efficiency, enhance regional connectivity, and unlock new economic opportunities. Conclusion India’s bridges are more than infrastructure; they are statements of intent, connecting a nation defined by scale and contrast. They rise from mountainsides, pierce through monsoon clouds, and skim the surface of some of the subcontinent’s most volatile waters. Through every corner of this vast terrain, various bridges continue to reflect India’s drive and determination. The Bogibeel Bridge and the New Saraighat Bridge in Assam, across the mighty Brahmaputra, carry both road and rail to strengthen connectivity. Similarly, the Digha–Sonpur Bridge in Bihar enhances movement across the river Ganga with its robust rail-cum-road design. In their shadows lie stories of innovation, perseverance, and the complex landscapes they dared to conquer. They reshape economies, redraw maps, and reimagine how people move, live, and dream. Each new span reflects not just engineering progress, but the nation’s willingness to push beyond the limitations of region, time, and history. As India continues to grow, its bridges will remain among the clearest expressions of a country in motion, always reaching forward, always building its own path. References Ministry of Railways https://www.pib.gov.in/PressReleasePage.aspx?PRID=2118895 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2119836 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2153252&reg=3&lang=2 Ministry of Road Transport and Highways https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1990763&reg=3&lang=2 Prime Minister's Office https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1995649 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2134513 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2118700 Press Information Bureau https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=154553&ModuleId=3 Other Links https://mmrda.maharashtra.gov.in/en/projects/transport/mumbai-trans-harbour-link/overview https://tinsukia.assam.gov.in/tourist-place-detail/275 https://dibrugarh.assam.gov.in/tourist-place-detail/276 https://morth.nic.in/sites/default/files/PragatiKiNayiGati/assam/files/assets/common/downloads/MAKING%20ASSAM%20ACCESSIBLE.pdf https://www.iricen.gov.in/iricen/ipwe_seminar/2017/Nov%202023%20Vol-2/Construction%20of%20Central%20Embankment.pdf Click here to see pdf **** PIB Research (Release ID: 2206921)",
    "scraped_at": "2025-12-20T09:35:21.779359"
  }
]