[
  {
    "id": "2208608",
    "ministry": "Vice President's Secretariat",
    "title": "Vice President Shri C. P. Radhakrishnan Participates as Chief Guest at Good Governance Day Celebrations Marking the Birth Anniversary of Shri Atal Bihari Vajpayee",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208608",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Vice President's Secretariat Vice President Shri C. P. Radhakrishnan Participates as Chief Guest at Good Governance Day Celebrations Marking the Birth Anniversary of Shri Atal Bihari Vajpayee Vice President Highlights Vajpayee’s Governance Philosophy Rooted in Transparency, Accountability, and Service to the People Good Governance Day Urges Citizens to Uphold Transparency, Ethical Conduct, and Empathy Vajpayee’s Governance Philosophy Inspires Viksit Bharat Vision for 2047 प्रविष्टि तिथि:\r\n                25 DEC 2025 8:46PM by PIB Delhi The Vice President of India, Shri C. P. Radhakrishnan, participated as the Chief Guest at the Good Governance Day celebrations held at Siri Fort Auditorium, New Delhi today, commemorating the birth anniversary of former Prime Minister Shri Atal Bihari Vajpayee. Vice President Shri C. P. Radhakrishnan participated as Chief Guest at the Good Governance Day celebrations at Siri Fort Auditorium, New Delhi, marking the birth anniversary of former Prime Minister Shri Atal Bihari Vajpayee. In his address, the Vice President highlighted Shri… pic.twitter.com/0ONdc0f6XH — Vice-President of India (@VPIndia) December 25, 2025 During the event, the Vice President highlighted Shri Vajpayee’s contributions as a visionary, poet, and dedicated servant of the people. He emphasized that Shri Vajpayee’s unmatched oratory, humility, and commitment to democracy guided the nation through complex domestic and foreign challenges, with good governance forming the foundation of a strong and prosperous India. Shri Vajpayee’s governance philosophy was noted to be grounded in transparency, accountability, inclusivity, and service to all segments of society. The Vice President also highlighted key initiatives undertaken during Shri Vajpayee’s tenure.He underscored that Shri Vajpayee’s governance philosophy was rooted in democratic values, constitutional morality, and national consensus. Emphasizing that good governance is a shared responsibility, the Vice President stated that governments, administrators, institutions, civil society, and citizens all play a role in ensuring transparent, ethical, and accountable governance. He urged participants to uphold these principles in building a developed, inclusive, and resilient India in alignment with the vision of Viksit Bharat 2047. A theatre production on Satyavadi Raja Harishchandra was also featured during the event, symbolically linking Shri Vajpayee’s life to the legendary king’s principles of truthfulness, integrity, and selfless service. The event was organised by Gandhi Smriti and Darshan Samiti , along with the Heritage India Foundation.Dignitaries present at the event included Union Minister of State in the Ministry of Corporate Affairs and Ministry of Road Transport and Highways Shri Harsh Malhotra; Speaker of the Delhi Legislative Assembly Shri Vijender Gupta; Vice Chairman of Gandhi Smriti and Darshan Samiti Shri Vijay Goel; and other eminent personalities. ******* PR/ASM (रिलीज़ आईडी: 2208608) आगंतुक पटल  : 152 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Marathi , Gujarati Vice President's Secretariat Vice President Shri C. P. Radhakrishnan Participates as Chief Guest at Good Governance Day Celebrations Marking the Birth Anniversary of Shri Atal Bihari Vajpayee Vice President Highlights Vajpayee’s Governance Philosophy Rooted in Transparency, Accountability, and Service to the People Good Governance Day Urges Citizens to Uphold Transparency, Ethical Conduct, and Empathy Vajpayee’s Governance Philosophy Inspires Viksit Bharat Vision for 2047 प्रविष्टि तिथि:\r\n                        25 DEC 2025 8:46PM by PIB Delhi The Vice President of India, Shri C. P. Radhakrishnan, participated as the Chief Guest at the Good Governance Day celebrations held at Siri Fort Auditorium, New Delhi today, commemorating the birth anniversary of former Prime Minister Shri Atal Bihari Vajpayee. Vice President Shri C. P. Radhakrishnan participated as Chief Guest at the Good Governance Day celebrations at Siri Fort Auditorium, New Delhi, marking the birth anniversary of former Prime Minister Shri Atal Bihari Vajpayee. In his address, the Vice President highlighted Shri… pic.twitter.com/0ONdc0f6XH — Vice-President of India (@VPIndia) December 25, 2025 During the event, the Vice President highlighted Shri Vajpayee’s contributions as a visionary, poet, and dedicated servant of the people. He emphasized that Shri Vajpayee’s unmatched oratory, humility, and commitment to democracy guided the nation through complex domestic and foreign challenges, with good governance forming the foundation of a strong and prosperous India. Shri Vajpayee’s governance philosophy was noted to be grounded in transparency, accountability, inclusivity, and service to all segments of society. The Vice President also highlighted key initiatives undertaken during Shri Vajpayee’s tenure.He underscored that Shri Vajpayee’s governance philosophy was rooted in democratic values, constitutional morality, and national consensus. Emphasizing that good governance is a shared responsibility, the Vice President stated that governments, administrators, institutions, civil society, and citizens all play a role in ensuring transparent, ethical, and accountable governance. He urged participants to uphold these principles in building a developed, inclusive, and resilient India in alignment with the vision of Viksit Bharat 2047. A theatre production on Satyavadi Raja Harishchandra was also featured during the event, symbolically linking Shri Vajpayee’s life to the legendary king’s principles of truthfulness, integrity, and selfless service. The event was organised by Gandhi Smriti and Darshan Samiti , along with the Heritage India Foundation.Dignitaries present at the event included Union Minister of State in the Ministry of Corporate Affairs and Ministry of Road Transport and Highways Shri Harsh Malhotra; Speaker of the Delhi Legislative Assembly Shri Vijender Gupta; Vice Chairman of Gandhi Smriti and Darshan Samiti Shri Vijay Goel; and other eminent personalities. ******* PR/ASM (रिलीज़ आईडी: 2208608)",
    "scraped_at": "2025-12-25T17:39:48.282738"
  },
  {
    "id": "2208546",
    "ministry": "Vice President's Secretariat",
    "title": "Vice President Releases Mahamana Vangmay, Final Series of Collected Works of Pandit Madan Mohan Malaviya in New Delhi",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208546",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Vice President's Secretariat Vice President Releases Mahamana Vangmay, Final Series of Collected Works of Pandit Madan Mohan Malaviya in New Delhi Mahamana Malaviya Bridged India’s Ancient Values and Modern Aspirations: Vice President Mahamana Vangmay Reflects the Intellectual DNA of India’s Freedom Struggle: Vice President Banaras Hindu University Stands as a Testament to Malaviya’s Educational Vision: Vice President Pandit Malaviya’s Educational Philosophy Reflected in National Education Policy 2020: Vice President प्रविष्टि तिथि:\r\n                25 DEC 2025 6:18PM by PIB Delhi The Vice President of India, Shri C. P. Radhakrishnan, today released “Mahamana Vangmay”, the final series of the collected works of Mahamana Pandit Madan Mohan Malaviya, at Bharat Mandapam, New Delhi. Vice President Shri C. P. Radhakrishnan released the final 12-volume series of Mahamana Vangmay, the collected works of Mahamana Pandit Madan Mohan Malaviya, at Bharat Mandapam, New Delhi today. Addressing the gathering, he highlighted Malaviya Ji’s vision of education,… pic.twitter.com/STxLW9Wj04 — Vice-President of India (@VPIndia) December 25, 2025 Addressing the gathering, the Vice President described Mahamana Malaviya as a towering nationalist, journalist, social reformer, lawyer, statesman, educationist, and a distinguished scholar of ancient Indian culture. He said Pandit Malaviya was a rare visionary who firmly believed that India’s future lay not in discarding its past, but in rejuvenating it, thus serving as a bridge between India’s ancient values and modern democratic aspirations. Highlighting Pandit Malaviya’s commitment to scientific and technological education, the Vice President said this reflected his ability to harmonise the best elements of ancient and modern civilizations. Recalling Mahamana Malaviya’s faith in education as the strongest instrument of national awakening during colonial rule, the Vice President said the establishment of Banaras Hindu University stands as a living testament to his belief that modern education and Indian culture must grow together. The Vice President observed that Mahamana Malaviya’s vision of a strong, self-reliant, and enlightened India resonates deeply with contemporary initiatives such as Aatmanirbhar Bharat, Make in India, and the mission of Viksit Bharat by 2047, championed by Prime Minister Shri Narendra Modi, who is carrying forward Pandit Malaviya’s enduring legacy. He further said that Mahamana Malaviya’s emphasis on inclusive, value-based, and skill-oriented education finds strong reflection in the National Education Policy 2020. Describing Mahamana Vangmay as more than a collection of writings, the Vice President said it represents the intellectual DNA of India’s freedom struggle and a blueprint for the country’s cultural renaissance. He congratulated the Mahamana Malaviya Mission and the Publications Division for their monumental effort and urged universities, scholars, and young researchers to actively engage with these volumes, noting that they offer enduring solutions to contemporary challenges. The second and final series of Mahamana Vangmay, comprising 12 volumes spread across about 3,500 pages, is a comprehensive collection of the writings and speeches of Pandit Madan Mohan Malaviya. The event was organised by the Mahamana Malaviya Mission, while the books have been published by the Publications Division of the Ministry of Information and Broadcasting. The first series of the collected works was released by Prime Minister Shri Narendra Modi in 2023. Union Minister Shri Arjun Ram Meghwal; Member of Parliament Shri Anurag Singh Thakur; President, Indira Gandhi National Centre for the Arts, Shri Ram Bahadur Rai; President, Mahamana Malaviya Mission, Shri Hari Shankar Singh; and Principal Director General, Publications Division, Shri Bhupendra Kainthola, were among the dignitaries present on the occasion. ****** PR/ASM (रिलीज़ आईडी: 2208546) आगंतुक पटल  : 208 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Gujarati , Tamil , Malayalam Vice President's Secretariat Vice President Releases Mahamana Vangmay, Final Series of Collected Works of Pandit Madan Mohan Malaviya in New Delhi Mahamana Malaviya Bridged India’s Ancient Values and Modern Aspirations: Vice President Mahamana Vangmay Reflects the Intellectual DNA of India’s Freedom Struggle: Vice President Banaras Hindu University Stands as a Testament to Malaviya’s Educational Vision: Vice President Pandit Malaviya’s Educational Philosophy Reflected in National Education Policy 2020: Vice President प्रविष्टि तिथि:\r\n                        25 DEC 2025 6:18PM by PIB Delhi The Vice President of India, Shri C. P. Radhakrishnan, today released “Mahamana Vangmay”, the final series of the collected works of Mahamana Pandit Madan Mohan Malaviya, at Bharat Mandapam, New Delhi. Vice President Shri C. P. Radhakrishnan released the final 12-volume series of Mahamana Vangmay, the collected works of Mahamana Pandit Madan Mohan Malaviya, at Bharat Mandapam, New Delhi today. Addressing the gathering, he highlighted Malaviya Ji’s vision of education,… pic.twitter.com/STxLW9Wj04 — Vice-President of India (@VPIndia) December 25, 2025 Addressing the gathering, the Vice President described Mahamana Malaviya as a towering nationalist, journalist, social reformer, lawyer, statesman, educationist, and a distinguished scholar of ancient Indian culture. He said Pandit Malaviya was a rare visionary who firmly believed that India’s future lay not in discarding its past, but in rejuvenating it, thus serving as a bridge between India’s ancient values and modern democratic aspirations. Highlighting Pandit Malaviya’s commitment to scientific and technological education, the Vice President said this reflected his ability to harmonise the best elements of ancient and modern civilizations. Recalling Mahamana Malaviya’s faith in education as the strongest instrument of national awakening during colonial rule, the Vice President said the establishment of Banaras Hindu University stands as a living testament to his belief that modern education and Indian culture must grow together. The Vice President observed that Mahamana Malaviya’s vision of a strong, self-reliant, and enlightened India resonates deeply with contemporary initiatives such as Aatmanirbhar Bharat, Make in India, and the mission of Viksit Bharat by 2047, championed by Prime Minister Shri Narendra Modi, who is carrying forward Pandit Malaviya’s enduring legacy. He further said that Mahamana Malaviya’s emphasis on inclusive, value-based, and skill-oriented education finds strong reflection in the National Education Policy 2020. Describing Mahamana Vangmay as more than a collection of writings, the Vice President said it represents the intellectual DNA of India’s freedom struggle and a blueprint for the country’s cultural renaissance. He congratulated the Mahamana Malaviya Mission and the Publications Division for their monumental effort and urged universities, scholars, and young researchers to actively engage with these volumes, noting that they offer enduring solutions to contemporary challenges. The second and final series of Mahamana Vangmay, comprising 12 volumes spread across about 3,500 pages, is a comprehensive collection of the writings and speeches of Pandit Madan Mohan Malaviya. The event was organised by the Mahamana Malaviya Mission, while the books have been published by the Publications Division of the Ministry of Information and Broadcasting. The first series of the collected works was released by Prime Minister Shri Narendra Modi in 2023. Union Minister Shri Arjun Ram Meghwal; Member of Parliament Shri Anurag Singh Thakur; President, Indira Gandhi National Centre for the Arts, Shri Ram Bahadur Rai; President, Mahamana Malaviya Mission, Shri Hari Shankar Singh; and Principal Director General, Publications Division, Shri Bhupendra Kainthola, were among the dignitaries present on the occasion. ****** PR/ASM (रिलीज़ आईडी: 2208546)",
    "scraped_at": "2025-12-25T17:39:50.641006"
  },
  {
    "id": "2208602",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister shares glimpses of inauguration of the Rashtra Prerna Sthal in Lucknow, UP",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208602",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister shares glimpses of inauguration of the Rashtra Prerna Sthal in Lucknow, UP प्रविष्टि तिथि:\r\n                25 DEC 2025 8:26PM by PIB Delhi The Prime Minister Shri Narendra Modi shared the glimpses of inauguration of the Rashtra Prerna Sthal in Lucknow, Uttar Pradesh to honour the life and ideals of Former PM Atal Bihari Vajpayee today. Speaking on the occasion marking Shri Vajpayee's 101st Birth Anniversary, the Prime Minister remarked that today the land of Lucknow is becoming a witness to a new inspiration. He extended Christmas greetings to the nation and the world. Highlighting that December 25 brings with it the remarkable occasion of the birth anniversaries of two great personalities of the nation, Shri Modi remarked that Bharat Ratna Atal Bihari Vajpayee ji and Bharat Ratna Mahamana Madan Mohan Malaviya ji dedicated their lives to safeguarding India’s identity, unity, and pride. The Prime Minister emphasized that both these stalwarts left an indelible mark on nation-building through their immense contributions. In a series of posts on X, Shri Modi said: \"राष्ट्र प्रेरणा स्थल में कमल पुष्प के आकार का अत्याधुनिक संग्रहालय निस्वार्थ नेतृत्व और सुशासन की भावना को सजीव रूप में सामने लाता है। यह आने वाली पीढ़ियों को हमारे जननायकों के आदर्शों को आत्मसात कर जीवन में अपनाने की प्रेरणा देता रहेगा।\" राष्ट्र प्रेरणा स्थल में कमल पुष्प के आकार का अत्याधुनिक संग्रहालय निस्वार्थ नेतृत्व और सुशासन की भावना को सजीव रूप में सामने लाता है। यह आने वाली पीढ़ियों को हमारे जननायकों के आदर्शों को आत्मसात कर जीवन में अपनाने की प्रेरणा देता रहेगा। pic.twitter.com/BrF4Rx8KAz — Narendra Modi (@narendramodi) December 25, 2025 \"राष्ट्र प्रेरणा स्थल में कमल पुष्प के आकार का अत्याधुनिक संग्रहालय निस्वार्थ नेतृत्व और सुशासन की भावना को सजीव रूप में सामने लाता है। यह आने वाली पीढ़ियों को हमारे जननायकों के आदर्शों को आत्मसात कर जीवन में अपनाने की प्रेरणा देता रहेगा।\" राष्ट्र प्रेरणा स्थल में कमल पुष्प के आकार का अत्याधुनिक संग्रहालय निस्वार्थ नेतृत्व और सुशासन की भावना को सजीव रूप में सामने लाता है। यह आने वाली पीढ़ियों को हमारे जननायकों के आदर्शों को आत्मसात कर जीवन में अपनाने की प्रेरणा देता रहेगा। pic.twitter.com/BrF4Rx8KAz — Narendra Modi (@narendramodi) December 25, 2025 \"लखनऊ के मेरे परिवारजनों का उत्साह और उमंग इस बात का प्रमाण है कि देश की महान विभूतियों के आदर्श, मूल्य और राष्ट्रसेवा की भावना आज भी जन-जन का मार्गदर्शन कर रही है।\" लखनऊ के मेरे परिवारजनों का उत्साह और उमंग इस बात का प्रमाण है कि देश की महान विभूतियों के आदर्श, मूल्य और राष्ट्रसेवा की भावना आज भी जन-जन का मार्गदर्शन कर रही है। pic.twitter.com/196edya92P — Narendra Modi (@narendramodi) December 25, 2025 \"राष्ट्र प्रेरणा स्थल उस सोच का प्रतीक है, जिसने भारत को आत्मसम्मान, एकता और सेवा का मार्ग दिखाया है। यहां डॉक्टर श्यामा प्रसाद मुखर्जी, पंडित दीनदयाल उपाध्याय जी और अटल बिहारी वाजपेयी जी की प्रतिमाएं हमें संदेश देती हैं कि हमारा हर कदम और हर प्रयास राष्ट्र-निर्माण के लिए समर्पित हो।\" राष्ट्र प्रेरणा स्थल उस सोच का प्रतीक है, जिसने भारत को आत्मसम्मान, एकता और सेवा का मार्ग दिखाया है। यहां डॉक्टर श्यामा प्रसाद मुखर्जी, पंडित दीनदयाल उपाध्याय जी और अटल बिहारी वाजपेयी जी की प्रतिमाएं हमें संदेश देती हैं कि हमारा हर कदम और हर प्रयास राष्ट्र-निर्माण के लिए समर्पित… pic.twitter.com/SX9o3HBvtd — Narendra Modi (@narendramodi) December 25, 2025 \"डॉक्टर श्यामा प्रसाद मुखर्जी ने भारत में आर्थिक आत्मनिर्भरता की नींव रखी थी। उनकी प्रेरणा से आज हम उसे और सशक्त बनाने में कोई कोर-कसर नहीं छोड़ रहे हैं।\" डॉक्टर श्यामा प्रसाद मुखर्जी ने भारत में आर्थिक आत्मनिर्भरता की नींव रखी थी। उनकी प्रेरणा से आज हम उसे और सशक्त बनाने में कोई कोर-कसर नहीं छोड़ रहे हैं। pic.twitter.com/aVzPhxivrQ — Narendra Modi (@narendramodi) December 25, 2025 \"पंडित दीनदयाल जी का विजन था कि कतार में खड़े अंतिम व्यक्ति तक हर सुविधा पहुंचे। आज जब हम हर जरूरतमंद तक सरकार की कल्याणकारी योजनाओं का लाभ पहुंचा रहे हैं, तो अंत्योदय का उनका ये सपना साकार हो रहा है।\" पंडित दीनदयाल जी का विजन था कि कतार में खड़े अंतिम व्यक्ति तक हर सुविधा पहुंचे। आज जब हम हर जरूरतमंद तक सरकार की कल्याणकारी योजनाओं का लाभ पहुंचा रहे हैं, तो अंत्योदय का उनका ये सपना साकार हो रहा है। pic.twitter.com/rILO0OBKKl — Narendra Modi (@narendramodi) December 25, 2025 \"अटल जी की जयंती सुशासन का उत्सव मनाने का भी दिन है। भाजपा-NDA सरकार ने सुशासन की जो विरासत बनाई है, उसे आज हम एक नया विस्तार दे रहे हैं।\" अटल जी की जयंती सुशासन का उत्सव मनाने का भी दिन है। भाजपा-NDA सरकार ने सुशासन की जो विरासत बनाई है, उसे आज हम एक नया विस्तार दे रहे हैं। pic.twitter.com/3IPZNeFRa6 — Narendra Modi (@narendramodi) December 25, 2025 \"कांग्रेस और उसके सहयोगियों ने राजनीतिक रूप से भाजपा को हमेशा अछूत बनाए रखा। लेकिन भाजपा के संस्कार ने हमें सबका सम्मान करना सिखाया है, जिसके एक नहीं अनेक उदाहरण हैं…\" कांग्रेस और उसके सहयोगियों ने राजनीतिक रूप से भाजपा को हमेशा अछूत बनाए रखा। लेकिन भाजपा के संस्कार ने हमें सबका सम्मान करना सिखाया है, जिसके एक नहीं अनेक उदाहरण हैं… pic.twitter.com/CMpzd43UHQ — Narendra Modi (@narendramodi) December 25, 2025 \"राष्ट्र प्रेरणा स्थल हमारे देश की महान विभूतियों के जीवन, उनके आदर्शों और अमूल्य विरासत को समर्पित एक प्रेरणादायी स्मारक है। आज सुशासन दिवस पर लखनऊ में इसका लोकार्पण कर अपार गौरव और आत्मिक संतोष की अनुभूति हुई।\" राष्ट्र प्रेरणा स्थल हमारे देश की महान विभूतियों के जीवन, उनके आदर्शों और अमूल्य विरासत को समर्पित एक प्रेरणादायी स्मारक है। आज सुशासन दिवस पर लखनऊ में इसका लोकार्पण कर अपार गौरव और आत्मिक संतोष की अनुभूति हुई। pic.twitter.com/2N87WqxRZn — Narendra Modi (@narendramodi) December 25, 2025 **** MJPS/VJ (रिलीज़ आईडी: 2208602) आगंतुक पटल  : 171 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Marathi , हिन्दी , Gujarati Prime Minister's Office Prime Minister shares glimpses of inauguration of the Rashtra Prerna Sthal in Lucknow, UP प्रविष्टि तिथि:\r\n                        25 DEC 2025 8:26PM by PIB Delhi The Prime Minister Shri Narendra Modi shared the glimpses of inauguration of the Rashtra Prerna Sthal in Lucknow, Uttar Pradesh to honour the life and ideals of Former PM Atal Bihari Vajpayee today. Speaking on the occasion marking Shri Vajpayee's 101st Birth Anniversary, the Prime Minister remarked that today the land of Lucknow is becoming a witness to a new inspiration. He extended Christmas greetings to the nation and the world. Highlighting that December 25 brings with it the remarkable occasion of the birth anniversaries of two great personalities of the nation, Shri Modi remarked that Bharat Ratna Atal Bihari Vajpayee ji and Bharat Ratna Mahamana Madan Mohan Malaviya ji dedicated their lives to safeguarding India’s identity, unity, and pride. The Prime Minister emphasized that both these stalwarts left an indelible mark on nation-building through their immense contributions. In a series of posts on X, Shri Modi said: \"राष्ट्र प्रेरणा स्थल में कमल पुष्प के आकार का अत्याधुनिक संग्रहालय निस्वार्थ नेतृत्व और सुशासन की भावना को सजीव रूप में सामने लाता है। यह आने वाली पीढ़ियों को हमारे जननायकों के आदर्शों को आत्मसात कर जीवन में अपनाने की प्रेरणा देता रहेगा।\" राष्ट्र प्रेरणा स्थल में कमल पुष्प के आकार का अत्याधुनिक संग्रहालय निस्वार्थ नेतृत्व और सुशासन की भावना को सजीव रूप में सामने लाता है। यह आने वाली पीढ़ियों को हमारे जननायकों के आदर्शों को आत्मसात कर जीवन में अपनाने की प्रेरणा देता रहेगा। pic.twitter.com/BrF4Rx8KAz — Narendra Modi (@narendramodi) December 25, 2025 \"राष्ट्र प्रेरणा स्थल में कमल पुष्प के आकार का अत्याधुनिक संग्रहालय निस्वार्थ नेतृत्व और सुशासन की भावना को सजीव रूप में सामने लाता है। यह आने वाली पीढ़ियों को हमारे जननायकों के आदर्शों को आत्मसात कर जीवन में अपनाने की प्रेरणा देता रहेगा।\" राष्ट्र प्रेरणा स्थल में कमल पुष्प के आकार का अत्याधुनिक संग्रहालय निस्वार्थ नेतृत्व और सुशासन की भावना को सजीव रूप में सामने लाता है। यह आने वाली पीढ़ियों को हमारे जननायकों के आदर्शों को आत्मसात कर जीवन में अपनाने की प्रेरणा देता रहेगा। pic.twitter.com/BrF4Rx8KAz — Narendra Modi (@narendramodi) December 25, 2025 \"लखनऊ के मेरे परिवारजनों का उत्साह और उमंग इस बात का प्रमाण है कि देश की महान विभूतियों के आदर्श, मूल्य और राष्ट्रसेवा की भावना आज भी जन-जन का मार्गदर्शन कर रही है।\" लखनऊ के मेरे परिवारजनों का उत्साह और उमंग इस बात का प्रमाण है कि देश की महान विभूतियों के आदर्श, मूल्य और राष्ट्रसेवा की भावना आज भी जन-जन का मार्गदर्शन कर रही है। pic.twitter.com/196edya92P — Narendra Modi (@narendramodi) December 25, 2025 \"राष्ट्र प्रेरणा स्थल उस सोच का प्रतीक है, जिसने भारत को आत्मसम्मान, एकता और सेवा का मार्ग दिखाया है। यहां डॉक्टर श्यामा प्रसाद मुखर्जी, पंडित दीनदयाल उपाध्याय जी और अटल बिहारी वाजपेयी जी की प्रतिमाएं हमें संदेश देती हैं कि हमारा हर कदम और हर प्रयास राष्ट्र-निर्माण के लिए समर्पित हो।\" राष्ट्र प्रेरणा स्थल उस सोच का प्रतीक है, जिसने भारत को आत्मसम्मान, एकता और सेवा का मार्ग दिखाया है। यहां डॉक्टर श्यामा प्रसाद मुखर्जी, पंडित दीनदयाल उपाध्याय जी और अटल बिहारी वाजपेयी जी की प्रतिमाएं हमें संदेश देती हैं कि हमारा हर कदम और हर प्रयास राष्ट्र-निर्माण के लिए समर्पित… pic.twitter.com/SX9o3HBvtd — Narendra Modi (@narendramodi) December 25, 2025 \"डॉक्टर श्यामा प्रसाद मुखर्जी ने भारत में आर्थिक आत्मनिर्भरता की नींव रखी थी। उनकी प्रेरणा से आज हम उसे और सशक्त बनाने में कोई कोर-कसर नहीं छोड़ रहे हैं।\" डॉक्टर श्यामा प्रसाद मुखर्जी ने भारत में आर्थिक आत्मनिर्भरता की नींव रखी थी। उनकी प्रेरणा से आज हम उसे और सशक्त बनाने में कोई कोर-कसर नहीं छोड़ रहे हैं। pic.twitter.com/aVzPhxivrQ — Narendra Modi (@narendramodi) December 25, 2025 \"पंडित दीनदयाल जी का विजन था कि कतार में खड़े अंतिम व्यक्ति तक हर सुविधा पहुंचे। आज जब हम हर जरूरतमंद तक सरकार की कल्याणकारी योजनाओं का लाभ पहुंचा रहे हैं, तो अंत्योदय का उनका ये सपना साकार हो रहा है।\" पंडित दीनदयाल जी का विजन था कि कतार में खड़े अंतिम व्यक्ति तक हर सुविधा पहुंचे। आज जब हम हर जरूरतमंद तक सरकार की कल्याणकारी योजनाओं का लाभ पहुंचा रहे हैं, तो अंत्योदय का उनका ये सपना साकार हो रहा है। pic.twitter.com/rILO0OBKKl — Narendra Modi (@narendramodi) December 25, 2025 \"अटल जी की जयंती सुशासन का उत्सव मनाने का भी दिन है। भाजपा-NDA सरकार ने सुशासन की जो विरासत बनाई है, उसे आज हम एक नया विस्तार दे रहे हैं।\" अटल जी की जयंती सुशासन का उत्सव मनाने का भी दिन है। भाजपा-NDA सरकार ने सुशासन की जो विरासत बनाई है, उसे आज हम एक नया विस्तार दे रहे हैं। pic.twitter.com/3IPZNeFRa6 — Narendra Modi (@narendramodi) December 25, 2025 \"कांग्रेस और उसके सहयोगियों ने राजनीतिक रूप से भाजपा को हमेशा अछूत बनाए रखा। लेकिन भाजपा के संस्कार ने हमें सबका सम्मान करना सिखाया है, जिसके एक नहीं अनेक उदाहरण हैं…\" कांग्रेस और उसके सहयोगियों ने राजनीतिक रूप से भाजपा को हमेशा अछूत बनाए रखा। लेकिन भाजपा के संस्कार ने हमें सबका सम्मान करना सिखाया है, जिसके एक नहीं अनेक उदाहरण हैं… pic.twitter.com/CMpzd43UHQ — Narendra Modi (@narendramodi) December 25, 2025 \"राष्ट्र प्रेरणा स्थल हमारे देश की महान विभूतियों के जीवन, उनके आदर्शों और अमूल्य विरासत को समर्पित एक प्रेरणादायी स्मारक है। आज सुशासन दिवस पर लखनऊ में इसका लोकार्पण कर अपार गौरव और आत्मिक संतोष की अनुभूति हुई।\" राष्ट्र प्रेरणा स्थल हमारे देश की महान विभूतियों के जीवन, उनके आदर्शों और अमूल्य विरासत को समर्पित एक प्रेरणादायी स्मारक है। आज सुशासन दिवस पर लखनऊ में इसका लोकार्पण कर अपार गौरव और आत्मिक संतोष की अनुभूति हुई। pic.twitter.com/2N87WqxRZn — Narendra Modi (@narendramodi) December 25, 2025 **** MJPS/VJ (रिलीज़ आईडी: 2208602)",
    "scraped_at": "2025-12-25T17:39:53.266912"
  },
  {
    "id": "2208540",
    "ministry": "Prime Minister's Office",
    "title": "English rendering of PM’s address during the inauguration of Rashtra Prerna Sthal in Lucknow",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208540",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office English rendering of PM’s address during the inauguration of Rashtra Prerna Sthal in Lucknow प्रविष्टि तिथि:\r\n                25 DEC 2025 6:05PM by PIB Delhi Bharat Mata ki – Jai! Bharat Mata ki – Jai! Bharat Mata ki – Jai! The Governor of Uttar Pradesh, Anandiben Patel; the popular Chief Minister of this state, Yogi Adityanath ji; my senior colleague in the Union Cabinet and Member of Parliament from Lucknow, Defence Minister Rajnath Singh ji; the President of the BJP in UP and my colleague in the Council of Ministers at the Centre, Shri Pankaj Chaudhary ji; the Deputy Chief Ministers of the state government, Keshav Prasad Maurya and Brajesh Pathak ji; other ministers present here, public representatives, ladies and gentlemen, Today, this land of Lucknow is witnessing a new source of inspiration. Before speaking about it in detail, I extend my Christmas greetings to the people of the country and the world. Today, crores of Christian families are celebrating in Bharat too. May this festival of Christmas bring happiness into everyone’s lives! This is our wish. Friends, This day of 25th December also brings with it the rare and wonderful coincidence of the birth anniversaries of two great sons of the nation -- Bharat Ratna Atal Bihari Vajpayee ji and Bharat Ratna Mahamana Madan Mohan Malaviya ji.  Both these great personalities safeguarded Bharat’s identity, unity, and pride, and left an indelible mark on nation-building. Friends, Today, 25th December, also marks the birth anniversary of Maharaja Bijli Pasi. The famous Bijli Pasi Fort of Lucknow is not very far from here. The legacy of valour, good governance, and inclusiveness left behind by Maharaja Bijli Pasi has been carried forward with pride by the Pasi community. It is also a coincidence that it was Atal ji himself who issued a postage stamp in honour of Maharaja Bijli Pasi in 2000. Friends, On this sacred day, I bow with reverence to Mahamana Malaviya ji, Atal ji, and Maharaja Bijli Pasi, and offer them my heartfelt homage. Friends, A short while ago, I had the privilege of inaugurating the Rashtra Prerna Sthal here. This Rashtra Prerna Sthal is a symbol of the ideals that have shown Bharat the path of self-respect, unity, and service. The towering statues of Dr. Syama Prasad Mookerjee, Pandit Deendayal Upadhyaya ji, and Atal Bihari Vajpayee ji are lofty in height, but the inspiration they impart is even greater. Atal ji once wrote: नीरवता से मुखरित मधुबन, परहित अर्पित अपना तन-मन, जीवन को शत-शत आहुति में, जलना होगा, गलना होगा। क़दम मिलाकर चलना होगा। (From silence, the garden speaks; For the welfare of others, one must dedicate body and soul. In life’s countless offerings, One must burn, one must melt. We must walk in step together.) This Rashtra Prerna Sthal conveys the message that every step we take, every effort we make, must be dedicated to nation-building. It is the collective effort of all that will fulfil the resolve of a ‘Viksit Bharat’ (Developed India). I congratulate Lucknow, Uttar Pradesh, and the entire nation on this modern centre of inspiration. As it was just mentioned and also shown in the video, the land on which this Prerna Sthal has been built, which is more than 30 acres, had been a mountain of garbage for several decades. Over the past three years, it has been completely cleared. I extend my heartfelt congratulations to all the workers, artisans, planners associated with this project, as well as to Yogi ji and his entire team. Friends, Dr. Syama Prasad Mookerjee played a decisive role in giving direction to the nation. It was Dr. Mookerjee who rejected the system of two constitutions, two flags, and two prime ministers in Bharat. Even after independence, this arrangement in Jammu and Kashmir posed a major challenge to Bharat’s unity and integrity. The BJP takes pride in the fact that our government got the opportunity to demolish the wall of Article 370. Today, the Constitution of Bharat is fully implemented in Jammu and Kashmir as well. Friends, As independent Bharat’s first Industry Minister, Dr. Mookerjee laid the foundation of economic self-reliance in the country. He gave the nation its first industrial policy thus laying the groundwork for industrialization in Bharat. Today, we are taking that very mantra of self-reliance to new heights. Made in India products are now reaching markets across the world. Look at Uttar Pradesh itself! On one hand, a massive One District, One Product campaign is strengthening small industries and units; on the other hand, a major Defence Corridor is being developed in the state. The power of the BrahMos missile that the world witnessed during Operation Sindoor is now being manufactured in Lucknow. The day is not far when Uttar Pradesh’s Defence Corridor will be known worldwide for defence manufacturing. Friends, Decades ago, Pandit Deendayal Upadhyaya ji envisioned the dream of Antyodaya. He believed that the true measure of Bharat’s progress would be reflected in the smile on the face of the person standing at the very end of the line. Deendayal ji also articulated the philosophy of Integral Humanism, which envisages the holistic development of the body, mind, intellect, and soul. Modi has made Deendayal ji’s dream his own resolve. We have expanded Antyodaya through the new approach of saturation, that is, ensuring that every needy person and every beneficiary is brought within the ambit of government welfare schemes. When there is a spirit of saturation, there is no discrimination and that is true good governance, true social justice, and true secularism. Today, when crores of citizens are receiving permanent houses, toilets, tap water, electricity, and gas connections for the first time without discrimination; when crores of people are receiving free food grains and free medical treatment for the first time; and when efforts are being made to reach the last person standing in the line then justice is truly being done to the vision of Pandit Deendayal ji. Friends, Over the past decade, crores of Indians have defeated poverty and risen above it. This has been possible because the BJP government prioritized those who were left behind and gave precedence to those at the very end of the line. Friends, Before 2014, about 25 crore citizens were covered under the government’s social security schemes. Only 25 crore people! Today, nearly 95 crore Indians are covered under this protective umbrella. In Uttar Pradesh too, a large number of people have benefited from it. Let me give you another example. Just as bank accounts were once limited to a few people, insurance too was confined to the well-off. Our government took up the responsibility of extending insurance security to the last person. For this, the Pradhan Mantri Jeevan Jyoti Bima Yojana was launched, providing life insurance coverage of two lakh rupees at a nominal premium. Today, more than 25 crore poor citizens are connected to this scheme. Similarly, the Pradhan Mantri Suraksha Bima Yojana is being implemented for accident insurance, and around 55 crore poor citizens are covered under it. These are the very citizens who earlier could not even think about insurance. Friends, You may be surprised to know that through these schemes, claims amounting to nearly 25,000 crore rupees have been paid, benefiting ordinary poor families who live modest lives. In other words, this money has come to the aid of poor families in times of crisis. Friends, Atal ji’s birth anniversary today is also a day to celebrate good governance. For a long time, slogans like “Garibi Hatao” were considered governance in this country. But Atal ji truly brought good governance down to the ground, in real terms. Today, there is so much discussion about digital identity. Its foundation was laid by Atal ji’s government itself. The work that began then on a special card has today become globally renowned as Aadhaar. The credit for accelerating the telecom revolution in Bharat also goes to Atal ji. The telecom policy framed by his government made it easier to take telephones and the internet to every household, and today Bharat is among the countries with the largest number of mobile and internet users in the world. Friends, Wherever Atal ji may be today, he would be pleased to know that Bharat has become the world’s second-largest mobile phone manufacturer over the past 11 years. And Uttar Pradesh from where he was a Member of Parliament is today Bharat’s number one mobile manufacturing state. Friends, Atal ji’s vision on connectivity gave early strength to 21st-century Bharat. It was during his government that the campaign to connect villages with roads was launched. It was also then that work began on the Golden Quadrilateral which is the expansion of highways. Friends, Since the year 2000, about 800,000 kilometres of roads have been built in villages so far under the Pradhan Mantri Gram Sadak Yojana. Of these, nearly 400,000 kilometres of rural roads have been constructed in the last 10–11 years alone. And friends, Today, you can see for yourselves how rapidly expressways are being built across the country at an unprecedented pace. Uttar Pradesh, too, is establishing its identity as an expressway state. It was Atal ji who initiated the Delhi Metro. Today, metro networks in more than 20 cities of the country are making the lives of millions of people easier. The legacy of good governance created by the BJP–NDA government is now being taken to new heights and new dimensions by BJP governments at the Centre and in the states. Friends, The inspiration drawn from these three great men—Dr. Mookerjee, Pandit Deendayal ji, and Atal ji—their visionary work, and these towering statues together form a very strong foundation for a ‘Viksit Bharat’. Today, these statues are filling us with renewed energy. But we must not forget how a tendency developed in Bharat after Independence to attribute every good work to a single family. Whether it was books, government schemes, government institutions, lanes, roads, or public squares, everything became an exercise in glorifying one family: the names, the statues, everything revolved around them. The BJP has freed the nation from this old tendency of being held captive by a single family. Our government is honouring the contribution of every immortal son and daughter who served Maa Bharati. Let me give you a few examples. Today, a statue of Netaji Subhas Chandra Bose stands on Kartavya Path in Delhi. The island in the Andamans where Netaji hoisted the Tricolour now bears his name. Friends, No one can forget how attempts were made to erase the legacy of Babasaheb Ambedkar. In Delhi, the Congress’s ruling family committed this grave wrongdoing, and here in Uttar Pradesh, the Samajwadi Party dared to do the same. But the BJP did not allow Babasaheb’s legacy to be erased. Today, from Delhi to London, Babasaheb Ambedkar’s Panch Teerth are proclaiming and celebrating his legacy. Friends, Sardar Vallabhbhai Patel unified our country, which had been fragmented into hundreds of princely states. Yet after Independence, attempts were made to diminish both his work and his stature. It is the BJP that gave Sardar Sahib the respect and honour he truly deserved. The BJP built the world’s tallest statue in his honour and developed an inspirational site known as Ekta Nagar. Now, the nation observes the main celebration of National Unity Day there every year on 31st October. Friends, For decades, the contributions of tribal communities were also not given their rightful place. It is our government that built a grand memorial for Bhagwan Birsa Munda. Just a few weeks ago, the Shaheed Veer Narayan Singh Tribal Museum was inaugurated in Chhattisgarh. Friends, There are many such examples across the country. Even here in Uttar Pradesh, take the case of Maharaja Suheldev.  The memorial dedicated to him was built only after a BJP government came to power. Here, the meeting place of Nishadraj and Lord Shri Ram has finally received the honour and recognition it deserves. From Raja Mahendra Pratap Singh to the martyrs of Chauri Chaura, it is the BJP government that has remembered the contributions of these sons of Maa Bharati with full reverence and humility. Friends, Politics driven by dynasticism has a distinct character: it is rooted in insecurity. That is why, for dynastic politicians, diminishing others becomes a compulsion, so that their own family appears larger and their enterprise continues to run. This mindset gave rise to political untouchability in Bharat. Just think, there have been many Prime Ministers in independent Bharat, yet in the capital Delhi, the museum that existed ignored several former Prime Ministers. It is the BJP and the NDA that have changed this situation. Today, when you go to Delhi, the grand Prime Ministers’ Museum welcomes you, where every Prime Minister of independent Bharat, regardless of how short their tenure may have been, has been given due respect and space. Friends, The Congress and its allies always kept the BJP politically “untouchable.” But BJP’s values teach us to respect everyone. Over the past 11 years of BJP and NDA governance, Bharat Ratna has been conferred upon Narasimha Rao ji and Pranab Babu. It is our government that has honoured many leaders, including Mulayam Singh Yadav ji and Tarun Gogoi ji, with national awards. One cannot expect such gestures from the Congress or from the Samajwadi Party. During their rule, BJP leaders received nothing but humiliation. Friends, Uttar Pradesh is benefiting greatly from the BJP’s double-engine government. Uttar Pradesh is carving out a distinct identity for itself in 21st-century Bharat. It is my good fortune that I am a Member of Parliament from UP. Today, I can say with great pride that the hardworking people of Uttar Pradesh are writing a new future. There was a time when UP was discussed only in terms of poor law and order; today, UP is discussed for its development. Today, UP is rapidly emerging on the country’s tourism map. The grand Ram Temple in Ayodhya and the Kashi Vishwanath Dham have become symbols of UP’s new global identity. And modern developments like the Rashtra Prerna Sthal are further illuminating the state’s new image. Friends, With the hope that our Uttar Pradesh reaches even greater heights as a model of good governance, prosperity, and true social justice, I once again congratulate all of you on the Rashtra Prerna Sthal. I will say: Dr. Syama Prasad Mookerjee and you will respond by saying Amar Rahe, Amar Rahe. I will say: Pandit Deendayal Upadhyaya ji and you will respond Amar Rahe, Amar Rahe. I will say: Atal Bihari Vajpayee ji and you will respond, Amar Rahe, Amar Rahe. Syama Prasad Mookerjee -- Amar Rahe, Amar Rahe. Syama Prasad Mookerjee -- Amar Rahe, Amar Rahe. Syama Prasad Mookerjee -- Amar Rahe, Amar Rahe. Pandit Deendayal ji -- Amar Rahe, Amar Rahe. Pandit Deendayal ji -- Amar Rahe, Amar Rahe. Pandit Deendayal ji -- Amar Rahe, Amar Rahe. Atal Bihari Vajpayee ji -- Amar Rahe, Amar Rahe. Atal Bihari Vajpayee ji -- Amar Rahe, Amar Rahe. Atal Bihari Vajpayee ji -- Amar Rahe, Amar Rahe. Bharat Mata ki – Jai! Vande Mataram! Vande Mataram! Thank you very much. **** MJPS/VJ/AK/VK (रिलीज़ आईडी: 2208540) आगंतुक पटल  : 211 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati Prime Minister's Office English rendering of PM’s address during the inauguration of Rashtra Prerna Sthal in Lucknow प्रविष्टि तिथि:\r\n                        25 DEC 2025 6:05PM by PIB Delhi Bharat Mata ki – Jai! Bharat Mata ki – Jai! Bharat Mata ki – Jai! The Governor of Uttar Pradesh, Anandiben Patel; the popular Chief Minister of this state, Yogi Adityanath ji; my senior colleague in the Union Cabinet and Member of Parliament from Lucknow, Defence Minister Rajnath Singh ji; the President of the BJP in UP and my colleague in the Council of Ministers at the Centre, Shri Pankaj Chaudhary ji; the Deputy Chief Ministers of the state government, Keshav Prasad Maurya and Brajesh Pathak ji; other ministers present here, public representatives, ladies and gentlemen, Today, this land of Lucknow is witnessing a new source of inspiration. Before speaking about it in detail, I extend my Christmas greetings to the people of the country and the world. Today, crores of Christian families are celebrating in Bharat too. May this festival of Christmas bring happiness into everyone’s lives! This is our wish. Friends, This day of 25th December also brings with it the rare and wonderful coincidence of the birth anniversaries of two great sons of the nation -- Bharat Ratna Atal Bihari Vajpayee ji and Bharat Ratna Mahamana Madan Mohan Malaviya ji.  Both these great personalities safeguarded Bharat’s identity, unity, and pride, and left an indelible mark on nation-building. Friends, Today, 25th December, also marks the birth anniversary of Maharaja Bijli Pasi. The famous Bijli Pasi Fort of Lucknow is not very far from here. The legacy of valour, good governance, and inclusiveness left behind by Maharaja Bijli Pasi has been carried forward with pride by the Pasi community. It is also a coincidence that it was Atal ji himself who issued a postage stamp in honour of Maharaja Bijli Pasi in 2000. Friends, On this sacred day, I bow with reverence to Mahamana Malaviya ji, Atal ji, and Maharaja Bijli Pasi, and offer them my heartfelt homage. Friends, A short while ago, I had the privilege of inaugurating the Rashtra Prerna Sthal here. This Rashtra Prerna Sthal is a symbol of the ideals that have shown Bharat the path of self-respect, unity, and service. The towering statues of Dr. Syama Prasad Mookerjee, Pandit Deendayal Upadhyaya ji, and Atal Bihari Vajpayee ji are lofty in height, but the inspiration they impart is even greater. Atal ji once wrote: नीरवता से मुखरित मधुबन, परहित अर्पित अपना तन-मन, जीवन को शत-शत आहुति में, जलना होगा, गलना होगा। क़दम मिलाकर चलना होगा। (From silence, the garden speaks; For the welfare of others, one must dedicate body and soul. In life’s countless offerings, One must burn, one must melt. We must walk in step together.) This Rashtra Prerna Sthal conveys the message that every step we take, every effort we make, must be dedicated to nation-building. It is the collective effort of all that will fulfil the resolve of a ‘Viksit Bharat’ (Developed India). I congratulate Lucknow, Uttar Pradesh, and the entire nation on this modern centre of inspiration. As it was just mentioned and also shown in the video, the land on which this Prerna Sthal has been built, which is more than 30 acres, had been a mountain of garbage for several decades. Over the past three years, it has been completely cleared. I extend my heartfelt congratulations to all the workers, artisans, planners associated with this project, as well as to Yogi ji and his entire team. Friends, Dr. Syama Prasad Mookerjee played a decisive role in giving direction to the nation. It was Dr. Mookerjee who rejected the system of two constitutions, two flags, and two prime ministers in Bharat. Even after independence, this arrangement in Jammu and Kashmir posed a major challenge to Bharat’s unity and integrity. The BJP takes pride in the fact that our government got the opportunity to demolish the wall of Article 370. Today, the Constitution of Bharat is fully implemented in Jammu and Kashmir as well. Friends, As independent Bharat’s first Industry Minister, Dr. Mookerjee laid the foundation of economic self-reliance in the country. He gave the nation its first industrial policy thus laying the groundwork for industrialization in Bharat. Today, we are taking that very mantra of self-reliance to new heights. Made in India products are now reaching markets across the world. Look at Uttar Pradesh itself! On one hand, a massive One District, One Product campaign is strengthening small industries and units; on the other hand, a major Defence Corridor is being developed in the state. The power of the BrahMos missile that the world witnessed during Operation Sindoor is now being manufactured in Lucknow. The day is not far when Uttar Pradesh’s Defence Corridor will be known worldwide for defence manufacturing. Friends, Decades ago, Pandit Deendayal Upadhyaya ji envisioned the dream of Antyodaya. He believed that the true measure of Bharat’s progress would be reflected in the smile on the face of the person standing at the very end of the line. Deendayal ji also articulated the philosophy of Integral Humanism, which envisages the holistic development of the body, mind, intellect, and soul. Modi has made Deendayal ji’s dream his own resolve. We have expanded Antyodaya through the new approach of saturation, that is, ensuring that every needy person and every beneficiary is brought within the ambit of government welfare schemes. When there is a spirit of saturation, there is no discrimination and that is true good governance, true social justice, and true secularism. Today, when crores of citizens are receiving permanent houses, toilets, tap water, electricity, and gas connections for the first time without discrimination; when crores of people are receiving free food grains and free medical treatment for the first time; and when efforts are being made to reach the last person standing in the line then justice is truly being done to the vision of Pandit Deendayal ji. Friends, Over the past decade, crores of Indians have defeated poverty and risen above it. This has been possible because the BJP government prioritized those who were left behind and gave precedence to those at the very end of the line. Friends, Before 2014, about 25 crore citizens were covered under the government’s social security schemes. Only 25 crore people! Today, nearly 95 crore Indians are covered under this protective umbrella. In Uttar Pradesh too, a large number of people have benefited from it. Let me give you another example. Just as bank accounts were once limited to a few people, insurance too was confined to the well-off. Our government took up the responsibility of extending insurance security to the last person. For this, the Pradhan Mantri Jeevan Jyoti Bima Yojana was launched, providing life insurance coverage of two lakh rupees at a nominal premium. Today, more than 25 crore poor citizens are connected to this scheme. Similarly, the Pradhan Mantri Suraksha Bima Yojana is being implemented for accident insurance, and around 55 crore poor citizens are covered under it. These are the very citizens who earlier could not even think about insurance. Friends, You may be surprised to know that through these schemes, claims amounting to nearly 25,000 crore rupees have been paid, benefiting ordinary poor families who live modest lives. In other words, this money has come to the aid of poor families in times of crisis. Friends, Atal ji’s birth anniversary today is also a day to celebrate good governance. For a long time, slogans like “Garibi Hatao” were considered governance in this country. But Atal ji truly brought good governance down to the ground, in real terms. Today, there is so much discussion about digital identity. Its foundation was laid by Atal ji’s government itself. The work that began then on a special card has today become globally renowned as Aadhaar. The credit for accelerating the telecom revolution in Bharat also goes to Atal ji. The telecom policy framed by his government made it easier to take telephones and the internet to every household, and today Bharat is among the countries with the largest number of mobile and internet users in the world. Friends, Wherever Atal ji may be today, he would be pleased to know that Bharat has become the world’s second-largest mobile phone manufacturer over the past 11 years. And Uttar Pradesh from where he was a Member of Parliament is today Bharat’s number one mobile manufacturing state. Friends, Atal ji’s vision on connectivity gave early strength to 21st-century Bharat. It was during his government that the campaign to connect villages with roads was launched. It was also then that work began on the Golden Quadrilateral which is the expansion of highways. Friends, Since the year 2000, about 800,000 kilometres of roads have been built in villages so far under the Pradhan Mantri Gram Sadak Yojana. Of these, nearly 400,000 kilometres of rural roads have been constructed in the last 10–11 years alone. And friends, Today, you can see for yourselves how rapidly expressways are being built across the country at an unprecedented pace. Uttar Pradesh, too, is establishing its identity as an expressway state. It was Atal ji who initiated the Delhi Metro. Today, metro networks in more than 20 cities of the country are making the lives of millions of people easier. The legacy of good governance created by the BJP–NDA government is now being taken to new heights and new dimensions by BJP governments at the Centre and in the states. Friends, The inspiration drawn from these three great men—Dr. Mookerjee, Pandit Deendayal ji, and Atal ji—their visionary work, and these towering statues together form a very strong foundation for a ‘Viksit Bharat’. Today, these statues are filling us with renewed energy. But we must not forget how a tendency developed in Bharat after Independence to attribute every good work to a single family. Whether it was books, government schemes, government institutions, lanes, roads, or public squares, everything became an exercise in glorifying one family: the names, the statues, everything revolved around them. The BJP has freed the nation from this old tendency of being held captive by a single family. Our government is honouring the contribution of every immortal son and daughter who served Maa Bharati. Let me give you a few examples. Today, a statue of Netaji Subhas Chandra Bose stands on Kartavya Path in Delhi. The island in the Andamans where Netaji hoisted the Tricolour now bears his name. Friends, No one can forget how attempts were made to erase the legacy of Babasaheb Ambedkar. In Delhi, the Congress’s ruling family committed this grave wrongdoing, and here in Uttar Pradesh, the Samajwadi Party dared to do the same. But the BJP did not allow Babasaheb’s legacy to be erased. Today, from Delhi to London, Babasaheb Ambedkar’s Panch Teerth are proclaiming and celebrating his legacy. Friends, Sardar Vallabhbhai Patel unified our country, which had been fragmented into hundreds of princely states. Yet after Independence, attempts were made to diminish both his work and his stature. It is the BJP that gave Sardar Sahib the respect and honour he truly deserved. The BJP built the world’s tallest statue in his honour and developed an inspirational site known as Ekta Nagar. Now, the nation observes the main celebration of National Unity Day there every year on 31st October. Friends, For decades, the contributions of tribal communities were also not given their rightful place. It is our government that built a grand memorial for Bhagwan Birsa Munda. Just a few weeks ago, the Shaheed Veer Narayan Singh Tribal Museum was inaugurated in Chhattisgarh. Friends, There are many such examples across the country. Even here in Uttar Pradesh, take the case of Maharaja Suheldev.  The memorial dedicated to him was built only after a BJP government came to power. Here, the meeting place of Nishadraj and Lord Shri Ram has finally received the honour and recognition it deserves. From Raja Mahendra Pratap Singh to the martyrs of Chauri Chaura, it is the BJP government that has remembered the contributions of these sons of Maa Bharati with full reverence and humility. Friends, Politics driven by dynasticism has a distinct character: it is rooted in insecurity. That is why, for dynastic politicians, diminishing others becomes a compulsion, so that their own family appears larger and their enterprise continues to run. This mindset gave rise to political untouchability in Bharat. Just think, there have been many Prime Ministers in independent Bharat, yet in the capital Delhi, the museum that existed ignored several former Prime Ministers. It is the BJP and the NDA that have changed this situation. Today, when you go to Delhi, the grand Prime Ministers’ Museum welcomes you, where every Prime Minister of independent Bharat, regardless of how short their tenure may have been, has been given due respect and space. Friends, The Congress and its allies always kept the BJP politically “untouchable.” But BJP’s values teach us to respect everyone. Over the past 11 years of BJP and NDA governance, Bharat Ratna has been conferred upon Narasimha Rao ji and Pranab Babu. It is our government that has honoured many leaders, including Mulayam Singh Yadav ji and Tarun Gogoi ji, with national awards. One cannot expect such gestures from the Congress or from the Samajwadi Party. During their rule, BJP leaders received nothing but humiliation. Friends, Uttar Pradesh is benefiting greatly from the BJP’s double-engine government. Uttar Pradesh is carving out a distinct identity for itself in 21st-century Bharat. It is my good fortune that I am a Member of Parliament from UP. Today, I can say with great pride that the hardworking people of Uttar Pradesh are writing a new future. There was a time when UP was discussed only in terms of poor law and order; today, UP is discussed for its development. Today, UP is rapidly emerging on the country’s tourism map. The grand Ram Temple in Ayodhya and the Kashi Vishwanath Dham have become symbols of UP’s new global identity. And modern developments like the Rashtra Prerna Sthal are further illuminating the state’s new image. Friends, With the hope that our Uttar Pradesh reaches even greater heights as a model of good governance, prosperity, and true social justice, I once again congratulate all of you on the Rashtra Prerna Sthal. I will say: Dr. Syama Prasad Mookerjee and you will respond by saying Amar Rahe, Amar Rahe. I will say: Pandit Deendayal Upadhyaya ji and you will respond Amar Rahe, Amar Rahe. I will say: Atal Bihari Vajpayee ji and you will respond, Amar Rahe, Amar Rahe. Syama Prasad Mookerjee -- Amar Rahe, Amar Rahe. Syama Prasad Mookerjee -- Amar Rahe, Amar Rahe. Syama Prasad Mookerjee -- Amar Rahe, Amar Rahe. Pandit Deendayal ji -- Amar Rahe, Amar Rahe. Pandit Deendayal ji -- Amar Rahe, Amar Rahe. Pandit Deendayal ji -- Amar Rahe, Amar Rahe. Atal Bihari Vajpayee ji -- Amar Rahe, Amar Rahe. Atal Bihari Vajpayee ji -- Amar Rahe, Amar Rahe. Atal Bihari Vajpayee ji -- Amar Rahe, Amar Rahe. Bharat Mata ki – Jai! Vande Mataram! Vande Mataram! Thank you very much. **** MJPS/VJ/AK/VK (रिलीज़ आईडी: 2208540)",
    "scraped_at": "2025-12-25T17:39:55.921552"
  },
  {
    "id": "2208535",
    "ministry": "Prime Minister's Office",
    "title": "PM to participate in the programme marking ‘Veer Baal Diwas’ on 26th December",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208535",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office PM to participate in the programme marking ‘Veer Baal Diwas’ on 26th December प्रविष्टि तिथि:\r\n                25 DEC 2025 5:37PM by PIB Delhi Prime Minister Shri Narendra Modi will participate in the national programme marking ‘Veer Baal Diwas’ on 26th December 2025, at around 12:15 PM, at Bharat Mandapam, New Delhi. On the occasion, the Prime Minister will also address the gathering. To mark Veer Baal Diwas, the Government of India is organising participative programmes across the country with the objective of informing and educating citizens about the extraordinary courage and supreme sacrifice of the Sahibzades, and to honour and commemorate the indomitable courage, sacrifice, and valour of the young heroes of India’s history. The activities will include storytelling sessions, recitations, poster-making and essay-writing competitions, among others. These will be conducted in schools, Child Care Institutions, Anganwadi centres, and other educational platforms, as well as through online activities on the MyGov and MyBharat portals. On the occasion of the Prakash Purab of Sri Guru Gobind Singh Ji on 9th January 2022, the Prime Minister had announced that 26th December would be observed as ‘Veer Baal Diwas’, to commemorate the martyrdom of Sahibzadas Baba Zorawar Singh Ji and Baba Fateh Singh Ji, the sons of Sri Guru Gobind Singh Ji, whose unparalleled sacrifice continues to inspire generations. Awardees of the Pradhan Mantri Rashtriya Bal Puraskar (PMRBP) will also be present during the programme. *** MJPS/VJ (रिलीज़ आईडी: 2208535) आगंतुक पटल  : 1054 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Marathi , Odia , Urdu , हिन्दी , Gujarati , Tamil , Telugu , Kannada , Malayalam Prime Minister's Office PM to participate in the programme marking ‘Veer Baal Diwas’ on 26th December प्रविष्टि तिथि:\r\n                        25 DEC 2025 5:37PM by PIB Delhi Prime Minister Shri Narendra Modi will participate in the national programme marking ‘Veer Baal Diwas’ on 26th December 2025, at around 12:15 PM, at Bharat Mandapam, New Delhi. On the occasion, the Prime Minister will also address the gathering. To mark Veer Baal Diwas, the Government of India is organising participative programmes across the country with the objective of informing and educating citizens about the extraordinary courage and supreme sacrifice of the Sahibzades, and to honour and commemorate the indomitable courage, sacrifice, and valour of the young heroes of India’s history. The activities will include storytelling sessions, recitations, poster-making and essay-writing competitions, among others. These will be conducted in schools, Child Care Institutions, Anganwadi centres, and other educational platforms, as well as through online activities on the MyGov and MyBharat portals. On the occasion of the Prakash Purab of Sri Guru Gobind Singh Ji on 9th January 2022, the Prime Minister had announced that 26th December would be observed as ‘Veer Baal Diwas’, to commemorate the martyrdom of Sahibzadas Baba Zorawar Singh Ji and Baba Fateh Singh Ji, the sons of Sri Guru Gobind Singh Ji, whose unparalleled sacrifice continues to inspire generations. Awardees of the Pradhan Mantri Rashtriya Bal Puraskar (PMRBP) will also be present during the programme. *** MJPS/VJ (रिलीज़ आईडी: 2208535)",
    "scraped_at": "2025-12-25T17:39:57.994547"
  },
  {
    "id": "2208531",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister Shri Narendra Modi inaugurates Rashtra Prerna Sthal in Lucknow, UP",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208531",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister Shri Narendra Modi inaugurates Rashtra Prerna Sthal in Lucknow, UP Rashtra Prerna Sthal symbolises a vision that has guided India towards self-respect, unity and service: PM Sabka Prayas will realise the resolve of a Viksit Bharat: PM We have given Antyodaya a new dimension of saturation, that is, fulfillment: PM प्रविष्टि तिथि:\r\n                25 DEC 2025 5:23PM by PIB Delhi Prime Minister Shri Narendra Modi inaugurated the Rashtra Prerna Sthal in Lucknow, Uttar Pradesh to honour the life and ideals of Former PM Atal Bihari Vajpayee today. Speaking on the occasion marking Shri Vajpayee's 101st Birth Anniversary, the Prime Minister remarked that today the land of Lucknow is becoming a witness to a new inspiration. He extended Christmas greetings to the nation and the world. Shri Modi highlighted that in India too, millions of Christian families are celebrating the festival today. He emphasized that this celebration of Christmas should bring happiness into everyone’s lives, which is the collective wish of all. Highlighting that December 25 brings with it the remarkable occasion of the birth anniversaries of two great personalities of the nation, Shri Modi remarked that Bharat Ratna Atal Bihari Vajpayee ji and Bharat Ratna Mahamana Madan Mohan Malaviya ji dedicated their lives to safeguarding India’s identity, unity, and pride. The Prime Minister emphasized that both these stalwarts left an indelible mark on nation-building through their immense contributions. Noting that December 25 also marks the birth anniversary of Maharaja Bijli Pasi ji, Shri Modi highlighted that the famous Bijli Pasi fort of Lucknow is not far from here and emphasized that Maharaja Bijli Pasi left behind a legacy of valor, good governance, and inclusiveness, which the Pasi community has carried forward with pride. He noted the coincidence that it was Atal ji who, in the year 2000, issued a postage stamp in honor of Maharaja Bijli Pasi. He paid respectful homage, offering salutations to Mahamana Malaviya ji, Atal ji, and Maharaja Bijli Pasi. Shri Modi remarked that a short while ago he had the privilege of inaugurating the Rashtra Prerna Sthal, which symbolizes the vision that showed India the path of self-respect, unity, and service. He highlighted that the grand statues of Dr. Syama Prasad Mookerjee, Pandit Deen Dayal Upadhyay ji, and Atal Bihari Vajpayee ji stand tall, yet the inspiration they provide is even greater. Quoting lines of Atal ji, the Prime Minister emphasized that this Rashtra Prerna Sthal gives the message that every step, every effort must be dedicated to nation-building, and that collective effort alone will fulfill the resolve of a developed India. He extended congratulations to Lucknow, Uttar Pradesh, and the entire nation on this modern inspiration site. He noted that the land on which this Prerna Sthal has been built had, for decades, accumulated a mountain of garbage spread over more than 30 acres, which has been completely cleared in the last three years. The Prime Minister congratulated all the workers, artisans, planners associated with the project, and conveyed special appreciation to the Chief Minister and his entire team for their efforts. Underlining that Dr. Syama Prasad Mookerjee played a decisive role in giving direction to the nation, the Prime Minister remarked that it was Dr. Mookerjee who rejected the provision of two constitutions, two emblems, and two prime ministers in India. He emphasized that even after independence, the arrangement in Jammu and Kashmir posed a major challenge to India’s integrity. Shri Modi stated with pride that it was their government that had the opportunity to bring down the wall of Article 370, and today the Constitution of India is fully implemented in Jammu and Kashmir. Prime Minister further recalled that as the first Industry Minister of independent India, Dr. Mookerjee laid the foundation of economic self-reliance and gave the country its first industrial policy, thereby establishing the basis of industrialization in India. He remarked that today the same mantra of self-reliance is being taken to new heights, with Made in India products reaching across the world. Shri Modi pointed out that in Uttar Pradesh itself, a massive campaign of One District One Product is underway, strengthening small industries and small units. He further highlighted that alongside this, a major defense corridor is being built in Uttar Pradesh.  The Prime Minister noted that the BrahMos missile, whose power the world witnessed during Operation Sindoor, is now being manufactured in Lucknow. He emphasized that the day is not far when the defense corridor of Uttar Pradesh will be recognized globally for defense manufacturing. Underscoring that decades ago Pandit Deendayal Upadhyay ji envisioned the dream of Antyodaya, the Prime Minister remarked that Deendayal ji believed India’s progress should be measured by the smile on the face of the last person in the queue. He emphasized that Deendayal ji spoke of Integral Humanism, where the body, mind, intellect, and soul all develop together. Shri Modi further stated that Deendayal ji’s dream has been adopted as his own resolve, and that Antyodaya has now been given a new dimension of saturation, meaning every needy person and every beneficiary is brought under the ambit of government welfare schemes. The Prime Minister underlined that when the spirit of saturation exists, there is no discrimination, and this is true good governance, true social justice, and true secularism. He remarked that today, millions of citizens of the country, without discrimination, are receiving for the first time pucca houses, toilets, tap water, electricity, and gas connections. He further highlighted that millions are receiving free ration and free medical treatment for the first time. The Prime Minister stressed that when efforts are made to reach the last person standing in the line, justice is being done to the vision of Pandit Deendayal ji. “In the past decade, crores of Indians have overcome poverty”, emphasised Shri Modi, remarking that this was possible because their government prioritized those who had been left behind, those standing in the last line. He stated that before 2014, around 25 crore citizens were covered under social security schemes, whereas today nearly 95 crore Indians are within this protective shield, with a large number of beneficiaries in Uttar Pradesh as well. The Prime Minister gave the example that just as bank accounts were once limited to a few, insurance too was confined to the affluent. He emphasized that his government took the responsibility of extending insurance security to the last person. For this, the Pradhan Mantri Jeevan Jyoti Bima Yojana was launched, ensuring insurance of two lakh rupees at a nominal premium, and today more than 25 crore poor citizens are enrolled in this scheme. Similarly, he noted that the Pradhan Mantri Suraksha Bima Yojana for accident insurance has connected nearly 55 crore poor citizens, who earlier could not even think of insurance. Shri Modi remarked that it would surprise many to know that these schemes have already provided claims worth nearly 25,000 crore rupees to beneficiaries, meaning that in times of crisis this money has supported poor families. The Prime Minister remarked that the birth anniversary of Atal ji is also a day to celebrate good governance. He highlighted that for a long time, slogans like poverty eradication were considered governance, but Atal ji truly brought good governance to the ground. Shri Modi emphasized that while today there is much discussion about digital identity, it was Atal ji’s government that laid its foundation. He noted that the special card initiative started at that time has today become world-renowned as Aadhaar. The Prime Minister further stated that the credit for accelerating the telecom revolution in India also goes to Atal ji. He highlighted that the telecom policy framed by his government made it easier to bring phones and internet to every household, and today India is among the countries with the highest number of mobile and internet users in the world. Shri Modi remarked that Atal ji would be pleased that in the past 11 years India has become the world’s second-largest mobile phone manufacturer. He highlighted that Uttar Pradesh, the state from which Atal ji served as a Member of Parliament, is today the number one mobile manufacturing state in India. The Prime Minister emphasized that Atal ji’s vision for connectivity gave early strength to 21st century India. He recalled that it was during Atal ji’s government that the campaign to connect villages with roads was launched, and the work on the Golden Quadrilateral highway expansion began. Shri Modi further pointed out that since the year 2000, under the Pradhan Mantri Gram Sadak Yojana, nearly 8 lakh kilometers of rural roads have been built, of which about 4 lakh kilometers were constructed in the last 10–11 years. He noted that today expressways are being built at unprecedented speed across the country, and Uttar Pradesh is establishing its identity as an expressway state. The Prime Minister further highlighted that it was Atal ji who initiated the Delhi Metro, and today metro networks in more than 20 cities across the country are making life easier for millions of people. He remarked that the legacy of good governance created by their government is now being expanded and given new dimensions by their governments at the Centre and in the states. Highlighting that the inspiration of Dr. Syama Prasad Mookerjee, Pandit Deendayal Upadhyay ji, and Atal Bihari Vajpayee ji, along with their visionary work and grand statues, form a strong foundation for a developed India, Shri Modi remarked that these statues today are filling the nation with new energy. He emphasized that it must not be forgotten how, after independence, there emerged a tendency to link every good work in India to a single family—whether books, government schemes, institutions, streets, or squares, all were associated with the glorification of one family, their names, and their statues. He stated that their party has freed the country from this old practice of being held hostage to one family. The Prime Minister underlined that his government is honoring every immortal child of Mother India and every contribution made in service of the nation. He gave examples, noting that today the statue of Netaji Subhas Chandra Bose stands proudly at Kartavya Path in Delhi, and the island in Andaman where Netaji hoisted the tricolor has now been named after him. Mentioning that no one can forget how attempts were made to erase the legacy of Babasaheb Ambedkar, the Prime Minister stated that the opposition parties committed this sin in Delhi and Uttar Pradesh. He emphasized that their party ensured Babasaheb’s legacy was not allowed to be erased. He highlighted that today, from Delhi to London, Babasaheb Ambedkar’s Panchteerth are proclaiming his legacy. The Prime Minister further recalled that Sardar Patel had united a country divided into hundreds of princely states, but after independence, efforts were made to diminish both his work and stature. He underlined that it was their party that gave Sardar Patel the respect he truly deserved. The Prime Minister noted that it was their government that built the world’s tallest statue of Sardar Patel and developed Ekta Nagar as a site of inspiration. He emphasized that every year, on 31st October, the nation now holds the main celebration of National Unity Day at this site. Noting that for decades the contributions of tribal communities were not given due recognition, Shri Modi highlighted that it was his government that built the grand memorial of Bhagwan Birsa Munda and only a few weeks ago inaugurated the Shaheed Veer Narayan Singh Tribal Museum in Chhattisgarh. The Prime Minister emphasized that there are numerous such examples across the country, noting that in Uttar Pradesh the memorial of Maharaja Suheldev was constructed only after their government came to power. He stated that the site where Nishadraj and Lord Shri Ram met has now finally received due respect. The Prime Minister underlined that from Raja Mahendra Pratap Singh to the martyrs of Chauri Chaura, the contributions of the sons of Mother India have been remembered with full reverence and humility by their government. Underlining that family-based politics has a distinct identity, filled with insecurity, Shri Modi said this compels such leaders to diminish others in order to make their own family appear larger and keep their influence intact. The Prime Minister stressed that this mindset introduced political untouchability in India. He pointed out that although many Prime Ministers served independent India, the museum in Delhi ignored several of them. He emphasized that it was their government that corrected this situation, and today when one visits Delhi, the grand Prime Ministers’ Museum welcomes them, where every Prime Minister of independent India, regardless of how short their tenure was, has been given due respect and rightful place. The Prime Minister remarked that the Opposition and its allies always kept their party politically untouchable, but the values of their party teach respect for all. He highlighted that in the past 11 years, during their government, Shri Narasimha Rao ji and Shri Pranab Mukherjee ji were conferred the Bharat Ratna. The Prime Minister emphasized that it was his government which honored leaders like Shri Mulayam Singh Yadav ji and Shri Tarun Gogoi ji with national awards, something that could never be expected from opposition and their allies, under whose rule leaders from other parties only faced insult. Underscoring that their governments at the Union and State have greatly benefited Uttar Pradesh, which is carving out a distinct identity in 21st century India, The Prime Minister, himself a Member of Parliament from Uttar Pradesh, expressed pride in saying that the hardworking people of the state are writing a new future. He recalled that once Uttar Pradesh was discussed in terms of poor law and order, but today it is discussed for development. Highlighting that Uttar Pradesh is rapidly emerging on the country’s tourism map, with the grand Ram Mandir in Ayodhya and the Kashi Vishwanath Dham becoming symbols of the state’s new identity in the world, the Prime Minister noted that modern constructions like the Rashtra Prerna Sthal further brighten the new image of Uttar Pradesh. The Prime Minister concluded with the wish that Uttar Pradesh continues to achieve greater heights as a model of good governance, prosperity, and true social justice, and once again extended congratulations on the Rashtra Prerna Sthal. Governor of Uttar Pradesh, Smt Anandiben Patel, Chief Minister of Uttar Pradesh, Shri Yogi Adityanath, Union Ministers, Shri Rajnath Singh, Shri Pankaj Chaudhary were present among others at the event. Background Driven by the vision of Prime Minister Shri Narendra Modi to honour the legacy of luminaries of independent India, Rashtra Prerna Sthal will serve a tribute to the life, ideals, and enduring legacy of one of India’s most revered statesmen, whose leadership left a profound impact on the nation’s democratic, political, and developmental journey. Rashtra Prerna Sthal has been developed as a landmark national memorial and inspirational complex of enduring national significance. Constructed at an approximate cost of ₹230 crore and spread across an expansive area of 65 acres, the complex is envisioned as a permanent national asset dedicated to fostering leadership values, national service, cultural consciousness, and public inspiration. The complex features 65-feet-high bronze statues of Dr. Syama Prasad Mookerjee, Pandit Deendayal Upadhyaya, and Former Prime Minister Shri Atal Bihari Vajpayee, symbolising their seminal contributions to India’s political thought, nation-building, and public life. It also houses a state-of-the-art museum designed in the form of a lotus-shaped structure, spread over approximately 98,000 square feet. The museum showcases India’s national journey and the contributions of these visionary leaders through advanced digital and immersive technologies, offering visitors an engaging and educational experience. The inauguration of Rashtra Prerna Sthal marks an important step in preserving and promoting the ideals of selfless leadership and good governance, and is expected to serve as a source of inspiration for present and future generations. पूर्व प्रधानमंत्री भारत रत्न श्रद्धेय अटल बिहारी वाजपेयी जी की जयंती के अवसर पर उत्तर प्रदेश के लखनऊ में 'राष्ट्र प्रेरणा स्थल' का उद्घाटन करना मेरे लिए परम सौभाग्य की बात है। https://t.co/P48AtZ8RWB — Narendra Modi (@narendramodi) December 25, 2025 Rashtra Prerna Sthal symbolises a vision that has guided India towards self-respect, unity and service. pic.twitter.com/gglaLfS6Ce — PMO India (@PMOIndia) December 25, 2025 Sabka Prayas will realise the resolve of a Viksit Bharat. pic.twitter.com/iJlDMRVf6B — PMO India (@PMOIndia) December 25, 2025 हमने अंत्योदय को saturation यानि संतुष्टिकरण का नया विस्तार दिया है। pic.twitter.com/hnp0WMpzY5 — PMO India (@PMOIndia) December 25, 2025 ***** MJPS/SR (रिलीज़ आईडी: 2208531) आगंतुक पटल  : 399 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Marathi , हिन्दी , Gujarati , Tamil , Malayalam Prime Minister's Office Prime Minister Shri Narendra Modi inaugurates Rashtra Prerna Sthal in Lucknow, UP Rashtra Prerna Sthal symbolises a vision that has guided India towards self-respect, unity and service: PM Sabka Prayas will realise the resolve of a Viksit Bharat: PM We have given Antyodaya a new dimension of saturation, that is, fulfillment: PM प्रविष्टि तिथि:\r\n                        25 DEC 2025 5:23PM by PIB Delhi Prime Minister Shri Narendra Modi inaugurated the Rashtra Prerna Sthal in Lucknow, Uttar Pradesh to honour the life and ideals of Former PM Atal Bihari Vajpayee today. Speaking on the occasion marking Shri Vajpayee's 101st Birth Anniversary, the Prime Minister remarked that today the land of Lucknow is becoming a witness to a new inspiration. He extended Christmas greetings to the nation and the world. Shri Modi highlighted that in India too, millions of Christian families are celebrating the festival today. He emphasized that this celebration of Christmas should bring happiness into everyone’s lives, which is the collective wish of all. Highlighting that December 25 brings with it the remarkable occasion of the birth anniversaries of two great personalities of the nation, Shri Modi remarked that Bharat Ratna Atal Bihari Vajpayee ji and Bharat Ratna Mahamana Madan Mohan Malaviya ji dedicated their lives to safeguarding India’s identity, unity, and pride. The Prime Minister emphasized that both these stalwarts left an indelible mark on nation-building through their immense contributions. Noting that December 25 also marks the birth anniversary of Maharaja Bijli Pasi ji, Shri Modi highlighted that the famous Bijli Pasi fort of Lucknow is not far from here and emphasized that Maharaja Bijli Pasi left behind a legacy of valor, good governance, and inclusiveness, which the Pasi community has carried forward with pride. He noted the coincidence that it was Atal ji who, in the year 2000, issued a postage stamp in honor of Maharaja Bijli Pasi. He paid respectful homage, offering salutations to Mahamana Malaviya ji, Atal ji, and Maharaja Bijli Pasi. Shri Modi remarked that a short while ago he had the privilege of inaugurating the Rashtra Prerna Sthal, which symbolizes the vision that showed India the path of self-respect, unity, and service. He highlighted that the grand statues of Dr. Syama Prasad Mookerjee, Pandit Deen Dayal Upadhyay ji, and Atal Bihari Vajpayee ji stand tall, yet the inspiration they provide is even greater. Quoting lines of Atal ji, the Prime Minister emphasized that this Rashtra Prerna Sthal gives the message that every step, every effort must be dedicated to nation-building, and that collective effort alone will fulfill the resolve of a developed India. He extended congratulations to Lucknow, Uttar Pradesh, and the entire nation on this modern inspiration site. He noted that the land on which this Prerna Sthal has been built had, for decades, accumulated a mountain of garbage spread over more than 30 acres, which has been completely cleared in the last three years. The Prime Minister congratulated all the workers, artisans, planners associated with the project, and conveyed special appreciation to the Chief Minister and his entire team for their efforts. Underlining that Dr. Syama Prasad Mookerjee played a decisive role in giving direction to the nation, the Prime Minister remarked that it was Dr. Mookerjee who rejected the provision of two constitutions, two emblems, and two prime ministers in India. He emphasized that even after independence, the arrangement in Jammu and Kashmir posed a major challenge to India’s integrity. Shri Modi stated with pride that it was their government that had the opportunity to bring down the wall of Article 370, and today the Constitution of India is fully implemented in Jammu and Kashmir. Prime Minister further recalled that as the first Industry Minister of independent India, Dr. Mookerjee laid the foundation of economic self-reliance and gave the country its first industrial policy, thereby establishing the basis of industrialization in India. He remarked that today the same mantra of self-reliance is being taken to new heights, with Made in India products reaching across the world. Shri Modi pointed out that in Uttar Pradesh itself, a massive campaign of One District One Product is underway, strengthening small industries and small units. He further highlighted that alongside this, a major defense corridor is being built in Uttar Pradesh.  The Prime Minister noted that the BrahMos missile, whose power the world witnessed during Operation Sindoor, is now being manufactured in Lucknow. He emphasized that the day is not far when the defense corridor of Uttar Pradesh will be recognized globally for defense manufacturing. Underscoring that decades ago Pandit Deendayal Upadhyay ji envisioned the dream of Antyodaya, the Prime Minister remarked that Deendayal ji believed India’s progress should be measured by the smile on the face of the last person in the queue. He emphasized that Deendayal ji spoke of Integral Humanism, where the body, mind, intellect, and soul all develop together. Shri Modi further stated that Deendayal ji’s dream has been adopted as his own resolve, and that Antyodaya has now been given a new dimension of saturation, meaning every needy person and every beneficiary is brought under the ambit of government welfare schemes. The Prime Minister underlined that when the spirit of saturation exists, there is no discrimination, and this is true good governance, true social justice, and true secularism. He remarked that today, millions of citizens of the country, without discrimination, are receiving for the first time pucca houses, toilets, tap water, electricity, and gas connections. He further highlighted that millions are receiving free ration and free medical treatment for the first time. The Prime Minister stressed that when efforts are made to reach the last person standing in the line, justice is being done to the vision of Pandit Deendayal ji. “In the past decade, crores of Indians have overcome poverty”, emphasised Shri Modi, remarking that this was possible because their government prioritized those who had been left behind, those standing in the last line. He stated that before 2014, around 25 crore citizens were covered under social security schemes, whereas today nearly 95 crore Indians are within this protective shield, with a large number of beneficiaries in Uttar Pradesh as well. The Prime Minister gave the example that just as bank accounts were once limited to a few, insurance too was confined to the affluent. He emphasized that his government took the responsibility of extending insurance security to the last person. For this, the Pradhan Mantri Jeevan Jyoti Bima Yojana was launched, ensuring insurance of two lakh rupees at a nominal premium, and today more than 25 crore poor citizens are enrolled in this scheme. Similarly, he noted that the Pradhan Mantri Suraksha Bima Yojana for accident insurance has connected nearly 55 crore poor citizens, who earlier could not even think of insurance. Shri Modi remarked that it would surprise many to know that these schemes have already provided claims worth nearly 25,000 crore rupees to beneficiaries, meaning that in times of crisis this money has supported poor families. The Prime Minister remarked that the birth anniversary of Atal ji is also a day to celebrate good governance. He highlighted that for a long time, slogans like poverty eradication were considered governance, but Atal ji truly brought good governance to the ground. Shri Modi emphasized that while today there is much discussion about digital identity, it was Atal ji’s government that laid its foundation. He noted that the special card initiative started at that time has today become world-renowned as Aadhaar. The Prime Minister further stated that the credit for accelerating the telecom revolution in India also goes to Atal ji. He highlighted that the telecom policy framed by his government made it easier to bring phones and internet to every household, and today India is among the countries with the highest number of mobile and internet users in the world. Shri Modi remarked that Atal ji would be pleased that in the past 11 years India has become the world’s second-largest mobile phone manufacturer. He highlighted that Uttar Pradesh, the state from which Atal ji served as a Member of Parliament, is today the number one mobile manufacturing state in India. The Prime Minister emphasized that Atal ji’s vision for connectivity gave early strength to 21st century India. He recalled that it was during Atal ji’s government that the campaign to connect villages with roads was launched, and the work on the Golden Quadrilateral highway expansion began. Shri Modi further pointed out that since the year 2000, under the Pradhan Mantri Gram Sadak Yojana, nearly 8 lakh kilometers of rural roads have been built, of which about 4 lakh kilometers were constructed in the last 10–11 years. He noted that today expressways are being built at unprecedented speed across the country, and Uttar Pradesh is establishing its identity as an expressway state. The Prime Minister further highlighted that it was Atal ji who initiated the Delhi Metro, and today metro networks in more than 20 cities across the country are making life easier for millions of people. He remarked that the legacy of good governance created by their government is now being expanded and given new dimensions by their governments at the Centre and in the states. Highlighting that the inspiration of Dr. Syama Prasad Mookerjee, Pandit Deendayal Upadhyay ji, and Atal Bihari Vajpayee ji, along with their visionary work and grand statues, form a strong foundation for a developed India, Shri Modi remarked that these statues today are filling the nation with new energy. He emphasized that it must not be forgotten how, after independence, there emerged a tendency to link every good work in India to a single family—whether books, government schemes, institutions, streets, or squares, all were associated with the glorification of one family, their names, and their statues. He stated that their party has freed the country from this old practice of being held hostage to one family. The Prime Minister underlined that his government is honoring every immortal child of Mother India and every contribution made in service of the nation. He gave examples, noting that today the statue of Netaji Subhas Chandra Bose stands proudly at Kartavya Path in Delhi, and the island in Andaman where Netaji hoisted the tricolor has now been named after him. Mentioning that no one can forget how attempts were made to erase the legacy of Babasaheb Ambedkar, the Prime Minister stated that the opposition parties committed this sin in Delhi and Uttar Pradesh. He emphasized that their party ensured Babasaheb’s legacy was not allowed to be erased. He highlighted that today, from Delhi to London, Babasaheb Ambedkar’s Panchteerth are proclaiming his legacy. The Prime Minister further recalled that Sardar Patel had united a country divided into hundreds of princely states, but after independence, efforts were made to diminish both his work and stature. He underlined that it was their party that gave Sardar Patel the respect he truly deserved. The Prime Minister noted that it was their government that built the world’s tallest statue of Sardar Patel and developed Ekta Nagar as a site of inspiration. He emphasized that every year, on 31st October, the nation now holds the main celebration of National Unity Day at this site. Noting that for decades the contributions of tribal communities were not given due recognition, Shri Modi highlighted that it was his government that built the grand memorial of Bhagwan Birsa Munda and only a few weeks ago inaugurated the Shaheed Veer Narayan Singh Tribal Museum in Chhattisgarh. The Prime Minister emphasized that there are numerous such examples across the country, noting that in Uttar Pradesh the memorial of Maharaja Suheldev was constructed only after their government came to power. He stated that the site where Nishadraj and Lord Shri Ram met has now finally received due respect. The Prime Minister underlined that from Raja Mahendra Pratap Singh to the martyrs of Chauri Chaura, the contributions of the sons of Mother India have been remembered with full reverence and humility by their government. Underlining that family-based politics has a distinct identity, filled with insecurity, Shri Modi said this compels such leaders to diminish others in order to make their own family appear larger and keep their influence intact. The Prime Minister stressed that this mindset introduced political untouchability in India. He pointed out that although many Prime Ministers served independent India, the museum in Delhi ignored several of them. He emphasized that it was their government that corrected this situation, and today when one visits Delhi, the grand Prime Ministers’ Museum welcomes them, where every Prime Minister of independent India, regardless of how short their tenure was, has been given due respect and rightful place. The Prime Minister remarked that the Opposition and its allies always kept their party politically untouchable, but the values of their party teach respect for all. He highlighted that in the past 11 years, during their government, Shri Narasimha Rao ji and Shri Pranab Mukherjee ji were conferred the Bharat Ratna. The Prime Minister emphasized that it was his government which honored leaders like Shri Mulayam Singh Yadav ji and Shri Tarun Gogoi ji with national awards, something that could never be expected from opposition and their allies, under whose rule leaders from other parties only faced insult. Underscoring that their governments at the Union and State have greatly benefited Uttar Pradesh, which is carving out a distinct identity in 21st century India, The Prime Minister, himself a Member of Parliament from Uttar Pradesh, expressed pride in saying that the hardworking people of the state are writing a new future. He recalled that once Uttar Pradesh was discussed in terms of poor law and order, but today it is discussed for development. Highlighting that Uttar Pradesh is rapidly emerging on the country’s tourism map, with the grand Ram Mandir in Ayodhya and the Kashi Vishwanath Dham becoming symbols of the state’s new identity in the world, the Prime Minister noted that modern constructions like the Rashtra Prerna Sthal further brighten the new image of Uttar Pradesh. The Prime Minister concluded with the wish that Uttar Pradesh continues to achieve greater heights as a model of good governance, prosperity, and true social justice, and once again extended congratulations on the Rashtra Prerna Sthal. Governor of Uttar Pradesh, Smt Anandiben Patel, Chief Minister of Uttar Pradesh, Shri Yogi Adityanath, Union Ministers, Shri Rajnath Singh, Shri Pankaj Chaudhary were present among others at the event. Background Driven by the vision of Prime Minister Shri Narendra Modi to honour the legacy of luminaries of independent India, Rashtra Prerna Sthal will serve a tribute to the life, ideals, and enduring legacy of one of India’s most revered statesmen, whose leadership left a profound impact on the nation’s democratic, political, and developmental journey. Rashtra Prerna Sthal has been developed as a landmark national memorial and inspirational complex of enduring national significance. Constructed at an approximate cost of ₹230 crore and spread across an expansive area of 65 acres, the complex is envisioned as a permanent national asset dedicated to fostering leadership values, national service, cultural consciousness, and public inspiration. The complex features 65-feet-high bronze statues of Dr. Syama Prasad Mookerjee, Pandit Deendayal Upadhyaya, and Former Prime Minister Shri Atal Bihari Vajpayee, symbolising their seminal contributions to India’s political thought, nation-building, and public life. It also houses a state-of-the-art museum designed in the form of a lotus-shaped structure, spread over approximately 98,000 square feet. The museum showcases India’s national journey and the contributions of these visionary leaders through advanced digital and immersive technologies, offering visitors an engaging and educational experience. The inauguration of Rashtra Prerna Sthal marks an important step in preserving and promoting the ideals of selfless leadership and good governance, and is expected to serve as a source of inspiration for present and future generations. पूर्व प्रधानमंत्री भारत रत्न श्रद्धेय अटल बिहारी वाजपेयी जी की जयंती के अवसर पर उत्तर प्रदेश के लखनऊ में 'राष्ट्र प्रेरणा स्थल' का उद्घाटन करना मेरे लिए परम सौभाग्य की बात है। https://t.co/P48AtZ8RWB — Narendra Modi (@narendramodi) December 25, 2025 Rashtra Prerna Sthal symbolises a vision that has guided India towards self-respect, unity and service. pic.twitter.com/gglaLfS6Ce — PMO India (@PMOIndia) December 25, 2025 Sabka Prayas will realise the resolve of a Viksit Bharat. pic.twitter.com/iJlDMRVf6B — PMO India (@PMOIndia) December 25, 2025 हमने अंत्योदय को saturation यानि संतुष्टिकरण का नया विस्तार दिया है। pic.twitter.com/hnp0WMpzY5 — PMO India (@PMOIndia) December 25, 2025 ***** MJPS/SR (रिलीज़ आईडी: 2208531)",
    "scraped_at": "2025-12-25T17:40:00.293568"
  },
  {
    "id": "2208550",
    "ministry": "Ministry of Environment, Forest and Climate Change",
    "title": "CAQM conducts inspection of PWD roads and re-inspection of DDA road stretches on 24.12.2025 to assess dust mitigation measures",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208550",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Environment, Forest and Climate Change CAQM conducts inspection of PWD roads and re-inspection of DDA road stretches on 24.12.2025 to assess dust mitigation measures Significant improvement observed on DDA stretches earlier reported with high visible dust, while PWD directed to further intensify on-ground interventions प्रविष्टि तिथि:\r\n                25 DEC 2025 6:33PM by PIB Delhi The Commission for Air Quality Management in NCR and Adjoining Areas (CAQM) conducted an inspection drive on 24.12.2025 to assess compliance and effectiveness of corrective measures undertaken by concerned road-maintaining agencies following inspections carried out earlier on 12.12.2025. This was done as part of its continuous monitoring and ongoing enforcement efforts under the statutory framework and provisions of the extant Graded Response Action Plan (GRAP). The drive focused on assessment of accumulation of visible road dust and on-ground operations of Mechanical Road Sweeping Machines (MRSMs), along with identification of instances of Municipal Solid Waste (MSW) accumulation, Construction and Demolition (C&D) waste accumulation and cases of open burning. A total of 15 teams of the Delhi Pollution Control Committee (DPCC) for inspection of 106 road stretches maintained by the Public Works Department (PWD) and 02 teams of the Central Pollution Control Board (CPCB) for re-inspection of selected 27 road stretches under the jurisdiction of Delhi Development Authority (DDA) were deployed under the directions of the Commission. Geo-tagged and time-stamped photographic documentation was collected and submitted to the Commission as part of the consolidated inspection report. During the re-inspection of 27 road stretches maintained by DDA, which were earlier reported with high visible dust levels during inspections conducted on 12.12.2025, it was observed that now none of the i.e. 0 stretches fell under the High Dust category on 24.12.2025. Out of these stretches, 07 found with Moderate Dust levels, 19 recorded Low Dust intensity and 01 stretch was found to have No Visible Dust. This indicates a marked improvement in the overall upkeep of these road stretches, reflecting the impact of corrective measures undertaken by the agency following the earlier inspection by CAQM. Simultaneously, inspection of 106 road stretches maintained by PWD revealed that 09 stretches exhibited High Visible Dust levels, 16 showed Moderate Dust, 37 recorded Low Dust intensity and 44 stretches were found to have No Visible Dust. On certain stretches observed with high dust intensity, accumulation of MSW and C&D waste, as well as instances of open burning, were also reported, indicating the need for strengthened on-ground enforcement and upkeep by the concerned agency. The Commission observed that while the re-inspection results of DDA-maintained road stretches indicates improvement and responsiveness to the directions issued earlier, the inspection of PWD-maintained road stretches highlight persisting gaps in effective road maintenance and dust control and require immediate and sustained corrective action. The Commission emphasized the need for regular mechanical sweeping, timely lifting and disposal of collected dust and waste, maintenance of road stretches and central verges, effective deployment of water sprinkling and dust-suppression mechanisms, and strict prevention of open burning across all stretches. The Commission reiterated that targeted inspection and re-inspection exercises under ‘Operation Clean Air’ will continue to be carried out actively to ensure strict adherence to its Statutory Directions for dust mitigation and prevention of open burning, with the objective of keeping road stretches across Delhi clean and dust-free. ***** VM/GS/SK (रिलीज़ आईडी: 2208550) आगंतुक पटल  : 180 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Environment, Forest and Climate Change CAQM conducts inspection of PWD roads and re-inspection of DDA road stretches on 24.12.2025 to assess dust mitigation measures Significant improvement observed on DDA stretches earlier reported with high visible dust, while PWD directed to further intensify on-ground interventions प्रविष्टि तिथि:\r\n                        25 DEC 2025 6:33PM by PIB Delhi The Commission for Air Quality Management in NCR and Adjoining Areas (CAQM) conducted an inspection drive on 24.12.2025 to assess compliance and effectiveness of corrective measures undertaken by concerned road-maintaining agencies following inspections carried out earlier on 12.12.2025. This was done as part of its continuous monitoring and ongoing enforcement efforts under the statutory framework and provisions of the extant Graded Response Action Plan (GRAP). The drive focused on assessment of accumulation of visible road dust and on-ground operations of Mechanical Road Sweeping Machines (MRSMs), along with identification of instances of Municipal Solid Waste (MSW) accumulation, Construction and Demolition (C&D) waste accumulation and cases of open burning. A total of 15 teams of the Delhi Pollution Control Committee (DPCC) for inspection of 106 road stretches maintained by the Public Works Department (PWD) and 02 teams of the Central Pollution Control Board (CPCB) for re-inspection of selected 27 road stretches under the jurisdiction of Delhi Development Authority (DDA) were deployed under the directions of the Commission. Geo-tagged and time-stamped photographic documentation was collected and submitted to the Commission as part of the consolidated inspection report. During the re-inspection of 27 road stretches maintained by DDA, which were earlier reported with high visible dust levels during inspections conducted on 12.12.2025, it was observed that now none of the i.e. 0 stretches fell under the High Dust category on 24.12.2025. Out of these stretches, 07 found with Moderate Dust levels, 19 recorded Low Dust intensity and 01 stretch was found to have No Visible Dust. This indicates a marked improvement in the overall upkeep of these road stretches, reflecting the impact of corrective measures undertaken by the agency following the earlier inspection by CAQM. Simultaneously, inspection of 106 road stretches maintained by PWD revealed that 09 stretches exhibited High Visible Dust levels, 16 showed Moderate Dust, 37 recorded Low Dust intensity and 44 stretches were found to have No Visible Dust. On certain stretches observed with high dust intensity, accumulation of MSW and C&D waste, as well as instances of open burning, were also reported, indicating the need for strengthened on-ground enforcement and upkeep by the concerned agency. The Commission observed that while the re-inspection results of DDA-maintained road stretches indicates improvement and responsiveness to the directions issued earlier, the inspection of PWD-maintained road stretches highlight persisting gaps in effective road maintenance and dust control and require immediate and sustained corrective action. The Commission emphasized the need for regular mechanical sweeping, timely lifting and disposal of collected dust and waste, maintenance of road stretches and central verges, effective deployment of water sprinkling and dust-suppression mechanisms, and strict prevention of open burning across all stretches. The Commission reiterated that targeted inspection and re-inspection exercises under ‘Operation Clean Air’ will continue to be carried out actively to ensure strict adherence to its Statutory Directions for dust mitigation and prevention of open burning, with the objective of keeping road stretches across Delhi clean and dust-free. ***** VM/GS/SK (रिलीज़ आईडी: 2208550)",
    "scraped_at": "2025-12-25T17:40:02.465195"
  },
  {
    "id": "2208571",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister and Minister of Cooperation Shri Amit Shah addresses Krishak Sammelan in Rewa, Madhya Pradesh",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208571",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah addresses Krishak Sammelan in Rewa, Madhya Pradesh Basavan Mama Govansh Van Vihar is a successful experiment in empowering small and marginal farmers through natural farming Natural farming will increase farmers' income, conserve water and protect consumers from various diseases Ministry of Cooperation has created two large cooperatives to certify, test, pack, market and export the organic produce The model farm in Rewa region will not only guide millions of farmers but will also play a pioneering role in promoting natural farming Let everyone pledge to serve nature and plant at least five peepal trees, which provide the most oxygen Today, 40 lakh farmers across the country have adopted natural farming and their yield is increasing In the coming days, more than 400 laboratories across the country will certify the farmers' fields and produce for being natural, which will increase their income by one and a half times Leaders like Atal Ji are rare, whose words and life are both complementary to each other Atal ji gave great importance to integrity and transparency not only in our party but in the public life of the entire country प्रविष्टि तिथि:\r\n                25 DEC 2025 7:15PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah addresses Krishak Sammelan in Rewa, Madhya Pradesh, today. Chief Minister of Madhya Pradesh, Dr. Mohan Yadav and several other dignitaries were present on the occasion. Union Home Minister and Minister of Cooperation, Shri Amit Shah said that Basavan Mama Govansh Van Vihar is a successful experiment in empowering small and marginal farmers through natural farming. He said that the model farm in Rewa region will not only guide millions of farmers but will also play a pioneering role in promoting natural farming. He said that we have forgotten the traditional practice of natural farming today. He said that natural farming is a method that utilizes cow dung and urine to create a system that not only maintains farmers' income but also produces pure and healthy crops. He said that with just one Indian breed cow, natural farming is being done on 21 acres of land without the use of fertilizers and pesticides. Shri Shah said that natural farming will increase farmers' income, conserve water and protect consumers from various diseases. He said that today, 40 lakh farmers in the country have adopted natural farming and their yield is increasing. Shri Amit Shah said that through the Ministry of Cooperation, set up by Prime Minister Shri Narendra Modi, two large cooperatives have been set up to certify natural farming products. These cooperatives will take care of the certification of organic produce, testing in the world's most advanced laboratories, packaging, marketing and export. He said that in the coming days, more than 400 laboratories across the country will provide farmers with certificates of both their farms and produce, being natural, which will increase their income by one and a half times. Shri Shah said that there is a huge market for organic products worldwide. He said that today the whole world believes that consumption of organic food is good for health. He said that to ensure that our farmers' organic products reach markets around the world effectively, we need a system for certification, scientific testing, attractive packaging and marketing and we are making efforts to increase farmers' income through all these means. He said that everyone should take a pledge to serve nature and plant at least five peepal trees, which provide the most oxygen. Union Home Minister and Minister of Cooperation said that the Rewa region of Madhya Pradesh is gradually developing into a prosperous area. He said that today, Asia's largest solar plant is located in Rewa and excellent four-lane roads have been developed connecting Rewa to Prayagraj or Jabalpur. Shri Amit Shah said that today is the birth anniversary of former Prime Minister Shri Atal Bihari Vajpayee and Rewa was one of his favorite places. Shri Shah said that Atal Ji gave great importance to integrity and transparency not only in his party but also in the public life of the entire country. He said that Atal Ji belongs to the category of leaders who delivered on their promises. Shri Shah said that Leaders like Atal Ji are rare, whose words and life are both complementary to each other. ***** RK / RR (रिलीज़ आईडी: 2208571) आगंतुक पटल  : 164 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Gujarati Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah addresses Krishak Sammelan in Rewa, Madhya Pradesh Basavan Mama Govansh Van Vihar is a successful experiment in empowering small and marginal farmers through natural farming Natural farming will increase farmers' income, conserve water and protect consumers from various diseases Ministry of Cooperation has created two large cooperatives to certify, test, pack, market and export the organic produce The model farm in Rewa region will not only guide millions of farmers but will also play a pioneering role in promoting natural farming Let everyone pledge to serve nature and plant at least five peepal trees, which provide the most oxygen Today, 40 lakh farmers across the country have adopted natural farming and their yield is increasing In the coming days, more than 400 laboratories across the country will certify the farmers' fields and produce for being natural, which will increase their income by one and a half times Leaders like Atal Ji are rare, whose words and life are both complementary to each other Atal ji gave great importance to integrity and transparency not only in our party but in the public life of the entire country प्रविष्टि तिथि:\r\n                        25 DEC 2025 7:15PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah addresses Krishak Sammelan in Rewa, Madhya Pradesh, today. Chief Minister of Madhya Pradesh, Dr. Mohan Yadav and several other dignitaries were present on the occasion. Union Home Minister and Minister of Cooperation, Shri Amit Shah said that Basavan Mama Govansh Van Vihar is a successful experiment in empowering small and marginal farmers through natural farming. He said that the model farm in Rewa region will not only guide millions of farmers but will also play a pioneering role in promoting natural farming. He said that we have forgotten the traditional practice of natural farming today. He said that natural farming is a method that utilizes cow dung and urine to create a system that not only maintains farmers' income but also produces pure and healthy crops. He said that with just one Indian breed cow, natural farming is being done on 21 acres of land without the use of fertilizers and pesticides. Shri Shah said that natural farming will increase farmers' income, conserve water and protect consumers from various diseases. He said that today, 40 lakh farmers in the country have adopted natural farming and their yield is increasing. Shri Amit Shah said that through the Ministry of Cooperation, set up by Prime Minister Shri Narendra Modi, two large cooperatives have been set up to certify natural farming products. These cooperatives will take care of the certification of organic produce, testing in the world's most advanced laboratories, packaging, marketing and export. He said that in the coming days, more than 400 laboratories across the country will provide farmers with certificates of both their farms and produce, being natural, which will increase their income by one and a half times. Shri Shah said that there is a huge market for organic products worldwide. He said that today the whole world believes that consumption of organic food is good for health. He said that to ensure that our farmers' organic products reach markets around the world effectively, we need a system for certification, scientific testing, attractive packaging and marketing and we are making efforts to increase farmers' income through all these means. He said that everyone should take a pledge to serve nature and plant at least five peepal trees, which provide the most oxygen. Union Home Minister and Minister of Cooperation said that the Rewa region of Madhya Pradesh is gradually developing into a prosperous area. He said that today, Asia's largest solar plant is located in Rewa and excellent four-lane roads have been developed connecting Rewa to Prayagraj or Jabalpur. Shri Amit Shah said that today is the birth anniversary of former Prime Minister Shri Atal Bihari Vajpayee and Rewa was one of his favorite places. Shri Shah said that Atal Ji gave great importance to integrity and transparency not only in his party but also in the public life of the entire country. He said that Atal Ji belongs to the category of leaders who delivered on their promises. Shri Shah said that Leaders like Atal Ji are rare, whose words and life are both complementary to each other. ***** RK / RR (रिलीज़ आईडी: 2208571)",
    "scraped_at": "2025-12-25T17:40:04.585468"
  },
  {
    "id": "2208547",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister and Minister of Cooperation Shri Amit Shah addresses Abhyudaya Madhya Pradesh Growth Summit in Gwalior",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208547",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah addresses Abhyudaya Madhya Pradesh Growth Summit in Gwalior I pay my respects to the revered Atal ji on his birth anniversary—the great orator, sensitive poet, leader dedicated to public welfare, and the one who laid the foundation for modern India's infrastructure development Under Modi ji's leadership, the tradition of structured industrial summits was started for the development of the states In the same direction, for the balanced development of the state, Mohan Yadav ji has initiated the tradition of regional investment summits In the times to come, such regional investment summits will prove to be very important for the balanced development of states Through the PM MITRA Park, cotton has once again become a profitable crop for the farmers of Madhya Pradesh It is the our party that has truly put Madhya Pradesh on the path of development Leaders of opposition party turned Madhya Pradesh into a BIMARU state; Shivraj Singh ji removed that tag, and now Mohan Yadav ji is taking the state forward with new energy PM MITRA Park is based on the 5F vision: Farm to Fibre, Fibre to Factory, Factory to Fashion, and Fashion to Foreign, which is ensuring fair prices for farmers Today, nearly 50% of startups in Madhya Pradesh are being run by women, which is a shining example of women's empowerment With the establishment of 4 lakh 57 thousand new MSME units in just one year, Madhya Pradesh is emerging as a new hub for MSMEs India has also made an explosive entry into the semiconductor industry; in this sector, India will become self-reliant and will also begin exporting In the fields of mobile manufacturing, defence manufacturing, and modern infrastructure, Modi ji has placed India in the front ranks of the world Atal ji not only preserved the country's cultural heritage but also dedicated his entire life to awakening the 'self' of the nation and advancing the journey from Swaraj to Susashan Achieving victory in the Kargil war by driving out every single infiltrator is a testament to Atal ji's resolute and determined leadership प्रविष्टि तिथि:\r\n                25 DEC 2025 6:22PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah today addressed the Abhyudaya Madhya Pradesh Growth Summit in Gwalior as the chief guest. On this occasion, Madhya Pradesh Chief Minister Dr. Mohan Yadav, Union Minister for Communications Shri Jyotiraditya Scindia, and several other dignitaries were present. Union Home Minister Shri Amit Shah said that the beginning of structured industrial conclaves in the country started from Gujarat, when Shri Narendra Modi ji was the Chief Minister of the state. He said that Modi ji scientifically initiated the organization of the industrial summit named Vibrant Gujarat, which was highly successful and also brought investments to Gujarat.Madhya Pradesh Chief Minister Dr. Mohan Yadav has initiated regional investment conclaves for the balanced development of the state. He said that investment-related activities have now begun in all regions of Madhya Pradesh, which will prove beneficial for other states as well. Shri Shah said that the investment of ₹2 lakh crore happening today may seem small at first glance, but for any one region, it is a very significant achievement. For the people of that region, this investment is extremely important. If there is no balanced development in the state, the state cannot progress, because immense possibilities are hidden in every region. He said that cotton has been a very old produce of the farmers in the Malwa and Chambal regions, but due to not getting proper prices, cotton cultivation has greatly reduced. Now, through the PM MITRA Park, cotton has once again become a profitable crop. Shri Amit Shah said that the biggest specialty of Madhya Pradesh is its geographical location. Half of India can be supplied from here at very low transportation costs, but itsoptimum utilization can happen only when industries are established symmetrically in Madhya Pradesh. Industries should be set up in districts bordering southern states, in areas adjacent to Delhi such as Gwalior, and also in regions bordering the west such as Dhar and Jhabua—only then will the benefit of the geographical location be fully realized. He said that Madhya Pradesh's regional investment summits have laid the foundation for the all-round development of the state. Union Home Minister Shri Amit Shah said that in Gwalior, the inauguration and foundation stone laying of 14 development works pertaining to Gwalior took place. Leaders of the opposition party turned Madhya Pradesh into a BIMARU state; Shivraj Singh ji removed that tag, and now Mohan Yadav ji is taking the state forward with new energy. As a result, Madhya Pradesh will definitely become a developed state. He said that excellent highways have been built in Madhya Pradesh, efforts have been made to supply water from Narmadariver to as many areas as possible, the irrigated area has increased by 17 percent, and by surpassing Punjab and Haryana, Madhya Pradesh has successfully won the 'Krishi Karman' Award consecutively seven times. He said that it is our party that has truly put Madhya Pradesh on the path of development. Shri Amit Shah said that to completely capitalize on Madhya Pradesh’s geographical location, a Multi-Modal Logistics Park is being developed in Indore, which is attracting companies engaged in production from across the country to set up their warehouses or hubs there. He said that at one time Madhya Pradesh was considered a negative state in the power sector, but today Madhya Pradesh has surplus electricity. In the field of cleanliness as well, Madhya Pradesh has left other states behind. Madhya Pradesh has the lowest operational cost for metro services among the states. The state has also performed well in the startup sector. Industries and startups have been established in every sector, including agriculture, food processing, minerals, mineral-based industries, renewable energy, logistics, textiles, pharmaceuticals, IT, and tourism. Approximately 50 percent of these startups are being run by women, which is an excellent example of women empowerment. He said that Madhya Pradesh has set a record by establishing 4 lakh 57 thousand new MSME units in just one year. As a result, in the matter of medium, small, and cottage industries, Madhya Pradesh is on its way to becoming a hub for the entire country, and through startups and innovation, it is poised to reach new heights. Shri Amit Shah said that the PM MITRA Park has been built on the 5F vision, which also works to ensure farmers receive fair prices for their produce. It includes Farm to Fibre, Fibre to Factory, Factory to Fashion, and Fashion to Foreign—meaning the PM MITRA Park has arrangements right up to export. He said that the largest PM MITRA Park is in Madhya Pradesh, which will benefit the farmers. Shri Shah said that the textile and tourism industries are the sectors that generate the most employment, and infrastructure suitable for both these sectors is being developed in Madhya Pradesh. He said that Madhya Pradesh has also performed very well in Ease of Doing Business. Union Home Minister and Minister of Cooperation Shri Amit Shah said that under the leadership of PM Modi, foundations are being laid in many new sectors, which will give the country the opportunity to become a global leader in these new areas in the coming days. He said that our foreign exchange reserves have crossed the record level of 700 billion dollars. We have made a late but impactful entry into the semi-conductor industry, and very soon we will not only become self-reliant in this sector but will also begin its exports. He said that through Digital India, we have achieved the fastest growth in the shortest time. He said that when Modi ji became Prime Minister, the number of internet users in the country was only 7 crore, which increased to 101 crore in September 2025. Now the number of broadband users has also reached approximately 99 crore. 4G connectivity is available in 95 percent parts of the country, and preparations are underway to provide 5G connectivity in 99 percent of the area. He said that through UPI, we have taken a giant leap in the field of digital transactions and FinTech. In the year 2024-25, nearly 50 percent of global digital transactions took place in India. In August 2025, by conducting 2000 crore digital transactions worth about Rs. 25 lakh crore, we have left the world behind. During the fight against Covid-19, a very large infrastructure was built for vaccine manufacturing and R&D. Today, 60 percent of the world's vaccines are manufactured in India. We have performed well in the manufacturing sector; India is today the world's second-largest mobile phone producer. Defence exports and defence manufacturing have also been restructured. In Ease of Doing Business, India was ranked 142nd in 2014; today it stands at 63rd position.The Insolvency and Bankruptcy Code has created a structured economic system. Union Home Minister and Minister of Cooperation Shri Amit Shah said that under the leadership of PM Modi, efforts have been made to make India first in the world in the field of infrastructure. During the previous government, there were 90 thousand kilometers of highways; now, 1.5 lakh kilometers of new highways have been built. Four-lane highways were previously 18,000 kilometers, now they have become 46,000 kilometers. Rural roads were previously 3 lakh 81 thousand kilometers, now they have become 7 lakh 84 thousand kilometers. Earlier, there were 74 airports; now their number is 163. Previously, there was not a single Vande Bharat train; now 164 Vande Bharat trains are being built, and the manufacturing of Vande Bharat train parts has also begun in Madhya Pradesh. Earlier, there was not a single Amrit Bharat station; now 1,337 have been built. Railway electrification was only 22 thousand kilometers; now it is 68 thousand kilometers. Metro-connected cities were previously five; now their number is 23. Earlier, optical fiber was available in only 100 gram panchayats; now it has reached 2 lakh 14 thousand panchayats. Union Home Minister and Minister of Cooperation told the youth of Madhya Pradesh and the industrialists who have come to invest in the state that the geographical location of Madhya Pradesh is so attractive that crops can be grown by sowing seeds anywhere, but the land of Madhya Pradesh is so fertile that by sowing rupees here, one can earn crores. He said that when the state develops with regional balance, the greatest benefit goes to the people of the state and the industrial sector, because industries based on regional specialties are sustainable and, hence, successful. On the 101st birth anniversary of former Prime Minister Atal Bihari Vajpayee, paying tribute to him, Union Home Minister Shri Amit Shah said that today the entire country is celebrating the birth anniversary of a great man of the era, a visionary, and the one who laid the foundation of modern India's infrastructure—Atal ji. Shri Shah said that he is fortunate that today he is standing on the land where Atal ji spent his early life. Home Minister said that he is present on the very land whose soil shaped the young Atal into Atal Bihari. Atal ji not only helped this country preserve its cultural heritage but also dedicated his entire life to awakening the 'self' of the nation and advancing the journey from Swaraj (self-rule) to Susashan (good governance). Shri Amit Shah said that when English dominated everything, Atal ji delivered a speech in Hindi at the United Nations, thereby winning the hearts of every Indian. Shri Shah said that the entire state of Madhya Pradesh is filled with tribal areas. Before Atal ji became Prime Minister, there was no separate department for tribals at the Centre, but during his tenure, the Government of India established the Ministry of Tribal Affairs, marking the beginning of a new journey for tribal welfare. When Atal ji became Prime Minister, investment in the country's infrastructure was not considered a means to win elections. He said that Atal ji put an end to the outdated mindset that \"elections are not won through investments in infrastructure,\" and implemented the Golden Quadrilateral project. Under this scheme, six major highways connecting the country from all directions were constructed, paving the way for India to advance on the path of robust infrastructure. Union Home Minister and Minister of Cooperation said that it was Atal ji who established before the entire world the principle that a nation can become a nuclear power even for the sake of peace. Despite opposition from around the world, he made India a nuclear-armed nation.The Home Minister said that when infiltrators entered during the Kargil conflict, there was immense pressure from the international community for India to go to global forums and negotiate with Pakistan. However, Atal ji firmly declared that we had already made efforts for peace, we had been deceived, and now there could be no talks with Pakistan until every single infiltrator was driven out of Indian territory. He said that the victory in Kargil is a testament to Atal ji’s resolute and determined leadership. Shri Shah said that Atal ji was a great orator, a sensitive poet, and a leader dedicated to the welfare of the people. He was regarded throughout his life as an “Ajatashatru” (one without enemies), and in the world of politics, to live and die without making enemies is a very great achievement. Even Atal ji’s opponents never spoke ill of him. Union Home Minister and Minister of Cooperation said that today is also the birth anniversary of Mahamana Pandit Madan Mohan Malaviya ji. He said that Pandit Malaviya ji, from the establishment of Banaras Hindu University to his role as a close associate of Gandhiji, and later through the creation of the Hindu Mahasabha, fearlessly propagated Hindu thought—which is the foundational idea of this country—across the nation without any hesitation. In later years, the same Banaras Hindu University produced many leaders for the country who advanced this very thought. The Home Minister said that today is also the death anniversary of Bharat Ratna C. Rajagopalachari. He paid tribute to C. Rajagopalachari as well. **** RK/PR/SS (रिलीज़ आईडी: 2208547) आगंतुक पटल  : 233 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah addresses Abhyudaya Madhya Pradesh Growth Summit in Gwalior I pay my respects to the revered Atal ji on his birth anniversary—the great orator, sensitive poet, leader dedicated to public welfare, and the one who laid the foundation for modern India's infrastructure development Under Modi ji's leadership, the tradition of structured industrial summits was started for the development of the states In the same direction, for the balanced development of the state, Mohan Yadav ji has initiated the tradition of regional investment summits In the times to come, such regional investment summits will prove to be very important for the balanced development of states Through the PM MITRA Park, cotton has once again become a profitable crop for the farmers of Madhya Pradesh It is the our party that has truly put Madhya Pradesh on the path of development Leaders of opposition party turned Madhya Pradesh into a BIMARU state; Shivraj Singh ji removed that tag, and now Mohan Yadav ji is taking the state forward with new energy PM MITRA Park is based on the 5F vision: Farm to Fibre, Fibre to Factory, Factory to Fashion, and Fashion to Foreign, which is ensuring fair prices for farmers Today, nearly 50% of startups in Madhya Pradesh are being run by women, which is a shining example of women's empowerment With the establishment of 4 lakh 57 thousand new MSME units in just one year, Madhya Pradesh is emerging as a new hub for MSMEs India has also made an explosive entry into the semiconductor industry; in this sector, India will become self-reliant and will also begin exporting In the fields of mobile manufacturing, defence manufacturing, and modern infrastructure, Modi ji has placed India in the front ranks of the world Atal ji not only preserved the country's cultural heritage but also dedicated his entire life to awakening the 'self' of the nation and advancing the journey from Swaraj to Susashan Achieving victory in the Kargil war by driving out every single infiltrator is a testament to Atal ji's resolute and determined leadership प्रविष्टि तिथि:\r\n                        25 DEC 2025 6:22PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah today addressed the Abhyudaya Madhya Pradesh Growth Summit in Gwalior as the chief guest. On this occasion, Madhya Pradesh Chief Minister Dr. Mohan Yadav, Union Minister for Communications Shri Jyotiraditya Scindia, and several other dignitaries were present. Union Home Minister Shri Amit Shah said that the beginning of structured industrial conclaves in the country started from Gujarat, when Shri Narendra Modi ji was the Chief Minister of the state. He said that Modi ji scientifically initiated the organization of the industrial summit named Vibrant Gujarat, which was highly successful and also brought investments to Gujarat.Madhya Pradesh Chief Minister Dr. Mohan Yadav has initiated regional investment conclaves for the balanced development of the state. He said that investment-related activities have now begun in all regions of Madhya Pradesh, which will prove beneficial for other states as well. Shri Shah said that the investment of ₹2 lakh crore happening today may seem small at first glance, but for any one region, it is a very significant achievement. For the people of that region, this investment is extremely important. If there is no balanced development in the state, the state cannot progress, because immense possibilities are hidden in every region. He said that cotton has been a very old produce of the farmers in the Malwa and Chambal regions, but due to not getting proper prices, cotton cultivation has greatly reduced. Now, through the PM MITRA Park, cotton has once again become a profitable crop. Shri Amit Shah said that the biggest specialty of Madhya Pradesh is its geographical location. Half of India can be supplied from here at very low transportation costs, but itsoptimum utilization can happen only when industries are established symmetrically in Madhya Pradesh. Industries should be set up in districts bordering southern states, in areas adjacent to Delhi such as Gwalior, and also in regions bordering the west such as Dhar and Jhabua—only then will the benefit of the geographical location be fully realized. He said that Madhya Pradesh's regional investment summits have laid the foundation for the all-round development of the state. Union Home Minister Shri Amit Shah said that in Gwalior, the inauguration and foundation stone laying of 14 development works pertaining to Gwalior took place. Leaders of the opposition party turned Madhya Pradesh into a BIMARU state; Shivraj Singh ji removed that tag, and now Mohan Yadav ji is taking the state forward with new energy. As a result, Madhya Pradesh will definitely become a developed state. He said that excellent highways have been built in Madhya Pradesh, efforts have been made to supply water from Narmadariver to as many areas as possible, the irrigated area has increased by 17 percent, and by surpassing Punjab and Haryana, Madhya Pradesh has successfully won the 'Krishi Karman' Award consecutively seven times. He said that it is our party that has truly put Madhya Pradesh on the path of development. Shri Amit Shah said that to completely capitalize on Madhya Pradesh’s geographical location, a Multi-Modal Logistics Park is being developed in Indore, which is attracting companies engaged in production from across the country to set up their warehouses or hubs there. He said that at one time Madhya Pradesh was considered a negative state in the power sector, but today Madhya Pradesh has surplus electricity. In the field of cleanliness as well, Madhya Pradesh has left other states behind. Madhya Pradesh has the lowest operational cost for metro services among the states. The state has also performed well in the startup sector. Industries and startups have been established in every sector, including agriculture, food processing, minerals, mineral-based industries, renewable energy, logistics, textiles, pharmaceuticals, IT, and tourism. Approximately 50 percent of these startups are being run by women, which is an excellent example of women empowerment. He said that Madhya Pradesh has set a record by establishing 4 lakh 57 thousand new MSME units in just one year. As a result, in the matter of medium, small, and cottage industries, Madhya Pradesh is on its way to becoming a hub for the entire country, and through startups and innovation, it is poised to reach new heights. Shri Amit Shah said that the PM MITRA Park has been built on the 5F vision, which also works to ensure farmers receive fair prices for their produce. It includes Farm to Fibre, Fibre to Factory, Factory to Fashion, and Fashion to Foreign—meaning the PM MITRA Park has arrangements right up to export. He said that the largest PM MITRA Park is in Madhya Pradesh, which will benefit the farmers. Shri Shah said that the textile and tourism industries are the sectors that generate the most employment, and infrastructure suitable for both these sectors is being developed in Madhya Pradesh. He said that Madhya Pradesh has also performed very well in Ease of Doing Business. Union Home Minister and Minister of Cooperation Shri Amit Shah said that under the leadership of PM Modi, foundations are being laid in many new sectors, which will give the country the opportunity to become a global leader in these new areas in the coming days. He said that our foreign exchange reserves have crossed the record level of 700 billion dollars. We have made a late but impactful entry into the semi-conductor industry, and very soon we will not only become self-reliant in this sector but will also begin its exports. He said that through Digital India, we have achieved the fastest growth in the shortest time. He said that when Modi ji became Prime Minister, the number of internet users in the country was only 7 crore, which increased to 101 crore in September 2025. Now the number of broadband users has also reached approximately 99 crore. 4G connectivity is available in 95 percent parts of the country, and preparations are underway to provide 5G connectivity in 99 percent of the area. He said that through UPI, we have taken a giant leap in the field of digital transactions and FinTech. In the year 2024-25, nearly 50 percent of global digital transactions took place in India. In August 2025, by conducting 2000 crore digital transactions worth about Rs. 25 lakh crore, we have left the world behind. During the fight against Covid-19, a very large infrastructure was built for vaccine manufacturing and R&D. Today, 60 percent of the world's vaccines are manufactured in India. We have performed well in the manufacturing sector; India is today the world's second-largest mobile phone producer. Defence exports and defence manufacturing have also been restructured. In Ease of Doing Business, India was ranked 142nd in 2014; today it stands at 63rd position.The Insolvency and Bankruptcy Code has created a structured economic system. Union Home Minister and Minister of Cooperation Shri Amit Shah said that under the leadership of PM Modi, efforts have been made to make India first in the world in the field of infrastructure. During the previous government, there were 90 thousand kilometers of highways; now, 1.5 lakh kilometers of new highways have been built. Four-lane highways were previously 18,000 kilometers, now they have become 46,000 kilometers. Rural roads were previously 3 lakh 81 thousand kilometers, now they have become 7 lakh 84 thousand kilometers. Earlier, there were 74 airports; now their number is 163. Previously, there was not a single Vande Bharat train; now 164 Vande Bharat trains are being built, and the manufacturing of Vande Bharat train parts has also begun in Madhya Pradesh. Earlier, there was not a single Amrit Bharat station; now 1,337 have been built. Railway electrification was only 22 thousand kilometers; now it is 68 thousand kilometers. Metro-connected cities were previously five; now their number is 23. Earlier, optical fiber was available in only 100 gram panchayats; now it has reached 2 lakh 14 thousand panchayats. Union Home Minister and Minister of Cooperation told the youth of Madhya Pradesh and the industrialists who have come to invest in the state that the geographical location of Madhya Pradesh is so attractive that crops can be grown by sowing seeds anywhere, but the land of Madhya Pradesh is so fertile that by sowing rupees here, one can earn crores. He said that when the state develops with regional balance, the greatest benefit goes to the people of the state and the industrial sector, because industries based on regional specialties are sustainable and, hence, successful. On the 101st birth anniversary of former Prime Minister Atal Bihari Vajpayee, paying tribute to him, Union Home Minister Shri Amit Shah said that today the entire country is celebrating the birth anniversary of a great man of the era, a visionary, and the one who laid the foundation of modern India's infrastructure—Atal ji. Shri Shah said that he is fortunate that today he is standing on the land where Atal ji spent his early life. Home Minister said that he is present on the very land whose soil shaped the young Atal into Atal Bihari. Atal ji not only helped this country preserve its cultural heritage but also dedicated his entire life to awakening the 'self' of the nation and advancing the journey from Swaraj (self-rule) to Susashan (good governance). Shri Amit Shah said that when English dominated everything, Atal ji delivered a speech in Hindi at the United Nations, thereby winning the hearts of every Indian. Shri Shah said that the entire state of Madhya Pradesh is filled with tribal areas. Before Atal ji became Prime Minister, there was no separate department for tribals at the Centre, but during his tenure, the Government of India established the Ministry of Tribal Affairs, marking the beginning of a new journey for tribal welfare. When Atal ji became Prime Minister, investment in the country's infrastructure was not considered a means to win elections. He said that Atal ji put an end to the outdated mindset that \"elections are not won through investments in infrastructure,\" and implemented the Golden Quadrilateral project. Under this scheme, six major highways connecting the country from all directions were constructed, paving the way for India to advance on the path of robust infrastructure. Union Home Minister and Minister of Cooperation said that it was Atal ji who established before the entire world the principle that a nation can become a nuclear power even for the sake of peace. Despite opposition from around the world, he made India a nuclear-armed nation.The Home Minister said that when infiltrators entered during the Kargil conflict, there was immense pressure from the international community for India to go to global forums and negotiate with Pakistan. However, Atal ji firmly declared that we had already made efforts for peace, we had been deceived, and now there could be no talks with Pakistan until every single infiltrator was driven out of Indian territory. He said that the victory in Kargil is a testament to Atal ji’s resolute and determined leadership. Shri Shah said that Atal ji was a great orator, a sensitive poet, and a leader dedicated to the welfare of the people. He was regarded throughout his life as an “Ajatashatru” (one without enemies), and in the world of politics, to live and die without making enemies is a very great achievement. Even Atal ji’s opponents never spoke ill of him. Union Home Minister and Minister of Cooperation said that today is also the birth anniversary of Mahamana Pandit Madan Mohan Malaviya ji. He said that Pandit Malaviya ji, from the establishment of Banaras Hindu University to his role as a close associate of Gandhiji, and later through the creation of the Hindu Mahasabha, fearlessly propagated Hindu thought—which is the foundational idea of this country—across the nation without any hesitation. In later years, the same Banaras Hindu University produced many leaders for the country who advanced this very thought. The Home Minister said that today is also the death anniversary of Bharat Ratna C. Rajagopalachari. He paid tribute to C. Rajagopalachari as well. **** RK/PR/SS (रिलीज़ आईडी: 2208547)",
    "scraped_at": "2025-12-25T17:40:07.598217"
  },
  {
    "id": "2208525",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister and Minister of Cooperation, Shri Amit Shah to inaugurate ‘Anti-Terror Conference’ on Friday in New Delhi",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208525",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister and Minister of Cooperation, Shri Amit Shah to inaugurate ‘Anti-Terror Conference’ on Friday in New Delhi Shaped under PM Shri Narendra Modi Ji's vision of zero tolerance for terror, the annual conference has become a platform for brainstorming India's next-generation strategies to counter emerging threats The conference is a meeting point for operational forces; technical, legal and forensic experts and agencies engaged in counter terrorism Key focus of the conference is on developing synergies among various stake holders for coordinated action against the menace of terrorism in the spirit of ‘Whole of the Government approach’ and to present substantive inputs for future policy formulation Deliberations and discussions in the two-day conference aim to share experiences and good practices across law enforcement agencies in addressing counter-terrorism (CT) issues and lessons from terror investigations प्रविष्टि तिथि:\r\n                25 DEC 2025 5:08PM by PIB Delhi Union Home Minister and Minister of Cooperation, Shri Amit Shah will inaugurate ‘Anti-Terror Conference’ on Friday, 26 th December 2025 in New Delhi. The two-day conference is being organized by the National Investigation Agency, Ministry of Home Affairs, Government of India. Shaped under PM Shri Narendra Modi's vision of zero tolerance for terror, the annual conference has become a platform for brainstorming India's next-generation strategies to counter emerging threats. The conference is a meeting point for operational forces; technical, legal, and forensic experts; and agencies engaged in counter terrorism for deliberations on issues impacting national security and threats emerging out of terrorism. The key focus of the conference is on developing synergies among various stake holders by establishing formal and informal channels for coordinated action against the menace of terrorism in the spirit of ‘Whole of the Government approach’ and to present substantive inputs for future policy formulation. The deliberations and discussions in the two-day conference aim to share experiences and good practices across law enforcement agencies in addressing counter-terrorism (CT) issues and lessons from terror investigations . The conference includes sessions on collecting evidence from foreign jurisdictions, digital forensics and data analysis in CT investigations, effective trial management, addressing radicalisation, espionage, and emerging hybrid threats to national security, among other topics related to terrorism. Additionally, sessions on disrupting terror financing networks—tools, techniques, and case learnings—as well as creating future-ready CT strategies and building institutional capacities to address emerging national security issues have been incorporated. The conference is being attended by senior police officers from States/UTs, officers from Central agencies/Departments dealing with issues related to Counter Terrorism and experts from related fields such as law, forensics, technology etc. ***** RK/RR/PR/SS (रिलीज़ आईडी: 2208525) आगंतुक पटल  : 404 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati Ministry of Home Affairs Union Home Minister and Minister of Cooperation, Shri Amit Shah to inaugurate ‘Anti-Terror Conference’ on Friday in New Delhi Shaped under PM Shri Narendra Modi Ji's vision of zero tolerance for terror, the annual conference has become a platform for brainstorming India's next-generation strategies to counter emerging threats The conference is a meeting point for operational forces; technical, legal and forensic experts and agencies engaged in counter terrorism Key focus of the conference is on developing synergies among various stake holders for coordinated action against the menace of terrorism in the spirit of ‘Whole of the Government approach’ and to present substantive inputs for future policy formulation Deliberations and discussions in the two-day conference aim to share experiences and good practices across law enforcement agencies in addressing counter-terrorism (CT) issues and lessons from terror investigations प्रविष्टि तिथि:\r\n                        25 DEC 2025 5:08PM by PIB Delhi Union Home Minister and Minister of Cooperation, Shri Amit Shah will inaugurate ‘Anti-Terror Conference’ on Friday, 26 th December 2025 in New Delhi. The two-day conference is being organized by the National Investigation Agency, Ministry of Home Affairs, Government of India. Shaped under PM Shri Narendra Modi's vision of zero tolerance for terror, the annual conference has become a platform for brainstorming India's next-generation strategies to counter emerging threats. The conference is a meeting point for operational forces; technical, legal, and forensic experts; and agencies engaged in counter terrorism for deliberations on issues impacting national security and threats emerging out of terrorism. The key focus of the conference is on developing synergies among various stake holders by establishing formal and informal channels for coordinated action against the menace of terrorism in the spirit of ‘Whole of the Government approach’ and to present substantive inputs for future policy formulation. The deliberations and discussions in the two-day conference aim to share experiences and good practices across law enforcement agencies in addressing counter-terrorism (CT) issues and lessons from terror investigations . The conference includes sessions on collecting evidence from foreign jurisdictions, digital forensics and data analysis in CT investigations, effective trial management, addressing radicalisation, espionage, and emerging hybrid threats to national security, among other topics related to terrorism. Additionally, sessions on disrupting terror financing networks—tools, techniques, and case learnings—as well as creating future-ready CT strategies and building institutional capacities to address emerging national security issues have been incorporated. The conference is being attended by senior police officers from States/UTs, officers from Central agencies/Departments dealing with issues related to Counter Terrorism and experts from related fields such as law, forensics, technology etc. ***** RK/RR/PR/SS (रिलीज़ आईडी: 2208525)",
    "scraped_at": "2025-12-25T17:40:09.225925"
  },
  {
    "id": "2208505",
    "ministry": "Ministry of Home Affairs",
    "title": "In a significant milestone towards Naxal-free Bharat, 6 Naxalites, including Central Committee Member Ganesh Uike, have been neutralized so far in a major operation in Kandhmal, Odisha",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208505",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs In a significant milestone towards Naxal-free Bharat, 6 Naxalites, including Central Committee Member Ganesh Uike, have been neutralized so far in a major operation in Kandhmal, Odisha With this major breakthrough, Odisha stands at the threshold of becoming completely free from Naxalism We are resolved to eliminate Naxalism before the 31st of March 2026. प्रविष्टि तिथि:\r\n                25 DEC 2025 4:35PM by PIB Delhi In a significant milestone towards Naxal-free Bharat, 6 Naxalites, including Central Committee Member Ganesh Uike, have been neutralized so far in a major operation in Kandhmal, Odisha. In a post on ‘X’, Home Minister’s Office said “A significant milestone towards Naxal-free Bharat. In a major operation in Kandhmal, Odisha, 6 Naxalites, including Central Committee Member Ganesh Uike, have been neutralized so far. With this major breakthrough, Odisha stands at the threshold of becoming completely free from Naxalism. We are resolved to eliminate Naxalism before the 31st of March 2026.” A significant milestone towards Naxal-free Bharat. In a major operation in Kandhmal, Odisha, 6 Naxalites, including Central Committee Member Ganesh Uike, have been neutralized so far. With this major breakthrough, Odisha stands at the threshold of becoming completely free from… — गृहमंत्री कार्यालय, HMO India (@HMOIndia) December 25, 2025 *** RK / RR (रिलीज़ आईडी: 2208505) आगंतुक पटल  : 314 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Gujarati , Odia , Tamil , Telugu , Malayalam Ministry of Home Affairs In a significant milestone towards Naxal-free Bharat, 6 Naxalites, including Central Committee Member Ganesh Uike, have been neutralized so far in a major operation in Kandhmal, Odisha With this major breakthrough, Odisha stands at the threshold of becoming completely free from Naxalism We are resolved to eliminate Naxalism before the 31st of March 2026. प्रविष्टि तिथि:\r\n                        25 DEC 2025 4:35PM by PIB Delhi In a significant milestone towards Naxal-free Bharat, 6 Naxalites, including Central Committee Member Ganesh Uike, have been neutralized so far in a major operation in Kandhmal, Odisha. In a post on ‘X’, Home Minister’s Office said “A significant milestone towards Naxal-free Bharat. In a major operation in Kandhmal, Odisha, 6 Naxalites, including Central Committee Member Ganesh Uike, have been neutralized so far. With this major breakthrough, Odisha stands at the threshold of becoming completely free from Naxalism. We are resolved to eliminate Naxalism before the 31st of March 2026.” A significant milestone towards Naxal-free Bharat. In a major operation in Kandhmal, Odisha, 6 Naxalites, including Central Committee Member Ganesh Uike, have been neutralized so far. With this major breakthrough, Odisha stands at the threshold of becoming completely free from… — गृहमंत्री कार्यालय, HMO India (@HMOIndia) December 25, 2025 *** RK / RR (रिलीज़ आईडी: 2208505)",
    "scraped_at": "2025-12-25T17:40:11.393578"
  },
  {
    "id": "2208542",
    "ministry": "Ministry of Information & Broadcasting",
    "title": "Vice President Releases Final Series of ‘The Collected Works of Madan Mohan Malaviya’ on the Birth Anniversary of Mahamana Malaviya",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208542",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Information & Broadcasting Vice President Releases Final Series of ‘The Collected Works of Madan Mohan Malaviya’ on the Birth Anniversary of Mahamana Malaviya 12-Volume Final Series Offers Unprecedented Insight into Mahamana Malaviya’s Life and Legacy प्रविष्टि तिथि:\r\n                25 DEC 2025 6:14PM by PIB Delhi Hon’ble Vice President of India, Shri C. P. Radhakrishnan, today released the final series of “The Collected Works of Madan Mohan Malaviya” (Volumes 12 to 23) at a ceremony held at Auditorium-1, Bharat Mandapam, New Delhi, on the birth anniversary of Bharat Ratna Pt. Madan Mohan Malaviya Ji. The event marked the completion of a major bilingual publication project jointly undertaken by the Mahamana Malaviya Mission and the Publications Division of the Ministry of Information and Broadcasting, Government of India. This final series of 12 volumes follows the first series of 11 volumes, which was released by the Hon’ble Prime Minister, Shri Narendra Modi on 25 th December 2023. The project involved researching and compiling original documents from across the country to preserve the legacy of one of the makers of modern India. This second series provides a comprehensive look into the multidimensional life of The Mahamana through approximately 3,500 pages of compiled documents. A major highlight of this collection is the inclusion of all 200 speeches delivered by him in the Central Legislative Assembly, showcasing his brilliance as a parliamentarian. The volumes also present a rare and significant historical record of interviews conducted by Mahamana with 135 industrialists from across the country in his capacity as a member of the Indian Industrial Commission. Furthermore, the collection includes all speeches delivered by him at the Second Round Table Conference and features rare material related to the Poona Pact, which is expected to provide new perspectives and potentially change the direction of research regarding this historic event. Mahamana Malaviya’s distinguished legal career is highlighted through a record of 170 cases argued before the Allahabad High Court, including his notable return to the court to secure justice for the accused in the Chauri-Chaura incident. The collection also explores his role as a flag-bearer of Dharma , documenting his participation in the Sanatana Dharma Mahasabha and his spiritual reflections through the Geeta Pravachan at Banaras Hindu University. The ceremony was attended by Shri Arjun Ram Meghwal, Hon’ble Minister of State (I/c) for Law & Justice and Minister of State for Parliamentary Affairs, and Shri Anurag Singh Thakur, Hon’ble Member of Parliament and Chairman of the Parliamentary Standing Committee on Coal, Mines & Steel, as Guests of Honour. Shri Ram Bahadur Rai, Padma Bhushan and President of the Indira Gandhi National Centre for the Arts (IGNCA), who led the team responsible for researching and compiling the original documents, was present on the occasion. Shri Bhupendra Kainthola, Principal Director General, Publications Division, was also present on the occasion. Summary of Mahamana Vangmay: Volumes 12–23 Volume 12: Political Speeches, Part 1 (1886–1908) This volume, totaling 298 pages, compiles the seminal speeches delivered by Pandit Madan Mohan Malaviya across various Indian National Congress sessions. Volume 13: Political Speeches, Part 2 (1909–1928) Consisting of 349 pages, this volume continues the collection of Malaviya Ji’s speeches at Congress sessions held across India from 1909 to 1916. Volume 14: Indian Industrial Conference and Commission, Part 1 (1905–1917) Spanning 296 pages, this volume features the impactful speeches delivered by Pandit Malaviya at the Indian Industrial Conferences held between 1905 and 1917 in locations such as Benares, Madras, and Lucknow. Volume 15: Indian Industrial Conference and Commission, Part 2 (1917–1918 ) This 284-page volume offers insights into Malaviya Ji’s advocacy for economic self-reliance through his famous call to \"Buy Indian Goods and Sell Indian Goods\" to patronize and promote domestic industries. Volume 16: Speeches in the Central Legislative Assembly, Part 1 (1924) Covering 274 pages, this volume documents Mahamana’s vigorous efforts toward attaining Self-Governing Dominion Status for India. Volume 17: Speeches in the Central Legislative Assembly, Part 2 (1924–1926) This 260-page collection covers significant legislative debates.  It notably contains a formal Note of Dissent authored by Pandit Malaviya. Volume 18: Speeches in the Central Legislative Assembly, Part 3 (1927–1928) Across 276 pages, this volume highlights Malaviya Ji’s focus on crucial financial and social legislation Volume 19: Speeches in the Central Legislative Assembly, Part 4 (1927–1928) This 280-page volume compiles various resolutions, including those regarding the circumstances surrounding Lala Lajpat Rai's death (1929), the Transfer of Property (Amendment) Bill (1929), and the establishment of military schools (1929). Volume 20: Second Indian Round Table Conference (1931) and The Poona Pact (1932) Comprising 187 pages, this volume records a watershed moment in Indian history. Volume 21: Advocate (1894–1923) This 238-page volume illustrates Pandit Malaviya’s distinguished legal career. Volume 22: Dharma-Karma, Part 1 (1891–1934) Consisting of 290 pages, this volume explores Mahamana’s role as a flag-bearer of Dharma. Volume 23: Dharma-Karma, Part 2 (1935–1946) The final 308-page volume focuses on his spiritual and social devotion. ***** Mahesh Kumar/ Vivek Vishwash (रिलीज़ आईडी: 2208542) आगंतुक पटल  : 202 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Marathi , Tamil Ministry of Information & Broadcasting Vice President Releases Final Series of ‘The Collected Works of Madan Mohan Malaviya’ on the Birth Anniversary of Mahamana Malaviya 12-Volume Final Series Offers Unprecedented Insight into Mahamana Malaviya’s Life and Legacy प्रविष्टि तिथि:\r\n                        25 DEC 2025 6:14PM by PIB Delhi Hon’ble Vice President of India, Shri C. P. Radhakrishnan, today released the final series of “The Collected Works of Madan Mohan Malaviya” (Volumes 12 to 23) at a ceremony held at Auditorium-1, Bharat Mandapam, New Delhi, on the birth anniversary of Bharat Ratna Pt. Madan Mohan Malaviya Ji. The event marked the completion of a major bilingual publication project jointly undertaken by the Mahamana Malaviya Mission and the Publications Division of the Ministry of Information and Broadcasting, Government of India. This final series of 12 volumes follows the first series of 11 volumes, which was released by the Hon’ble Prime Minister, Shri Narendra Modi on 25 th December 2023. The project involved researching and compiling original documents from across the country to preserve the legacy of one of the makers of modern India. This second series provides a comprehensive look into the multidimensional life of The Mahamana through approximately 3,500 pages of compiled documents. A major highlight of this collection is the inclusion of all 200 speeches delivered by him in the Central Legislative Assembly, showcasing his brilliance as a parliamentarian. The volumes also present a rare and significant historical record of interviews conducted by Mahamana with 135 industrialists from across the country in his capacity as a member of the Indian Industrial Commission. Furthermore, the collection includes all speeches delivered by him at the Second Round Table Conference and features rare material related to the Poona Pact, which is expected to provide new perspectives and potentially change the direction of research regarding this historic event. Mahamana Malaviya’s distinguished legal career is highlighted through a record of 170 cases argued before the Allahabad High Court, including his notable return to the court to secure justice for the accused in the Chauri-Chaura incident. The collection also explores his role as a flag-bearer of Dharma , documenting his participation in the Sanatana Dharma Mahasabha and his spiritual reflections through the Geeta Pravachan at Banaras Hindu University. The ceremony was attended by Shri Arjun Ram Meghwal, Hon’ble Minister of State (I/c) for Law & Justice and Minister of State for Parliamentary Affairs, and Shri Anurag Singh Thakur, Hon’ble Member of Parliament and Chairman of the Parliamentary Standing Committee on Coal, Mines & Steel, as Guests of Honour. Shri Ram Bahadur Rai, Padma Bhushan and President of the Indira Gandhi National Centre for the Arts (IGNCA), who led the team responsible for researching and compiling the original documents, was present on the occasion. Shri Bhupendra Kainthola, Principal Director General, Publications Division, was also present on the occasion. Summary of Mahamana Vangmay: Volumes 12–23 Volume 12: Political Speeches, Part 1 (1886–1908) This volume, totaling 298 pages, compiles the seminal speeches delivered by Pandit Madan Mohan Malaviya across various Indian National Congress sessions. Volume 13: Political Speeches, Part 2 (1909–1928) Consisting of 349 pages, this volume continues the collection of Malaviya Ji’s speeches at Congress sessions held across India from 1909 to 1916. Volume 14: Indian Industrial Conference and Commission, Part 1 (1905–1917) Spanning 296 pages, this volume features the impactful speeches delivered by Pandit Malaviya at the Indian Industrial Conferences held between 1905 and 1917 in locations such as Benares, Madras, and Lucknow. Volume 15: Indian Industrial Conference and Commission, Part 2 (1917–1918 ) This 284-page volume offers insights into Malaviya Ji’s advocacy for economic self-reliance through his famous call to \"Buy Indian Goods and Sell Indian Goods\" to patronize and promote domestic industries. Volume 16: Speeches in the Central Legislative Assembly, Part 1 (1924) Covering 274 pages, this volume documents Mahamana’s vigorous efforts toward attaining Self-Governing Dominion Status for India. Volume 17: Speeches in the Central Legislative Assembly, Part 2 (1924–1926) This 260-page collection covers significant legislative debates.  It notably contains a formal Note of Dissent authored by Pandit Malaviya. Volume 18: Speeches in the Central Legislative Assembly, Part 3 (1927–1928) Across 276 pages, this volume highlights Malaviya Ji’s focus on crucial financial and social legislation Volume 19: Speeches in the Central Legislative Assembly, Part 4 (1927–1928) This 280-page volume compiles various resolutions, including those regarding the circumstances surrounding Lala Lajpat Rai's death (1929), the Transfer of Property (Amendment) Bill (1929), and the establishment of military schools (1929). Volume 20: Second Indian Round Table Conference (1931) and The Poona Pact (1932) Comprising 187 pages, this volume records a watershed moment in Indian history. Volume 21: Advocate (1894–1923) This 238-page volume illustrates Pandit Malaviya’s distinguished legal career. Volume 22: Dharma-Karma, Part 1 (1891–1934) Consisting of 290 pages, this volume explores Mahamana’s role as a flag-bearer of Dharma. Volume 23: Dharma-Karma, Part 2 (1935–1946) The final 308-page volume focuses on his spiritual and social devotion. ***** Mahesh Kumar/ Vivek Vishwash (रिलीज़ आईडी: 2208542)",
    "scraped_at": "2025-12-25T17:40:13.589395"
  },
  {
    "id": "2208532",
    "ministry": "Ministry of Railways",
    "title": "Indian Railways Rationalises Fare Structure; No Fare Increase for Suburban Services, Season Tickets and Second Class Ordinary Journeys up to 215 km",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208532",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Railways Indian Railways Rationalises Fare Structure; No Fare Increase for Suburban Services, Season Tickets and Second Class Ordinary Journeys up to 215 km Minimising Impact on Passengers: Only 1 Paise per Km Increase for Sleeper and First Class Ordinary Across AC and Non-AC Classes, Mail/Express Fare Revision Limited to 2 Paise per Km No Change in Reservation Fees or Superfast Charges, Under Fare Rationalisation; GST Applicability and Fare Rounding Rules Also Remain Unchanged Revised Fares to Apply Only on Tickets Booked from 26 December 2025, with No Impact on Existing Bookings Even for Future Travel प्रविष्टि तिथि:\r\n                25 DEC 2025 5:30PM by PIB Delhi The Railways has rationalised its passenger fare structure with effect from 26 December 2025 , with the objective of balancing affordability for passengers and sustainability of operations. Under the revised fare structure, there is no change in fares for suburban services and Season Tickets , including both suburban and non-suburban routes. For Ordinary Non-AC (Non-Suburban) services , fares have been rationalised in a graded manner across Second Class Ordinary, Sleeper Class Ordinary, and First Class Ordinary . In Second Class Ordinary , there is no increase in fare for journeys up to 215 km, ensuring that short-distance and daily commuters are not impacted. For distances from 216 km to 750 km , the fare increases by ₹5 . For longer journeys, the increase is applied in steps — ₹10 for distances between 751 km and 1250 km , ₹15 for distances between 1251 km and 1750 km , and ₹20 for distances between 1751 km and 2250 km . In Sleeper Class Ordinary and First Class Ordinary , fares have been revised uniformly at the rate of 1 paise per kilometre for non-suburban journeys, ensuring a gradual and limited increase in fares. In Mail/Express trains , the fare increase has been rationalised at 2 paise per kilometre across Non-AC and AC classes. This includes Sleeper Class, First Class, AC Chair Car, AC 3-Tier, AC 2-Tier, and AC First Class. As an illustration, for a 500 km journey in non-AC Mail/Express coaches , passengers will pay only about ₹10 extra . The existing basic fares of major train services, including Tejas Rajdhani, Rajdhani, Shatabdi, Duronto, Vande Bharat, Humsafar, Amrit Bharat, Tejas, Mahamana, Gatimaan, Antyodaya, Garib Rath, Jan Shatabdi, Yuva Express, Namo Bharat Rapid Rail, and Ordinary non-suburban services (excluding AC MEMU/DEMU, where applicable), have been revised in line with the approved class-wise basic fare increases. The revision has been carried out uniformly and in a calibrated manner across applicable classes. Notably, no changes have been made in reservation fees, superfast surcharges, or other ancillary charges , which will continue to be levied as per existing rules. GST applicability remains unchanged , and fares will continue to be rounded off according to prevailing norms. The revised fares are applicable only on tickets booked on or after 26 December 2025 . Tickets booked prior to this date will not attract any additional charges, even if the journey is undertaken after the effective date. The fare list displayed at stations will also be updated to reflect the new fares effective from 26.12.2025. Indian Railways remains committed to providing safe, reliable and affordable travel to millions of passengers every day. The revised fare structure reflects a balanced approach that safeguards passenger convenience while maintaining operational sustainability. Commercial Circular can be seen at- https://indianrailways.gov.in/railwayboard/uploads/directorate/traffic_comm/Comm_Cir_2025/CC_24_2025.pdf ***** Dharmendra Tewari/ Manik Sharma (रिलीज़ आईडी: 2208532) आगंतुक पटल  : 559 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati , Odia , Malayalam Ministry of Railways Indian Railways Rationalises Fare Structure; No Fare Increase for Suburban Services, Season Tickets and Second Class Ordinary Journeys up to 215 km Minimising Impact on Passengers: Only 1 Paise per Km Increase for Sleeper and First Class Ordinary Across AC and Non-AC Classes, Mail/Express Fare Revision Limited to 2 Paise per Km No Change in Reservation Fees or Superfast Charges, Under Fare Rationalisation; GST Applicability and Fare Rounding Rules Also Remain Unchanged Revised Fares to Apply Only on Tickets Booked from 26 December 2025, with No Impact on Existing Bookings Even for Future Travel प्रविष्टि तिथि:\r\n                        25 DEC 2025 5:30PM by PIB Delhi The Railways has rationalised its passenger fare structure with effect from 26 December 2025 , with the objective of balancing affordability for passengers and sustainability of operations. Under the revised fare structure, there is no change in fares for suburban services and Season Tickets , including both suburban and non-suburban routes. For Ordinary Non-AC (Non-Suburban) services , fares have been rationalised in a graded manner across Second Class Ordinary, Sleeper Class Ordinary, and First Class Ordinary . In Second Class Ordinary , there is no increase in fare for journeys up to 215 km, ensuring that short-distance and daily commuters are not impacted. For distances from 216 km to 750 km , the fare increases by ₹5 . For longer journeys, the increase is applied in steps — ₹10 for distances between 751 km and 1250 km , ₹15 for distances between 1251 km and 1750 km , and ₹20 for distances between 1751 km and 2250 km . In Sleeper Class Ordinary and First Class Ordinary , fares have been revised uniformly at the rate of 1 paise per kilometre for non-suburban journeys, ensuring a gradual and limited increase in fares. In Mail/Express trains , the fare increase has been rationalised at 2 paise per kilometre across Non-AC and AC classes. This includes Sleeper Class, First Class, AC Chair Car, AC 3-Tier, AC 2-Tier, and AC First Class. As an illustration, for a 500 km journey in non-AC Mail/Express coaches , passengers will pay only about ₹10 extra . The existing basic fares of major train services, including Tejas Rajdhani, Rajdhani, Shatabdi, Duronto, Vande Bharat, Humsafar, Amrit Bharat, Tejas, Mahamana, Gatimaan, Antyodaya, Garib Rath, Jan Shatabdi, Yuva Express, Namo Bharat Rapid Rail, and Ordinary non-suburban services (excluding AC MEMU/DEMU, where applicable), have been revised in line with the approved class-wise basic fare increases. The revision has been carried out uniformly and in a calibrated manner across applicable classes. Notably, no changes have been made in reservation fees, superfast surcharges, or other ancillary charges , which will continue to be levied as per existing rules. GST applicability remains unchanged , and fares will continue to be rounded off according to prevailing norms. The revised fares are applicable only on tickets booked on or after 26 December 2025 . Tickets booked prior to this date will not attract any additional charges, even if the journey is undertaken after the effective date. The fare list displayed at stations will also be updated to reflect the new fares effective from 26.12.2025. Indian Railways remains committed to providing safe, reliable and affordable travel to millions of passengers every day. The revised fare structure reflects a balanced approach that safeguards passenger convenience while maintaining operational sustainability. Commercial Circular can be seen at- https://indianrailways.gov.in/railwayboard/uploads/directorate/traffic_comm/Comm_Cir_2025/CC_24_2025.pdf ***** Dharmendra Tewari/ Manik Sharma (रिलीज़ आईडी: 2208532)",
    "scraped_at": "2025-12-25T17:40:15.818168"
  },
  {
    "id": "2208606",
    "ministry": "Ministry of Ports, Shipping and Waterways",
    "title": "‘PM Narendra Modi Turned Sports into a Mass Movement’, says Sarbananda Sonowal at Dibrugarh Khel Mahotsav",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208606",
    "date": "25 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Ports, Shipping and Waterways ‘PM Narendra Modi Turned Sports into a Mass Movement’, says Sarbananda Sonowal at Dibrugarh Khel Mahotsav “Targeted Incentives for Emerging Sportspersons in Dibrugarh soon:” Sarbananda  Sonowal प्रविष्टि तिथि:\r\n                25 DEC 2025 8:40PM by PIB Delhi The Union Minister of Ports, Shipping & Waterways (MoPSW), Sarbananda Sonowal credited Prime Minister Narendra Modi for transforming sports from a niche pursuit into a nationwide mass movement, following his participation in the Sansad Khel Mahotsav in Dibrugarh. Addressing athletes, students and local residents, the Dibrugarh LSC MP Sarbananda Sonowal said the initiative reflects the Prime Minister’s larger vision of linking fitness, discipline and youth empowerment with nation-building. “Prime Minister Narendra Modi ji has given sports a central place in India’s development journey by turning fitness and athletic excellence into a people’s movement,” Sarbananda Sonowal said. “I call upon our youth and citizens to participate in building a healthy, fit and sports-oriented India, guided by the spirit of Khelo India – Khelo Desh,” he further added. Sarbananda Sonowal said the ‘Sansad Khel Mahotsav’ has strengthened grassroots sports by identifying young talent early and fostering community participation. “This initiative is nurturing talent at the grassroots, strengthening community bonds and instilling discipline, confidence and character among our youth,” he said. Announcing constituency-level support, Sonowal said promising sportspersons from Dibrugarh would receive targeted assistance to improve training and performance. “Talented athletes from Dibrugarh will be given special incentives and institutional support so they can compete at higher levels and bring recognition to Assam and the nation,” Sonowal said. Referring to Good Governance Day, observed on the birth anniversary of former Prime Minister Atal Bihari Vajpayee, Sonowal highlighted the sports reforms introduced since 2014. “Since 2014, under the leadership of Prime Minister Narendra Modi ji, India has seen unprecedented expansion of sports infrastructure, wider participation and systematic identification of talent from every corner of the country,” Sonowal said. Citing national flagship programmes, Sonowal said Khelo India, Fit India and the Target Olympic Podium Scheme (TOPS) have created structured pathways for athletes. “These initiatives have ensured world-class facilities and professional training, enabling young Indians to pursue sports as a serious career,” he said. Sonowal added that Assam has aligned its efforts with the national vision through initiatives such as Khel Mahotsav. “Through Khel Mahotsav, we are identifying talent from villages, tea garden areas and remote regions, and preparing them for national and international competitions,” Sonowal said, noting that improved indoor and outdoor stadium infrastructure in Dibrugarh has increased parental confidence in sports as a career option. Prominent dignitaries present at the event included Assam Minister Prashanta Phukan, Dibrugarh Municipal Corporation (DMC), Mayor, Deputy Mayor Ujjal Phukan, Chairman of Assam Petrochemicals Limited (APL), Bikul Deka, BJP District President Dulal Bora, Chairman of Dibrugarh Development Authority (DDA), Asim Hazarika, Managing Director of BVFCL Pranjal Barman, Vice Chancellor of Sri Sri Aniruddhadeva University Prof. Narendra Nath Sarma, President of Dibrugarh District Sports Association (DDSA) Niranjan Saikia, Secretary Kamakhya Saikia, District Commissioner of Dibrugarh, Bikram Kairi, and other distinguished guests and citizens. **** PN/IY (रिलीज़ आईडी: 2208606) आगंतुक पटल  : 127 Ministry of Ports, Shipping and Waterways ‘PM Narendra Modi Turned Sports into a Mass Movement’, says Sarbananda Sonowal at Dibrugarh Khel Mahotsav “Targeted Incentives for Emerging Sportspersons in Dibrugarh soon:” Sarbananda  Sonowal प्रविष्टि तिथि:\r\n                        25 DEC 2025 8:40PM by PIB Delhi The Union Minister of Ports, Shipping & Waterways (MoPSW), Sarbananda Sonowal credited Prime Minister Narendra Modi for transforming sports from a niche pursuit into a nationwide mass movement, following his participation in the Sansad Khel Mahotsav in Dibrugarh. Addressing athletes, students and local residents, the Dibrugarh LSC MP Sarbananda Sonowal said the initiative reflects the Prime Minister’s larger vision of linking fitness, discipline and youth empowerment with nation-building. “Prime Minister Narendra Modi ji has given sports a central place in India’s development journey by turning fitness and athletic excellence into a people’s movement,” Sarbananda Sonowal said. “I call upon our youth and citizens to participate in building a healthy, fit and sports-oriented India, guided by the spirit of Khelo India – Khelo Desh,” he further added. Sarbananda Sonowal said the ‘Sansad Khel Mahotsav’ has strengthened grassroots sports by identifying young talent early and fostering community participation. “This initiative is nurturing talent at the grassroots, strengthening community bonds and instilling discipline, confidence and character among our youth,” he said. Announcing constituency-level support, Sonowal said promising sportspersons from Dibrugarh would receive targeted assistance to improve training and performance. “Talented athletes from Dibrugarh will be given special incentives and institutional support so they can compete at higher levels and bring recognition to Assam and the nation,” Sonowal said. Referring to Good Governance Day, observed on the birth anniversary of former Prime Minister Atal Bihari Vajpayee, Sonowal highlighted the sports reforms introduced since 2014. “Since 2014, under the leadership of Prime Minister Narendra Modi ji, India has seen unprecedented expansion of sports infrastructure, wider participation and systematic identification of talent from every corner of the country,” Sonowal said. Citing national flagship programmes, Sonowal said Khelo India, Fit India and the Target Olympic Podium Scheme (TOPS) have created structured pathways for athletes. “These initiatives have ensured world-class facilities and professional training, enabling young Indians to pursue sports as a serious career,” he said. Sonowal added that Assam has aligned its efforts with the national vision through initiatives such as Khel Mahotsav. “Through Khel Mahotsav, we are identifying talent from villages, tea garden areas and remote regions, and preparing them for national and international competitions,” Sonowal said, noting that improved indoor and outdoor stadium infrastructure in Dibrugarh has increased parental confidence in sports as a career option. Prominent dignitaries present at the event included Assam Minister Prashanta Phukan, Dibrugarh Municipal Corporation (DMC), Mayor, Deputy Mayor Ujjal Phukan, Chairman of Assam Petrochemicals Limited (APL), Bikul Deka, BJP District President Dulal Bora, Chairman of Dibrugarh Development Authority (DDA), Asim Hazarika, Managing Director of BVFCL Pranjal Barman, Vice Chancellor of Sri Sri Aniruddhadeva University Prof. Narendra Nath Sarma, President of Dibrugarh District Sports Association (DDSA) Niranjan Saikia, Secretary Kamakhya Saikia, District Commissioner of Dibrugarh, Bikram Kairi, and other distinguished guests and citizens. **** PN/IY (रिलीज़ आईडी: 2208606)",
    "scraped_at": "2025-12-25T17:40:18.222789"
  }
]