[
  {
    "id": "2207360",
    "ministry": "Vice President's Secretariat",
    "title": "Vice-President Addresses Indian Defence Accounts Service Officer Trainees",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207360",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Vice President's Secretariat Vice-President Addresses Indian Defence Accounts Service Officer Trainees Adopt ‘Seva Bhav–Kartavya Bodh’ as Your Mantra, Vice-President Tells IDAS Officer Trainees Collective Efforts Key to Building Atmanirbhar and Viksit Bharat, Says Vice-President Prudent financial management is essential to ensure the operational readiness of the Armed Forces: Vice President Integrity, Vigilance and Accountability Must Guide Financial Decision-Making, Says Vice-President प्रविष्टि तिथि:\r\n                22 DEC 2025 2:53PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, addressed the Officer Trainees of the Indian Defence Accounts Service (IDAS) of the 2023 and 2024 batches at the Vice-President’s Enclave today. Welcoming the officer trainees, the Vice-President noted with pride that the Defence Accounts Department has a rich legacy of over 275 years, making it one of the oldest departments of the Government of India. The Vice-President said that as the nation moves towards the ambitious goal of becoming a Viksit Bharat by 2047, civil servants will play a pivotal role in translating this vision into reality. He recalled the clarion call given by Prime Minister Shri Narendra Modi during the Amrit Kaal and emphasized that development must focus on inclusive growth and last-mile delivery. He said youthful energy and innovative thinking of the young officers would be vital in nation-building and urged them to adopt “Seva Bhav and Kartavya Bodh” as their guiding mantra. Underscoring the significance of the Indian Defence Accounts Service, the Vice-President said that the Service plays a critical role in managing the financial resources of the Indian Armed Forces and allied organisations. As the accounting and financial authority of the Defence Services, he said, officers must understand and assimilate the challenges faced by the Armed Forces while discharging their duties.He emphasized that prudent financial management is essential to ensure the operational readiness of the Armed Forces. The Vice President  stressed the need to maintain the highest standards of integrity, transparency, vigilance, and accountability, especially since public money represents the hard-earned contributions of taxpayers. The Vice-President also stressed the importance of continuous capacity building in an era marked by rapid technological and scientific advancements. He encouraged officers to make effective use of platforms such as iGOT Karmayogi for lifelong learning. Speaking on values in public service, the Vice-President said that while knowledge is essential, character is paramount. He reminded the officers that among India’s 140 crore citizens, they have been entrusted with a rare opportunity to bring about positive change in society and must exercise this responsibility with humility and dedication. Responding to a question from an officer trainee on expectations from civil servants in the journey towards Viksit Bharat, the Vice-President urged them to remain innovative, adaptive to modern technologies, enthusiastic in their work, empathetic in approach, and ethical in administration. The event was attended by Shri Rajesh Kumar Singh, Defence Secretary; Shri Vishvajit Sahay, Controller General of Defence Accounts; Shri Raj Kumar Arora, Financial Adviser (Defence Services), among others. **** PR/ASM (रिलीज़ आईडी: 2207360) आगंतुक पटल  : 65 Vice President's Secretariat Vice-President Addresses Indian Defence Accounts Service Officer Trainees Adopt ‘Seva Bhav–Kartavya Bodh’ as Your Mantra, Vice-President Tells IDAS Officer Trainees Collective Efforts Key to Building Atmanirbhar and Viksit Bharat, Says Vice-President Prudent financial management is essential to ensure the operational readiness of the Armed Forces: Vice President Integrity, Vigilance and Accountability Must Guide Financial Decision-Making, Says Vice-President प्रविष्टि तिथि:\r\n                        22 DEC 2025 2:53PM by PIB Delhi The Vice-President of India, Shri C. P. Radhakrishnan, addressed the Officer Trainees of the Indian Defence Accounts Service (IDAS) of the 2023 and 2024 batches at the Vice-President’s Enclave today. Welcoming the officer trainees, the Vice-President noted with pride that the Defence Accounts Department has a rich legacy of over 275 years, making it one of the oldest departments of the Government of India. The Vice-President said that as the nation moves towards the ambitious goal of becoming a Viksit Bharat by 2047, civil servants will play a pivotal role in translating this vision into reality. He recalled the clarion call given by Prime Minister Shri Narendra Modi during the Amrit Kaal and emphasized that development must focus on inclusive growth and last-mile delivery. He said youthful energy and innovative thinking of the young officers would be vital in nation-building and urged them to adopt “Seva Bhav and Kartavya Bodh” as their guiding mantra. Underscoring the significance of the Indian Defence Accounts Service, the Vice-President said that the Service plays a critical role in managing the financial resources of the Indian Armed Forces and allied organisations. As the accounting and financial authority of the Defence Services, he said, officers must understand and assimilate the challenges faced by the Armed Forces while discharging their duties.He emphasized that prudent financial management is essential to ensure the operational readiness of the Armed Forces. The Vice President  stressed the need to maintain the highest standards of integrity, transparency, vigilance, and accountability, especially since public money represents the hard-earned contributions of taxpayers. The Vice-President also stressed the importance of continuous capacity building in an era marked by rapid technological and scientific advancements. He encouraged officers to make effective use of platforms such as iGOT Karmayogi for lifelong learning. Speaking on values in public service, the Vice-President said that while knowledge is essential, character is paramount. He reminded the officers that among India’s 140 crore citizens, they have been entrusted with a rare opportunity to bring about positive change in society and must exercise this responsibility with humility and dedication. Responding to a question from an officer trainee on expectations from civil servants in the journey towards Viksit Bharat, the Vice-President urged them to remain innovative, adaptive to modern technologies, enthusiastic in their work, empathetic in approach, and ethical in administration. The event was attended by Shri Rajesh Kumar Singh, Defence Secretary; Shri Vishvajit Sahay, Controller General of Defence Accounts; Shri Raj Kumar Arora, Financial Adviser (Defence Services), among others. **** PR/ASM (रिलीज़ आईडी: 2207360)",
    "scraped_at": "2025-12-22T09:53:07.431005"
  },
  {
    "id": "2207299",
    "ministry": "Prime Minister's Office",
    "title": "Prime Minister holds a telephone conversation with the Prime Minister of New Zealand",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207299",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office Prime Minister holds a telephone conversation with the Prime Minister of New Zealand The two leaders jointly announce a landmark India-New Zealand Free Trade Agreement The leaders agree that the FTA would serve as a catalyst for greater trade, investment, innovation and shared opportunities between both countries The leaders also welcome progress in other areas of bilateral cooperation including defence, sports, education and people-to-people ties Posted On:\r\n                22 DEC 2025 11:30AM by PIB Delhi Prime Minister Shri Narendra Modi held a telephone conversation with the Prime Minister of New Zealand, The Rt. Hon. Christopher Luxon today. The two leaders jointly announced the successful conclusion of the historic, ambitious and mutually beneficial India–New Zealand Free Trade Agreement (FTA). With negotiations having been Initiated during PM Luxon’s visit to India in March 2025, the two leaders agreed that the conclusion of the FTA in a record time of 9 months reflects the shared ambition and political will to further deepen ties between the two countries. The FTA would significantly deepen bilateral economic engagement, enhance market access, promote investment flows, strengthen strategic cooperation between the two countries, and also open up new opportunities for innovators, entrepreneurs, farmers, MSMEs, students and youth of both countries across various sectors. With the strong and credible foundation provided by the FTA, both leaders expressed confidence in doubling bilateral trade over the next five years as well as an investment of USD 20 billion in India from New Zealand over the next 15 years. The leaders also welcomed the progress achieved in other areas of bilateral cooperation such as sports, education, and people-to-people ties, and reaffirmed their commitment towards further strengthening of the India-New Zealand partnership. The leaders agreed to remain in touch. *** MJPS/ST (Release ID: 2207299) Visitor Counter : 2054 Read this release in: Urdu , Marathi , हिन्दी , Assamese , Bengali , Gujarati , Tamil , Kannada , Malayalam Prime Minister's Office Prime Minister holds a telephone conversation with the Prime Minister of New Zealand The two leaders jointly announce a landmark India-New Zealand Free Trade Agreement The leaders agree that the FTA would serve as a catalyst for greater trade, investment, innovation and shared opportunities between both countries The leaders also welcome progress in other areas of bilateral cooperation including defence, sports, education and people-to-people ties Posted On:\r\n                        22 DEC 2025 11:30AM by PIB Delhi Prime Minister Shri Narendra Modi held a telephone conversation with the Prime Minister of New Zealand, The Rt. Hon. Christopher Luxon today. The two leaders jointly announced the successful conclusion of the historic, ambitious and mutually beneficial India–New Zealand Free Trade Agreement (FTA). With negotiations having been Initiated during PM Luxon’s visit to India in March 2025, the two leaders agreed that the conclusion of the FTA in a record time of 9 months reflects the shared ambition and political will to further deepen ties between the two countries. The FTA would significantly deepen bilateral economic engagement, enhance market access, promote investment flows, strengthen strategic cooperation between the two countries, and also open up new opportunities for innovators, entrepreneurs, farmers, MSMEs, students and youth of both countries across various sectors. With the strong and credible foundation provided by the FTA, both leaders expressed confidence in doubling bilateral trade over the next five years as well as an investment of USD 20 billion in India from New Zealand over the next 15 years. The leaders also welcomed the progress achieved in other areas of bilateral cooperation such as sports, education, and people-to-people ties, and reaffirmed their commitment towards further strengthening of the India-New Zealand partnership. The leaders agreed to remain in touch. *** MJPS/ST (Release ID: 2207299)",
    "scraped_at": "2025-12-22T09:53:09.181347"
  },
  {
    "id": "2207300",
    "ministry": "Ministry of Commerce & Industry",
    "title": "India and New Zealand Announce Conclusion of Landmark Free Trade Agreement Negotiations",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207300",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Commerce & Industry India and New Zealand Announce Conclusion of Landmark Free Trade Agreement Negotiations A new generation trade agreement built on Tariffs, agricultural productivity, Investment and Talent: A People-Centric, Jobs-Driven Strategic Partnership for Viksit Bharat 2047 Zero Duty market access on 100% of India’s exports. India has offered tariff liberalisation in 70% lines covering 95% of New Zealand India Bilateral trade Launched on March 16th 2025, the fastest with a Developed Country FTA concludes the year on a high note for all Indian exports including textiles, pharmaceuticals, leather, Engineering Goods, Agricultural products Best-ever market access and services offer by New Zealand to India, covering 118 services sectors including computer Related Services, Professional Services, Audio Visual Services, Telecommunication Services, Construction Services, Tourism and Travel related Service. Most-Favoured Nation Commitment in about 139 sub-sectors Boosts Student mobility through post-study work visas and professional pathways in New Zealand, with no numerical caps Students can convert global learning to global experience with post-study work rights of up to 3 years for STEM Bachelor’s and Master’s graduates and up to 4 years for Doctoral scholars Dedicated quota of Temporary Employment Entry visa for 5,000 professionals and 1,000 Work and Holiday Visas Commitment of Investment of USD 20 Billion over a period of 15 years Establishes Agricultural Productivity Partnerships through Centres of Excellence for Apples, Kiwifruit, and Honey to boost productivity, farmer incomes Productivity cooperation is paired with restricted market access for apples, kiwifruit and honey linked to quotas and minimum import prices, aligning knowledge transfer with safeguards for domestic producers. To ensure protection to farmers and the domestic industry, Market access excludes dairy, coffee, milk, cream, cheese, yoghurts, whey, caseins, onions, sugar, spices, edible oils, rubber Duty free inputs for India’s Manufacturing Sector: Wooden logs, coking coal, waste and scraps of metals प्रविष्टि तिथि:\r\n                22 DEC 2025 11:39AM by PIB Delhi India and New Zealand have concluded a comprehensive, balanced and forward-looking Free Trade Agreement (FTA) under the visionary leadership of Hon’ble Prime Minister Shri Narendra Modi, marking a major economic and strategic milestone in India’s engagement with the Indo-Pacific region. The Agreement stands out as one of India’s fastest-concluded FTAs aligned with the national vision of Viksit Bharat 2047.  The negotiations were formally launched on 16 March 2025 during the meeting between Hon’ble Minister of Commerce and Industry Shri Piyush Goyal and Hon’ble Minister for Trade and Investment of New Zealand Mr. Todd McClay. The agreement was concluded by holding continuous and intense discussions spread over 5 formal negotiation rounds, several in-person and virtual intersessions. The FTA establishes a high-quality economic partnership that promotes employment, facilitates skill mobility, drives trade and investment-led growth, fosters innovation for agricultural productivity, and enhances MSME participation to strengthen long-term economic resilience. Speaking on the conclusion, Minister for Commerce and Industry Shri Piyush Goyal said, “Today this Free Trade Agreement is about building trade around people and launching opportunities – for our farmers, for our entrepreneurs, for our students, for our Women and for our innovators. Boosting yields and farmer incomes, the agreement drives modern agricultural productivity. It  opens doors for Indian businesses in the region through well-integrated directional exports and gives our youth choices to learn, work and grow on a global stage” Elimination of tariffs on 100% of its tariff lines, provides duty-free access for all Indian exports. This market access enhances the competitiveness of India’s labour-intensive sectors including textiles, apparel, leather, footwear, marine products, gems and jewellery, handicrafts, engineering goods and automobiles, directly supporting Indian workers, artisans, women, youth and MSMEs and integrating them deeper into global value chains. The FTA delivers New Zealand’s best and most ambitious services offer in any of its FTAs to date. India has secured commitments across a wide range of high-value sectors including IT and IT-enabled services, professional services, education, financial services, tourism, construction and other business services, opening substantial new opportunities for Indian service suppliers and high-skill employment. Rajesh Agrawal, Commerce Secretary, called it “A new generation trade agreement built on tariffs, agricultural productivity, Investment and Talent with complementarity at the core.  India’s strengths expand exports, support labour-intensive growth and power services. New Zealand gains deeper, more predictable access to India’s large and growing economy. The movement of people-students, professionals, and skilled workers converges these strengths.” A future-ready and facilitative mobility framework positions India as a key supplier of skilled and semi-skilled talent. The FTA provides improved entry and stay provisions for Indian professionals, students and youth, including work opportunities during studies, post-study work pathways, dedicated visa arrangements and a Working Holiday visa framework, strengthening people-to-people ties and expanding global exposure for Indian youth. The FTA Opens Skilled Employment Pathways through a new Temporary Employment Entry Visa pathway for Indian professionals in skilled occupations, with a quota of 5,000 visas at any given time and a stay of up to three years. This pathway covers Indian professions such as AYUSH practitioners, yoga instructors, Indian chefs, and music teachers, as well as high-demand sectors including IT, engineering, healthcare, education, and construction, strengthening workforce mobility and services trade. Establishment of dedicated Agri-Technology Action Plans on kiwifruit, apples and honey, focus on productivity enhancement, technology, research collaboration, quality improvement and value-chain development, to strengthen domestic capabilities and supporting income growth for Indian farmers. The cooperation includes the establishment of Centres of Excellence, improved planting material, capacity building for growers and technical support for orchard management, post-harvest practices, supply chain performance, and food safety. Projects for apple cultivators and sustainable beekeeping practices will enhance production and quality standards. The Agreement significantly strengthens the investment partnership between the two countries. New Zealand has committed to facilitate investments of USD 20 billion into India over the next fifteen years, thereby supporting manufacturing, infrastructure, services, innovation and employment under India’s Make in India vision. Indian enterprises are also expected to benefit from their presence in New Zealand and access the wider Pacific Island markets. Boost to Pharma and Medical Devices through faster regulatory Access by enabling acceptance of GMP and GCP inspection reports from comparable regulators, including approvals by the US FDA, EMA, UK MHRA, and other comparable regulators. This will reduce duplicative inspections, lower compliance costs, and expedite product approvals, thereby facilitating the growth of India’s pharmaceutical and medical devices exports to New Zealand. Commitment has been extended on Geographical Indications, including amendment of its law to facilitate the registration of India’s wines, spirits and ‘other goods’, a benefit that was accorded to the EU by New Zealand- to be completed under defined timelines. Cooperation has been agreed in AYUSH, culture, fisheries, audio visual tourism, forestry, horticulture and traditional knowledge systems. The FTA promotes India’s AYUSH systems internationally, encourages medical value travel, and positions India as a global wellness hub. Apart from tariff liberalisation, the FTA includes provisions to address non-tariff barriers through enhanced regulatory cooperation, transparency, and streamlined customs, Sanitary and Phyto-sanitary (SPS) measures and Technical Barriers to Trade disciplines. All systemic facilitations and fast-track mechanisms for imports that serve as inputs for our manufactured exports ensure that tariff concessions translate into effective and meaningful market access. India–New Zealand economic engagement has shown steady momentum. Bilateral merchandise trade reached USD 1.3 billion in 2024–25, while total trade in goods and services stood at approximately USD 2.4 billion in 2024, with services trade alone reaching USD 1.24 billion, led by travel, IT and business services. The FTA provides a stable and predictable framework to unlock the full potential of this relationship. The 3 rd FTA concluded this year under the visionary leadership of Hon’ble Prime Minister Shri Narendra Modi, the India–New Zealand Free Trade Agreement represents a new generation trade partnership. It stands as a significant step in India’s journey towards becoming a globally competitive, inclusive and resilient economy under the vision of Viksit Bharat 2047. *** Abhishek Dayal/Garima Singh/Anushka Pandey (रिलीज़ आईडी: 2207300) आगंतुक पटल  : 1482 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Tamil Ministry of Commerce & Industry India and New Zealand Announce Conclusion of Landmark Free Trade Agreement Negotiations A new generation trade agreement built on Tariffs, agricultural productivity, Investment and Talent: A People-Centric, Jobs-Driven Strategic Partnership for Viksit Bharat 2047 Zero Duty market access on 100% of India’s exports. India has offered tariff liberalisation in 70% lines covering 95% of New Zealand India Bilateral trade Launched on March 16th 2025, the fastest with a Developed Country FTA concludes the year on a high note for all Indian exports including textiles, pharmaceuticals, leather, Engineering Goods, Agricultural products Best-ever market access and services offer by New Zealand to India, covering 118 services sectors including computer Related Services, Professional Services, Audio Visual Services, Telecommunication Services, Construction Services, Tourism and Travel related Service. Most-Favoured Nation Commitment in about 139 sub-sectors Boosts Student mobility through post-study work visas and professional pathways in New Zealand, with no numerical caps Students can convert global learning to global experience with post-study work rights of up to 3 years for STEM Bachelor’s and Master’s graduates and up to 4 years for Doctoral scholars Dedicated quota of Temporary Employment Entry visa for 5,000 professionals and 1,000 Work and Holiday Visas Commitment of Investment of USD 20 Billion over a period of 15 years Establishes Agricultural Productivity Partnerships through Centres of Excellence for Apples, Kiwifruit, and Honey to boost productivity, farmer incomes Productivity cooperation is paired with restricted market access for apples, kiwifruit and honey linked to quotas and minimum import prices, aligning knowledge transfer with safeguards for domestic producers. To ensure protection to farmers and the domestic industry, Market access excludes dairy, coffee, milk, cream, cheese, yoghurts, whey, caseins, onions, sugar, spices, edible oils, rubber Duty free inputs for India’s Manufacturing Sector: Wooden logs, coking coal, waste and scraps of metals प्रविष्टि तिथि:\r\n                        22 DEC 2025 11:39AM by PIB Delhi India and New Zealand have concluded a comprehensive, balanced and forward-looking Free Trade Agreement (FTA) under the visionary leadership of Hon’ble Prime Minister Shri Narendra Modi, marking a major economic and strategic milestone in India’s engagement with the Indo-Pacific region. The Agreement stands out as one of India’s fastest-concluded FTAs aligned with the national vision of Viksit Bharat 2047.  The negotiations were formally launched on 16 March 2025 during the meeting between Hon’ble Minister of Commerce and Industry Shri Piyush Goyal and Hon’ble Minister for Trade and Investment of New Zealand Mr. Todd McClay. The agreement was concluded by holding continuous and intense discussions spread over 5 formal negotiation rounds, several in-person and virtual intersessions. The FTA establishes a high-quality economic partnership that promotes employment, facilitates skill mobility, drives trade and investment-led growth, fosters innovation for agricultural productivity, and enhances MSME participation to strengthen long-term economic resilience. Speaking on the conclusion, Minister for Commerce and Industry Shri Piyush Goyal said, “Today this Free Trade Agreement is about building trade around people and launching opportunities – for our farmers, for our entrepreneurs, for our students, for our Women and for our innovators. Boosting yields and farmer incomes, the agreement drives modern agricultural productivity. It  opens doors for Indian businesses in the region through well-integrated directional exports and gives our youth choices to learn, work and grow on a global stage” Elimination of tariffs on 100% of its tariff lines, provides duty-free access for all Indian exports. This market access enhances the competitiveness of India’s labour-intensive sectors including textiles, apparel, leather, footwear, marine products, gems and jewellery, handicrafts, engineering goods and automobiles, directly supporting Indian workers, artisans, women, youth and MSMEs and integrating them deeper into global value chains. The FTA delivers New Zealand’s best and most ambitious services offer in any of its FTAs to date. India has secured commitments across a wide range of high-value sectors including IT and IT-enabled services, professional services, education, financial services, tourism, construction and other business services, opening substantial new opportunities for Indian service suppliers and high-skill employment. Rajesh Agrawal, Commerce Secretary, called it “A new generation trade agreement built on tariffs, agricultural productivity, Investment and Talent with complementarity at the core.  India’s strengths expand exports, support labour-intensive growth and power services. New Zealand gains deeper, more predictable access to India’s large and growing economy. The movement of people-students, professionals, and skilled workers converges these strengths.” A future-ready and facilitative mobility framework positions India as a key supplier of skilled and semi-skilled talent. The FTA provides improved entry and stay provisions for Indian professionals, students and youth, including work opportunities during studies, post-study work pathways, dedicated visa arrangements and a Working Holiday visa framework, strengthening people-to-people ties and expanding global exposure for Indian youth. The FTA Opens Skilled Employment Pathways through a new Temporary Employment Entry Visa pathway for Indian professionals in skilled occupations, with a quota of 5,000 visas at any given time and a stay of up to three years. This pathway covers Indian professions such as AYUSH practitioners, yoga instructors, Indian chefs, and music teachers, as well as high-demand sectors including IT, engineering, healthcare, education, and construction, strengthening workforce mobility and services trade. Establishment of dedicated Agri-Technology Action Plans on kiwifruit, apples and honey, focus on productivity enhancement, technology, research collaboration, quality improvement and value-chain development, to strengthen domestic capabilities and supporting income growth for Indian farmers. The cooperation includes the establishment of Centres of Excellence, improved planting material, capacity building for growers and technical support for orchard management, post-harvest practices, supply chain performance, and food safety. Projects for apple cultivators and sustainable beekeeping practices will enhance production and quality standards. The Agreement significantly strengthens the investment partnership between the two countries. New Zealand has committed to facilitate investments of USD 20 billion into India over the next fifteen years, thereby supporting manufacturing, infrastructure, services, innovation and employment under India’s Make in India vision. Indian enterprises are also expected to benefit from their presence in New Zealand and access the wider Pacific Island markets. Boost to Pharma and Medical Devices through faster regulatory Access by enabling acceptance of GMP and GCP inspection reports from comparable regulators, including approvals by the US FDA, EMA, UK MHRA, and other comparable regulators. This will reduce duplicative inspections, lower compliance costs, and expedite product approvals, thereby facilitating the growth of India’s pharmaceutical and medical devices exports to New Zealand. Commitment has been extended on Geographical Indications, including amendment of its law to facilitate the registration of India’s wines, spirits and ‘other goods’, a benefit that was accorded to the EU by New Zealand- to be completed under defined timelines. Cooperation has been agreed in AYUSH, culture, fisheries, audio visual tourism, forestry, horticulture and traditional knowledge systems. The FTA promotes India’s AYUSH systems internationally, encourages medical value travel, and positions India as a global wellness hub. Apart from tariff liberalisation, the FTA includes provisions to address non-tariff barriers through enhanced regulatory cooperation, transparency, and streamlined customs, Sanitary and Phyto-sanitary (SPS) measures and Technical Barriers to Trade disciplines. All systemic facilitations and fast-track mechanisms for imports that serve as inputs for our manufactured exports ensure that tariff concessions translate into effective and meaningful market access. India–New Zealand economic engagement has shown steady momentum. Bilateral merchandise trade reached USD 1.3 billion in 2024–25, while total trade in goods and services stood at approximately USD 2.4 billion in 2024, with services trade alone reaching USD 1.24 billion, led by travel, IT and business services. The FTA provides a stable and predictable framework to unlock the full potential of this relationship. The 3 rd FTA concluded this year under the visionary leadership of Hon’ble Prime Minister Shri Narendra Modi, the India–New Zealand Free Trade Agreement represents a new generation trade partnership. It stands as a significant step in India’s journey towards becoming a globally competitive, inclusive and resilient economy under the vision of Viksit Bharat 2047. *** Abhishek Dayal/Garima Singh/Anushka Pandey (रिलीज़ आईडी: 2207300)",
    "scraped_at": "2025-12-22T09:53:10.972994"
  },
  {
    "id": "2207358",
    "ministry": "Ministry of Communications",
    "title": "IP&TAFS Celebrates 51st Foundation Year as Sanchar Vitta Lekha Diwas and organises Communication Finance Summit 2025",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207358",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Communications IP&TAFS Celebrates 51st Foundation Year as Sanchar Vitta Lekha Diwas and organises Communication Finance Summit 2025 प्रविष्टि तिथि:\r\n                22 DEC 2025 2:43PM by PIB Delhi The Indian Posts & Telecommunications Accounts and Finance Service (IP&TAFS) , a Central Civil Service recruited through the Civil Services Examination conducted by the Union Public Service Commission (UPSC) , celebrated its 51st Foundation Year as Sanchar Vitta Lekha Diwas , and organised the Communication Finance Summit 2025 . Addressing the gathering, the Controller General of Communication Accounts (CGCA), Ms. Vandana Gupta , highlighted the 51-year institutional journey of IP&TAFS and its pivotal role in strengthening financial governance in India’s telecommunications and postal sectors. She reflected on the transformative impact of economic reforms, liberalisation, and rapid technological advancements that reshaped the roles of the Department of Telecommunications and the Department of Posts. The CGCA emphasised IP&TAFS’s expanding responsibilities in revenue assurance , assessment and collection of licence fees and Spectrum Usage Charges , financial oversight of telecom operators , internal audit , pension management , and policy-oriented financial advice , underscoring the Service’s evolution into a strategic financial governance cadre supporting transparent, accountable, and sustainable public service delivery. The commitment and professionalism of the Service have also contributed to the Department of Telecommunications (DoT) and the Department of Posts (DoP) consistently remaining among the best-performing Departments in the Grievance Redressal rankings published by the Department of Administrative Reforms and Public Grievances (DARPG) . Highlighting the Service’s strong focus on capacity building , Ms. Gupta noted with pride that IP&TAFS today hosts a Sarvottam–Capacity Building Commission highest-rated Central Training Institute , the National Communications Academy–Finance (NCA-Finance) . The Academy has successfully conducted the Special Foundation Course for 176 officers of 15 All India Services and Central Civil Services , in collaboration with the Lal Bahadur Shastri National Academy of Administration (LBSNAA) , which has been highly appreciated by LBSNAA . She further observed that the role of IP&TAFS officers has expanded beyond traditional accounts and finance functions, with officers now entrusted with core operational, governance, audit, and policy-support functions in the telecommunications and postal sectors. Advisor (Finance), Ms. Darshana M. Dabral , congratulated members of the Service on the Foundation Day and underlined the importance of periodically reflecting on the Service’s journey. She noted that IP&TAFS experienced major growth phases during the liberalisation era of the 1990s and the ongoing digital transformation of the 2020s, during which its role transitioned from service provider to regulator and strategic financial partner. She identified agility and adaptability as the two defining pillars of the Service and highlighted major reforms such as IT 2.0 in Postal operations and rapid accounting reforms. She emphasised the significance of SAMPANN, IT 2.0, and SARAS as core digital applications and suggested that these platforms could be expanded across other Ministries, State Governments, and Direct Benefit Transfer (DBT) frameworks to enhance efficiency and transparency. Sharing his reflections, Shri Rajeev Kumar, Senior Deputy Director General (PAF) , highlighted the multiple transitions witnessed by the Service in both the telecom and postal sectors and shared key challenges and success stories from these periods of change. He emphasised that IP&TAFS has consistently evolved with veteran and retired officers playing a crucial role as mentors and custodians of institutional memory, guiding the Service through critical phases of development. Extending greetings on the occasion, Ms. Astha Saxena, Additional Controller General of Accounts , emphasised that Accounts and Finance Services have remained indispensable to governance across eras. She highlighted the close collaboration between the Controller General of Accounts (CGA) and IP&TAFS, including through platforms such as the Public Financial Management System (PFMS) , and reaffirmed that communications will continue to remain in focus to government functioning. During the Summit, retired senior officers shared insights on the evolution of the IP&TAFS service, drawing upon their institutional memory and experience, enriching serving officers with a long-term vision for strengthening the communications sector and contributing to national development. Discussions were also held on ongoing developments , with emphasis on the impact of SAMPANN 2.0 for pension management , IT 2.0 for postal reforms , and SAMPANN for revenue assurance and mitigation of financial challenges . Looking ahead, initiatives such as Digital Bharat Nidhi , digital and financial literacy , Innovation Cells , and performance audits were envisaged to promote inclusive growth and bring about positive systemic transformation in the communications sector. A Whole-of-Government approach was deliberated through interactions with officers from various Ministries and Departments of the Government of India , reflecting strong inter-departmental coordination and commitment towards robust public financial governance. ***** MI/ARJ (रिलीज़ आईडी: 2207358) आगंतुक पटल  : 82 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी Ministry of Communications IP&TAFS Celebrates 51st Foundation Year as Sanchar Vitta Lekha Diwas and organises Communication Finance Summit 2025 प्रविष्टि तिथि:\r\n                        22 DEC 2025 2:43PM by PIB Delhi The Indian Posts & Telecommunications Accounts and Finance Service (IP&TAFS) , a Central Civil Service recruited through the Civil Services Examination conducted by the Union Public Service Commission (UPSC) , celebrated its 51st Foundation Year as Sanchar Vitta Lekha Diwas , and organised the Communication Finance Summit 2025 . Addressing the gathering, the Controller General of Communication Accounts (CGCA), Ms. Vandana Gupta , highlighted the 51-year institutional journey of IP&TAFS and its pivotal role in strengthening financial governance in India’s telecommunications and postal sectors. She reflected on the transformative impact of economic reforms, liberalisation, and rapid technological advancements that reshaped the roles of the Department of Telecommunications and the Department of Posts. The CGCA emphasised IP&TAFS’s expanding responsibilities in revenue assurance , assessment and collection of licence fees and Spectrum Usage Charges , financial oversight of telecom operators , internal audit , pension management , and policy-oriented financial advice , underscoring the Service’s evolution into a strategic financial governance cadre supporting transparent, accountable, and sustainable public service delivery. The commitment and professionalism of the Service have also contributed to the Department of Telecommunications (DoT) and the Department of Posts (DoP) consistently remaining among the best-performing Departments in the Grievance Redressal rankings published by the Department of Administrative Reforms and Public Grievances (DARPG) . Highlighting the Service’s strong focus on capacity building , Ms. Gupta noted with pride that IP&TAFS today hosts a Sarvottam–Capacity Building Commission highest-rated Central Training Institute , the National Communications Academy–Finance (NCA-Finance) . The Academy has successfully conducted the Special Foundation Course for 176 officers of 15 All India Services and Central Civil Services , in collaboration with the Lal Bahadur Shastri National Academy of Administration (LBSNAA) , which has been highly appreciated by LBSNAA . She further observed that the role of IP&TAFS officers has expanded beyond traditional accounts and finance functions, with officers now entrusted with core operational, governance, audit, and policy-support functions in the telecommunications and postal sectors. Advisor (Finance), Ms. Darshana M. Dabral , congratulated members of the Service on the Foundation Day and underlined the importance of periodically reflecting on the Service’s journey. She noted that IP&TAFS experienced major growth phases during the liberalisation era of the 1990s and the ongoing digital transformation of the 2020s, during which its role transitioned from service provider to regulator and strategic financial partner. She identified agility and adaptability as the two defining pillars of the Service and highlighted major reforms such as IT 2.0 in Postal operations and rapid accounting reforms. She emphasised the significance of SAMPANN, IT 2.0, and SARAS as core digital applications and suggested that these platforms could be expanded across other Ministries, State Governments, and Direct Benefit Transfer (DBT) frameworks to enhance efficiency and transparency. Sharing his reflections, Shri Rajeev Kumar, Senior Deputy Director General (PAF) , highlighted the multiple transitions witnessed by the Service in both the telecom and postal sectors and shared key challenges and success stories from these periods of change. He emphasised that IP&TAFS has consistently evolved with veteran and retired officers playing a crucial role as mentors and custodians of institutional memory, guiding the Service through critical phases of development. Extending greetings on the occasion, Ms. Astha Saxena, Additional Controller General of Accounts , emphasised that Accounts and Finance Services have remained indispensable to governance across eras. She highlighted the close collaboration between the Controller General of Accounts (CGA) and IP&TAFS, including through platforms such as the Public Financial Management System (PFMS) , and reaffirmed that communications will continue to remain in focus to government functioning. During the Summit, retired senior officers shared insights on the evolution of the IP&TAFS service, drawing upon their institutional memory and experience, enriching serving officers with a long-term vision for strengthening the communications sector and contributing to national development. Discussions were also held on ongoing developments , with emphasis on the impact of SAMPANN 2.0 for pension management , IT 2.0 for postal reforms , and SAMPANN for revenue assurance and mitigation of financial challenges . Looking ahead, initiatives such as Digital Bharat Nidhi , digital and financial literacy , Innovation Cells , and performance audits were envisaged to promote inclusive growth and bring about positive systemic transformation in the communications sector. A Whole-of-Government approach was deliberated through interactions with officers from various Ministries and Departments of the Government of India , reflecting strong inter-departmental coordination and commitment towards robust public financial governance. ***** MI/ARJ (रिलीज़ आईडी: 2207358)",
    "scraped_at": "2025-12-22T09:53:12.700891"
  },
  {
    "id": "2207312",
    "ministry": "Ministry of Defence",
    "title": "DRDO & RRU ink MoU to foster collaboration in research, education, training and technology support for defence & internal security",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207312",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Defence DRDO & RRU ink MoU to foster collaboration in research, education, training and technology support for defence & internal security प्रविष्टि तिथि:\r\n                22 DEC 2025 12:20PM by PIB Delhi Defence Research & Development Organisation (DRDO) and Rashtriya Raksha University (RRU) have signed a Memorandum of Understanding (MoU) to foster collaboration in the areas of research, education, training and technology support for defence & internal security. The MoU was inked by Distinguished Scientist & Director General (Production Coordination & Services Interaction) Dr Chandrika Kaushik and Vice Chancellor, RRU Prof (Dr) Bimal N Patel in the presence of Raksha Mantri Shri Rajnath Singh at South Block, New Delhi on December 22, 2025. Secretary, Department of Defence R&D and Chairman, DRDO Dr Samir V Kamat was also present on the occasion. The MoU aims to strengthen India’s self-reliance in defence and internal security technologies, in line with the national vision of Aatmanirbhar Bharat and the whole-of-nation approach during Amrit Kaal. It reflects a shared commitment to integrating technology, knowledge and operational insight to enhance national security preparedness and reinforce India’s strategic autonomy in internal security. Rashtriya Raksha University, an institution of national importance under the Ministry of Home Affairs and the University Grants Commission (UGC)-designated Nodal Centre for Defence Studies, brings strong academic, training and policy expertise in the domain of internal security. DRDO, the nation’s premier defence R&D organisation, contributes cutting-edge indigenous technologies and system-level expertise to meet the requirements of the Armed Forces and security agencies. Under the MoU, both organisations will collaborate on joint research projects, PhD & fellowship programmes and specialised training & capacity-building programmes for security forces. The collaboration will also include studies on emerging operational challenges, technology gap analysis, forecasting of future requirements, and life-cycle management of DRDO-developed systems inducted into the Central Armed Police Forces and other agencies under the Ministry of Home Affairs. *** VK/Savvy (रिलीज़ आईडी: 2207312) आगंतुक पटल  : 510 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Gujarati , Tamil Ministry of Defence DRDO & RRU ink MoU to foster collaboration in research, education, training and technology support for defence & internal security प्रविष्टि तिथि:\r\n                        22 DEC 2025 12:20PM by PIB Delhi Defence Research & Development Organisation (DRDO) and Rashtriya Raksha University (RRU) have signed a Memorandum of Understanding (MoU) to foster collaboration in the areas of research, education, training and technology support for defence & internal security. The MoU was inked by Distinguished Scientist & Director General (Production Coordination & Services Interaction) Dr Chandrika Kaushik and Vice Chancellor, RRU Prof (Dr) Bimal N Patel in the presence of Raksha Mantri Shri Rajnath Singh at South Block, New Delhi on December 22, 2025. Secretary, Department of Defence R&D and Chairman, DRDO Dr Samir V Kamat was also present on the occasion. The MoU aims to strengthen India’s self-reliance in defence and internal security technologies, in line with the national vision of Aatmanirbhar Bharat and the whole-of-nation approach during Amrit Kaal. It reflects a shared commitment to integrating technology, knowledge and operational insight to enhance national security preparedness and reinforce India’s strategic autonomy in internal security. Rashtriya Raksha University, an institution of national importance under the Ministry of Home Affairs and the University Grants Commission (UGC)-designated Nodal Centre for Defence Studies, brings strong academic, training and policy expertise in the domain of internal security. DRDO, the nation’s premier defence R&D organisation, contributes cutting-edge indigenous technologies and system-level expertise to meet the requirements of the Armed Forces and security agencies. Under the MoU, both organisations will collaborate on joint research projects, PhD & fellowship programmes and specialised training & capacity-building programmes for security forces. The collaboration will also include studies on emerging operational challenges, technology gap analysis, forecasting of future requirements, and life-cycle management of DRDO-developed systems inducted into the Central Armed Police Forces and other agencies under the Ministry of Home Affairs. *** VK/Savvy (रिलीज़ आईडी: 2207312)",
    "scraped_at": "2025-12-22T09:53:14.904280"
  },
  {
    "id": "2207348",
    "ministry": "Ministry of Statistics & Programme Implementation",
    "title": "MoSPI is set to convene a Pre-release Consultative Workshop on the Base Revision of GDP, CPI and IIP on 23rd December 2025 at Bharat Mandapam, New Delhi",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207348",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Statistics & Programme Implementation MoSPI is set to convene a Pre-release Consultative Workshop on the Base Revision of GDP, CPI and IIP on 23rd December 2025 at Bharat Mandapam, New Delhi New series of CPI with Base Year (2024=100) is scheduled to be released 12th February, 2026 New series of National Accounts with FY 2022-23 as Base Year is scheduled to be released on 27th February, 2026 New series of IIP with Base Year 2022-23 is scheduled to be released on 28th May, 2026 प्रविष्टि तिथि:\r\n                22 DEC 2025 2:15PM by PIB Delhi The Ministry of Statistics and Programme Implementation (MoSPI) is organizing the Second Pre-release Consultative Workshop on the Base Revision of the Gross Domestic Product (GDP), Consumer Price Index (CPI) and Index of Industrial Production (IIP) on 23 rd December, 2025 at Bharat Mandapam, Pragati Maidan, New Delhi. The First Pre-release Consultative Workshop was held on 26 th November, 2026 at Mumbai. The primary objective of the workshop is to share the proposed methodological and structural changes in the ongoing base revision of GDP, CPI, and IIP for seeking feedback and comments of the participants. The workshop will bring together a wide spectrum of participants, including eminent economists, experts from financial institutions and the banking sector, subject-matter specialists, users of core statistics, and senior officials from the Central and State Governments. The participation of this diverse group is expected to enrich the discussions and familiarize users with the changes in the revised series. Inaugural session of the Workshop will be graced by the distinguished dignitaries, including Shri Suman K Bery, Vice Chairman, NITI Aayog as the chief guest along with Dr. V. Anantha Nageswaran, Chief Economic Advisor, Dr. Saurabh Garg, Secretary, MoSPI and Shri N. K. Santoshi, Director General (Central Statistics), MoSPI. Inaugural session will be followed by the technical sessions on GDP, CPI and IIP along-with the open house discussions. A booklet containing the brief concept notes on proposed changes in base revision of GDP, CPI, and IIP will also be shared with the participants. The workshop aims to strengthen transparency, foster informed dialogue and ensure broad-based consultation before the release of the revised series of GDP, CPI and IIP. ******** Samrat/ (रिलीज़ आईडी: 2207348) आगंतुक पटल  : 164 Ministry of Statistics & Programme Implementation MoSPI is set to convene a Pre-release Consultative Workshop on the Base Revision of GDP, CPI and IIP on 23rd December 2025 at Bharat Mandapam, New Delhi New series of CPI with Base Year (2024=100) is scheduled to be released 12th February, 2026 New series of National Accounts with FY 2022-23 as Base Year is scheduled to be released on 27th February, 2026 New series of IIP with Base Year 2022-23 is scheduled to be released on 28th May, 2026 प्रविष्टि तिथि:\r\n                        22 DEC 2025 2:15PM by PIB Delhi The Ministry of Statistics and Programme Implementation (MoSPI) is organizing the Second Pre-release Consultative Workshop on the Base Revision of the Gross Domestic Product (GDP), Consumer Price Index (CPI) and Index of Industrial Production (IIP) on 23 rd December, 2025 at Bharat Mandapam, Pragati Maidan, New Delhi. The First Pre-release Consultative Workshop was held on 26 th November, 2026 at Mumbai. The primary objective of the workshop is to share the proposed methodological and structural changes in the ongoing base revision of GDP, CPI, and IIP for seeking feedback and comments of the participants. The workshop will bring together a wide spectrum of participants, including eminent economists, experts from financial institutions and the banking sector, subject-matter specialists, users of core statistics, and senior officials from the Central and State Governments. The participation of this diverse group is expected to enrich the discussions and familiarize users with the changes in the revised series. Inaugural session of the Workshop will be graced by the distinguished dignitaries, including Shri Suman K Bery, Vice Chairman, NITI Aayog as the chief guest along with Dr. V. Anantha Nageswaran, Chief Economic Advisor, Dr. Saurabh Garg, Secretary, MoSPI and Shri N. K. Santoshi, Director General (Central Statistics), MoSPI. Inaugural session will be followed by the technical sessions on GDP, CPI and IIP along-with the open house discussions. A booklet containing the brief concept notes on proposed changes in base revision of GDP, CPI, and IIP will also be shared with the participants. The workshop aims to strengthen transparency, foster informed dialogue and ensure broad-based consultation before the release of the revised series of GDP, CPI and IIP. ******** Samrat/ (रिलीज़ आईडी: 2207348)",
    "scraped_at": "2025-12-22T09:53:16.712604"
  },
  {
    "id": "2207351",
    "ministry": "PIB Headquarters",
    "title": "Viksit Bharat- G RAM G Act 2025",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207351",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters Viksit Bharat- G RAM G Act 2025 “Reforming MGNREGA for Viksit Bharat” Posted On:\r\n                22 DEC 2025 2:27PM by PIB Delhi Introduction Rural employment has been a cornerstone of India’s social protection framework for nearly two decades. Since its enactment in 2005 , the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA ) played a key role in providing wage employment, stabilising rural incomes and creating basic infrastructure. Over time, however, the structure and objectives of rural India have evolved significantly. Rising incomes, expanded connectivity, widespread digital penetration and diversified livelihoods have altered the nature of rural employment needs. Against this backdrop, the President of India has given assent to the Viksit Bharat-Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB-G RAM G) Bill , 2025 marking a significant milestone in the transformation of rural employment policy. The Viksit Bharat-Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB-G RAM G) Act, 2025 represents a comprehensive statutory overhaul of MGNREGA , aligning rural employment with the long-term vision of Viksit Bharat 2047 , while strengthening accountability, infrastructure outcomes and income security. Background of Rural Employment and Development Policy in India Since Independence, rural development policies in India have focused on reducing poverty, improving agricultural productivity, and creating employment for surplus and underemployed rural labour. Wage employment programmes have gradually evolved as key instruments for supporting rural livelihoods while also strengthening basic infrastructure, with approaches adapting to changing socio-economic conditions over time. India’s wage employment initiatives progressed through multiple phases, beginning with early programmes such as the Rural Manpower Programme (1960s) and the Crash Scheme for Rural Employment (1971). These were followed by more structured efforts in the 1980s and 1990s , including the National Rural Employment Programme, Rural Landless Employment Guarantee Programme , later merged into Jawahar Rozgar Yojana (1993), which consolidated into Sampoorna Grameen Rozgar Yojana in 1999, aimed at improving coverage and coordination. Complementary schemes such as the Employment Assurance Scheme and the Food for Work Programme addressed seasonal unemployment and food security. A major shift came with the Maharashtra Employment Guarantee Act of 1977 , which introduced the concept of a statutory right to work. These experiences culminated in the enactment of the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) in 2005 , providing a nationwide legal framework for rural employment generation. MGNREGA Evolution and the Limits of Incremental Reform The Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) was a flagship programme aimed at enhancing livelihood security by providing at least 100 days of guaranteed wage employment each year to rural households willing to undertake unskilled manual work. Over the years, a range of administrative and technological reforms strengthened its implementation, leading to notable improvements in participation, transparency, and digital governance. Women’s participation rose steadily from 48 per cent to 58.15 per cent between FY 2013-14 and FY 2025-26 , Aadhaar seeding expanded sharply, the Aadhaar-Based Payment System was widely adopted, and electronic wage payments became nearly universal. Monitoring of works also improved, with a large expansion in geo-tagged assets and a growing share of individual assets created at the household level. The experience under MGNREGA also highlighted the critical role played by field-level staff, who ensured continuity and scale of implementation despite working with limited administrative resources and staffing. However, alongside these gains, deeper structural issues persisted. Monitoring across several states revealed gaps such as work not found on the ground, expenditure not matching physical progress, use of machines in labour-intensive works, and frequent bypassing of digital attendance systems. Over time, misappropriation accumulated, and only a small proportion of households were able to complete the full one hundred days of employment in the post pandemic period. These trends indicated that while delivery systems improved, the overall architecture of MGNREGA had reached its limits. The Viksit Bharat Guarantee for Rozgar and Ajeevika Mission Gramin Act responds to this experience through a comprehensive legislative reset. It strengthens the implementation framework by increasing the administrative expenditure ceiling from 6 per cent to 9 per cent , providing greater support for staffing, remuneration, training, and technical capacity. This shift reflects a practical and people-centred approach to programme management, moving towards a more professional and adequately supported system. Stronger administrative capacity is expected to improve planning and execution, enhance service delivery, and reinforce accountability, ensuring that the objectives of the new framework are achieved consistently at the village level. Rationale for a New Statutory Framework The need for reform is also rooted in broader socio-economic changes. MGNREGA was built in 2005, but rural India has transformed. Poverty levels declined from 27.1 per cent in 2011-12 to 5.3 per cent in 2022-23 , supported by rising consumption, improved financial access, and expanded welfare coverage. With rural livelihoods becoming more diversified and digitally integrated, the open-ended and demand-driven design of MGNREGA no longer aligns fully with contemporary rural realities. The Viksit Bharat- G RAM G Act, 2025 responds to this context by modernising rural employment guarantees, strengthening accountability, and aligning employment creation with long term infrastructure and climate resilience goals. Key Features of the Viksit Bharat- G RAM G Act, 2025 The Act guarantees 125 days of wage employment per rural household in each financial year to such rural households whose adult members volunteer to undertake unskilled manual work, contributing to income security beyond the earlier 100-day entitlement, with an aggregated 60-day no-work period to ensure the availability of agricultural labour during peak sowing and harvesting season. Workers continue to receive 125 guaranteed days of employment within the remaining 305 days , ensuring that both farmers and labourers benefit. The disbursement of daily wages shall be made on a weekly basis or, in any case, not later than a fortnight after the date on which such work was done. Employment creation is integrated with infrastructure development through four priority verticals: Water security through water-related works Core-rural infrastructure Livelihood- related infrastructure Special works to mitigate extreme weather events All assets created are aggregated into the Viksit Bharat National Rural Infrastructure Stack, ensuring a unified, coordinated national development strategy. Planning is decentralised through Viksit Gram Panchayat Plans , which are prepared locally and spatially integrated with national systems such as PM Gati Shakti. MGNREGA vs VIKSIT BHARAT- G RAM G Act, 2025 The new Act represents a major upgrade over MGNREGA, fixing structural weaknesses while enhancing employment, transparency, planning, and accountability. The Financial Architecture The shift from a central sector scheme to a centrally sponsored framework reflects the inherently local nature of rural employment and asset creation . Under the new architecture, states share both cost and responsibility through a normative allocation framework , creating stronger incentives for effective implementation and preventing misuse. Planning is grounded in regional realities through Gram Panchayat Plans . At the same time, the Centre continues to set standards, while states execute with accountability, resulting in a cooperative partnership that improves efficiency and strengthens outcomes. The total estimated annual requirement of funds on wage, material, and administrative components is Rs. 1,51,282 crore , including the State share. Of this, the estimated Central share is Rs. 95,692.31 crore . This transition does not impose an undue financial burden on states . The funding structure is calibrated to state capacity, with a standard cost-sharing ratio of 60:40 between the Centre and states , enhanced support of 90:10 for North Eastern and Himalayan states, and 100 per cent central funding for Union Territories without legislatures . States were already bearing a share of material and administrative costs under the earlier framework, and the move to predictable normative allocations further supports sound budgeting. Provisions for additional assistance to states during disasters and stronger oversight mechanisms also help reduce long term losses arising from misappropriation, reinforcing fiscal sustainability alongside accountability. Benefits of the Viksit Bharat- G RAM G Act The Act strengthens the rural economy by linking employment generation with productive asset creation, leading to higher household incomes and improved resilience. Priority is given to water-related works, supporting agriculture and groundwater recharge. Investment in core rural infrastructure, such as roads and connectivity, improves market access, while livelihood infrastructure, including storage, markets, and production assets, enables income diversification. Climate resilience is strengthened through works focused on water harvesting, flood drainage, and soil conservation . The guarantee of 125 days of employment raises household earnings, stimulates village-level consumption, and helps reduce distress-driven migration, supported by digital attendance, wage payments, and data-driven planning. Farmers benefit from assured labour availability through state-notified pauses in public works during peak sowing and harvesting seasons, prevention of wage inflation, and improved irrigation, storage, and connectivity . Labourers gain from higher potential earnings, predictable work through Viksit Gram Panchayat Plans, secure digital wage payments, direct benefits from the assets they help create, and a mandatory unemployment allowance . Where work is not provided , a daily unemployment allowance becomes payable after 15 days , with liability resting on the States . The rates and conditions are to be prescribed through rules, ensuring flexibility while safeguarding workers’ rights and promoting the timely provision of employment. Implementing and Monitoring Authorities The Act establishes a clear institutional framework to ensure coordinated, accountable, and transparent implementation of the Mission across national, State, district, block, and village levels. Central and State Gramin Rozgar Guarantee Councils provide policy guidance, review implementation, and strengthen accountability. National and State Steering Committees drive strategic direction, convergence, and performance review. Panchayati Raj Institutions lead planning and execution, with Gram Panchayats implementing at least half of the works in terms of cost. District Programme Coordinators and Programme Officers manage planning, compliance, payments, and social audits. Gram Sabhas play a strengthened role in conducting social audits and ensuring transparency through access to all records. Transparency, Accountability, and Social Protection The Act equips the Central Government with clear enforcement powers to ensure compliance and protect public funds. It authorises the Centre to investigate complaints relating to implementation, suspend fund releases where serious irregularities are detected, and direct corrective or remedial measures to address deficiencies . These provisions strengthen accountability across the system, maintain financial discipline, and enable timely intervention to prevent misuse. The Act also establishes a comprehensive transparency framework covering every stage of implementation. It enables the use of artificial intelligence and biometric authentication to identify irregularities early, supported by Central and State Steering Committees that provide continuous guidance and coordination. A focused approach through four clearly defined rural development verticals allows closer tracking of outcomes. Panchayats are assigned an enhanced role in supervision, complemented by GPS and mobile-based monitoring of works in real time. Real-time MIS dashboards and weekly public disclosures ensure public visibility, while social audits mandated at least once every six months reinforce community participation and trust. Conclusion The Viksit Bharat- Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025, represents a decisive shift in India’s rural employment policy. While MGNREGA achieved significant gains in participation, digitisation, and transparency over time, persistent structural weaknesses limited its effectiveness. The new Act builds on past improvements while addressing their shortcomings through a modern, accountable, and infrastructure-focused framework. By expanding guaranteed employment, aligning work with national development priorities, and embedding strong digital governance, the Act repositions rural employment as a strategic instrument for sustainable growth and resilient livelihoods, fully aligned with the vision of Viksit Bharat 2047. References Ministry of Rural Development https://mnregaweb4.nic.in/netnrega/SocialAuditFindings/SAU_FMRecoveryReport.aspx?lflag=eng&fin_year=2024-2025&source=national&labels=labels&rep_type=SoA&Digest=3uRMVt6308BGCW2QZYttXQ Lok Sabha Bill https://sansad.in/getFile/BillsTexts/LSBillTexts/Asintroduced/As intro1216202512439PM.pdf?source=legislation News on Air https://www.newsonair.gov.in/indias-extreme-poverty-falls-to-5-3-in-2022-2023-says-world-bank/ PIB Press Releases https://www.pib.gov.in/PressNoteDetails.aspx?id=155090&NoteId=155090&ModuleId=3&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207187&reg=3&lang=2 Click here to see PDF ***** PIB Research (Release ID: 2207351) Visitor Counter : 159 Read this release in: हिन्दी , Gujarati PIB Headquarters Viksit Bharat- G RAM G Act 2025 “Reforming MGNREGA for Viksit Bharat” Posted On:\r\n                        22 DEC 2025 2:27PM by PIB Delhi Introduction Rural employment has been a cornerstone of India’s social protection framework for nearly two decades. Since its enactment in 2005 , the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA ) played a key role in providing wage employment, stabilising rural incomes and creating basic infrastructure. Over time, however, the structure and objectives of rural India have evolved significantly. Rising incomes, expanded connectivity, widespread digital penetration and diversified livelihoods have altered the nature of rural employment needs. Against this backdrop, the President of India has given assent to the Viksit Bharat-Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB-G RAM G) Bill , 2025 marking a significant milestone in the transformation of rural employment policy. The Viksit Bharat-Guarantee for Rozgar and Ajeevika Mission (Gramin) (VB-G RAM G) Act, 2025 represents a comprehensive statutory overhaul of MGNREGA , aligning rural employment with the long-term vision of Viksit Bharat 2047 , while strengthening accountability, infrastructure outcomes and income security. Background of Rural Employment and Development Policy in India Since Independence, rural development policies in India have focused on reducing poverty, improving agricultural productivity, and creating employment for surplus and underemployed rural labour. Wage employment programmes have gradually evolved as key instruments for supporting rural livelihoods while also strengthening basic infrastructure, with approaches adapting to changing socio-economic conditions over time. India’s wage employment initiatives progressed through multiple phases, beginning with early programmes such as the Rural Manpower Programme (1960s) and the Crash Scheme for Rural Employment (1971). These were followed by more structured efforts in the 1980s and 1990s , including the National Rural Employment Programme, Rural Landless Employment Guarantee Programme , later merged into Jawahar Rozgar Yojana (1993), which consolidated into Sampoorna Grameen Rozgar Yojana in 1999, aimed at improving coverage and coordination. Complementary schemes such as the Employment Assurance Scheme and the Food for Work Programme addressed seasonal unemployment and food security. A major shift came with the Maharashtra Employment Guarantee Act of 1977 , which introduced the concept of a statutory right to work. These experiences culminated in the enactment of the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) in 2005 , providing a nationwide legal framework for rural employment generation. MGNREGA Evolution and the Limits of Incremental Reform The Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) was a flagship programme aimed at enhancing livelihood security by providing at least 100 days of guaranteed wage employment each year to rural households willing to undertake unskilled manual work. Over the years, a range of administrative and technological reforms strengthened its implementation, leading to notable improvements in participation, transparency, and digital governance. Women’s participation rose steadily from 48 per cent to 58.15 per cent between FY 2013-14 and FY 2025-26 , Aadhaar seeding expanded sharply, the Aadhaar-Based Payment System was widely adopted, and electronic wage payments became nearly universal. Monitoring of works also improved, with a large expansion in geo-tagged assets and a growing share of individual assets created at the household level. The experience under MGNREGA also highlighted the critical role played by field-level staff, who ensured continuity and scale of implementation despite working with limited administrative resources and staffing. However, alongside these gains, deeper structural issues persisted. Monitoring across several states revealed gaps such as work not found on the ground, expenditure not matching physical progress, use of machines in labour-intensive works, and frequent bypassing of digital attendance systems. Over time, misappropriation accumulated, and only a small proportion of households were able to complete the full one hundred days of employment in the post pandemic period. These trends indicated that while delivery systems improved, the overall architecture of MGNREGA had reached its limits. The Viksit Bharat Guarantee for Rozgar and Ajeevika Mission Gramin Act responds to this experience through a comprehensive legislative reset. It strengthens the implementation framework by increasing the administrative expenditure ceiling from 6 per cent to 9 per cent , providing greater support for staffing, remuneration, training, and technical capacity. This shift reflects a practical and people-centred approach to programme management, moving towards a more professional and adequately supported system. Stronger administrative capacity is expected to improve planning and execution, enhance service delivery, and reinforce accountability, ensuring that the objectives of the new framework are achieved consistently at the village level. Rationale for a New Statutory Framework The need for reform is also rooted in broader socio-economic changes. MGNREGA was built in 2005, but rural India has transformed. Poverty levels declined from 27.1 per cent in 2011-12 to 5.3 per cent in 2022-23 , supported by rising consumption, improved financial access, and expanded welfare coverage. With rural livelihoods becoming more diversified and digitally integrated, the open-ended and demand-driven design of MGNREGA no longer aligns fully with contemporary rural realities. The Viksit Bharat- G RAM G Act, 2025 responds to this context by modernising rural employment guarantees, strengthening accountability, and aligning employment creation with long term infrastructure and climate resilience goals. Key Features of the Viksit Bharat- G RAM G Act, 2025 The Act guarantees 125 days of wage employment per rural household in each financial year to such rural households whose adult members volunteer to undertake unskilled manual work, contributing to income security beyond the earlier 100-day entitlement, with an aggregated 60-day no-work period to ensure the availability of agricultural labour during peak sowing and harvesting season. Workers continue to receive 125 guaranteed days of employment within the remaining 305 days , ensuring that both farmers and labourers benefit. The disbursement of daily wages shall be made on a weekly basis or, in any case, not later than a fortnight after the date on which such work was done. Employment creation is integrated with infrastructure development through four priority verticals: Water security through water-related works Core-rural infrastructure Livelihood- related infrastructure Special works to mitigate extreme weather events All assets created are aggregated into the Viksit Bharat National Rural Infrastructure Stack, ensuring a unified, coordinated national development strategy. Planning is decentralised through Viksit Gram Panchayat Plans , which are prepared locally and spatially integrated with national systems such as PM Gati Shakti. MGNREGA vs VIKSIT BHARAT- G RAM G Act, 2025 The new Act represents a major upgrade over MGNREGA, fixing structural weaknesses while enhancing employment, transparency, planning, and accountability. The Financial Architecture The shift from a central sector scheme to a centrally sponsored framework reflects the inherently local nature of rural employment and asset creation . Under the new architecture, states share both cost and responsibility through a normative allocation framework , creating stronger incentives for effective implementation and preventing misuse. Planning is grounded in regional realities through Gram Panchayat Plans . At the same time, the Centre continues to set standards, while states execute with accountability, resulting in a cooperative partnership that improves efficiency and strengthens outcomes. The total estimated annual requirement of funds on wage, material, and administrative components is Rs. 1,51,282 crore , including the State share. Of this, the estimated Central share is Rs. 95,692.31 crore . This transition does not impose an undue financial burden on states . The funding structure is calibrated to state capacity, with a standard cost-sharing ratio of 60:40 between the Centre and states , enhanced support of 90:10 for North Eastern and Himalayan states, and 100 per cent central funding for Union Territories without legislatures . States were already bearing a share of material and administrative costs under the earlier framework, and the move to predictable normative allocations further supports sound budgeting. Provisions for additional assistance to states during disasters and stronger oversight mechanisms also help reduce long term losses arising from misappropriation, reinforcing fiscal sustainability alongside accountability. Benefits of the Viksit Bharat- G RAM G Act The Act strengthens the rural economy by linking employment generation with productive asset creation, leading to higher household incomes and improved resilience. Priority is given to water-related works, supporting agriculture and groundwater recharge. Investment in core rural infrastructure, such as roads and connectivity, improves market access, while livelihood infrastructure, including storage, markets, and production assets, enables income diversification. Climate resilience is strengthened through works focused on water harvesting, flood drainage, and soil conservation . The guarantee of 125 days of employment raises household earnings, stimulates village-level consumption, and helps reduce distress-driven migration, supported by digital attendance, wage payments, and data-driven planning. Farmers benefit from assured labour availability through state-notified pauses in public works during peak sowing and harvesting seasons, prevention of wage inflation, and improved irrigation, storage, and connectivity . Labourers gain from higher potential earnings, predictable work through Viksit Gram Panchayat Plans, secure digital wage payments, direct benefits from the assets they help create, and a mandatory unemployment allowance . Where work is not provided , a daily unemployment allowance becomes payable after 15 days , with liability resting on the States . The rates and conditions are to be prescribed through rules, ensuring flexibility while safeguarding workers’ rights and promoting the timely provision of employment. Implementing and Monitoring Authorities The Act establishes a clear institutional framework to ensure coordinated, accountable, and transparent implementation of the Mission across national, State, district, block, and village levels. Central and State Gramin Rozgar Guarantee Councils provide policy guidance, review implementation, and strengthen accountability. National and State Steering Committees drive strategic direction, convergence, and performance review. Panchayati Raj Institutions lead planning and execution, with Gram Panchayats implementing at least half of the works in terms of cost. District Programme Coordinators and Programme Officers manage planning, compliance, payments, and social audits. Gram Sabhas play a strengthened role in conducting social audits and ensuring transparency through access to all records. Transparency, Accountability, and Social Protection The Act equips the Central Government with clear enforcement powers to ensure compliance and protect public funds. It authorises the Centre to investigate complaints relating to implementation, suspend fund releases where serious irregularities are detected, and direct corrective or remedial measures to address deficiencies . These provisions strengthen accountability across the system, maintain financial discipline, and enable timely intervention to prevent misuse. The Act also establishes a comprehensive transparency framework covering every stage of implementation. It enables the use of artificial intelligence and biometric authentication to identify irregularities early, supported by Central and State Steering Committees that provide continuous guidance and coordination. A focused approach through four clearly defined rural development verticals allows closer tracking of outcomes. Panchayats are assigned an enhanced role in supervision, complemented by GPS and mobile-based monitoring of works in real time. Real-time MIS dashboards and weekly public disclosures ensure public visibility, while social audits mandated at least once every six months reinforce community participation and trust. Conclusion The Viksit Bharat- Guarantee for Rozgar and Ajeevika Mission (Gramin) Act, 2025, represents a decisive shift in India’s rural employment policy. While MGNREGA achieved significant gains in participation, digitisation, and transparency over time, persistent structural weaknesses limited its effectiveness. The new Act builds on past improvements while addressing their shortcomings through a modern, accountable, and infrastructure-focused framework. By expanding guaranteed employment, aligning work with national development priorities, and embedding strong digital governance, the Act repositions rural employment as a strategic instrument for sustainable growth and resilient livelihoods, fully aligned with the vision of Viksit Bharat 2047. References Ministry of Rural Development https://mnregaweb4.nic.in/netnrega/SocialAuditFindings/SAU_FMRecoveryReport.aspx?lflag=eng&fin_year=2024-2025&source=national&labels=labels&rep_type=SoA&Digest=3uRMVt6308BGCW2QZYttXQ Lok Sabha Bill https://sansad.in/getFile/BillsTexts/LSBillTexts/Asintroduced/As intro1216202512439PM.pdf?source=legislation News on Air https://www.newsonair.gov.in/indias-extreme-poverty-falls-to-5-3-in-2022-2023-says-world-bank/ PIB Press Releases https://www.pib.gov.in/PressNoteDetails.aspx?id=155090&NoteId=155090&ModuleId=3&reg=3&lang=2 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207187&reg=3&lang=2 Click here to see PDF ***** PIB Research (Release ID: 2207351)",
    "scraped_at": "2025-12-22T09:53:18.483541"
  },
  {
    "id": "2207293",
    "ministry": "PIB Headquarters",
    "title": "PESA Mahotsav",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2207293",
    "date": "22 DEC 2025",
    "content": "Press Release:Press Information Bureau PIB Headquarters PESA Mahotsav Celebrating Community-Led Governance under the PESA Act प्रविष्टि तिथि:\r\n                22 DEC 2025 10:55AM by PIB Delhi Key Takeaways The Ministry of Panchayati Raj and Tribal Affairs jointly celebrate the PESA Mahotsav on December 23 and 24 every year. This marks the anniversary of the Panchayats Extension to Scheduled Areas (PESA) Act, 1996 . The PESA Act empowers tribal communities by extending Panchayati Raj provisions to their scheduled lands , protecting them from being removed or alienated in their lands. 2025’s PESA Mahotsav will be held in Visakhapatnam The objective would be to spread awareness on the act and improving the capabilities of local level bodies in Scheduled Areas. Introduction Tribal communities in India make up about 8.6% of the population. Areas with significant tribal populations are designated as Scheduled Areas by the President of India in terms of Article 244 of the Constitution so that tribals can have control over their local resources, development, and social life. In 1993, India's Constitution was amended ( 73rd Amendment ) to establish Panchayati Raj Institutions or local governance structures at the village, block, and district levels . The amendment devolved power to local-level institutions, empowering villagers to make decisions regarding their development and communities. However, the 73rd Amendment Act did not apply to tribal Scheduled Areas automatically. In 1996, the Panchayats (Extension to Scheduled Areas) Act (PESA) came into force, giving similar powers to tribal communities in Scheduled Areas to self-govern. This landmark legislation restores and protects the rights of tribal communities over their land, water, forest resources, culture, and governance systems. It extends decentralised democracy to tribal communities by empowering tribal Gram Sabhas . The PESA Act also recognises that tribal communities have unique traditional governance systems and special developmental needs. Eight of the ten states with tribal Scheduled Areas have framed their PESA rules, while Odisha and Jharkhand have created draft rules. PESA Mahotsav 2025, Dec 23-24, Visakhapatnam, Andhra Pradesh The Ministry of Panchayati Raj will hold the PESA Mahotsav in Visakhapatnam on 23–24 December 2025 , coinciding with the anniversary of the PESA Act, 1996. The Mahotsav is envisioned as a landmark initiative that will showcase traditional sports like Chakki Khel , Uppanna Barelu, Cholo and Puli Meka, Mallakhamba, Pithool, Gedi Doud and Sikor; cultural heritage and tribal cuisine . Its objective is to empower tribal communities by providing a nationally recognised platform to celebrate, preserve and promote their rich traditions. Panchayati Raj in India — 73rd Constitutional Amendment (1993) The 73 rd Constitutional Amendment (1993) added Part IX and the Eleventh Schedule to the Constitution. Part IX of the Constitution delegates power to institutions at the village and district levels , also known as the Panchayats. The Eleventh Schedule lists 29 subjects over which these local institutions have decision-making powers. The Amendment made way for a more decentralised democracy. Part IX of the Constitutional amendment established a three-tier structure of Panchayati Raj institutions – Gram Panchayats at the village level, Panchayat Samitis at the intermediate or block level (representing a group of villages), and Zilla Parishads at the district level. All the members of these three bodies are elected. Further, the chairperson of panchayats at the intermediate and district levels are indirectly elected from amongst the elected members. But at the village level, the election of Panchayat Sarpanch may be direct or indirect. At every level of Panchayat, seats are reserved for Scheduled Castes and Scheduled Tribes in proportion to their population. A Gram Sabha is a body consisting of all the persons registered in the electoral rolls of a village within the area of a Gram Panchayat. The powers and functions of Gram Sabhas are determined by state legislatures through law. PESA Act of 1996 The PESA Act extends the Panchayati Raj system or the 73 rd Constitutional Amendment provisions to the tribal-dominated Fifth Schedule Areas . The Act gives Gram Sabhas and Panchayats in these areas additional powers to maintain their traditional governance systems. Salient Features of the PESA Act The enhanced powers of the Gram Sabhas form the heart of the PESA Act , allowing tribal communities more authority over their own village governance. Even though there are constitutional rules for Panchayats and Gram Sabhas, the PESA Act overrides them, and the state legislatures cannot make any Panchayat law violating these features. Scheduled Areas and the PESA Act The Constitution’s Fifth Schedule empowers the government to establish Scheduled Areas in states where Scheduled Tribes (STs) reside (not including the states of Assam, Meghalaya, Tripura and Mizoram). At present, 10 states have Fifth Scheduled Areas: # Name of the State Villages Panchayats Blocks Districts Fully covered Partially covered 1 Andhra Pradesh 1,586 588 36 0 5 2 Chhattisgarh 9,977 5,050 85 13 6 3 Gujarat 4,503 2,388 40 4 7 4 Himachal Pradesh 806 151 7 2 1 5 Jharkhand 16,022 2,074 131 13 3 6 Madhya Pradesh 11,784 5,211 89 5 15 7 Maharashtra 5,905 2,835 59 0 12 8 Odisha 19,311 1,918 119 6 7 9 Rajasthan 5,054 1,194 26 2 3 10 Telangana 2,616 631 72 0 4 Total 77,564 22,040 664 45 63 Andhra Pradesh, Chhattisgarh, Gujarat, Himachal Pradesh, Maharashtra, Madhya Pradesh, Rajasthan and Telangana have framed their PESA Rules. Odisha and Jharkhand have framed their draft PESA Rules. Ministry Initiatives for PESA Act Implementation The Ministry of Panchayati Raj has taken various steps to implement the PESA Act effectively, including organizing national and regional conferences on the Act and training personnel on its provisions. MoPR and seven anchor states conducted two rounds of state-level master trainer training in 2024-25 to train elected representatives on all PESA provisions. Over 1 lakh participants at the state, district, and block levels were trained. The PESA-Gram Panchayat Development Plan Portal was also launched during the National Conference on the PESA Act in September 2024. It facilitates planning and monitoring of development activities aligned with the rights and priorities of tribal communities under the PESA Act. The portal enables hamlet- and village-wise resource allocation of Central Finance Commission grants, State Finance Commission grants, Centrally Sponsored Schemes, State Schemes, and other funds in PESA Gram Panchayats, which they can use to plan village-wise activities. PESA DAY The Ministry of Panchayati Raj asked all ten PESA States to celebrate December 24, 2024, as PESA Day. The goal was to raise awareness about the PESA Act and strengthen governance by empowering Gram Sabhas and improving Gram Panchayats in Scheduled Areas. The national event was held in Ranchi and chaired by the Secretary, Ministry of Panchayati Raj. The MoPR established a dedicated PESA Cell, staffed with ministerial team and consultants (Social Sciences, Legal and Finance sectors) to strengthen oversight and coordination. Manuals on the PESA Act were translated to various languages, including tribal languages (in collaboration with the Ministry of Tribal Affairs). The manuals were translated to Telugu, Marathi, Gujarati and Odia, and the tribal languages of Santhali, Gondi Bhili and Mundari. The MoPR sent proposals to 16 universities for the establishment of Centres of Excellence in central universities to institutionalise PESA capacity-building and documentation. The Indira Gandhi National Tribal University, Amarkantak (central government share: Rs.8.01 crore for 5 years) signed an MoU on July 24, 2025, with MoPR and the Government of Madhya Pradesh for one such CoE. A Programme Advisory Board was constituted to the CoEs and a 2025–26 Work Plan was approved with focus on documentation of customs, dispute resolution models, training manuals, information and communication materials on PESA in local/tribal languages, and 5 model PESA Gram Sabhas. PESA Act Success Stories and Best Practices The PESA Act has empowered tribal communities. Exercising these powers, tribal communities across the country have defended their rights, promoted inclusive development, strengthened accountability, and driven their communities' development. \"PESA in Action: Stories of Strength and Self-Governance\", a compilation of 40 PESA Act success stories, was published in July 2025. The stories detail how tribal communities have used the powers given to them by the Act, to strengthen and empower their Gram Sabhas, produce and manage forest produce, take charge of minor minerals in their lands, and manage water bodies, among other achievements. Empowered Gram Sabha Increases Economic Activity Khamdhogi is a village of 443 people in Kanker district, North Bastar, Chhattisgarh, a Fifth Schedule Area. According to the Chhattisgarh PESA Rules 2022, a Gram Sabha was established in this village. The villagers, living in the remote hinterlands, were struggling with development and finding livelihood options. They lacked technical knowledge and were rooted in traditional means of livelihood. Many were also living below the poverty line. Even with the establishment of the Gram Sabha, community participation was low. To overcome these challenges, the villagers were trained and organised into various committees. The training allowed them to gain technical knowledge. To increase community participation, the presence of one man and one woman from each household during the Gram Sabha's decision-making meetings was made mandatory. Due to these initiatives, the villagers began forest produce collection, fisheries, bamboo rafting, and other activities, increasing their economic output. These initiatives, led by the Gram Sabha, helped the community come together to manage village affairs and promote sustainable livelihoods. Combining Traditional Practices with PESA Act Provisions The PESA Act empowers tribal communities to continue their traditional cultural and economic practices. Chilgoza pine nuts are a prized forest produce in Kinnaur district, Himachal Pradesh. The Rarang Gram Panchayat traditionally harvests these nuts according to their customs. According to the Himachal Pradesh PESA Rules 2011, the state's forest department must consult the Gram Sabha before preparing any plan for the harvesting of forest produce. Moreover, the rules assert that communities have the right to manage and utilize minor forest produce, even beyond their immediate village boundaries, as per their traditional practices. Due to these rules the Rarang Gram Panchayat was able to implement their customary laws and practices. The sale of the nuts to traders is equally divided among all households. Every family is expected to provide a few people to collect the harvest. Forest plots are pre-allocated to individual households, and families have complete control over these plots. The PESA Act has strengthened equity and inclusive, strengthened community decision-making power and institutions, preserved traditional practices and made way for sustainable resource management. Management of Minor Minerals Leads to Grassroots Transformation Vadagudem village is located on the Godavari basin, a prime location for sand mining. The village formed a Tribal Sand Mining Cooperative Society to manage sand mining in their area. This initiative transformed 100 families into direct stakeholders in the Society. The Gram Sabha approved sand mining rights for this Society from the river basin. The mining operation generates Rs. 40 lakh annually in revenue. These funds are channelled into village infrastructure development, education, healthcare, and livelihood support. The Panchayat also receives revenue through seigniorage charges, which is used for community development. The PESA Act has led to a significant boost in tribal welfare, self-employment, and rural development, empowering tribal communities economically and socially. Fighting Displacement with the PESA Act When the forest department surveyed the area around Bhim Talai, a remote village in Udaipur district, Rajasthan, they included the village and four other revenue villages within the 'Phulwari Ki Naal Wildlife Sanctuary'. This sanctuary spans 500 sq km and borders Gujarat. The forest department declared the tribal area a critical habitat and began displacing the Bhil tribal community who had lived there for generations. The villagers organized themselves into a Gram Sabha under the PESA Act with help from a non-profit organization, which also provided legal awareness training. The Gram Sabha held a special meeting and unanimously passed a resolution that the village would not be evacuated, citing the Rajasthan Panchayati Raj Act 1999, which requires Gram Sabha approval before any land acquisition. The Medi Gram Panchayat approved this resolution. Today, the Bhil community continues to live securely, with their traditions and land protected under the PESA Act. Conclusion PESA Mahotsav highlights the Government of India’s sustained commitment to strengthening self-governance in Scheduled Areas under the PESA Act . Through policy reforms, capacity-building, cultural documentation, digital initiatives and community-led governance efforts, the Ministry of Panchayati Raj is strengthening and empowering Gram Sabhas. These efforts promote community-led governance and ensure that tribal communities play a central role in shaping their own development. References https://x.com/mopr_goi/status/1998628574266380451/photo/1 https://www.mha.gov.in/sites/default/files/PESAAct1996_0.pdf chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://www.mea.gov.in/images/pdf1/s5.pdf https://secforuts.mha.gov.in/73rd-amendment-of-panchayati-raj-in-india/ chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://cdnbbsr.s3waas.gov.in/s316026d60ff9b54410b3435b403afd226/uploads/2023/02/2023022123-1.pdf https://panchayat.gov.in/en/pesa-act/ Click here to download PDF ********* PIB Research (रिलीज़ आईडी: 2207293) आगंतुक पटल  : 501 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Gujarati , हिन्दी , Tamil PIB Headquarters PESA Mahotsav Celebrating Community-Led Governance under the PESA Act प्रविष्टि तिथि:\r\n                        22 DEC 2025 10:55AM by PIB Delhi Key Takeaways The Ministry of Panchayati Raj and Tribal Affairs jointly celebrate the PESA Mahotsav on December 23 and 24 every year. This marks the anniversary of the Panchayats Extension to Scheduled Areas (PESA) Act, 1996 . The PESA Act empowers tribal communities by extending Panchayati Raj provisions to their scheduled lands , protecting them from being removed or alienated in their lands. 2025’s PESA Mahotsav will be held in Visakhapatnam The objective would be to spread awareness on the act and improving the capabilities of local level bodies in Scheduled Areas. Introduction Tribal communities in India make up about 8.6% of the population. Areas with significant tribal populations are designated as Scheduled Areas by the President of India in terms of Article 244 of the Constitution so that tribals can have control over their local resources, development, and social life. In 1993, India's Constitution was amended ( 73rd Amendment ) to establish Panchayati Raj Institutions or local governance structures at the village, block, and district levels . The amendment devolved power to local-level institutions, empowering villagers to make decisions regarding their development and communities. However, the 73rd Amendment Act did not apply to tribal Scheduled Areas automatically. In 1996, the Panchayats (Extension to Scheduled Areas) Act (PESA) came into force, giving similar powers to tribal communities in Scheduled Areas to self-govern. This landmark legislation restores and protects the rights of tribal communities over their land, water, forest resources, culture, and governance systems. It extends decentralised democracy to tribal communities by empowering tribal Gram Sabhas . The PESA Act also recognises that tribal communities have unique traditional governance systems and special developmental needs. Eight of the ten states with tribal Scheduled Areas have framed their PESA rules, while Odisha and Jharkhand have created draft rules. PESA Mahotsav 2025, Dec 23-24, Visakhapatnam, Andhra Pradesh The Ministry of Panchayati Raj will hold the PESA Mahotsav in Visakhapatnam on 23–24 December 2025 , coinciding with the anniversary of the PESA Act, 1996. The Mahotsav is envisioned as a landmark initiative that will showcase traditional sports like Chakki Khel , Uppanna Barelu, Cholo and Puli Meka, Mallakhamba, Pithool, Gedi Doud and Sikor; cultural heritage and tribal cuisine . Its objective is to empower tribal communities by providing a nationally recognised platform to celebrate, preserve and promote their rich traditions. Panchayati Raj in India — 73rd Constitutional Amendment (1993) The 73 rd Constitutional Amendment (1993) added Part IX and the Eleventh Schedule to the Constitution. Part IX of the Constitution delegates power to institutions at the village and district levels , also known as the Panchayats. The Eleventh Schedule lists 29 subjects over which these local institutions have decision-making powers. The Amendment made way for a more decentralised democracy. Part IX of the Constitutional amendment established a three-tier structure of Panchayati Raj institutions – Gram Panchayats at the village level, Panchayat Samitis at the intermediate or block level (representing a group of villages), and Zilla Parishads at the district level. All the members of these three bodies are elected. Further, the chairperson of panchayats at the intermediate and district levels are indirectly elected from amongst the elected members. But at the village level, the election of Panchayat Sarpanch may be direct or indirect. At every level of Panchayat, seats are reserved for Scheduled Castes and Scheduled Tribes in proportion to their population. A Gram Sabha is a body consisting of all the persons registered in the electoral rolls of a village within the area of a Gram Panchayat. The powers and functions of Gram Sabhas are determined by state legislatures through law. PESA Act of 1996 The PESA Act extends the Panchayati Raj system or the 73 rd Constitutional Amendment provisions to the tribal-dominated Fifth Schedule Areas . The Act gives Gram Sabhas and Panchayats in these areas additional powers to maintain their traditional governance systems. Salient Features of the PESA Act The enhanced powers of the Gram Sabhas form the heart of the PESA Act , allowing tribal communities more authority over their own village governance. Even though there are constitutional rules for Panchayats and Gram Sabhas, the PESA Act overrides them, and the state legislatures cannot make any Panchayat law violating these features. Scheduled Areas and the PESA Act The Constitution’s Fifth Schedule empowers the government to establish Scheduled Areas in states where Scheduled Tribes (STs) reside (not including the states of Assam, Meghalaya, Tripura and Mizoram). At present, 10 states have Fifth Scheduled Areas: # Name of the State Villages Panchayats Blocks Districts Fully covered Partially covered 1 Andhra Pradesh 1,586 588 36 0 5 2 Chhattisgarh 9,977 5,050 85 13 6 3 Gujarat 4,503 2,388 40 4 7 4 Himachal Pradesh 806 151 7 2 1 5 Jharkhand 16,022 2,074 131 13 3 6 Madhya Pradesh 11,784 5,211 89 5 15 7 Maharashtra 5,905 2,835 59 0 12 8 Odisha 19,311 1,918 119 6 7 9 Rajasthan 5,054 1,194 26 2 3 10 Telangana 2,616 631 72 0 4 Total 77,564 22,040 664 45 63 Andhra Pradesh, Chhattisgarh, Gujarat, Himachal Pradesh, Maharashtra, Madhya Pradesh, Rajasthan and Telangana have framed their PESA Rules. Odisha and Jharkhand have framed their draft PESA Rules. Ministry Initiatives for PESA Act Implementation The Ministry of Panchayati Raj has taken various steps to implement the PESA Act effectively, including organizing national and regional conferences on the Act and training personnel on its provisions. MoPR and seven anchor states conducted two rounds of state-level master trainer training in 2024-25 to train elected representatives on all PESA provisions. Over 1 lakh participants at the state, district, and block levels were trained. The PESA-Gram Panchayat Development Plan Portal was also launched during the National Conference on the PESA Act in September 2024. It facilitates planning and monitoring of development activities aligned with the rights and priorities of tribal communities under the PESA Act. The portal enables hamlet- and village-wise resource allocation of Central Finance Commission grants, State Finance Commission grants, Centrally Sponsored Schemes, State Schemes, and other funds in PESA Gram Panchayats, which they can use to plan village-wise activities. PESA DAY The Ministry of Panchayati Raj asked all ten PESA States to celebrate December 24, 2024, as PESA Day. The goal was to raise awareness about the PESA Act and strengthen governance by empowering Gram Sabhas and improving Gram Panchayats in Scheduled Areas. The national event was held in Ranchi and chaired by the Secretary, Ministry of Panchayati Raj. The MoPR established a dedicated PESA Cell, staffed with ministerial team and consultants (Social Sciences, Legal and Finance sectors) to strengthen oversight and coordination. Manuals on the PESA Act were translated to various languages, including tribal languages (in collaboration with the Ministry of Tribal Affairs). The manuals were translated to Telugu, Marathi, Gujarati and Odia, and the tribal languages of Santhali, Gondi Bhili and Mundari. The MoPR sent proposals to 16 universities for the establishment of Centres of Excellence in central universities to institutionalise PESA capacity-building and documentation. The Indira Gandhi National Tribal University, Amarkantak (central government share: Rs.8.01 crore for 5 years) signed an MoU on July 24, 2025, with MoPR and the Government of Madhya Pradesh for one such CoE. A Programme Advisory Board was constituted to the CoEs and a 2025–26 Work Plan was approved with focus on documentation of customs, dispute resolution models, training manuals, information and communication materials on PESA in local/tribal languages, and 5 model PESA Gram Sabhas. PESA Act Success Stories and Best Practices The PESA Act has empowered tribal communities. Exercising these powers, tribal communities across the country have defended their rights, promoted inclusive development, strengthened accountability, and driven their communities' development. \"PESA in Action: Stories of Strength and Self-Governance\", a compilation of 40 PESA Act success stories, was published in July 2025. The stories detail how tribal communities have used the powers given to them by the Act, to strengthen and empower their Gram Sabhas, produce and manage forest produce, take charge of minor minerals in their lands, and manage water bodies, among other achievements. Empowered Gram Sabha Increases Economic Activity Khamdhogi is a village of 443 people in Kanker district, North Bastar, Chhattisgarh, a Fifth Schedule Area. According to the Chhattisgarh PESA Rules 2022, a Gram Sabha was established in this village. The villagers, living in the remote hinterlands, were struggling with development and finding livelihood options. They lacked technical knowledge and were rooted in traditional means of livelihood. Many were also living below the poverty line. Even with the establishment of the Gram Sabha, community participation was low. To overcome these challenges, the villagers were trained and organised into various committees. The training allowed them to gain technical knowledge. To increase community participation, the presence of one man and one woman from each household during the Gram Sabha's decision-making meetings was made mandatory. Due to these initiatives, the villagers began forest produce collection, fisheries, bamboo rafting, and other activities, increasing their economic output. These initiatives, led by the Gram Sabha, helped the community come together to manage village affairs and promote sustainable livelihoods. Combining Traditional Practices with PESA Act Provisions The PESA Act empowers tribal communities to continue their traditional cultural and economic practices. Chilgoza pine nuts are a prized forest produce in Kinnaur district, Himachal Pradesh. The Rarang Gram Panchayat traditionally harvests these nuts according to their customs. According to the Himachal Pradesh PESA Rules 2011, the state's forest department must consult the Gram Sabha before preparing any plan for the harvesting of forest produce. Moreover, the rules assert that communities have the right to manage and utilize minor forest produce, even beyond their immediate village boundaries, as per their traditional practices. Due to these rules the Rarang Gram Panchayat was able to implement their customary laws and practices. The sale of the nuts to traders is equally divided among all households. Every family is expected to provide a few people to collect the harvest. Forest plots are pre-allocated to individual households, and families have complete control over these plots. The PESA Act has strengthened equity and inclusive, strengthened community decision-making power and institutions, preserved traditional practices and made way for sustainable resource management. Management of Minor Minerals Leads to Grassroots Transformation Vadagudem village is located on the Godavari basin, a prime location for sand mining. The village formed a Tribal Sand Mining Cooperative Society to manage sand mining in their area. This initiative transformed 100 families into direct stakeholders in the Society. The Gram Sabha approved sand mining rights for this Society from the river basin. The mining operation generates Rs. 40 lakh annually in revenue. These funds are channelled into village infrastructure development, education, healthcare, and livelihood support. The Panchayat also receives revenue through seigniorage charges, which is used for community development. The PESA Act has led to a significant boost in tribal welfare, self-employment, and rural development, empowering tribal communities economically and socially. Fighting Displacement with the PESA Act When the forest department surveyed the area around Bhim Talai, a remote village in Udaipur district, Rajasthan, they included the village and four other revenue villages within the 'Phulwari Ki Naal Wildlife Sanctuary'. This sanctuary spans 500 sq km and borders Gujarat. The forest department declared the tribal area a critical habitat and began displacing the Bhil tribal community who had lived there for generations. The villagers organized themselves into a Gram Sabha under the PESA Act with help from a non-profit organization, which also provided legal awareness training. The Gram Sabha held a special meeting and unanimously passed a resolution that the village would not be evacuated, citing the Rajasthan Panchayati Raj Act 1999, which requires Gram Sabha approval before any land acquisition. The Medi Gram Panchayat approved this resolution. Today, the Bhil community continues to live securely, with their traditions and land protected under the PESA Act. Conclusion PESA Mahotsav highlights the Government of India’s sustained commitment to strengthening self-governance in Scheduled Areas under the PESA Act . Through policy reforms, capacity-building, cultural documentation, digital initiatives and community-led governance efforts, the Ministry of Panchayati Raj is strengthening and empowering Gram Sabhas. These efforts promote community-led governance and ensure that tribal communities play a central role in shaping their own development. References https://x.com/mopr_goi/status/1998628574266380451/photo/1 https://www.mha.gov.in/sites/default/files/PESAAct1996_0.pdf chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://www.mea.gov.in/images/pdf1/s5.pdf https://secforuts.mha.gov.in/73rd-amendment-of-panchayati-raj-in-india/ chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://cdnbbsr.s3waas.gov.in/s316026d60ff9b54410b3435b403afd226/uploads/2023/02/2023022123-1.pdf https://panchayat.gov.in/en/pesa-act/ Click here to download PDF ********* PIB Research (रिलीज़ आईडी: 2207293)",
    "scraped_at": "2025-12-22T09:53:20.543922"
  }
]