[
  {
    "id": "2206437",
    "ministry": "President's Secretariat",
    "title": "PRESIDENT OF INDIA INAUGURATES NATIONAL CONFERENCE FOR THE CHAIRPERSONS OF PUBLIC SERVICE COMMISSIONS AT HYDERABAD",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206437",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau President's Secretariat PRESIDENT OF INDIA INAUGURATES NATIONAL CONFERENCE FOR THE CHAIRPERSONS OF PUBLIC SERVICE COMMISSIONS AT HYDERABAD PUBLIC SERVICE COMMISSIONS SHOULD NOT ONLY BE GUIDED BY THE IDEAL OF EQUALITY OF OPPORTUNITY BUT SHOULD ALSO TRY TO ACHIEVE THE GOAL OF EQUALITY OF OUTCOMES: PRESIDENT DROUPADI MURMU PUBLIC SERVICE COMMISSIONS SHOULD GIVE HIGHEST PRIORITY TO THE ASPECT OF HONESTY AND INTEGRITY OF THE CANDIDATES THEY RECRUIT: PRESIDENT DROUPADI MURMU Posted On:\r\n                19 DEC 2025 12:34PM by PIB Delhi The President of India, Smt Droupadi Murmu, inaugurated the National Conference for the Chairpersons of Public Service Commissions, being organised by the Telangana Public Service Commission, at Hyderabad, Telangana today (December 19, 2025). Speaking on the occasion, the President said that our Constitution makers dedicated an entire part of the Constitution to Services and Public Service Commissions. This highlights the significance they attached to the roles and functions of the Public Service Commissions for the Union and for the States. The President said that our Constitutional ideals of social, economic and political justice, and equality of status and of opportunity are most pertinent to the functioning of the Public Service Commissions. The Preamble of the Constitution, the Fundamental Right of equality of opportunity in matters of public employment and the Directive Principle guiding the State to secure a social order for the promotion of welfare of the people indicate the pathways for the Public Service Commissions. The Public Service Commissions should not only be guided by the ideal of equality of opportunity but should also try to achieve the goal of equality of outcomes. The Commissions are change-agents which promote equality and equity. The President said that impartiality, continuity and stability are imparted to the process of governance by what is called the ‘permanent executive’ or the body of public servants selected by the Public Service Commissions. Integrity, sensitivity and competence of the civil servants constituting the permanent executive are of utmost importance for implementing the people-oriented policies at national and state levels. She stated that Public Service Commissions should give highest priority to the aspect of honesty and integrity of the candidates they recruit. Honesty and integrity are paramount as well as non-negotiable. She underlined that lack of skills and competencies can be dealt with through learning interventions and several other strategies. But lack of integrity may cause grave challenges which may be impossible to overcome. The President said that young people seeking employment as civil servants should have the inclination to work for the marginalised and the vulnerable. Our civil servants should be particularly sensitive to the needs and aspirations of women. Gender-sensitisation should be given high priority by Public Service Commissions. The President said that India, as the world’s fastest growing major economy and also a nation marked by enormous diversity, needs most effective governance systems at all levels. The country is aiming to be the third largest economy in the world in the near future. We are also moving towards achieving the goal of ‘Viksit Bharat’ by 2047. She expressed confidence that the Public Service Commissions will continue to fulfil their responsibilities and contribute towards building a future-ready team of civil servants selected and guided by them. Please click here to see the President's Speech- *** MJPS/SR (Release ID: 2206437) Visitor Counter : 205 Read this release in: हिन्दी , Gujarati , Telugu President's Secretariat PRESIDENT OF INDIA INAUGURATES NATIONAL CONFERENCE FOR THE CHAIRPERSONS OF PUBLIC SERVICE COMMISSIONS AT HYDERABAD PUBLIC SERVICE COMMISSIONS SHOULD NOT ONLY BE GUIDED BY THE IDEAL OF EQUALITY OF OPPORTUNITY BUT SHOULD ALSO TRY TO ACHIEVE THE GOAL OF EQUALITY OF OUTCOMES: PRESIDENT DROUPADI MURMU PUBLIC SERVICE COMMISSIONS SHOULD GIVE HIGHEST PRIORITY TO THE ASPECT OF HONESTY AND INTEGRITY OF THE CANDIDATES THEY RECRUIT: PRESIDENT DROUPADI MURMU Posted On:\r\n                        19 DEC 2025 12:34PM by PIB Delhi The President of India, Smt Droupadi Murmu, inaugurated the National Conference for the Chairpersons of Public Service Commissions, being organised by the Telangana Public Service Commission, at Hyderabad, Telangana today (December 19, 2025). Speaking on the occasion, the President said that our Constitution makers dedicated an entire part of the Constitution to Services and Public Service Commissions. This highlights the significance they attached to the roles and functions of the Public Service Commissions for the Union and for the States. The President said that our Constitutional ideals of social, economic and political justice, and equality of status and of opportunity are most pertinent to the functioning of the Public Service Commissions. The Preamble of the Constitution, the Fundamental Right of equality of opportunity in matters of public employment and the Directive Principle guiding the State to secure a social order for the promotion of welfare of the people indicate the pathways for the Public Service Commissions. The Public Service Commissions should not only be guided by the ideal of equality of opportunity but should also try to achieve the goal of equality of outcomes. The Commissions are change-agents which promote equality and equity. The President said that impartiality, continuity and stability are imparted to the process of governance by what is called the ‘permanent executive’ or the body of public servants selected by the Public Service Commissions. Integrity, sensitivity and competence of the civil servants constituting the permanent executive are of utmost importance for implementing the people-oriented policies at national and state levels. She stated that Public Service Commissions should give highest priority to the aspect of honesty and integrity of the candidates they recruit. Honesty and integrity are paramount as well as non-negotiable. She underlined that lack of skills and competencies can be dealt with through learning interventions and several other strategies. But lack of integrity may cause grave challenges which may be impossible to overcome. The President said that young people seeking employment as civil servants should have the inclination to work for the marginalised and the vulnerable. Our civil servants should be particularly sensitive to the needs and aspirations of women. Gender-sensitisation should be given high priority by Public Service Commissions. The President said that India, as the world’s fastest growing major economy and also a nation marked by enormous diversity, needs most effective governance systems at all levels. The country is aiming to be the third largest economy in the world in the near future. We are also moving towards achieving the goal of ‘Viksit Bharat’ by 2047. She expressed confidence that the Public Service Commissions will continue to fulfil their responsibilities and contribute towards building a future-ready team of civil servants selected and guided by them. Please click here to see the President's Speech- *** MJPS/SR (Release ID: 2206437)",
    "scraped_at": "2025-12-19T09:46:36.723362"
  },
  {
    "id": "2206501",
    "ministry": "Lok Sabha Secretariat",
    "title": "SIXTH SESSION OF EIGHTEENTH LOK SABHA CONCLUDES",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206501",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Lok Sabha Secretariat SIXTH SESSION OF EIGHTEENTH LOK SABHA CONCLUDES DURING SIXTH SESSION OF 18TH LOK SABHA, PRODUCTIVITY WAS 111 PERCENT: LOK SABHA SPEAKER 15 SITTINGS OF LOK SABHA WERE HELD DURING SIXTH SESSION, WHICH LASTED FOR 92 HOURS 25 MINUTES: LOK SABHA SPEAKER 10 GOVERNMENT BILLS WERE INTRODUCED IN LOK SABHA AND 08 BILLS WERE PASSED: LOK SABHA SPEAKER DISCUSSION ON “VANDE MATARAM” LASTED FOR 11 HOURS AND 32 MINUTES AND 65 MEMBERS PARTICIPATED IN THE DISCUSSION: LOK SABHA SPEAKER “ELECTORAL REFORMS” WAS DISCUSSED FOR 13 HOURS AND 63 MEMBERS PARTICIPATED IN THE DISCUSSION: LOK SABHA SPEAKER 408 MATTERS OF URGENT PUBLIC IMPORTANCE WERE RAISED DURING THE SESSION: LOK SABHA SPEAKER प्रविष्टि तिथि:\r\n                19 DEC 2025 2:53PM by PIB Delhi The Sixth Session of the Eighteenth Lok Sabha, which commenced on 1 December, 2025, concluded today. In this regard, Lok Sabha Speaker Shri Birla informed that 15 sittings were held during the Session. The total sitting hours during the Session was 92 hours and 25 minutes. The Productivity of the House was during the Session was 111 percent, informed Shri Birla. 10 Government Bills were introduced and 08 Bills were passed, during the session. The bills which were passed are as follows: (i)         The Manipur Goods and Services Tax (Second Amendment) Bill, 2025; (ii)        The Central Excise (Amendment) Bill, 2025; (iii)       The Health Security se National Security Cess Bill, 2025; (iv)       The Appropriation (No. 4) Bill, 2025; (v)        The Repealing and Amending Bill, 2025; (vi)       The Sabka Bima Sabki Raksha (Amendment of Insurance Laws) Bill, 2025; (vii)      The Sustainable Harnessing and Advancement of Nuclear Energy for Transforming India Bill, 2025; and (viii)     The Viksit Bharat - Guarantee for Rozgar and Ajeevika Mission (Gramin): VB - G RAM G ( विकसित भारत—जी राम जी) Bill, 2025 18वीं लोक सभा के छठे सत्र का आज सफलतापूर्वक समापन हुआ। यह सत्र 1 दिसंबर, 2025 को आरंभ हुआ जिसमें कुल 15 बैठकें आयोजित हुई। सभी माननीय सदस्यों के सहयोग से सदन की उत्पादकता 111 प्रतिशत के करीब रही। सदन की कार्यवाही के सुचारु संचालन के लिए माननीय प्रधानमंत्री, नेता प्रतिपक्ष, सत्ता… pic.twitter.com/amKNgWRfLj — Om Birla (@ombirlakota) December 19, 2025 On 15 December 2025, after discussion, voting was held on the Supplementary Demands for Grants – First Batch, 2025–26. Thereafter, the Appropriation (No. 4) Bill, 2025 was passed. On 8 December 2025, the Prime Minister initiated a discussion to commemorate the completion of 150 years of the national song “Vande Mataram”. The House discussed the subject for 11 hours and 32 minutes, during which 65 Members participated. Similarly, the issue of “Electoral Reforms” was discussed on 9 and 10 December for approximately 13 hours, with the participation of 63 Members. During the Session, 300 starred questions were admitted and 72 starred questions were answered orally. A total number of 3449 unstarred questions were admitted during the Session. A total of 408 matters of urgent public importance were raised by the Members during the Zero Hour and a total of 372 matters were taken up under Rule 377. On 11 December 2025, 150 Members raised their matters during Zero Hour in the House. During the Session, 35 Statements were made under Direction 73A and a total number of 38 Statements including two Statements given under Rule 372 and one Statement by Minister of Parliamentary Affairs. During the session, a total of 2,116 papers were laid on the Table of the House. A total of 41 reports of the Parliamentary Standing Committees associated with various Departments were presented in the House. As regards Private Members’ Bills, during this session, 137 Private Members’ Bills on various subjects were introduced on 5 December 2025. On 12 December 2025, a Private Members’ Resolution moved by Shri Shafi Parambil was withdrawn, after discussion, with the permission of the House. On 2 December 2025, His Excellency Mr. Shalva Papuashvili, Chairman of the Parliament of Georgia, along with his parliamentary delegation, was received and accorded a warm welcome by the Parliament of India during his official visit. *** AM (रिलीज़ आईडी: 2206501) आगंतुक पटल  : 40 Lok Sabha Secretariat SIXTH SESSION OF EIGHTEENTH LOK SABHA CONCLUDES DURING SIXTH SESSION OF 18TH LOK SABHA, PRODUCTIVITY WAS 111 PERCENT: LOK SABHA SPEAKER 15 SITTINGS OF LOK SABHA WERE HELD DURING SIXTH SESSION, WHICH LASTED FOR 92 HOURS 25 MINUTES: LOK SABHA SPEAKER 10 GOVERNMENT BILLS WERE INTRODUCED IN LOK SABHA AND 08 BILLS WERE PASSED: LOK SABHA SPEAKER DISCUSSION ON “VANDE MATARAM” LASTED FOR 11 HOURS AND 32 MINUTES AND 65 MEMBERS PARTICIPATED IN THE DISCUSSION: LOK SABHA SPEAKER “ELECTORAL REFORMS” WAS DISCUSSED FOR 13 HOURS AND 63 MEMBERS PARTICIPATED IN THE DISCUSSION: LOK SABHA SPEAKER 408 MATTERS OF URGENT PUBLIC IMPORTANCE WERE RAISED DURING THE SESSION: LOK SABHA SPEAKER प्रविष्टि तिथि:\r\n                        19 DEC 2025 2:53PM by PIB Delhi The Sixth Session of the Eighteenth Lok Sabha, which commenced on 1 December, 2025, concluded today. In this regard, Lok Sabha Speaker Shri Birla informed that 15 sittings were held during the Session. The total sitting hours during the Session was 92 hours and 25 minutes. The Productivity of the House was during the Session was 111 percent, informed Shri Birla. 10 Government Bills were introduced and 08 Bills were passed, during the session. The bills which were passed are as follows: (i)         The Manipur Goods and Services Tax (Second Amendment) Bill, 2025; (ii)        The Central Excise (Amendment) Bill, 2025; (iii)       The Health Security se National Security Cess Bill, 2025; (iv)       The Appropriation (No. 4) Bill, 2025; (v)        The Repealing and Amending Bill, 2025; (vi)       The Sabka Bima Sabki Raksha (Amendment of Insurance Laws) Bill, 2025; (vii)      The Sustainable Harnessing and Advancement of Nuclear Energy for Transforming India Bill, 2025; and (viii)     The Viksit Bharat - Guarantee for Rozgar and Ajeevika Mission (Gramin): VB - G RAM G ( विकसित भारत—जी राम जी) Bill, 2025 18वीं लोक सभा के छठे सत्र का आज सफलतापूर्वक समापन हुआ। यह सत्र 1 दिसंबर, 2025 को आरंभ हुआ जिसमें कुल 15 बैठकें आयोजित हुई। सभी माननीय सदस्यों के सहयोग से सदन की उत्पादकता 111 प्रतिशत के करीब रही। सदन की कार्यवाही के सुचारु संचालन के लिए माननीय प्रधानमंत्री, नेता प्रतिपक्ष, सत्ता… pic.twitter.com/amKNgWRfLj — Om Birla (@ombirlakota) December 19, 2025 On 15 December 2025, after discussion, voting was held on the Supplementary Demands for Grants – First Batch, 2025–26. Thereafter, the Appropriation (No. 4) Bill, 2025 was passed. On 8 December 2025, the Prime Minister initiated a discussion to commemorate the completion of 150 years of the national song “Vande Mataram”. The House discussed the subject for 11 hours and 32 minutes, during which 65 Members participated. Similarly, the issue of “Electoral Reforms” was discussed on 9 and 10 December for approximately 13 hours, with the participation of 63 Members. During the Session, 300 starred questions were admitted and 72 starred questions were answered orally. A total number of 3449 unstarred questions were admitted during the Session. A total of 408 matters of urgent public importance were raised by the Members during the Zero Hour and a total of 372 matters were taken up under Rule 377. On 11 December 2025, 150 Members raised their matters during Zero Hour in the House. During the Session, 35 Statements were made under Direction 73A and a total number of 38 Statements including two Statements given under Rule 372 and one Statement by Minister of Parliamentary Affairs. During the session, a total of 2,116 papers were laid on the Table of the House. A total of 41 reports of the Parliamentary Standing Committees associated with various Departments were presented in the House. As regards Private Members’ Bills, during this session, 137 Private Members’ Bills on various subjects were introduced on 5 December 2025. On 12 December 2025, a Private Members’ Resolution moved by Shri Shafi Parambil was withdrawn, after discussion, with the permission of the House. On 2 December 2025, His Excellency Mr. Shalva Papuashvili, Chairman of the Parliament of Georgia, along with his parliamentary delegation, was received and accorded a warm welcome by the Parliament of India during his official visit. *** AM (रिलीज़ आईडी: 2206501)",
    "scraped_at": "2025-12-19T09:46:38.444900"
  },
  {
    "id": "2206488",
    "ministry": "Prime Minister's Office",
    "title": "PM to visit Assam on 20-21 December",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206488",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office PM to visit Assam on 20-21 December PM to inaugurate and lay the foundation stone of projects worth around Rs. 15,600 crore in Assam PM to inaugurate New Terminal Building of Lokapriya Gopinath Bardoloi International Airport in Guwahati Spread over nearly 1.4 lakh square metres, New Terminal Building is designed to handle up to 1.3 crore passengers annually New Terminal Building draws inspiration from Assam’s biodiversity and cultural heritage under the theme “Bamboo Orchids” PM to perform Bhoomipujan for Ammonia-Urea Fertilizer Project of Assam Valley Fertilizer and Chemical Company Limited at Namrup in Dibrugarh Project to be built with an estimated investment of over Rs. 10,600 crore and help meet fertilizer requirements of Assam & neighbouring states and reduce import dependence PM to pay tribute to martyrs at Swahid Smarak Kshetra in Boragaon, Guwahati प्रविष्टि तिथि:\r\n                19 DEC 2025 2:29PM by PIB Delhi Prime Minister Shri Narendra Modi will undertake a visit to Assam on 20-21 December. On 20th December, at around  3 PM, Prime Minister will reach Guwahati, where he will undertake a walkthrough and inaugurate the New Terminal Building of Lokapriya Gopinath Bardoloi International Airport. He will also address the gathering on the occasion. On 21st December, at around 9:45 AM, Prime Minister will pay tribute to martyrs at Swahid Smarak Kshetra in Boragaon, Guwahati. After that, he will travel to Namrup in Dibrugarh, Assam, where he will perform Bhoomi Pujan for the Ammonia-Urea Project of Assam Valley Fertilizer and Chemical Company Ltd. He will also address the gathering on the occasion. On 20th December, Prime Minister will inaugurate the new terminal building of Lokapriya Gopinath Bardoloi International Airport in Guwahati, marking a transformative milestone in Assam’s connectivity, economic expansion and global engagement. The newly completed Integrated New Terminal Building, spread over nearly 1.4 lakh square metres, is designed to handle up to 1.3 crore passengers annually, supported by major upgrades to the runway, airfield systems, aprons and taxiways. India’s first nature-themed airport terminal, the airport’s design draws inspiration from Assam’s biodiversity and cultural heritage under the theme “Bamboo Orchids”. The terminal makes pioneering use of about 140 metric tonnes of locally sourced Northeast bamboo, complemented by Kaziranga-inspired green landscapes, japi motifs, the iconic rhino symbol and 57 orchid-inspired columns reflecting the Kopou flower. A unique “Sky Forest”, featuring nearly one lakh plants of indigenous species, offers arriving passengers an immersive, forest-like experience. The terminal sets new benchmarks in passenger convenience and digital innovation. Features such as full-body scanners for fast, non-intrusive security screening, DigiYatra-enabled contactless travel, automated baggage handling, fast-track immigration and AI-driven airport operations ensure seamless, secure and efficient journeys. On 21st December morning before heading to Namrup, Prime Minister will also visit the Swahid Smarak Kshetra to pay homage to the martyrs of the historic Assam Movement, a six-year-long people’s movement that embodied the collective resolve for a foreigner-free Assam and the protection of the State’s identity. Later in the day, Prime Minister will perform Bhoomipujan of the new brownfield Ammonia-Urea Fertilizer Project at Namrup, in Dibrugarh, Assam, within the existing premises of Brahmaputra Valley Fertilizer Corporation Limited (BVFCL). Furthering Prime Minister’s vision of Farmers’ Welfare, the project, with an estimated investment of over Rs. 10,600 crore, will meet fertilizer requirements of Assam and neighbouring states, reduce import dependence, generate substantial employment and catalyse regional economic development. It stands as a cornerstone of industrial revival and farmer welfare. *** MJPS/ST (रिलीज़ आईडी: 2206488) आगंतुक पटल  : 207 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Gujarati Prime Minister's Office PM to visit Assam on 20-21 December PM to inaugurate and lay the foundation stone of projects worth around Rs. 15,600 crore in Assam PM to inaugurate New Terminal Building of Lokapriya Gopinath Bardoloi International Airport in Guwahati Spread over nearly 1.4 lakh square metres, New Terminal Building is designed to handle up to 1.3 crore passengers annually New Terminal Building draws inspiration from Assam’s biodiversity and cultural heritage under the theme “Bamboo Orchids” PM to perform Bhoomipujan for Ammonia-Urea Fertilizer Project of Assam Valley Fertilizer and Chemical Company Limited at Namrup in Dibrugarh Project to be built with an estimated investment of over Rs. 10,600 crore and help meet fertilizer requirements of Assam & neighbouring states and reduce import dependence PM to pay tribute to martyrs at Swahid Smarak Kshetra in Boragaon, Guwahati प्रविष्टि तिथि:\r\n                        19 DEC 2025 2:29PM by PIB Delhi Prime Minister Shri Narendra Modi will undertake a visit to Assam on 20-21 December. On 20th December, at around  3 PM, Prime Minister will reach Guwahati, where he will undertake a walkthrough and inaugurate the New Terminal Building of Lokapriya Gopinath Bardoloi International Airport. He will also address the gathering on the occasion. On 21st December, at around 9:45 AM, Prime Minister will pay tribute to martyrs at Swahid Smarak Kshetra in Boragaon, Guwahati. After that, he will travel to Namrup in Dibrugarh, Assam, where he will perform Bhoomi Pujan for the Ammonia-Urea Project of Assam Valley Fertilizer and Chemical Company Ltd. He will also address the gathering on the occasion. On 20th December, Prime Minister will inaugurate the new terminal building of Lokapriya Gopinath Bardoloi International Airport in Guwahati, marking a transformative milestone in Assam’s connectivity, economic expansion and global engagement. The newly completed Integrated New Terminal Building, spread over nearly 1.4 lakh square metres, is designed to handle up to 1.3 crore passengers annually, supported by major upgrades to the runway, airfield systems, aprons and taxiways. India’s first nature-themed airport terminal, the airport’s design draws inspiration from Assam’s biodiversity and cultural heritage under the theme “Bamboo Orchids”. The terminal makes pioneering use of about 140 metric tonnes of locally sourced Northeast bamboo, complemented by Kaziranga-inspired green landscapes, japi motifs, the iconic rhino symbol and 57 orchid-inspired columns reflecting the Kopou flower. A unique “Sky Forest”, featuring nearly one lakh plants of indigenous species, offers arriving passengers an immersive, forest-like experience. The terminal sets new benchmarks in passenger convenience and digital innovation. Features such as full-body scanners for fast, non-intrusive security screening, DigiYatra-enabled contactless travel, automated baggage handling, fast-track immigration and AI-driven airport operations ensure seamless, secure and efficient journeys. On 21st December morning before heading to Namrup, Prime Minister will also visit the Swahid Smarak Kshetra to pay homage to the martyrs of the historic Assam Movement, a six-year-long people’s movement that embodied the collective resolve for a foreigner-free Assam and the protection of the State’s identity. Later in the day, Prime Minister will perform Bhoomipujan of the new brownfield Ammonia-Urea Fertilizer Project at Namrup, in Dibrugarh, Assam, within the existing premises of Brahmaputra Valley Fertilizer Corporation Limited (BVFCL). Furthering Prime Minister’s vision of Farmers’ Welfare, the project, with an estimated investment of over Rs. 10,600 crore, will meet fertilizer requirements of Assam and neighbouring states, reduce import dependence, generate substantial employment and catalyse regional economic development. It stands as a cornerstone of industrial revival and farmer welfare. *** MJPS/ST (रिलीज़ आईडी: 2206488)",
    "scraped_at": "2025-12-19T09:46:40.116216"
  },
  {
    "id": "2206485",
    "ministry": "Prime Minister's Office",
    "title": "PM to visit West Bengal on 20th December",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206485",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Prime Minister's Office PM to visit West Bengal on 20th December PM to Inaugurate and Lay Foundation Stone for two National Highway Projects worth around Rs. 3,200 Crore in West Bengal PM to inaugurate 66.7 km long 4-Laning of Barajaguli - Krishnanagar Section of NH-34 in Nadia district PM to lay the foundation stone for the 4-laning of the 17.6 km long Barasat-Barajaguli Section of NH-34 in North 24 Parganas district Projects  will serve as a vital connecting link between Kolkata and Siliguri प्रविष्टि तिथि:\r\n                19 DEC 2025 2:28PM by PIB Delhi Prime Minister Shri Narendra Modi will undertake a visit to West Bengal on 20th December. At around 11:15 AM, Prime Minister will lay the foundation stone and inaugurate national highway projects at Ranaghat in Nadia district, West Bengal. He will also address the gathering on the occasion. Prime Minister will inaugurate and lay the foundation stone of two National Highway projects worth around Rs. 3,200 crores. Prime Minister will inaugurate 66.7 km long 4-Laning of Barajaguli - Krishnanagar Section of NH-34 in the Nadia District of West Bengal. He will also lay the foundation stone for the 4-laning of the 17.6 km long Barasat-Barajaguli Section of NH-34 in North 24 Parganas district of West Bengal. The projects  will serve as a vital connecting link between Kolkata and Siliguri. They will help to reduce travel time by approximately 2 hours, ensuring faster and smoother movement of vehicles for unhindered traffic flow, reduced vehicle operating costs, and improve connectivity between Kolkata and other neighboring districts of West Bengal as well as with neighbouring countries. The projects will also boost the economic growth in the region and will provide impetus to the growth of tourism across the region. *** MJPS/ST (रिलीज़ आईडी: 2206485) आगंतुक पटल  : 191 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Assamese , Gujarati , Telugu , Malayalam Prime Minister's Office PM to visit West Bengal on 20th December PM to Inaugurate and Lay Foundation Stone for two National Highway Projects worth around Rs. 3,200 Crore in West Bengal PM to inaugurate 66.7 km long 4-Laning of Barajaguli - Krishnanagar Section of NH-34 in Nadia district PM to lay the foundation stone for the 4-laning of the 17.6 km long Barasat-Barajaguli Section of NH-34 in North 24 Parganas district Projects  will serve as a vital connecting link between Kolkata and Siliguri प्रविष्टि तिथि:\r\n                        19 DEC 2025 2:28PM by PIB Delhi Prime Minister Shri Narendra Modi will undertake a visit to West Bengal on 20th December. At around 11:15 AM, Prime Minister will lay the foundation stone and inaugurate national highway projects at Ranaghat in Nadia district, West Bengal. He will also address the gathering on the occasion. Prime Minister will inaugurate and lay the foundation stone of two National Highway projects worth around Rs. 3,200 crores. Prime Minister will inaugurate 66.7 km long 4-Laning of Barajaguli - Krishnanagar Section of NH-34 in the Nadia District of West Bengal. He will also lay the foundation stone for the 4-laning of the 17.6 km long Barasat-Barajaguli Section of NH-34 in North 24 Parganas district of West Bengal. The projects  will serve as a vital connecting link between Kolkata and Siliguri. They will help to reduce travel time by approximately 2 hours, ensuring faster and smoother movement of vehicles for unhindered traffic flow, reduced vehicle operating costs, and improve connectivity between Kolkata and other neighboring districts of West Bengal as well as with neighbouring countries. The projects will also boost the economic growth in the region and will provide impetus to the growth of tourism across the region. *** MJPS/ST (रिलीज़ आईडी: 2206485)",
    "scraped_at": "2025-12-19T09:46:41.810391"
  },
  {
    "id": "2206480",
    "ministry": "Ministry of Communications",
    "title": "2025 Year End Review for Department of Posts",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206480",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Communications 2025 Year End Review for Department of Posts प्रविष्टि तिथि:\r\n                19 DEC 2025 2:09PM by PIB Delhi Ministry of External Affairs has associated with Department of Posts to leverage the Post Office network and provide passport services to people in their vicinity; As on 30.11.2025, 452 Post Office Passport Seva Kendras (POPSKs) are operational 1,552 Aadhaar Camps were organized in schools for mandatory biometric updates of children turning 5 and 15 years old during the National Postal Week in October; 4,335 Aadhaar enrolments and 35,606 Aadhaar updations were carried out From January 2025 to November 2025, more than 2.35 Crore Aadhaar enrolment and updations were carried out, generating a revenue of Rs. 129.13 Crore Department of Posts successfully distributed 28,13,627 National Flags under Har Ghar Tiranga campaign 4.0 during the year 2025 From January 2025 to November 2025, 1,69,368 Prime Minister’s Employment Generation Programme (PMEGP) units have been verified Memorandum of Understanding (MoUs) signed between the Department of Posts, the Unit Trust of India (UTI) and the Specified Undertaking of the Unit Trust of India (SUUTI) for the door-to-door collection and verification of KYC documents from mutual fund investors; Around 5 lakh KYC verifications have been completed as on 30.11.2025 Landmark MoU signed with Association of Mutual Funds in India (AMFI), to streamline KYC verification for Mutual Fund investors of all 50 Asset Management Companies registered with AMFI; M oU(s) also signed with Nippon India Mutual Fund and SBI Mutual Funds DoP signed MoU with BSNL to leverage its unparalleled postal network of over 1.64 lakh Post Offices for sale of BSNL SIM cards and mobile recharge services across the country Department of Posts, supported by NRSC-ISRO and IIT Hyderabad, designed DIGIPIN, a 10-character alphanumeric code that uniquely identifies every 4 × 4 metre grid across India; Initiative received Special Mention award for Innovation in the Postal Sector at the Asian-Pacific Postal Union (APPU) Business Forum 2025 A key milestone during the year was the successful launch of the UPI–UPU interlinkage, integrating India’s Unified Payments Interface (UPI) with the UPU’s Interconnection Platform (IP) Department of Posts organized the first Asia-Pacific Postal Leaders Forum in Jaipur under the aegis of the Universal Postal Union in March; Participation from Delegates from around 28 countries across the Asia-Pacific region, including the Secretary General of the Asia Pacific Postal Union (APPU) Bilateral International Tracked Packet Service (ITPS) Agreement between India Post and Russian Post was formally signed at DakBhawan Commemorative Postage Stamps on 42 issues were released during the period 1 st January 2025 to 30 th November 2025; Significant commemorations included 100 Years of Rashtriya Swayamsevak Sangh, 125 Years of Kodaikanal Solar Observatory, President's Bodyguard, 50 Years of Statehood of Sikkim, 150 Years of Vande Mataram among others From 1 st January 2025 to 30 th November 2025, 47 Customized My Stamps released including those of national importance like the engineering marvel, the Chenab Railway Bridge; 90 years of the Reserve Bank of India; 50 Years of Karnataka State Police; 75 years of the National Sample Survey (NSS); and the 100th Birth Centenary of renowned environmentalist Gaura Devi 1. Post Ofﬁce Passport Seva Kendras In view of greater mobility of the Indian population in search of education, better work opportunities, and other social commitments, passport has become a necessary document that everyone needs to obtain. Given the ever-increasing demand for passport services and to provide convenience to citizens who previously had to travel long distances to get passports, the Ministry of External Affairs has associated with the Department of Posts to leverage the Post Office network and provide passport services to people in their vicinity by establishing Post Office Passport Seva Kendras (POPSKs). It has been mutually decided by DOP & MEA to open a POPSK in each Lok Sabha constituency. As on 30.11.2025, 452 POPSKs have been operationalized. More than 29 lakh passport applications, including 1.54 lakh Police Clearance Certificates (PCC), and have earned a revenue of Rs. 114.88 crore for the Department for the period from January 2025 to November 2025. The following 10 POPSKs have been operationalized during the period from January 2025 to November 2025: Araku SO, Andhra Pradesh Circle (22.01.2025) Tirupur HO, Tamil Nadu Circle (24.01.2025) Bakhra SO, Bihar Circle (22.03.2025) Rajnagar SO, Bihar Circle (22.03.2025) Kalpetta HO, Kerala Circle (09.04.2025) Khargaon HO, Madhya Pradesh Circle (17.04.2025) Bhind HO, Madhya Pradesh Circle (19.04.2025) Kushinagar SO, Uttar Pradesh Circle (30.04.2025) Mandla, Madhya Pradesh Circle (14.11.2025) Pollachi, Tamil Nadu Circle (29.11.2025) Inauguration of Mandla POPSK, Madhya Pradesh Circle on 14.11.2025 Inauguration of Mandla POPSK, Madhya Pradesh Circle on 14.11.2025 2. Post Ofﬁce Aadhaar Updation and Enrollment Centre Thirteen thousand three hundred fifty-two (13352) Aadhaar Centers were set up across India in Post Offices with the aim of providing citizen-centric services in the vicinity of the citizens. The facility of these Post Office Aadhaar Centers has brought convenience to citizens in generating new Aadhaar cards and updating their Aadhaar cards in case of any change or mismatch. To reach out to the masses in the remotest areas of the country, India Post has also distributed Mobile/Laptop Aadhaar kits to the Post Offices. Because of these Aadhaar Mobile/Laptop kits, Aadhaar Updation/Enrolments can now be done in camp mode, thus helping the masses, especially DBT beneficiaries, to obtain benefits of different government schemes. The Department of Posts, in collaboration with the Army Postal Service (APS) and the Unique Identification Authority of India (UIDAI), has started Aadhaar services for Defense personnel. Aadhaar center has been operationalized at Siachin, which marks the highest Aadhaar center in the country. So far, 110 Aadhaar centers are functional in APS. 1,552 Aadhaar Camps were organized in schools for mandatory biometric updates of children turning 5 and 15 years old during the National Postal Week in October 2025 in which 4,335 Aadhaar enrolments and 35,606 Aadhaar updations were carried out. During the period from January 2025 to November 2025, more than 2.35 Crore Aadhaar enrolment and updations have been carried out, generating a revenue of Rs. 129.13 Crore. Mainly two (2) types of services are provided in Post Office Aadhaar Centres: Aadhaar Enrolment : The Enrolment process involves the electronic capture of demographic and biometric information of residents. Aadhaar Updation : Mandatory update: Update of details in Aadhaar is mandatory once in ten years. Demographic Updation, such as Name, Email ID, Mobile Number, Address, Date of Birth, etc. Biometric Updation, including facial images, 10 fingerprints, and iris, are updated through post offices. Aadhaar Centre, Ambala GPO, Haryana Circle Aadhaar Centre, Indore GPO, Madhya Pradesh Circle Aadhaar Camp at Geeta Adarsh Vidyalaya, Solan Division, Himachal Pradesh Circle Aadhaar Camp at C M Rise School, Chhindwara Division, Madhya Pradesh Circle 3. Har Ghar Tiranga Campaign 2025 To facilitate extensive participation of citizens in the Har Ghar Tiranga campaign run by the Ministry of Culture and MyGov to celebrate India's independence, Department of Posts successfully distributed 28,13,627 National Flags under Har Ghar Tiranga campaign 4.0 during the year 2025. National Flags were made available in every Post Office for offline sale/distribution and also available through e-PostOffice Portal for online sale/distribution during the campaign. To promote participation in the campaign, postal employees held wide-spread rallies, prabhat pheries, door to door campaigns, bike rallies, letter-writing and rakhi-making for school children etc. Tiranga rally by Postal Staff at Agra Division, Uttar Pradesh Circle 4. Physical Verification of Prime Minister’s Employment Generation Programme (PMEGP) Units: An MoU was signed between the Department of Posts and the Khadi & Village Industries Commission (KVIC) on 20.08.2024 for physical verification of Prime Minister’s Employment Generation Programme (PMEGP) units. This verification will facilitate the adjustment of government subsidy to the loan account of beneficiaries under the Prime Minister’s Employment Generation Programme. Proof of concept has been completed successfully and pan India rollout started on 20th August 2024 in a phased manner. From January 2025 to November 2025, 1,69,368 PMEGP units have been verified. KVIC Unit Verification by Postal Staff, Bihar Circle 5. KYC (Know Your Customer) Documents Verification/Collection: Memorandum of Understanding (MoUs) have been signed between the Department of Posts and the Unit Trust of India (UTI) on 24.07.2023 and between the Department of Posts and the Specified Undertaking of the Unit Trust of India (SUUTI) on 23.04.2024 for the door-to-door collection and verification of KYC documents from mutual fund investors. Around 5 lakh  KYC verifications have been completed as on 30.11.2025. New Initiative: KYC Verification through India Post KYC verification by postmen and other field officials of India Post bridges the gap between the formal financial system and the under covered sections of society fostering economic empowerment and financial inclusion, reducing inequality and contributing to the overall development of the nation. The collaboration between DoP and Mutual Fund companies for KYC (Know Your Customer) verification of their investors is an initiative to streamline and simplify the KYC process for investors. The Department of Posts (DoP) has signed MoU(s) with Nippon India Mutual Fund and SBI Mutual Funds on 03.04.2025 and 29.04.2025 respectively, for the KYC verification of their investors. The Department of Posts (DoP) has also signed a landmark MoU on 17.07.2025 with the Association of Mutual Funds in India (AMFI) , to streamline KYC verification for Mutual Fund investors of all 50 Asset Management Companies registered with AMFI. Through this partnership, DoP will utilize its network of 1.64 lakh post offices to assist mutual fund investors in completing and verifying KYC documents, which will help them attain “KYC Validated\" status.  This initiative is a significant step towards ensuring regulatory compliance for legacy investors residing in far corners of the country. It will help investors revive their folios and continue to invest seamlessly in mutual funds. This pathbreaking initiative promotes financial inclusion, particularly in remote and underserved areas, and complies with SEBI regulations to ensure secure and efficient investor servicing. Signing of MoU between Department of Posts and NIPPON India MF on 03.04.2025 Signing of MoU between Department of Posts and SBIMF on 29.04.2025 Signing of MoU between Department of Posts and AMFI on 17.07.2025 New Initiative: Distribution of Mutual Funds through India Post The Department of Posts (DoP) and the Association of Mutual Funds in India (AMFI) signed a pioneering MoU on 22.08.2025 , during the 30th Foundation Day Celebration of AMFI in Mumbai. This landmark agreement marks the beginning of a new service model where India Post will act as a distributor to facilitate mutual fund investments through its extensive postal network, particularly benefitting citizens in rural and semi-urban areas. DoP staff will function as mutual fund distributors to enhance mutual fund penetration in smaller towns and rural regions where access to structured financial products has traditionally been limited. India Post has an extensive presence in rural and semi-urban regions across the country, where awareness about mutual fund investments remains relatively low. The initiative aims to broaden access to mutual fund products, leveraging the trust and reach of post offices across the country. Signing of MoU between Department of Posts and AMFI on 22.08.2025 New Initiative: Sale & Recharge of BSNL SIM Cards Signing of MoU between Department of Posts and BSNL on 17.09.2025 The Department of Posts (DoP), under the Ministry of Communications, Government of India, and Bharat Sanchar Nigam Limited (BSNL) have signed a Memorandum of Understanding (MoU) on 17.09.2025 , in New Delhi to expand BSNL’s mobile connectivity reach across India. Under this agreement, DoP will leverage its unparalleled postal network of over 1.64 lakh Post Offices for sale of BSNL SIM cards and mobile recharge services across the country. Through this collaboration, post offices will act as Points of Sale (PoS) for BSNL, Mobile SIM sale and for mobile recharges. BSNL will provide SIM stock and training, while DoP will onboard new customers for BSNL and facilitate transactions in a standardized and secure manner. This initiative aims to make BSNL's telecom services more accessible and affordable, particularly for citizens in the remotest parts of the country who often struggle with limited connectivity. By enabling Post Offices as service points, the partnership seeks to bridge the digital divide, empower rural households with mobile services, and advance the broader goals of Digital India, financial inclusion, and socio-economic development. The proof of concept was implemented in Assam, where it has already shown significant success, demonstrating its potential as a scalable model for nationwide rollout. Upcoming Initiatives: 1. Rural Digital Connectivity Survey for Telecom Regulatory Authority & India (TRAI) The upcoming project aims to transform rural connectivity by enabling Dak Sevaks to use a dedicated mobile application to survey the quality and speed of telecom services provided by BSNL, Jio, Airtel, Vodafone, and others across 6.5 lakh villages. Currently under active examination and consideration by both the Department of Posts (DoP) and TRAI, the initiative will help accurately map network gaps and guide improvements in rural telecom infrastructure. This, in turn, is expected to boost communication efficiency, enhance digital banking reliability, and strengthen access to essential online services for rural citizens, while also improving market linkages and economic opportunities. As part of the collaboration framework, a Memorandum of Understanding (MoU) between the DoP and TRAI is scheduled to be signed in December 2025 , marking a key milestone in taking this project forward. 2. Onsite MSME Udyam Registration Verification The upcoming project seeks to enhance the authenticity and reliability of the Udyam Registration Portal (URP) by enabling the Department of Posts’ field staff to verify the details of 3.69 crore registered enterprises. Benefits under various government schemes will be released only after verification by DoP, ensuring that subsidies and support reach genuine entrepreneurs. By strengthening the credibility of Udyam data, the initiative is expected to contribute to the creation of over 50 lakh jobs through verified micro-businesses and enable faster access to credit, government schemes, and market opportunities. It will also promote local manufacturing, exports, and broader rural economic growth. The project is under active consideration by the DoP and the Ministry of MSME, with an MoU between the two expected to be signed in December 2025. 3. Udyam Assist Portal Credit Pilot (with SIDBI) The upcoming project focuses on verifying the details of 2.73 crore Informal Micro Enterprises (IMEs) through the Department of Posts’ field staff, ensuring that benefits under the scheme are disbursed only after proper verification by DoP. By authenticating IME data, the initiative aims to support entrepreneurship, enable small businesses to expand, and help them generate sustainable income. It will also strengthen the rural credit ecosystem, drive financial inclusion, and contribute to grassroots-level “Make in India” efforts, ultimately fostering economic empowerment in rural areas. The project is currently under active consideration by the DoP and the Ministry of MSME, with an MoU between the two scheduled to be signed in December 2025 . FS Division e-KYC: Aadhaar-based e-KYC (Electronic Know Your Customer) has been introduced across all Departmental Post Offices pan-India with effect from 06.01.2025 for the onboarding of new customers. e-KYC is a digital method of verifying the identity of customers through electronic records and enables Post Offices to authenticate customers quickly and securely without relying on physical documents. As of November 2025, a total of 1,09,878 accounts have been opened through the e-KYC facility, and 24,45,029 transactions have been carried out. Revamped ATM Network: Department of Posts has undertaken a comprehensive revamp of its ATM network across the country to enhance service delivery and customer convenience. New and upgraded infrastructure is being provided at all 1,000 ATM sites to ensure smooth, secure, and uninterrupted operations. This modernization initiative has significantly improved system reliability and transaction efficiency with faster response times and reduced downtime. The initiative reflects the Department’s commitment to leveraging technology for improved ATM services. DAC Division The Department of Posts, supported by NRSC-ISRO and IIT Hyderabad, designed DIGIPIN, a 10-character alphanumeric code that uniquely identifies every 4 × 4 metre grid across India. Generated from latitude and longitude coordinates, DIGIPIN functions as a permanent, GIS-based digital identifier, converting any location on India’s landmass into a precise, machine-readable address. DIGIPIN was launched on 7 March 2025, and the source code released in the public domain, enabling rapid uptake by both public and private sectors. Further, a web application called “ Know Your DIGIPIN ” was launched on 27 May 2025, to make it convenient for the public to generate their DIGIPIN through their latitude–longitude coordinates and vice versa. By enabling accurate, geocoded and standardised location addressing, DIGIPIN can improve service delivery in various sectors like e-commerce logistics, welfare programme implementation, and emergency response systems, amongst others. At present, it has been integrated with platforms such as ISRO’s BHUVAN, Gram Manchitra, and Rajdharaa, and other central and state level government systems. Special Mention: In December 2025, the initiative received a Special Mention award for Innovation in the Postal Sector at the Asian-Pacific Postal Union (APPU) Business Forum 2025 in Bangkok. International Relations & Global Business Division The 28 th Universal Postal Union (UPU) Congress was held in Dubai from 8th to 19th September 2025. India’s leadership and standing within the global postal community were strongly reaffirmed, with the country being re-elected to both the Council of Administration (CA) and the Postal Operations Council (POC), securing votes among the highest by any member country in our region. A key milestone during the year was the successful launch of the UPI–UPU interlinkage, integrating India’s Unified Payments Interface (UPI) with the UPU’s Interconnection Platform (IP). India further strengthened its postal diplomacy by enhancing cooperation with Regional Unions through the signing of Letters of Intent (LoI) with Pan African Postal Union (PAPU), the Postal Union of the Americas, Spain and Portugal (PUASP), and the Caribbean Postal Union (CPU), thereby reinforcing engagement with the Global South. These LoIs establish a structured framework for cooperation between the Department of Posts and the respective unions, aimed at strengthening bilateral and multilateral collaboration in the postal sector. Department of Posts also organized the first Asia-Pacific Postal Leaders Forum in Jaipur under the aegis of the Universal Postal Union from 19 th to 21 st March, 2025. The forum provided a platform for deliberations on strengthening postal networks and promoting international collaboration, and was attended by delegates from around 28 countries across the Asia-Pacific region, including the Secretary General of the Asia Pacific Postal Union (APPU). Furthermore, a bilateral International Tracked Packet Service (ITPS) Agreement between India Post and Russian Post was formally signed at DakBhawan on 4 th December 2025. The Agreement establishes the framework governing the exchange, handling, tracking, and delivery of International Tracked Packet consignments between the two postal administrations. Its implementation is expected to strengthen bilateral postal cooperation, enhance service reliability, and facilitate smoother cross-border movement of tracked postal items between India and the Russian Federation. Dak Ghar Niryat Kendra Dak Ghar Niryat Kendra (DNK) is a transformative national initiative of the Department of Posts aimed at democratising exports by enabling small producers, artisans, weavers, women entrepreneurs, self-help groups (SHGs), MSMEs and rural enterprises to directly export in global markets without intermediaries. It is implemented in collaboration with Indian Customs and the Directorate General of Foreign Trade (DGFT). DNK has expanded India’s export facilitation infrastructure from 20 Foreign Post Offices (FPOs) to 1,013 dedicated DNKs across 762 districts, including 122 DNKs in the North Eastern Region, thereby bringing export services to the doorsteps of businesses in the hinterland. DNK provides an end-to-end phygital (physical + digital) export enablement ecosystem through a single digital platform. Exporters can complete the entire export lifecycle—one-time registration, KYC, self-booking, label generation, invoice and document upload, faceless customs assessment, digital compliance, Let Export Order (LEO),online payments, shipment tracking and provision to download e-Postal Bill of Export etc. This has eliminated paper-based and time-consuming procedures, reduced transaction time from 2–3 days, lowered costs significantly, improved transparency and enabled real-time interaction between exporters and Customs. The initiative has resulted in complete digitalisation of postal export processes, supported by trained personnel at district-level DNKs who provide continuous handholding to first-time exporters. Seamless integration of DNK with ICEGATE, DGFT, GSTN, Central drugs control organization (CDSCO),  RBI and global postal networks through UPU applications has ensured regulatory compliance and smooth cross-border movement. Exporter-centric features such as dashboards, automated document generation, real-time updates and free API access for aggregators and e-marketplaces further enhance ease of doing business. As of date, DNK has facilitated over 12.31 lakh export shipments with an export value of approximately ₹287 crore, while significantly reducing export costs and delays. DNK is a gender-inclusive and socially impactful initiative, empowering women-led enterprises, SHGs, micro-sellers and rural artisans to participate in global trade. Its contribution to inclusive trade has received international recognition, including the Special Recognition Award at the 1st UPU Trade Post Awards 2023 (Geneva) for promoting women’s participation in exports and a Special Mention for Innovation in the Postal Sector by the Asia-Pacific Postal Union in 2024. Developed in-house, DNK’s scalable digital architecture, continuous capacity building, institutionalised counters and strong multi-agency coordination ensure long-term sustainability, resilience during disruptions and readiness for future expansion, firmly positioning the postal network as a national export facilitation backbone. The Department has organised workshops for marketing executives to create awareness of international mail operations and DNKs. This year National level workshop has been organised at Chennai, Mumbai, Vadodara& Lucknow in 2025. The workshops with exporters are also being organized in colocation with Export Promotion Councils, DGFT, Customs etc. Philately Division Release of Stamps 1.1 Commemorative Postage Stamp Commemorative Postage Stamps on 42 issues were released during the period 1 st January 2025 to 30 th November 2025, commemorating contributions made by various Personalities/ Important Events/ Occasions /Institutions/ Achievements and Joint Issues with friendly nations. Some of the significant commemorations were 100 Years of Rashtriya Swayamsevak Sangh, 125 Years of Kodaikanal Solar Observatory, President's Bodyguard, 50 Years of Statehood of Sikkim, 150 Years of Vande Mataram etc. India Post, in collaboration with MyGov, the Ministry of External Affairs (MEA), and the United Nations, organised a nationwide Stamp Design Competition to commemorate 80 years of the United Nations. The initiative witnessed an overwhelming response, with around 7.4 lakh students participating from across the country and 7,705 entries received for national-level were evaluated. After a comprehensive assessment, the top ten entries were selected for awards, and the top three designs were used to create the commemorative postage stamp, FDC and brochure, which were released on 24th October, 2025. In 2025, the Department of Posts commemorated key milestones in India’s diplomatic engagements through the release of a series of Joint Issue postage stamps. These included Joint Issues with Israel, as well as special commemorative stamps marking 50 years of the re-establishment of diplomatic relations with Portugal; 60 years of diplomatic relations with the Maldives; the 75th anniversary of India–Philippines diplomatic relations; and the 70th anniversary of diplomatic relations between India and Mongolia. Each issue highlights India’s enduring commitment to fostering mutual goodwill, cultural exchange, and strong international partnerships. Stamps were also issued to commemorate great personalities like M.S. Swaminathan, Sardar Vallabhbhai Patel, Laxmidas Borkar, Rani Chennabhairadevi, Sitaram Maroo etc. Stamps were issued to showcase heritage of India such as G.I. Products of Bihar, Maha Kumbh and 11th International Day of Yoga, 150 Years of Vande Mataram etc. 1.2 Customized My Stamp Customized My Stamp is a personalised sheet of Postage Stamps wherein Corporates, Organisations and Institutions can get customized sheets printed. From 1 st January 2025 to 30 th November 2025, 47 Customized My Stamps have been released. During the year, the Department of Posts issued several Customized ‘My Stamp’ releases of national significance. These included a My Stamp featuring the engineering marvel, the Chenab Railway Bridge; 90 years of the Reserve Bank of India; 50 Years of Karnataka State Police; 75 years of the National Sample Survey (NSS); and the 100th Birth Centenary of renowned environmentalist Gaura Devi. Commemorative Postage Stamps released from 1 st January, 2025 to 30 th November, 2025 Sl.No. Name of Stamp Date of release Denomination Category 1 Peasant Uprising of Patharughat-1894 28.01.2025 500 p Event 2 India Israel 11.02.2025 5000 p, 5000 p Joint Issue 3 Maha Kumbh 2025 13.02.2025 1500 p Event 4 National School of Drama 16.02.2025 1000 p, 1000 p Institution 5 G.I. Products of Bihar 11.03.2025 500 p, 500 p, 500 p, 500 p, 500 p Thematic 6 5th Battalion the Rajput Regiment 22.03.2025 500 p Institution 7 Mata Karma 25.03.2025 500 p Personality 8 50 Years of reestablishment of Diplomatic Relations between India and Portugal 07.04.2025 5000 p, 5000 p Joint Issue 9 Birth Centenary of Legends 01.05.2025 2500 p Personality 10 125 Years of Kodaikanal Solar Observatory 16.05.2025 500 p Institution 11 50 Years of Statehood of Sikkim 29.05.2025 500 p Event 12 300th Birth Anniversary of Ahilya Bai Holkar 31.05.2025 500 p Personality 13 125 Years of RajBhawan Nainital 20.06.2025 500 p Institution 14 11th International Day of Yoga 21.06.2025 500 p Event 15 100th Birth Anniversary of Acharya Vidyanand 28.06.2025 500 p Personality 16 125th Birth Anniversary of SYAMA PRASAD MOOKERJEE 9.07.2025 500 p Personality 17 Chandrabhanu Gupta 13.07.2025 500 p Personality 18 Centenary Celebration of Mysore Medical College and Research Institute 17.07.2025 500 p Institution 19 Rani Chennabhairadevi 24.07.2025 500 p Personality 20 60 Years of establishment of Diplomatic Relations Between India and Maldives 25.07.2025 6000 p, 6000 p Joint Issue 21 Purshottamdas H. Purohit 02.08.2025 500 p Personality 22 75th Anniversary of India-Philippines Diplomatic Relations 05.08.2025 5000 p, 5000 p Joint Issue 23 M.S.Swaminathan 07.08.2025 500 p Personality 24 Laxmidas Borkar 17.08.2025 500 p Personality 25 Vithalbhai Patel First Indian Elected Speaker 24.08.2025 500 p Personality 26 Sri Madhvacharya 30.08.2025 500 p Personality 27 Centenary Year of Ranchi Institute of Neuro-Psychiatry and Allied Sciences 04.09.2025 500 p Institution 28 President's Bodyguard 30.09.2025 500 p Event 29 100 Years of Rashtriya Swayamsevak Sangh 01.10.2025 500 p Event 30 Military Nursing Service 01.10.2025 500 p Institution 31 Sitaram Maroo 11.10.2025 500 p Personality 32 70th Anniversary of the Establishment of Diplomatic Relations Between India and Mongolia 14.10.2025 5000 p, 5000 p Joint Issue 33 New Mangalore Port Authority 15.10.2025 500 p Institution 34 80 Years of the United Nations 24.10.2025 500 p Event 35 150th Birth Anniversary of Sardar Vallabhbhai Patel 30.10.2025 500 p Personality 36 150 Years of Vande Mataram 07.11.2025 500 p Event 37 150th Birth Anniversary of Acharya Jawahar Lal 16.11.2025 500 p Personality 38 Birth Centenary of Sri Sathya Sai Baba 19.11.2025 500 p (4) Personality 39 Platinum Jubilee of IIT Kharagpur 24.11.2025 500 p (2) Institution 40 THE BHARAT SCOUTS AND GUIDES – DIAMOND JUBILEE 24.11.2025 500 p Institution 41 350th Martyrdom Day of Sri Guru Tegh Bahadur Ji 25.11.2025 500 p Personality 42 K. Vaikunth, Cinematographer 27.11.2025 500 p Personality **** MI/ARJ (रिलीज़ आईडी: 2206480) आगंतुक पटल  : 100 Ministry of Communications 2025 Year End Review for Department of Posts प्रविष्टि तिथि:\r\n                        19 DEC 2025 2:09PM by PIB Delhi Ministry of External Affairs has associated with Department of Posts to leverage the Post Office network and provide passport services to people in their vicinity; As on 30.11.2025, 452 Post Office Passport Seva Kendras (POPSKs) are operational 1,552 Aadhaar Camps were organized in schools for mandatory biometric updates of children turning 5 and 15 years old during the National Postal Week in October; 4,335 Aadhaar enrolments and 35,606 Aadhaar updations were carried out From January 2025 to November 2025, more than 2.35 Crore Aadhaar enrolment and updations were carried out, generating a revenue of Rs. 129.13 Crore Department of Posts successfully distributed 28,13,627 National Flags under Har Ghar Tiranga campaign 4.0 during the year 2025 From January 2025 to November 2025, 1,69,368 Prime Minister’s Employment Generation Programme (PMEGP) units have been verified Memorandum of Understanding (MoUs) signed between the Department of Posts, the Unit Trust of India (UTI) and the Specified Undertaking of the Unit Trust of India (SUUTI) for the door-to-door collection and verification of KYC documents from mutual fund investors; Around 5 lakh KYC verifications have been completed as on 30.11.2025 Landmark MoU signed with Association of Mutual Funds in India (AMFI), to streamline KYC verification for Mutual Fund investors of all 50 Asset Management Companies registered with AMFI; M oU(s) also signed with Nippon India Mutual Fund and SBI Mutual Funds DoP signed MoU with BSNL to leverage its unparalleled postal network of over 1.64 lakh Post Offices for sale of BSNL SIM cards and mobile recharge services across the country Department of Posts, supported by NRSC-ISRO and IIT Hyderabad, designed DIGIPIN, a 10-character alphanumeric code that uniquely identifies every 4 × 4 metre grid across India; Initiative received Special Mention award for Innovation in the Postal Sector at the Asian-Pacific Postal Union (APPU) Business Forum 2025 A key milestone during the year was the successful launch of the UPI–UPU interlinkage, integrating India’s Unified Payments Interface (UPI) with the UPU’s Interconnection Platform (IP) Department of Posts organized the first Asia-Pacific Postal Leaders Forum in Jaipur under the aegis of the Universal Postal Union in March; Participation from Delegates from around 28 countries across the Asia-Pacific region, including the Secretary General of the Asia Pacific Postal Union (APPU) Bilateral International Tracked Packet Service (ITPS) Agreement between India Post and Russian Post was formally signed at DakBhawan Commemorative Postage Stamps on 42 issues were released during the period 1 st January 2025 to 30 th November 2025; Significant commemorations included 100 Years of Rashtriya Swayamsevak Sangh, 125 Years of Kodaikanal Solar Observatory, President's Bodyguard, 50 Years of Statehood of Sikkim, 150 Years of Vande Mataram among others From 1 st January 2025 to 30 th November 2025, 47 Customized My Stamps released including those of national importance like the engineering marvel, the Chenab Railway Bridge; 90 years of the Reserve Bank of India; 50 Years of Karnataka State Police; 75 years of the National Sample Survey (NSS); and the 100th Birth Centenary of renowned environmentalist Gaura Devi 1. Post Ofﬁce Passport Seva Kendras In view of greater mobility of the Indian population in search of education, better work opportunities, and other social commitments, passport has become a necessary document that everyone needs to obtain. Given the ever-increasing demand for passport services and to provide convenience to citizens who previously had to travel long distances to get passports, the Ministry of External Affairs has associated with the Department of Posts to leverage the Post Office network and provide passport services to people in their vicinity by establishing Post Office Passport Seva Kendras (POPSKs). It has been mutually decided by DOP & MEA to open a POPSK in each Lok Sabha constituency. As on 30.11.2025, 452 POPSKs have been operationalized. More than 29 lakh passport applications, including 1.54 lakh Police Clearance Certificates (PCC), and have earned a revenue of Rs. 114.88 crore for the Department for the period from January 2025 to November 2025. The following 10 POPSKs have been operationalized during the period from January 2025 to November 2025: Araku SO, Andhra Pradesh Circle (22.01.2025) Tirupur HO, Tamil Nadu Circle (24.01.2025) Bakhra SO, Bihar Circle (22.03.2025) Rajnagar SO, Bihar Circle (22.03.2025) Kalpetta HO, Kerala Circle (09.04.2025) Khargaon HO, Madhya Pradesh Circle (17.04.2025) Bhind HO, Madhya Pradesh Circle (19.04.2025) Kushinagar SO, Uttar Pradesh Circle (30.04.2025) Mandla, Madhya Pradesh Circle (14.11.2025) Pollachi, Tamil Nadu Circle (29.11.2025) Inauguration of Mandla POPSK, Madhya Pradesh Circle on 14.11.2025 Inauguration of Mandla POPSK, Madhya Pradesh Circle on 14.11.2025 2. Post Ofﬁce Aadhaar Updation and Enrollment Centre Thirteen thousand three hundred fifty-two (13352) Aadhaar Centers were set up across India in Post Offices with the aim of providing citizen-centric services in the vicinity of the citizens. The facility of these Post Office Aadhaar Centers has brought convenience to citizens in generating new Aadhaar cards and updating their Aadhaar cards in case of any change or mismatch. To reach out to the masses in the remotest areas of the country, India Post has also distributed Mobile/Laptop Aadhaar kits to the Post Offices. Because of these Aadhaar Mobile/Laptop kits, Aadhaar Updation/Enrolments can now be done in camp mode, thus helping the masses, especially DBT beneficiaries, to obtain benefits of different government schemes. The Department of Posts, in collaboration with the Army Postal Service (APS) and the Unique Identification Authority of India (UIDAI), has started Aadhaar services for Defense personnel. Aadhaar center has been operationalized at Siachin, which marks the highest Aadhaar center in the country. So far, 110 Aadhaar centers are functional in APS. 1,552 Aadhaar Camps were organized in schools for mandatory biometric updates of children turning 5 and 15 years old during the National Postal Week in October 2025 in which 4,335 Aadhaar enrolments and 35,606 Aadhaar updations were carried out. During the period from January 2025 to November 2025, more than 2.35 Crore Aadhaar enrolment and updations have been carried out, generating a revenue of Rs. 129.13 Crore. Mainly two (2) types of services are provided in Post Office Aadhaar Centres: Aadhaar Enrolment : The Enrolment process involves the electronic capture of demographic and biometric information of residents. Aadhaar Updation : Mandatory update: Update of details in Aadhaar is mandatory once in ten years. Demographic Updation, such as Name, Email ID, Mobile Number, Address, Date of Birth, etc. Biometric Updation, including facial images, 10 fingerprints, and iris, are updated through post offices. Aadhaar Centre, Ambala GPO, Haryana Circle Aadhaar Centre, Indore GPO, Madhya Pradesh Circle Aadhaar Camp at Geeta Adarsh Vidyalaya, Solan Division, Himachal Pradesh Circle Aadhaar Camp at C M Rise School, Chhindwara Division, Madhya Pradesh Circle 3. Har Ghar Tiranga Campaign 2025 To facilitate extensive participation of citizens in the Har Ghar Tiranga campaign run by the Ministry of Culture and MyGov to celebrate India's independence, Department of Posts successfully distributed 28,13,627 National Flags under Har Ghar Tiranga campaign 4.0 during the year 2025. National Flags were made available in every Post Office for offline sale/distribution and also available through e-PostOffice Portal for online sale/distribution during the campaign. To promote participation in the campaign, postal employees held wide-spread rallies, prabhat pheries, door to door campaigns, bike rallies, letter-writing and rakhi-making for school children etc. Tiranga rally by Postal Staff at Agra Division, Uttar Pradesh Circle 4. Physical Verification of Prime Minister’s Employment Generation Programme (PMEGP) Units: An MoU was signed between the Department of Posts and the Khadi & Village Industries Commission (KVIC) on 20.08.2024 for physical verification of Prime Minister’s Employment Generation Programme (PMEGP) units. This verification will facilitate the adjustment of government subsidy to the loan account of beneficiaries under the Prime Minister’s Employment Generation Programme. Proof of concept has been completed successfully and pan India rollout started on 20th August 2024 in a phased manner. From January 2025 to November 2025, 1,69,368 PMEGP units have been verified. KVIC Unit Verification by Postal Staff, Bihar Circle 5. KYC (Know Your Customer) Documents Verification/Collection: Memorandum of Understanding (MoUs) have been signed between the Department of Posts and the Unit Trust of India (UTI) on 24.07.2023 and between the Department of Posts and the Specified Undertaking of the Unit Trust of India (SUUTI) on 23.04.2024 for the door-to-door collection and verification of KYC documents from mutual fund investors. Around 5 lakh  KYC verifications have been completed as on 30.11.2025. New Initiative: KYC Verification through India Post KYC verification by postmen and other field officials of India Post bridges the gap between the formal financial system and the under covered sections of society fostering economic empowerment and financial inclusion, reducing inequality and contributing to the overall development of the nation. The collaboration between DoP and Mutual Fund companies for KYC (Know Your Customer) verification of their investors is an initiative to streamline and simplify the KYC process for investors. The Department of Posts (DoP) has signed MoU(s) with Nippon India Mutual Fund and SBI Mutual Funds on 03.04.2025 and 29.04.2025 respectively, for the KYC verification of their investors. The Department of Posts (DoP) has also signed a landmark MoU on 17.07.2025 with the Association of Mutual Funds in India (AMFI) , to streamline KYC verification for Mutual Fund investors of all 50 Asset Management Companies registered with AMFI. Through this partnership, DoP will utilize its network of 1.64 lakh post offices to assist mutual fund investors in completing and verifying KYC documents, which will help them attain “KYC Validated\" status.  This initiative is a significant step towards ensuring regulatory compliance for legacy investors residing in far corners of the country. It will help investors revive their folios and continue to invest seamlessly in mutual funds. This pathbreaking initiative promotes financial inclusion, particularly in remote and underserved areas, and complies with SEBI regulations to ensure secure and efficient investor servicing. Signing of MoU between Department of Posts and NIPPON India MF on 03.04.2025 Signing of MoU between Department of Posts and SBIMF on 29.04.2025 Signing of MoU between Department of Posts and AMFI on 17.07.2025 New Initiative: Distribution of Mutual Funds through India Post The Department of Posts (DoP) and the Association of Mutual Funds in India (AMFI) signed a pioneering MoU on 22.08.2025 , during the 30th Foundation Day Celebration of AMFI in Mumbai. This landmark agreement marks the beginning of a new service model where India Post will act as a distributor to facilitate mutual fund investments through its extensive postal network, particularly benefitting citizens in rural and semi-urban areas. DoP staff will function as mutual fund distributors to enhance mutual fund penetration in smaller towns and rural regions where access to structured financial products has traditionally been limited. India Post has an extensive presence in rural and semi-urban regions across the country, where awareness about mutual fund investments remains relatively low. The initiative aims to broaden access to mutual fund products, leveraging the trust and reach of post offices across the country. Signing of MoU between Department of Posts and AMFI on 22.08.2025 New Initiative: Sale & Recharge of BSNL SIM Cards Signing of MoU between Department of Posts and BSNL on 17.09.2025 The Department of Posts (DoP), under the Ministry of Communications, Government of India, and Bharat Sanchar Nigam Limited (BSNL) have signed a Memorandum of Understanding (MoU) on 17.09.2025 , in New Delhi to expand BSNL’s mobile connectivity reach across India. Under this agreement, DoP will leverage its unparalleled postal network of over 1.64 lakh Post Offices for sale of BSNL SIM cards and mobile recharge services across the country. Through this collaboration, post offices will act as Points of Sale (PoS) for BSNL, Mobile SIM sale and for mobile recharges. BSNL will provide SIM stock and training, while DoP will onboard new customers for BSNL and facilitate transactions in a standardized and secure manner. This initiative aims to make BSNL's telecom services more accessible and affordable, particularly for citizens in the remotest parts of the country who often struggle with limited connectivity. By enabling Post Offices as service points, the partnership seeks to bridge the digital divide, empower rural households with mobile services, and advance the broader goals of Digital India, financial inclusion, and socio-economic development. The proof of concept was implemented in Assam, where it has already shown significant success, demonstrating its potential as a scalable model for nationwide rollout. Upcoming Initiatives: 1. Rural Digital Connectivity Survey for Telecom Regulatory Authority & India (TRAI) The upcoming project aims to transform rural connectivity by enabling Dak Sevaks to use a dedicated mobile application to survey the quality and speed of telecom services provided by BSNL, Jio, Airtel, Vodafone, and others across 6.5 lakh villages. Currently under active examination and consideration by both the Department of Posts (DoP) and TRAI, the initiative will help accurately map network gaps and guide improvements in rural telecom infrastructure. This, in turn, is expected to boost communication efficiency, enhance digital banking reliability, and strengthen access to essential online services for rural citizens, while also improving market linkages and economic opportunities. As part of the collaboration framework, a Memorandum of Understanding (MoU) between the DoP and TRAI is scheduled to be signed in December 2025 , marking a key milestone in taking this project forward. 2. Onsite MSME Udyam Registration Verification The upcoming project seeks to enhance the authenticity and reliability of the Udyam Registration Portal (URP) by enabling the Department of Posts’ field staff to verify the details of 3.69 crore registered enterprises. Benefits under various government schemes will be released only after verification by DoP, ensuring that subsidies and support reach genuine entrepreneurs. By strengthening the credibility of Udyam data, the initiative is expected to contribute to the creation of over 50 lakh jobs through verified micro-businesses and enable faster access to credit, government schemes, and market opportunities. It will also promote local manufacturing, exports, and broader rural economic growth. The project is under active consideration by the DoP and the Ministry of MSME, with an MoU between the two expected to be signed in December 2025. 3. Udyam Assist Portal Credit Pilot (with SIDBI) The upcoming project focuses on verifying the details of 2.73 crore Informal Micro Enterprises (IMEs) through the Department of Posts’ field staff, ensuring that benefits under the scheme are disbursed only after proper verification by DoP. By authenticating IME data, the initiative aims to support entrepreneurship, enable small businesses to expand, and help them generate sustainable income. It will also strengthen the rural credit ecosystem, drive financial inclusion, and contribute to grassroots-level “Make in India” efforts, ultimately fostering economic empowerment in rural areas. The project is currently under active consideration by the DoP and the Ministry of MSME, with an MoU between the two scheduled to be signed in December 2025 . FS Division e-KYC: Aadhaar-based e-KYC (Electronic Know Your Customer) has been introduced across all Departmental Post Offices pan-India with effect from 06.01.2025 for the onboarding of new customers. e-KYC is a digital method of verifying the identity of customers through electronic records and enables Post Offices to authenticate customers quickly and securely without relying on physical documents. As of November 2025, a total of 1,09,878 accounts have been opened through the e-KYC facility, and 24,45,029 transactions have been carried out. Revamped ATM Network: Department of Posts has undertaken a comprehensive revamp of its ATM network across the country to enhance service delivery and customer convenience. New and upgraded infrastructure is being provided at all 1,000 ATM sites to ensure smooth, secure, and uninterrupted operations. This modernization initiative has significantly improved system reliability and transaction efficiency with faster response times and reduced downtime. The initiative reflects the Department’s commitment to leveraging technology for improved ATM services. DAC Division The Department of Posts, supported by NRSC-ISRO and IIT Hyderabad, designed DIGIPIN, a 10-character alphanumeric code that uniquely identifies every 4 × 4 metre grid across India. Generated from latitude and longitude coordinates, DIGIPIN functions as a permanent, GIS-based digital identifier, converting any location on India’s landmass into a precise, machine-readable address. DIGIPIN was launched on 7 March 2025, and the source code released in the public domain, enabling rapid uptake by both public and private sectors. Further, a web application called “ Know Your DIGIPIN ” was launched on 27 May 2025, to make it convenient for the public to generate their DIGIPIN through their latitude–longitude coordinates and vice versa. By enabling accurate, geocoded and standardised location addressing, DIGIPIN can improve service delivery in various sectors like e-commerce logistics, welfare programme implementation, and emergency response systems, amongst others. At present, it has been integrated with platforms such as ISRO’s BHUVAN, Gram Manchitra, and Rajdharaa, and other central and state level government systems. Special Mention: In December 2025, the initiative received a Special Mention award for Innovation in the Postal Sector at the Asian-Pacific Postal Union (APPU) Business Forum 2025 in Bangkok. International Relations & Global Business Division The 28 th Universal Postal Union (UPU) Congress was held in Dubai from 8th to 19th September 2025. India’s leadership and standing within the global postal community were strongly reaffirmed, with the country being re-elected to both the Council of Administration (CA) and the Postal Operations Council (POC), securing votes among the highest by any member country in our region. A key milestone during the year was the successful launch of the UPI–UPU interlinkage, integrating India’s Unified Payments Interface (UPI) with the UPU’s Interconnection Platform (IP). India further strengthened its postal diplomacy by enhancing cooperation with Regional Unions through the signing of Letters of Intent (LoI) with Pan African Postal Union (PAPU), the Postal Union of the Americas, Spain and Portugal (PUASP), and the Caribbean Postal Union (CPU), thereby reinforcing engagement with the Global South. These LoIs establish a structured framework for cooperation between the Department of Posts and the respective unions, aimed at strengthening bilateral and multilateral collaboration in the postal sector. Department of Posts also organized the first Asia-Pacific Postal Leaders Forum in Jaipur under the aegis of the Universal Postal Union from 19 th to 21 st March, 2025. The forum provided a platform for deliberations on strengthening postal networks and promoting international collaboration, and was attended by delegates from around 28 countries across the Asia-Pacific region, including the Secretary General of the Asia Pacific Postal Union (APPU). Furthermore, a bilateral International Tracked Packet Service (ITPS) Agreement between India Post and Russian Post was formally signed at DakBhawan on 4 th December 2025. The Agreement establishes the framework governing the exchange, handling, tracking, and delivery of International Tracked Packet consignments between the two postal administrations. Its implementation is expected to strengthen bilateral postal cooperation, enhance service reliability, and facilitate smoother cross-border movement of tracked postal items between India and the Russian Federation. Dak Ghar Niryat Kendra Dak Ghar Niryat Kendra (DNK) is a transformative national initiative of the Department of Posts aimed at democratising exports by enabling small producers, artisans, weavers, women entrepreneurs, self-help groups (SHGs), MSMEs and rural enterprises to directly export in global markets without intermediaries. It is implemented in collaboration with Indian Customs and the Directorate General of Foreign Trade (DGFT). DNK has expanded India’s export facilitation infrastructure from 20 Foreign Post Offices (FPOs) to 1,013 dedicated DNKs across 762 districts, including 122 DNKs in the North Eastern Region, thereby bringing export services to the doorsteps of businesses in the hinterland. DNK provides an end-to-end phygital (physical + digital) export enablement ecosystem through a single digital platform. Exporters can complete the entire export lifecycle—one-time registration, KYC, self-booking, label generation, invoice and document upload, faceless customs assessment, digital compliance, Let Export Order (LEO),online payments, shipment tracking and provision to download e-Postal Bill of Export etc. This has eliminated paper-based and time-consuming procedures, reduced transaction time from 2–3 days, lowered costs significantly, improved transparency and enabled real-time interaction between exporters and Customs. The initiative has resulted in complete digitalisation of postal export processes, supported by trained personnel at district-level DNKs who provide continuous handholding to first-time exporters. Seamless integration of DNK with ICEGATE, DGFT, GSTN, Central drugs control organization (CDSCO),  RBI and global postal networks through UPU applications has ensured regulatory compliance and smooth cross-border movement. Exporter-centric features such as dashboards, automated document generation, real-time updates and free API access for aggregators and e-marketplaces further enhance ease of doing business. As of date, DNK has facilitated over 12.31 lakh export shipments with an export value of approximately ₹287 crore, while significantly reducing export costs and delays. DNK is a gender-inclusive and socially impactful initiative, empowering women-led enterprises, SHGs, micro-sellers and rural artisans to participate in global trade. Its contribution to inclusive trade has received international recognition, including the Special Recognition Award at the 1st UPU Trade Post Awards 2023 (Geneva) for promoting women’s participation in exports and a Special Mention for Innovation in the Postal Sector by the Asia-Pacific Postal Union in 2024. Developed in-house, DNK’s scalable digital architecture, continuous capacity building, institutionalised counters and strong multi-agency coordination ensure long-term sustainability, resilience during disruptions and readiness for future expansion, firmly positioning the postal network as a national export facilitation backbone. The Department has organised workshops for marketing executives to create awareness of international mail operations and DNKs. This year National level workshop has been organised at Chennai, Mumbai, Vadodara& Lucknow in 2025. The workshops with exporters are also being organized in colocation with Export Promotion Councils, DGFT, Customs etc. Philately Division Release of Stamps 1.1 Commemorative Postage Stamp Commemorative Postage Stamps on 42 issues were released during the period 1 st January 2025 to 30 th November 2025, commemorating contributions made by various Personalities/ Important Events/ Occasions /Institutions/ Achievements and Joint Issues with friendly nations. Some of the significant commemorations were 100 Years of Rashtriya Swayamsevak Sangh, 125 Years of Kodaikanal Solar Observatory, President's Bodyguard, 50 Years of Statehood of Sikkim, 150 Years of Vande Mataram etc. India Post, in collaboration with MyGov, the Ministry of External Affairs (MEA), and the United Nations, organised a nationwide Stamp Design Competition to commemorate 80 years of the United Nations. The initiative witnessed an overwhelming response, with around 7.4 lakh students participating from across the country and 7,705 entries received for national-level were evaluated. After a comprehensive assessment, the top ten entries were selected for awards, and the top three designs were used to create the commemorative postage stamp, FDC and brochure, which were released on 24th October, 2025. In 2025, the Department of Posts commemorated key milestones in India’s diplomatic engagements through the release of a series of Joint Issue postage stamps. These included Joint Issues with Israel, as well as special commemorative stamps marking 50 years of the re-establishment of diplomatic relations with Portugal; 60 years of diplomatic relations with the Maldives; the 75th anniversary of India–Philippines diplomatic relations; and the 70th anniversary of diplomatic relations between India and Mongolia. Each issue highlights India’s enduring commitment to fostering mutual goodwill, cultural exchange, and strong international partnerships. Stamps were also issued to commemorate great personalities like M.S. Swaminathan, Sardar Vallabhbhai Patel, Laxmidas Borkar, Rani Chennabhairadevi, Sitaram Maroo etc. Stamps were issued to showcase heritage of India such as G.I. Products of Bihar, Maha Kumbh and 11th International Day of Yoga, 150 Years of Vande Mataram etc. 1.2 Customized My Stamp Customized My Stamp is a personalised sheet of Postage Stamps wherein Corporates, Organisations and Institutions can get customized sheets printed. From 1 st January 2025 to 30 th November 2025, 47 Customized My Stamps have been released. During the year, the Department of Posts issued several Customized ‘My Stamp’ releases of national significance. These included a My Stamp featuring the engineering marvel, the Chenab Railway Bridge; 90 years of the Reserve Bank of India; 50 Years of Karnataka State Police; 75 years of the National Sample Survey (NSS); and the 100th Birth Centenary of renowned environmentalist Gaura Devi. Commemorative Postage Stamps released from 1 st January, 2025 to 30 th November, 2025 Sl.No. Name of Stamp Date of release Denomination Category 1 Peasant Uprising of Patharughat-1894 28.01.2025 500 p Event 2 India Israel 11.02.2025 5000 p, 5000 p Joint Issue 3 Maha Kumbh 2025 13.02.2025 1500 p Event 4 National School of Drama 16.02.2025 1000 p, 1000 p Institution 5 G.I. Products of Bihar 11.03.2025 500 p, 500 p, 500 p, 500 p, 500 p Thematic 6 5th Battalion the Rajput Regiment 22.03.2025 500 p Institution 7 Mata Karma 25.03.2025 500 p Personality 8 50 Years of reestablishment of Diplomatic Relations between India and Portugal 07.04.2025 5000 p, 5000 p Joint Issue 9 Birth Centenary of Legends 01.05.2025 2500 p Personality 10 125 Years of Kodaikanal Solar Observatory 16.05.2025 500 p Institution 11 50 Years of Statehood of Sikkim 29.05.2025 500 p Event 12 300th Birth Anniversary of Ahilya Bai Holkar 31.05.2025 500 p Personality 13 125 Years of RajBhawan Nainital 20.06.2025 500 p Institution 14 11th International Day of Yoga 21.06.2025 500 p Event 15 100th Birth Anniversary of Acharya Vidyanand 28.06.2025 500 p Personality 16 125th Birth Anniversary of SYAMA PRASAD MOOKERJEE 9.07.2025 500 p Personality 17 Chandrabhanu Gupta 13.07.2025 500 p Personality 18 Centenary Celebration of Mysore Medical College and Research Institute 17.07.2025 500 p Institution 19 Rani Chennabhairadevi 24.07.2025 500 p Personality 20 60 Years of establishment of Diplomatic Relations Between India and Maldives 25.07.2025 6000 p, 6000 p Joint Issue 21 Purshottamdas H. Purohit 02.08.2025 500 p Personality 22 75th Anniversary of India-Philippines Diplomatic Relations 05.08.2025 5000 p, 5000 p Joint Issue 23 M.S.Swaminathan 07.08.2025 500 p Personality 24 Laxmidas Borkar 17.08.2025 500 p Personality 25 Vithalbhai Patel First Indian Elected Speaker 24.08.2025 500 p Personality 26 Sri Madhvacharya 30.08.2025 500 p Personality 27 Centenary Year of Ranchi Institute of Neuro-Psychiatry and Allied Sciences 04.09.2025 500 p Institution 28 President's Bodyguard 30.09.2025 500 p Event 29 100 Years of Rashtriya Swayamsevak Sangh 01.10.2025 500 p Event 30 Military Nursing Service 01.10.2025 500 p Institution 31 Sitaram Maroo 11.10.2025 500 p Personality 32 70th Anniversary of the Establishment of Diplomatic Relations Between India and Mongolia 14.10.2025 5000 p, 5000 p Joint Issue 33 New Mangalore Port Authority 15.10.2025 500 p Institution 34 80 Years of the United Nations 24.10.2025 500 p Event 35 150th Birth Anniversary of Sardar Vallabhbhai Patel 30.10.2025 500 p Personality 36 150 Years of Vande Mataram 07.11.2025 500 p Event 37 150th Birth Anniversary of Acharya Jawahar Lal 16.11.2025 500 p Personality 38 Birth Centenary of Sri Sathya Sai Baba 19.11.2025 500 p (4) Personality 39 Platinum Jubilee of IIT Kharagpur 24.11.2025 500 p (2) Institution 40 THE BHARAT SCOUTS AND GUIDES – DIAMOND JUBILEE 24.11.2025 500 p Institution 41 350th Martyrdom Day of Sri Guru Tegh Bahadur Ji 25.11.2025 500 p Personality 42 K. Vaikunth, Cinematographer 27.11.2025 500 p Personality **** MI/ARJ (रिलीज़ आईडी: 2206480)",
    "scraped_at": "2025-12-19T09:46:43.858216"
  },
  {
    "id": "2206477",
    "ministry": "Ministry of Communications",
    "title": "2025 Year End Review for Department of Telecommunications",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206477",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Communications 2025 Year End Review for Department of Telecommunications प्रविष्टि तिथि:\r\n                19 DEC 2025 2:02PM by PIB Delhi DoT makes significant strides in strengthening the Indian telecom ecosystem The National Broadband Mission (NBM) 2.0 launched on 17th January, 2025; Aims to propel India into a new era of digital transformation 5G services rolled out in all States/ UTs across the country and are available in 99.9% of the districts in the country with a population coverage of 85% 5.08 lakh 5G Base Transceiver Stations (BTSs) installed by Telecom Service Providers (TSPs) across the country Optical Fiber Cable (OFC) length increased from 19.35 lakh route km (2019) to 42.36 lakh route km; A total of 2,14,843 GPs now endowed with broadband connectivity Overall tele-density in India rose to 86.65% in September 2025, up from 75.23% in March 2014 Rural telephone connections grew 42.9%; nearly double of urban increase, rising from 377.78 million in March 2014 to 539.83 million in September 2025 Internet connections crossed the milestone of 100 crore to reach 100.29 crore, as against 25.15 crore in March 2014, registering growth of 298.77% Broadband connections rose from 6.1 crore in March 2014 to 99.56 crore in 2025, growing by 1,532.13% Average monthly data consumption per wireless data subscriber increased by 399 times to 24.01 GB in 2025, up from 61.66 MB in March 2014, one of the highest in the world The median mobile broadband download speed witnessed a substantial increase, rising from 10.71 Mbps in 2019 to an impressive 131.47 Mbps in October 2025 India becomes only the 5th country in the world to develop its indigenous 4G stack, through collaboration among C-DOT, Tejas Networks and TCS and deployment by BSNL DoT re-farmed 687 MHz of spectrum in various frequency bands viz. 6425-7025 MHz, 2500-2690 MHz and 1427-1518 MHz, for IMT based services DoT in collaboration with COAI organised Asia’s largest technology and innovation forum, the ninth edition of India Mobile Congress (IMC 2025) Atmanirbhar Bharat- PLI records sale of Rs. 96,240 crore, exports of Rs. 19,240 crore and employment generation of around 30,000 DoT introduces “Financial Fraud Risk Indicator (FRI)” to strengthen Cyber Fraud Prevention; RBI mandates integration of FRI into banking systems; Generated alerts for more than 70 lakh fraudulent transactions, preventing financial loss of around ₹450 crore for citizens Sanchar Saathi mobile app launched in Hindi, English and 21 regional languages; recorded more than 1.5 crore downloads since its launch; Sanchar Saathi portal records 22 crore visitors 26.35 lakhs lost/stolen handsets traced, 7.3 lakh handsets returned to rightful owners, 6.21 lakhs fraud-linked IMEIs blocked with the help of Sanchar Saathi initiative DoT puts in place Device Setu – Indian Counterfeited Device Restriction (ICDR) system to allow manufacturers, brand owners, and importers to register and generate IMEI certificates free of charge DoT guides pan-India Implementation of indigenous Cell Broadcasting for alerts dissemination DoT ensures resilient telecom infrastructure and uninterrupted services during: Himachal pradesh, Uttarakhand, Punjab and Jammu & Kashmir floods, cloudbursts and landslides and Cyclones Montha and Ditwah, and during Operation Sindoor Major strides achieved in advancing indigenous 6G research and development under the ambitious Bharat 6G Mission DoT launches Sanchar Mitra 2.0, a youth-oriented initiative aimed at harnessing the energy and potential of young students to raise public awareness about mobile safety, telecom fraud prevention, and about government digital initiatives The Department of Telecommunications (DoT) looks back on 2025 as a year of profound transformation, highlighted by major achievements in connectivity, digital infrastructure, citizen‑centric governance, and technological self‑reliance. This period witnessed unprecedented growth in telephone and internet penetration, alongside record-low data costs, powerfully reinforcing India's position as a global digital powerhouse. The rapid expansion of optical fibre and 5G infrastructure, coupled with decisive regulatory reforms under the Telecommunications Act, 2023, marked a pivotal moment for the sector. A central theme of the year was the dramatic strengthening of the telecom ecosystem’s security and accountability, spearheaded by the success of the citizen-centric initiatives like Sanchar Saathi and FRI. In line with the Atmanirbhar Bharat vision, the large-scale rollout of home-grown network infrastructure also gained significant momentum. India became only the 5 th country in the world to have its own 4G stack, upgradable to 5G, demonstrating India’s commitment to technological self-sufficiency. While it took decades to develop such technology in other parts of the world, it took just 2 years to develop such technology. Coupled with this, major strides were achieved in advancing indigenous 6G research and development under the ambitious Bharat 6G Mission . India is emerging as a global leader in telecom—shaping global standards, contributing to international policy dialogues, and positioning itself at the forefront of the next generation of communication technologies. Guided by the vision of ‘Local for Global’ and a commitment to strengthening the startup ecosystem and inclusive growth, the DoT has shaped its digital transformation strategy around the DSS approach— Design in India, Solve in India, Scale for the World. INDIAN TELECOM SCENARIO IN 2025 Telephone Subscriptions: Total telephone connections in India grew from 933 million in March 2014 to 1228.94 million in September, 2025 posting a growth of 31.72%. The number of mobile telephone connections stood at 1182.32 million at the end of September, 2025. The overall tele-density in India was 75.23% in March 2014 which rose to 86.65% in September, 2025. Urban telephone connections rose to 689.11 million in September, 2025 as compared to 555.23 million in March 2014, growing by 24.11% while the growth in rural telephone connections was 42.9% which is nearly double of urban increase, rising from 377.78 million in March 2014 to 539.83 million in September, 2025. Internet & Broadband Penetration: Internet connections crossed the milestone of 1 billion to 100.29 crore in June, 2025 compared to 25.15 crore in March, 2014, registering a growth of 298.77%. Broadband connections rose from 6.1 crore in March, 2014 to 99.56 crore in September, 2025 growing by 1532.13%. Average monthly data consumption per wireless data subscriber increased by 399 times to 24.01 GB in June, 2025 from 61.66 MB in March, 2014. The median mobile broadband download speed witnessed a substantial increase, rising from 10.71 Mbps in 2019 to an impressive 131.47 Mbps in October 2025. Similarly, the median fixed broadband download speed increased from 29.25 Mbps in 2019 to 60.34 Mbps in October 2025, according to Ookla’s Speedtest Global Index. Optical Fiber Cable (OFC) length increased from 19.35 lakh route km (2019) to 42.36 lakh route km (as of Sep, 2025). BTS and Towers: The numbers of Mobile Base Transceiver Stations (BTS) are 31.44 lakh as on 31.10.2025. The numbers of mobile towers are 8.43 lakh as on 31.10.2025. Inflow of FDI: FDI (equity flow) in the telecommunication sector during 2024-25 was US $746 million. Data cost: Average cost of 1 GB of mobile data is $0.10 as compared to $0.16 last year. TELECOM REFORMS Telecommunication Act, 2023 The Department is presently in the process of framing of rules under various sections of the Telecom Act, 2023. The Central Government, till date, has enforced 43 sections (out of 62 sections) and notified rules under 14 provisions of the Act. Draft rules under provisions related to authorization, assignment/management of spectrum, regulatory sandbox, etc. are at various stages of drafting/public consultation. Reforms related to Citizens Centric Services and prevention of misuse of Telecom resources for cyber-crime and financial frauds. Sanchar Saathi Portal: The citizen-centric Sanchar Saathi portal ( www.sancharsaathi.gov.in ), launched in 2023 is available in 21 languages and has recorded over 22 crore visits to date. On average, the portal receives around 2.4 lakh visitors per day, and in the current year, the daily visitor count has further increased to approximately 3.7 lakh users. A new module, Trusted Contact Details has been added on Sanchar Saathi portal in 2025. This module has contact details like toll-free numbers, emails, and genuine websites of banks, financial institutions, and government bodies. Sanchar Saathi Mobile App: DoT launched Sanchar Saathi Mobile App on 17.01.2025 in order to provide the convenience of reporting fraudulent calls, blocking/unblocking of lost/stolen mobile handset, knowing mobile connections issued in citizens name etc. The newly launched Sanchar Saathi Mobile App is available for download on both the Google Play Store & Apple App Store and available in Hindi, English & 21 regional languages, ensuring its inclusivity and accessibility nationwide. Sanchar Saathi mobile app has recorded more than 1.5 crore downloads since its launch. Digital Intelligence Platform (DIP): The Digital Intelligence Platform (DIP) was launched in 2024 for sharing of information related to misuse of telecom resources among the stakeholders for prevention of cyber-crime and financial frauds. At present over 850 organizations including Telecom Service Providers (TSPs), MHA, UIDAI, SEBI, FIU, NPCI, Central LEAs, 800+ banks and financial institutions, 35 States/UTs police, central agencies and other stakeholders have on-boarded this platform. This platform, inter-alia, hosts the list of disconnected mobile connections on near real time basis along with the reasons for disconnections enabling the stakeholders to take appropriate action including to disengage the associated services linked with these mobile numbers. Financial Fraud Risk indicator (FRI): In a major step towards combating cybercrime and financial frauds based on pro-active intelligence, the DoT introduced Financial Fraud Risk Indicator (FRI) in May 2025. FRI categorizes mobile numbers based on their potential risk of involvement in financial fraud - medium, high or very high. It allows banks, financial institutions, NBFCs, and UPI service providers to identify threats early and take preventive action like generating alerts, warnings, transaction delays, declines or account restrictions. As reported by stakeholders, Banks/UPI platforms have declined transactions and generated alerts for more than 70 lakh fraudulent transactions, preventing a financial loss of around ₹450 crore for citizens. RBI in collaboration with DoT has issued advisory on integration of the FRI into banking systems to enhance protection and prevention of suspicious transactions. PFDRA issued advisory to Pension Funds & Central Recordkeeping Agencies (CRAs) on adoption of FRI. DoT and Financial Intelligence Unit (FIU)-IND have signed a Memorandum of Understanding (MoU) in September 2025 to strengthen efforts against telecom enabled cyber-crimes and financial frauds. International Incoming Spoofed Calls Prevention System: The system was launched in October 2024 to identify and block incoming international calls spoofed with Indian mobile numbers. It has reduced such malicious call attempts to 1-2 lakh per day as on date. Even these call attempts are blocked at the International Long-Distance gateways itself. Blocking of International Carriers/Aggregators: Analysis of crowd-sourced Chakshu data prompted the blocking of unused area/satellite codes and the blocking of over 309 international carriers/aggregators repeatedly sending spoofed call traffic to India. Based on DoT instructions, major telecom service providers have implemented displaying \" International Call \" to subscribers in all incoming calls with international numbers to India so that citizens can take informed decision and prevented from being victim of cybercrime and financial frauds. Device Setu – Indian Counterfeited Device Restriction (ICDR) system: The system is in place to allow manufacturers, brand owners, and importers to register and generate IMEI certificates free of charge. In 2025, over 48,000 certificates have been issued to local manufacturers and 27,000 to importers, covering ~29.43 crore devices till date. DoT has disconnected approximately 2 lakh Direct Inward Dialing (DID)/landline telephone numbers that were found to be involved in unauthorized promotional activities and illegal activities. In the backdrop of the Indian Telecommunications Act 2023, under Section 22(1) and (2), DoT notified the Telecommunications (Telecom Cyber Security) Rules, 2024 in year 2024. DoT has notified the Telecommunications (Telecom Cyber Security) Amendment Rules, 2025. These Rules aim to safeguard India's communication networks and services. These rules impose stringent obligations on operators from conducting regular security audits to reporting incidents, while prohibiting the tampering of IMEIs. These regulatory measures ensure that both service providers and device importers prioritize cybersecurity and subscriber protection. DoT has partnered with the Railway Protection Force (RPF) to enhance the recovery process of stolen or lost mobile phones in trains through ‘Block your lost / stolen mobile handset’ or Central Equipment Identity Register (CEIR) facility of Sanchar Saathi portal. Summary of Tangible Impact and Outcomes of DoT efforts: (Data till November, 2025) Sr. No. Heading Count 1 Visitors on Sanchar Saathi portal (www.sancharsaathi.gov.in) 22 crore 2 Downloads of Sanchar Saathi mobile app 1.5 crore 3 Mobile number disconnections after re‑verification failures based on ASTR analysis 86 lakh 4 Mobile number disconnections based on inputs of various stakeholders 97.5 lakh 5 Mobile number disconnections for exceeding individual connection limit 1.82 crore 6 Mobile number disconnections based on citizen feedback on Sanchar Saathi (Not My Number/Not Required) 1.94 crore 7 Lost/Stolen mobile handsets traced via CEIR 26.35 lakh 8 Lost/Stolen mobile handsets returned to rightful owners by police 7.3 lakh 9 IMEIs blocked (cyber‑crime/financial‑fraud involvement) 6.21 lakh 10 Point of Sale (SIM sellers) blacklisted 75,410 11 WhatsApp profiles/groups disengaged 28.89 lakh Centralized Right of Way (RoW) Portal One of the salient features of the Telecommunications Act, 2023 is 'Digital by Design': The Act mandates that its implementation shall be digital by design. Accordingly, the Centralized RoW portal was upgraded as per RoW rules, 2024 from 01.01.2025. Later the portal was incorporated into the Unified Portal of DoT named as ‘Telecom eServices Portal’. The portal has streamlined the process of granting permissions for Right of Way applications, reducing the approval time for application processing by ~13x from 448 days (2019) to approx. 34 days (as of Nov, 2025) and ~25% of applications are now being disposed of within 15 days. The portal has successfully streamlined approvals in a time-bound manner leading to a substantial increase in the approval of Towers and Optical Fiber Cable permissions (3.81 lakh applications disposed so far). This acceleration has enabled more mobile connections and improved service quality, effectively bridging the digital divide, especially in rural and remote areas. Implementation of Right of Way (RoW) rules, 2024 across country The Government of India, Department of Telecom has notified the Telecommunications (Right of Way) Rules, 2024 on 17th September, 2024, which came into effect on the 1st day of January, 2025. It, inter-alia, aims to significantly streamline and mitigate several challenges faced in the rollout of telecom infrastructure: Single Window Approval System: Establishment of a unified, single window system for telecom infrastructure approval. This reduces the delays that telecom companies previously faced when obtaining permissions from various local, state, and central authorities. Clear Timelines: The new rules set strict timelines for granting approvals. Uniformity across States and Local Authorities: The rules standardize the process for obtaining RoW permissions across different states and municipalities. This consistency helps telecom companies avoid navigating varying requirements in each region. Facilitating Efficient Use of Public Land/Building: The public entity which is responsible for the infrastructure project or class of infrastructure projects, shall make available such common ducts or conduits or cable corridors for the installation of telecommunication network, on an open access basis, that is, non-discriminatory and non-exclusive, subject to prescribed conditions. Faster Dispute Resolution: The rules introduce a dispute resolution mechanism, allowing telecom companies to resolve conflicts with local authorities or landowners faster than before. Encouraging Shared Infrastructure: The rules also encourage infrastructure sharing between telecom providers, reducing the need for multiple towers or infrastructure in the same area. PM Gati Shakti National Master Plan (NMP) Platform Department of Telecommunications (DoT) has mapped ~13.5 Lakh Route Km of OFC of PSUs, ~43,000 km OFC of state governments, ~8.40 Lakh Telecom towers having ~31.31 lakh (Base Transceivers) BTSs, ~3.15 lakh PM- WANI Wi-Fi hotspots and planned mobile towers from various DBN (Digital Bharat Nidhi) projects on the PM Gati Shakti NMP platform. The mapping of telecom assets has aided in planning new infrastructure projects and rolling out new technologies such as 5G. This comprehensive mapping has enhanced strategic decision-making, optimized resource allocation and accelerate the deployment of telecom infrastructure. Reducing Compliance Burden With the objective of enhancing Ease of Living and Ease of Doing Business, the department has launched an ambitious initiative to reduce compliance burden by simplifying both Government-to-Citizen and Government-to-Business interfaces. In line with this initiative, the Department of Telecommunications (DoT) identified 114 compliances for removal or rationalization, of which 110 have already been addressed. Further, following consultations with service providers, the requirements for various periodical reports were reviewed, resulting in the discontinuation of several non-essential reports, increased periodicity for many others, and a transition from physical to digital submissions for multiple compliance requirements. This has significantly streamlined procedures and reduced operational burden on stakeholders. The department has strengthened ease of doing business by extending the validity of Pro Tem Security Certification—from the earlier six months to two years—enabling smoother business continuity for telecom and ICT manufacturers. With 102 certificates already issued, the longer validity will significantly reduce renewal pressures on industry. This move complements DoT’s July 2025 reduction of up to 95% in security testing fees and simplification of processes for Highly Specialized Equipment and End-of-Sale/End-of-Life products, reaffirming the Government’s commitment to supporting domestic and global OEMs under the ComSec scheme, aligned with India’s broader MTCTE-based security certification framework. The DoT has also simplified the security testing and compliance process for Highly Specialized Equipment (HSE) and End-of-Sale/End-of-Life telecom products. These moves signal the government's resolve to enable ease of doing business for both domestic and international Original Equipment Manufacturers (OEMs) in the telecom/ICT sectors. Disaster Management Department of Telecommunications (DoT) continued to strengthen its disaster preparedness and emergency communications framework under SOP-2020, ensuring resilient telecom infrastructure and uninterrupted services during natural disasters and evolving security situations. The Disaster Management (DM) Division coordinated closely with LSAs, Telecom Service Providers (TSPs), and Central and State agencies to ensure rapid restoration of telecom networks and effective communication support for emergency services and citizens. Response and Restoration during Natural Disasters (2025) Himachal Pradesh Floods & Landslides (August 2025): Severe rainfall and landslides in Chamba, Kullu, and Lahaul-Spiti caused major disruptions. DoT enabled immediate ICR activation and Priority Call Routing (PCR). Teams, including those air-dropped in inaccessible regions with State support. Jammu & Kashmir Cloudburst & Landslides (August 2025): Heavy rainfall led to extensive fibre damages and BTS outages across Kishtwar, Doda, Ramban, Reasi, and Udhampur. A 24×7 control room was activated, and ICR remained operational from 26 August to 10 September. With special logistics support and coordination with NDMA, Army, and UT authorities, ~99% connectivity was restored within two weeks. Uttarakhand Cloudbursts – Dharali & Tharali (August 2025): Rapid activation of ICR, deployment of BTSs and small cells, and emergency fibre replacement (with Army support) enabled full restoration within 3–5 days. Punjab Floods (August 2025): Telecom backbone remained intact; BTSs in water-logged pockets were swiftly restored as the situation improved. Cyclone Montha (October 2025): In advance of landfall over coastal Andhra Pradesh and Odisha, DoT activated a 24×7 control room at Vijayawada and issued directions to all TSPs for ensuring uninterrupted network availability, adequate fuel reserves, and deployment of emergency field teams. ICR and Cell Broadcast testing were completed for all TSPs as per SOP-2020, with indigenous Cell Broadcast successfully tested with APSDMA and subsequently utilised for sending early warning alerts. Necessary COWs and mobile BTS units were pre-positioned at vulnerable locations through coordinated planning with State authorities. There was no impact on network during the event and outages of few sites were mainly due to non-availability of power, which got restored immediately on resumption of power supply. Cyclone Ditwah (November 2025): For Cyclone Ditwah, DoT and TN LSA undertook advance preparedness based on IMD warnings by reviewing readiness with all TSPs, ensuring intra-circle roaming, fuel arrangements, identification of response teams, and positioning of critical resources such as mobile DG sets and Cells-on-Wheels; coordination meetings were held with the Tamil Nadu Government, Puducherry Administration and NDMA, network status was monitored twice daily through a dedicated Telecom Control Room, and DoT officers were deployed at the State Emergency Operations Centre—resulting in zero network outages in Tamil Nadu and Puducherry during the cyclone period. Strategic Preparedness & Resilience Measures during Operation Sindoor In May 2025, the Department of Telecommunications (DoT) issued a series of comprehensive directives and action plans to strengthen the resilience and continuity of telecom services across the country. The Continuity of Telecom Services Directive emphasized safeguarding networks in border and sensitive districts through adequate fuel stocking, crew mobility facilitation, infrastructure protection, and ICR readiness. Simultaneously, DoT released an Action Plan for Infrastructure Hardening and Cyber-Resilience, outlining measures such as GIS-based risk mapping of telecom assets, enhanced power redundancy, deployment of Quick Response Teams (QRTs), readiness of VSAT and Cell-on-Wheels (COW) systems, and round-the-clock Security Operations Centre (SOC) monitoring. Further, all Telecom Service Providers (TSPs) were mandated to establish National Level Control Centres (NLCCs) for real-time network monitoring and coordinated national response during emergencies. To enhance international connectivity resilience, the Submarine Cable Resilience Programme was implemented, under which all submarine cable operators submitted detailed plans ensuring network redundancy, geographically diverse routes, and readiness of SEAIOCMA repair ships with requisite MoD/MHA clearances. Pan-India Implementation of indigenous Cell Broadcasting for alerts dissemination To strengthen India’s national public warning infrastructure, a Memorandum of Understanding (MoU) was signed between the Centre for Development of Telematics (C-DOT) and the National Disaster Management Authority (NDMA) in February 2025 for the implementation of an indigenous Cell Broadcast (CB) system across all Indian telecom networks. The initiative, undertaken under the guidance of the Department of Telecommunications (DoT) and NDMA, aims to enable the dissemination of location-specific alerts to citizens through mobile networks during natural disasters and emergencies. Following the MoU, C-DOT successfully integrated its indigenously developed CB platform across all four major Telecom Service Providers (Airtel, BSNL, Jio, and Vi), achieving more than 95% pan-India network readiness. During the year, significant milestones were achieved, including pilot testing of the CB system across all TSPs, nationwide integration testing under DoT and NDMA supervision, and live operational deployment during Cyclone Montha (October 2025) in Andhra Pradesh and Odisha. The alerts were disseminated in regional languages within 2–3 seconds, reaching affected populations effectively and demonstrating the reliability of India’s indigenous CB technology for mass public alerting. The initiative represents a major step toward achieving the vision of an “Alert for All” system, ensuring rapid and reliable dissemination of disaster warnings across the nation. 5G and 6G Rollout of 5G services 5G services have been rolled out in all States/ UTs across the country and it is available in 99.9% of the districts in the country with a population coverage of 85%. As on 31.10.2025, 5.08 lakh 5G Base Transceiver Stations (BTSs) have been installed by the Telecom Service Providers (TSPs) across the country. To accelerate the deployment of 5G services and infrastructure across the country, Government has taken several initiatives, which, inter alia, include the following: Auction of spectrum for 5G mobile services Financial reforms to rationalize Adjusted Gross Revenue (AGR), Bank Guarantees (BGs) and interest rates. Removal of Spectrum Usage Charges for spectrum acquired in auction of 2022 and thereafter. Simplification of procedure for SACFA (Standing Advisory Committee on Radio Frequency Allocations) clearance. Launch of GatiShakti Sanchar portal and RoW (Right of Way) Rules to streamline RoW permissions and clearance of installation of telecom infrastructure. Time-bound permission for use of street furniture for installation of small cells and telecommunication line. Implementation of 100 5G Labs Initiative In October 2023, the Hon’ble Prime Minister awarded 100 5G Use Case Labs. All the Labs have been set up, and operationalized since April 2025. A Gradation Framework has been developed to grade the lab’s performance and create a heathy competition among the labs. Top three institutes were felicitated in India Mobile Congress-25. The high performing institutions are being engaged in sharing experience with other institutes to improve their performance. A Competition Framework has been created, in the form 6-month long Hackathon, to create competition among students, faculty, researchers, and startups, and develop solutions for real world problems. This year’s nation-wide Hackathon was conducted from April to September 25. Experts from Industry and ITU were engaged in mentoring the participants. The winners were awarded and facilitated to showcase their products in IMC-25. Industry Leaders in telecommunication [Ericsson & Qualcomm] have been engaged in Capacity Building in Telecommunication. Bharat 6G Vision and Bharat 6G Alliance The Hon’ble Prime Minister launched the Bharat 6G Vision in March 2023, positioning India as a global leader in designing, developing, and deploying 6G technology by 2030. The Bharat 6G Alliance (B6GA) is a collaborative platform bringing together academia, industry, and government to build a comprehensive 6G ecosystem in India. The alliance focuses on research, development, and standardization of 6G technology, with the goal of making India a global leader in the emerging 6G landscape. Bharat 6G Alliance has constituted seven Working Groups on different domains of 6G like Spectrum, Technology, Applications, Green and Sustainability and use cases. In a step towards redefining the future of global communication, the Bharat 6G Alliance signed a Memorandum of Understanding (MoU) with leading research alliances for collaborative research and standardization. These MoUs with 6G research alliances will further enable development of secure and trusted telecommunication technology including resilient supply chains. The Government has taken the following initiatives to facilitate the development of 6G technology in the country: Funding two testbeds namely 6G THz Testbed & Advance Optical Communication Testbed to promote R&D and innovation in the country. 100+ research proposals have been approved on 6G network ecosystems to promote research and innovation in line with global roadmap for 6G technology. The Apex Council meeting of the Bharat 6G Mission on 10 th December 2025, chaired by Union Minister Jyotiraditya M. Scindia, highlighted India’s rapid progress toward emerging as a global 6G leader by 2030. The Council reviewed advances in indigenous 6G components, spectrum strategy, international standard-setting, and progress driven by the ₹1-lakh-crore RDI Fund. It also showcased achievements from the 5G Use Case Labs and honoured top-performing institutions. The Bharat 6G Alliance reported strong expansion to over 84 members and deepening global collaborations, reinforcing India’s commitment to building a world-class, future-ready 6G ecosystem. PROJECTS & INITIATIVES Digital Bharat Nidhi (DBN) Universal Service Obligation Fund (USOF), formed by an Act of Parliament, was established w.e.f. 01.04.2002 under the Indian Telegraph (Amendment) Act, 2003 (further amended in 2006), to provide financial support for the provision of telecom services in commercially unviable rural and remote areas of the country. The USOF was established with the fundamental objective of providing access to ‘basic’ telecom services to people in the rural and remote areas at affordable and reasonable prices. As per the Telecommunication Act, 2023 (No.44 of 2023) and the subsequent notification of Telecommunications (Administration of Digital Bharat Nidhi) Rules 2024 dated 30.08.2024, the Universal Service Obligation Fund (USOF) has been renamed as “Digital Bharat Nidhi” (DBN). The Telecommunication Act, 2023 also expanded the scope of DBN to: support universal service through promoting access to and delivery of telecommunication services in underserved rural, remote and urban areas; support research and development of telecommunication services, technologies, and products; support pilot projects, consultancy assistance and advisory support towards provision of service under clause (a) of this section; support introduction of telecommunication services, technologies, and products. BharatNet BharatNet project is being implemented in a phased manner to provide broadband connectivity to all Gram Panchayats (GPs) and villages in the country. The Phase-I has been completed in December 2017 with the implementation of over 1 lakh GPs and the remaining GPs are being connected under various models of implementation, i.e. State-led Model, CPSU-led Model and Private Sector-led model, etc. As on October 2025, 6,94,711 km of Optical Fibre Cable (OFC) has been laid and 2,09,809 GPs are Service Ready on OFC. In addition, 5,034 GPs have been connected over satellite media. Thus, a total 2,14,843 GPs are now endowed with broadband connectivity. The Amended BharatNet project is being implemented in a phased manner to provide broadband connectivity to 2.65 lakhs Gram Panchayats (GPs) and Villages beyond GPs on demand basis across the country with outlay of ₹1.39 lakh crore. Assets created under BharatNet will be National Assets owned by Digital Bharat Nidhi (DBN) under Department of telecommunications (DoT) and accessible on a non-discriminatory basis to all service providers. Saturation of 4G mobile services The Union Cabinet on 27.07.2022 approved a project for saturation of 4G mobile services in uncovered villages across the country at a total cost of Rs. 26,316 Cr. The project aimed to provide 4G mobile services in 24,680 uncovered villages in remote and difficult areas. The project has a provision to include 20% additional villages on account of rehabilitation, new-settlements, withdrawal of services by existing operators etc. In addition, 6,279 villages having only 2G/3G connectivity shall be upgraded to 4G. Implementation work of the project is under progress and till October, 2025, 17,193 towers including upgradation of 648 towers have been planned out of which 13,142 towers have been made functional covering 19,465 villages. Telecom Technology Development Fund (TTDF) The Telecom Technology Development Fund (TTDF) Scheme aims to fund research and development (R&D) in rural-specific communication technologies, fostering collaboration between academia, start-ups, research institutes, and industry to enhance the telecom ecosystem in India. The TTDF is aligned with the Hon'ble Prime Minister's vision of \"Jai Anusandhan\" and seeks to promote indigenous telecom solutions. Total 136 projects at cost of ₹ 550 Cr have been funded spanning across emerging telecom technologies viz. 5G/6G, AI, Quantum communications etc. Production Linked Incentive Scheme for Telecom and Networking products The PLI Scheme for Telecom and Networking products, effective from April 2021 with a total outlay of Rs. 12,195 crore was launched by DoT to boost domestic manufacturing of telecom products by incentivising incremental investments and turnover. The scheme has helped in increasing the sales of domestically manufactured telecom products. The scheme registers an impressive performance with cumulative investment of more than Rs. 4,646 crore, total sales exceeding Rs. 96,240 crore including exports worth Rs. 19,240 crore and employment generation of (Nos) 29,574 as on 30.09.2025 National Broadband Mission 2.0 (2025-30) The Hon’ble Minister of Communications and Development of North Eastern Region Shri Jyotiraditya M. Scindia launched the National Broadband Mission (NBM) 2.0 on 17 th January, 2025. The NBM 2.0 aims to propel India into a new era of digital transformation. Aligning with the Hon’ble Prime Minister’s vision of a Viksit Bharat by 2047, it envisions India as a global knowledge society by providing High-speed Broadband and Meaningful Connectivity for all. Building on the success of NBM 1.0. Following will be the key benefits of NBM 2.0: Extending operational optical fiber cable (OFC) connectivity to 2.70 lakh villages by 2030 with 95% uptime To provide broadband connectivity to 90% of anchor institutions like Schools, PHCs, Anganwadi Centre, and Panchayat offices by 2030. Improve the Fixed broadband download Speeds- National Average to a minimum 100 Mbps by 2030. To achieve 100% mapping of fiber networks owned by government PSUs by 2026 on PM GatiShakti National Master Plan Platform (PMGS) and use PMGS for planning of Additional Bharatnet project. For Ease of Doing Business, reduce the Right of Way application average disposal time Increase the number of rural internet subscribers per 100 population Achieve the target of powering 30% of mobile towers with sustainable energy by 2030. Collaborate with all stakeholders viz. Central Ministries and departments, States, UTs and municipalities to ensure the effective implementation of the Telecommunications (Right of Way) Rules, 2024, issued under the Telecommunications Act, 2023. Call Before u Dig (CBuD) Mobile App: Hon’ble Prime Minister launched the 'Call Before u Dig' (CBuD) Mobile Application on March 22, 2023, which provides an interface for excavating agencies/contractors to alert/inform owners of existing utility assets about their upcoming excavation route. Over the past year, CBuD has witnessed a significant rise in usage, with monthly enquiries increased from 1,211 in November 2024 to 11,258 in October 2025 — usages jumped nine-fold (9X) year on year. Sanchar Mitra The Sanchar Mitra Scheme of DoT, initially launched on a pilot basis, has now been revamped and rolled out as a regular initiative on 26.05.2025 as Sanchar Mitra 2.0. This youth-oriented initiative is aimed at harnessing the energy and potential of young students to spread awareness about safe digital behaviour. Under this scheme, student volunteers, named as Sanchar Mitra, will raise public awareness about mobile safety, telecom fraud prevention, and about government digital initiatives. They will conduct outreach in communities, schools, and public spaces to educate citizens on responsible and secure use of telecom services. Around 2,200 Sanchar Mitras have been selected by LSAs from nearly 230 reputed institutes across the country. In a short span of time, Sanchar Mitras have conducted around 100 awareness sessions on key citizen-centric telecom initiatives such as Sanchar Saathi features and EMF radiation myths. Citizens are being sensitized on: Protecting themselves from unsolicited commercial calls, spam calls, digital arrest scams, and other fraudulent communication. Identifying and reporting international scam calls using Indian numbers. Lodging complaints for lost/stolen mobile phones through CEIR. Verifying the genuineness of mobile handsets. EMF radiation myth busting Auction of Spectrum Policy Initiatives Re-farm of spectrum for IMT: For India to take a lead in the development of 6G services, re-farming of spectrum for mobile communication services is a significant step. It underscores the government’s commitment to optimize use of natural resources to enable cutting-edge mobile communication services across the nation. In this regard, the Government has re-farmed 687 MHz of spectrum in various frequency bands viz. 6425-7025 MHz, 2500-2690 MHz and 1427-1518 MHz for IMT based services. This initiative aims to bolster the reach, quality, and affordability of mobile networks, further accelerating the realization of a robust and inclusive Digital India. This move also lays a strong foundation for the advancement of next-generation technologies, including 6G. Spectrum for Wi-Fi and Intelligent Transport System: The DoT is taking important initiative to facilitate east of living for the common citizen, which include additional spectrum in the 6 GHz band for Wi-Fi, promoting next generation use cases such as Augmented Reality (AR)/ Virtual Reality (VR) and in the 70 GHz band for Intelligent Transport systems. Revision of NFAP 2022: The National Frequency Allocation Plan (NFAP) is an important document for managing India's radio spectrum, ensuring its efficient and effective use across various sectors. NFAP has been revised incorporating outcomes from the World Radiocommunication Conference 2023 and the updated ITU Radio Regulations 2024. The revision process involved consultations with various stakeholders including government agencies, private sector entities, industry associations, academic institutions, and startups to ensure that the updated NFAP addresses the evolving needs of all users. The revised NFAP aims to provide regulatory certainty, foster investment, and support the development of emerging technologies such as 5G, 6G, satellite communications etc. Process Simplification and moving the entire process to online portal has developed an online CRS module for simplification of process for issuing Community Radio Station (CRS) Licences. The Saral Sanchar portal of DoT and Broadcast Seva Portal of MIB, have been integrated for fetching of data/document from each other at different stage while processing the CRS cases. REVIVAL OF BSNL & MTNL: The Government has taken various steps for the revival of BSNL & MTNL by issuing Revival Packages in 2019, 2022 & 2023; under which several measures, including Voluntary Retirement Scheme (VRS), capital infusion through Capex support, spectrum allocation for 4G and 5G, debt restructuring, and asset monetization, have been implemented or currently in progress. As a result of the above-mentioned revival packages and efforts by GoI: BSNL has sustained revenue increase and positive EBIDTA over the last 5 years. MTNL has also become EBITDA positive in last 4 years. For the first time since FY 2008-09, BSNL has achieved a net profit of Rs. 262 Cr. in Q3 and Rs. 280Cr. in Q4 of 2024-25. BSNL has accelerated Capex investment in the last 2 years to upgrade its network and telecom infra pan India. A massive investment has been done in transmission equipment & optical fiber cable (OFC) network. This CAPEX is expected to put BSNL on a higher revenue growth trajectory in the future. In line with Atmanirbhar Bharat initiative, BSNL has placed purchase order for 1 Lakh indigenously developed 4G sites for pan India deployment. Supply of 4G equipment has started from September 2023 and as on 31.10.2025, total 97,068 4G sites have been installed and 93,511 sites are ON-Air. The equipment is upgradable to 5G. IMPORTANT EVENTS India Mobile Congress, 2025 The ninth edition of the India Mobile Congress (IMC 2025) was organized jointly by the Department of Telecommunications (DoT) and the Cellular Operators Association of India (COAI) from 8th to 11th October 2025 at Yashobhoomi, New Delhi. Recognized as Asia’s largest technology and innovation forum, IMC 2025 carried forward its vision of promoting digital transformation and technological self-reliance under the theme “Innovate to Transform.” The event was inaugurated by the Hon’ble Prime Minister of India, Shri Narendra Modi, in the august presence of the Hon’ble Minister for Communications, Shri Jyotiraditya M. Scindia, the Hon’ble Minister of State for Communications, Dr. Chandra Sekhar Pemmasani, senior government officials, and captains of industry. IMC 2025 served as a dynamic platform for global collaboration and technological innovation, bringing together leaders, innovators, policymakers, and researchers from 101 countries. The four-day event featured 860 exhibitors and partners, including leading telecom operators Airtel, Jio, and Vi, alongside major technology companies such as Ericsson, Nokia, TCS, Qualcomm, Intel, Tejas Networks, STL, VVDN, Tanla Platforms and many more. The exhibition showcased over 1,500 cutting-edge technology use cases across diverse sectors, highlighting India’s growing capabilities in AI, Deep Tech, Cybersecurity, Quantum Communication, Semiconductors, SATCOM, Digital Health, and Smart Mobility. The demonstrations reflected India’s evolution from a technology adopter to a global innovation leader, capable of developing scalable, home grown solutions for both domestic and international markets. Startups formed the backbone of this year’s edition, with 465 Indian startups presenting breakthrough solutions in areas such as AI, optical communications, semiconductor applications, quantum networking, and fraud risk detection. Aspire, IMC’s flagship startup program, exemplified the spirit of Atmanirbhar Bharat, underscoring the growing synergy between government, academia, and industry in nurturing indigenous innovation. A key highlight of IMC 2025 was its comprehensive conference program, featuring 918 speakers across 113 sessions, including 52 keynote addresses, 12 roundtables, and 84 panel discussions. These sessions provided a global platform for exchange of ideas on the future of connectivity, digital trust, and next generation innovation. Discussions spanned themes such as 5G and 6G, AI, Cloud, Cybersecurity, Manufacturing, Satcom, Quantum Computing and many more. IMC 2025 attracted an unprecedented footfall of over 1.4 lakh visitors, reflecting a year-on-year growth in international engagement and public participation. With its scale, diversity, and depth of discussion, the event reaffirmed India’s growing influence as a hub for digital and telecom innovation. By uniting government, industry, academia, startups, and investors on one platform, IMC 2025 advanced India’s aspiration to emerge as a trusted global partner in digital transformation. The event embodied the Prime Minister’s vision of “Harnessing Innovation to Power Bharat’s Transformation,” charting a course toward an inclusive, secure, and innovation-led digital future. Rollout of Indigenous 4G stack The rollout of indigenous 4G network by Prime Minister Shri Narendra Modi on 27th September 2025 marked a transformative milestone in the country’s telecom sector. The fully homegrown 4G technology stack—featuring a Radio Access Network (RAN) developed by Tejas Networks, a core network engineered by C-DOT, and system integration by TCS—has been deployed by BSNL as part of the Aatmanirbhar Bharat vision. This Swadeshi 4G network is entirely software-driven, cloud-based, and designed with future-ready architecture that enables a seamless upgrade to 5G, demonstrating India’s commitment to technological self-sufficiency. Its deployment across nearly 98,000 towers reflects India’s emergence as a global telecom equipment manufacturer, shifting from dependence on foreign technologies to becoming a creator and exporter of advanced telecom solutions. India has become 5th country in the world to have its own 4G stack. While it took decades to develop such technology in other parts of the world, it took just 2 years to develop the technology. This indigenous rollout represents more than technological achievement—it symbolizes India’s growing self-reliance and leadership in digital infrastructure. The network is already serving millions of customers nationwide, demonstrating both scalability and reliability. It enables robust connectivity across diverse terrains and communities, ensuring that no part of the country remains underserved. By developing and deploying this end-to-end Indian 4G ecosystem, the nation has proven its capability to innovate at scale, strengthen digital sovereignty, and position itself at the forefront of future telecom advancements. DoT’S INTERNATIONAL ENGAGEMENTS IN 2025 Asia Pacific Telecommunity Ministerial Meeting (APT-MM) from 30-31st May 2025: A delegation headed by Secretary, DoT participated in the APT SOM and Ministerial Meeting from 29-31 May, 2025m in Tokyo, Japan. India actively engaged in the activities of APT and made a statement highlighting the leadership position of India in telecoms/ ICTs. World Telecommunication Development Conference, 2025 (WTDC-25) in Baku, Azerbaijan from 17 to 28 November 2025: India participated in WTDC-25 under the leadership of Dr. Pemmasani Chandra Sekhar, Hon’ble Minister of State for Communications and Rural Development (HMoSC), who delivered India’s high-level policy statement on universal and meaningful connectivity, inclusive digital transformation and the role of emerging technologies. India held several key leadership positions during WTDC-25, served as Conference Vice-Chair, APT-WTDC-25 Coordination Chair and Chair of the Ad Hoc Group on Digital Transformation and Innovation. India also secured two Leadership positions (Vice-Chairs) for the ITU-D Study Groups for the 2026–29 cycle. Indian delegation played a major role in the adoption of more than 19 APT common proposals at the conference. BRICS 2025 Communications Ministers’ Meeting: The 11th BRICS Ministers’ of Communications Meeting was held on 2nd June 2025. Dr. Pemmasani Chandra Sekhar, Hon’ble Minister of State for Communications, Government of India led the Indian delegation. This was preceded by the regulated engagements such as the Working Group Meeting on Cooperation in ICTs, the Digital BRICS Task Force (DBTF), the BRICS Institute of Future Networks (BIFN), and a Business Dialogue, between 29 May 25 –30 May 25. India-UK Connectivity and Innovation Centre: India and the UK announced a landmark strategic partnership in the form of The India-UK Connectivity and Innovation Centre on 10th Oct 2025 to advance digital inclusion and shape the future of secure and innovative communications. The India-UK Connectivity and Innovation Centre will bring together complementary strengths in UK and Indian innovation in advanced connectivity – linking cutting-edge research at universities, with lab testing and field trials, through to market deployment. The initiative will create new commercial opportunities by enabling industry partners to innovate, test and scale products with a pathway to market adoption. MOU with GSMA: Department of Telecommunications, signed an MOU with GSMA Global for capacity building in field of Telecommunications on 10th Oct, 2025. India-Japan 8th ICT JWG: The 8th meeting of the India-Japan ICT JWG led by Secretary, DoT, India and Vice Minister for International Affairs, Ministry of Internal Affairs and Communications, Japan was held on 10th October 2025 in New Delhi. The meeting spotlighted the two nations’ joint commitment to drive the next wave of digital innovation through discussions involving the government as well as the private sector. From 5G/6G and AI to Open RAN and Quantum Security, both countries aim to shape a future-ready, resilient, and inclusive digital ecosystem through strategic ICT collaboration. Signed 2 LoIs (Letter of Intents) with ITU: Driving innovation in advanced technologies like Digital Twin Promoting research through academic dialogues with PhD scholars ***** MI/ARJ (रिलीज़ आईडी: 2206477) आगंतुक पटल  : 130 Ministry of Communications 2025 Year End Review for Department of Telecommunications प्रविष्टि तिथि:\r\n                        19 DEC 2025 2:02PM by PIB Delhi DoT makes significant strides in strengthening the Indian telecom ecosystem The National Broadband Mission (NBM) 2.0 launched on 17th January, 2025; Aims to propel India into a new era of digital transformation 5G services rolled out in all States/ UTs across the country and are available in 99.9% of the districts in the country with a population coverage of 85% 5.08 lakh 5G Base Transceiver Stations (BTSs) installed by Telecom Service Providers (TSPs) across the country Optical Fiber Cable (OFC) length increased from 19.35 lakh route km (2019) to 42.36 lakh route km; A total of 2,14,843 GPs now endowed with broadband connectivity Overall tele-density in India rose to 86.65% in September 2025, up from 75.23% in March 2014 Rural telephone connections grew 42.9%; nearly double of urban increase, rising from 377.78 million in March 2014 to 539.83 million in September 2025 Internet connections crossed the milestone of 100 crore to reach 100.29 crore, as against 25.15 crore in March 2014, registering growth of 298.77% Broadband connections rose from 6.1 crore in March 2014 to 99.56 crore in 2025, growing by 1,532.13% Average monthly data consumption per wireless data subscriber increased by 399 times to 24.01 GB in 2025, up from 61.66 MB in March 2014, one of the highest in the world The median mobile broadband download speed witnessed a substantial increase, rising from 10.71 Mbps in 2019 to an impressive 131.47 Mbps in October 2025 India becomes only the 5th country in the world to develop its indigenous 4G stack, through collaboration among C-DOT, Tejas Networks and TCS and deployment by BSNL DoT re-farmed 687 MHz of spectrum in various frequency bands viz. 6425-7025 MHz, 2500-2690 MHz and 1427-1518 MHz, for IMT based services DoT in collaboration with COAI organised Asia’s largest technology and innovation forum, the ninth edition of India Mobile Congress (IMC 2025) Atmanirbhar Bharat- PLI records sale of Rs. 96,240 crore, exports of Rs. 19,240 crore and employment generation of around 30,000 DoT introduces “Financial Fraud Risk Indicator (FRI)” to strengthen Cyber Fraud Prevention; RBI mandates integration of FRI into banking systems; Generated alerts for more than 70 lakh fraudulent transactions, preventing financial loss of around ₹450 crore for citizens Sanchar Saathi mobile app launched in Hindi, English and 21 regional languages; recorded more than 1.5 crore downloads since its launch; Sanchar Saathi portal records 22 crore visitors 26.35 lakhs lost/stolen handsets traced, 7.3 lakh handsets returned to rightful owners, 6.21 lakhs fraud-linked IMEIs blocked with the help of Sanchar Saathi initiative DoT puts in place Device Setu – Indian Counterfeited Device Restriction (ICDR) system to allow manufacturers, brand owners, and importers to register and generate IMEI certificates free of charge DoT guides pan-India Implementation of indigenous Cell Broadcasting for alerts dissemination DoT ensures resilient telecom infrastructure and uninterrupted services during: Himachal pradesh, Uttarakhand, Punjab and Jammu & Kashmir floods, cloudbursts and landslides and Cyclones Montha and Ditwah, and during Operation Sindoor Major strides achieved in advancing indigenous 6G research and development under the ambitious Bharat 6G Mission DoT launches Sanchar Mitra 2.0, a youth-oriented initiative aimed at harnessing the energy and potential of young students to raise public awareness about mobile safety, telecom fraud prevention, and about government digital initiatives The Department of Telecommunications (DoT) looks back on 2025 as a year of profound transformation, highlighted by major achievements in connectivity, digital infrastructure, citizen‑centric governance, and technological self‑reliance. This period witnessed unprecedented growth in telephone and internet penetration, alongside record-low data costs, powerfully reinforcing India's position as a global digital powerhouse. The rapid expansion of optical fibre and 5G infrastructure, coupled with decisive regulatory reforms under the Telecommunications Act, 2023, marked a pivotal moment for the sector. A central theme of the year was the dramatic strengthening of the telecom ecosystem’s security and accountability, spearheaded by the success of the citizen-centric initiatives like Sanchar Saathi and FRI. In line with the Atmanirbhar Bharat vision, the large-scale rollout of home-grown network infrastructure also gained significant momentum. India became only the 5 th country in the world to have its own 4G stack, upgradable to 5G, demonstrating India’s commitment to technological self-sufficiency. While it took decades to develop such technology in other parts of the world, it took just 2 years to develop such technology. Coupled with this, major strides were achieved in advancing indigenous 6G research and development under the ambitious Bharat 6G Mission . India is emerging as a global leader in telecom—shaping global standards, contributing to international policy dialogues, and positioning itself at the forefront of the next generation of communication technologies. Guided by the vision of ‘Local for Global’ and a commitment to strengthening the startup ecosystem and inclusive growth, the DoT has shaped its digital transformation strategy around the DSS approach— Design in India, Solve in India, Scale for the World. INDIAN TELECOM SCENARIO IN 2025 Telephone Subscriptions: Total telephone connections in India grew from 933 million in March 2014 to 1228.94 million in September, 2025 posting a growth of 31.72%. The number of mobile telephone connections stood at 1182.32 million at the end of September, 2025. The overall tele-density in India was 75.23% in March 2014 which rose to 86.65% in September, 2025. Urban telephone connections rose to 689.11 million in September, 2025 as compared to 555.23 million in March 2014, growing by 24.11% while the growth in rural telephone connections was 42.9% which is nearly double of urban increase, rising from 377.78 million in March 2014 to 539.83 million in September, 2025. Internet & Broadband Penetration: Internet connections crossed the milestone of 1 billion to 100.29 crore in June, 2025 compared to 25.15 crore in March, 2014, registering a growth of 298.77%. Broadband connections rose from 6.1 crore in March, 2014 to 99.56 crore in September, 2025 growing by 1532.13%. Average monthly data consumption per wireless data subscriber increased by 399 times to 24.01 GB in June, 2025 from 61.66 MB in March, 2014. The median mobile broadband download speed witnessed a substantial increase, rising from 10.71 Mbps in 2019 to an impressive 131.47 Mbps in October 2025. Similarly, the median fixed broadband download speed increased from 29.25 Mbps in 2019 to 60.34 Mbps in October 2025, according to Ookla’s Speedtest Global Index. Optical Fiber Cable (OFC) length increased from 19.35 lakh route km (2019) to 42.36 lakh route km (as of Sep, 2025). BTS and Towers: The numbers of Mobile Base Transceiver Stations (BTS) are 31.44 lakh as on 31.10.2025. The numbers of mobile towers are 8.43 lakh as on 31.10.2025. Inflow of FDI: FDI (equity flow) in the telecommunication sector during 2024-25 was US $746 million. Data cost: Average cost of 1 GB of mobile data is $0.10 as compared to $0.16 last year. TELECOM REFORMS Telecommunication Act, 2023 The Department is presently in the process of framing of rules under various sections of the Telecom Act, 2023. The Central Government, till date, has enforced 43 sections (out of 62 sections) and notified rules under 14 provisions of the Act. Draft rules under provisions related to authorization, assignment/management of spectrum, regulatory sandbox, etc. are at various stages of drafting/public consultation. Reforms related to Citizens Centric Services and prevention of misuse of Telecom resources for cyber-crime and financial frauds. Sanchar Saathi Portal: The citizen-centric Sanchar Saathi portal ( www.sancharsaathi.gov.in ), launched in 2023 is available in 21 languages and has recorded over 22 crore visits to date. On average, the portal receives around 2.4 lakh visitors per day, and in the current year, the daily visitor count has further increased to approximately 3.7 lakh users. A new module, Trusted Contact Details has been added on Sanchar Saathi portal in 2025. This module has contact details like toll-free numbers, emails, and genuine websites of banks, financial institutions, and government bodies. Sanchar Saathi Mobile App: DoT launched Sanchar Saathi Mobile App on 17.01.2025 in order to provide the convenience of reporting fraudulent calls, blocking/unblocking of lost/stolen mobile handset, knowing mobile connections issued in citizens name etc. The newly launched Sanchar Saathi Mobile App is available for download on both the Google Play Store & Apple App Store and available in Hindi, English & 21 regional languages, ensuring its inclusivity and accessibility nationwide. Sanchar Saathi mobile app has recorded more than 1.5 crore downloads since its launch. Digital Intelligence Platform (DIP): The Digital Intelligence Platform (DIP) was launched in 2024 for sharing of information related to misuse of telecom resources among the stakeholders for prevention of cyber-crime and financial frauds. At present over 850 organizations including Telecom Service Providers (TSPs), MHA, UIDAI, SEBI, FIU, NPCI, Central LEAs, 800+ banks and financial institutions, 35 States/UTs police, central agencies and other stakeholders have on-boarded this platform. This platform, inter-alia, hosts the list of disconnected mobile connections on near real time basis along with the reasons for disconnections enabling the stakeholders to take appropriate action including to disengage the associated services linked with these mobile numbers. Financial Fraud Risk indicator (FRI): In a major step towards combating cybercrime and financial frauds based on pro-active intelligence, the DoT introduced Financial Fraud Risk Indicator (FRI) in May 2025. FRI categorizes mobile numbers based on their potential risk of involvement in financial fraud - medium, high or very high. It allows banks, financial institutions, NBFCs, and UPI service providers to identify threats early and take preventive action like generating alerts, warnings, transaction delays, declines or account restrictions. As reported by stakeholders, Banks/UPI platforms have declined transactions and generated alerts for more than 70 lakh fraudulent transactions, preventing a financial loss of around ₹450 crore for citizens. RBI in collaboration with DoT has issued advisory on integration of the FRI into banking systems to enhance protection and prevention of suspicious transactions. PFDRA issued advisory to Pension Funds & Central Recordkeeping Agencies (CRAs) on adoption of FRI. DoT and Financial Intelligence Unit (FIU)-IND have signed a Memorandum of Understanding (MoU) in September 2025 to strengthen efforts against telecom enabled cyber-crimes and financial frauds. International Incoming Spoofed Calls Prevention System: The system was launched in October 2024 to identify and block incoming international calls spoofed with Indian mobile numbers. It has reduced such malicious call attempts to 1-2 lakh per day as on date. Even these call attempts are blocked at the International Long-Distance gateways itself. Blocking of International Carriers/Aggregators: Analysis of crowd-sourced Chakshu data prompted the blocking of unused area/satellite codes and the blocking of over 309 international carriers/aggregators repeatedly sending spoofed call traffic to India. Based on DoT instructions, major telecom service providers have implemented displaying \" International Call \" to subscribers in all incoming calls with international numbers to India so that citizens can take informed decision and prevented from being victim of cybercrime and financial frauds. Device Setu – Indian Counterfeited Device Restriction (ICDR) system: The system is in place to allow manufacturers, brand owners, and importers to register and generate IMEI certificates free of charge. In 2025, over 48,000 certificates have been issued to local manufacturers and 27,000 to importers, covering ~29.43 crore devices till date. DoT has disconnected approximately 2 lakh Direct Inward Dialing (DID)/landline telephone numbers that were found to be involved in unauthorized promotional activities and illegal activities. In the backdrop of the Indian Telecommunications Act 2023, under Section 22(1) and (2), DoT notified the Telecommunications (Telecom Cyber Security) Rules, 2024 in year 2024. DoT has notified the Telecommunications (Telecom Cyber Security) Amendment Rules, 2025. These Rules aim to safeguard India's communication networks and services. These rules impose stringent obligations on operators from conducting regular security audits to reporting incidents, while prohibiting the tampering of IMEIs. These regulatory measures ensure that both service providers and device importers prioritize cybersecurity and subscriber protection. DoT has partnered with the Railway Protection Force (RPF) to enhance the recovery process of stolen or lost mobile phones in trains through ‘Block your lost / stolen mobile handset’ or Central Equipment Identity Register (CEIR) facility of Sanchar Saathi portal. Summary of Tangible Impact and Outcomes of DoT efforts: (Data till November, 2025) Sr. No. Heading Count 1 Visitors on Sanchar Saathi portal (www.sancharsaathi.gov.in) 22 crore 2 Downloads of Sanchar Saathi mobile app 1.5 crore 3 Mobile number disconnections after re‑verification failures based on ASTR analysis 86 lakh 4 Mobile number disconnections based on inputs of various stakeholders 97.5 lakh 5 Mobile number disconnections for exceeding individual connection limit 1.82 crore 6 Mobile number disconnections based on citizen feedback on Sanchar Saathi (Not My Number/Not Required) 1.94 crore 7 Lost/Stolen mobile handsets traced via CEIR 26.35 lakh 8 Lost/Stolen mobile handsets returned to rightful owners by police 7.3 lakh 9 IMEIs blocked (cyber‑crime/financial‑fraud involvement) 6.21 lakh 10 Point of Sale (SIM sellers) blacklisted 75,410 11 WhatsApp profiles/groups disengaged 28.89 lakh Centralized Right of Way (RoW) Portal One of the salient features of the Telecommunications Act, 2023 is 'Digital by Design': The Act mandates that its implementation shall be digital by design. Accordingly, the Centralized RoW portal was upgraded as per RoW rules, 2024 from 01.01.2025. Later the portal was incorporated into the Unified Portal of DoT named as ‘Telecom eServices Portal’. The portal has streamlined the process of granting permissions for Right of Way applications, reducing the approval time for application processing by ~13x from 448 days (2019) to approx. 34 days (as of Nov, 2025) and ~25% of applications are now being disposed of within 15 days. The portal has successfully streamlined approvals in a time-bound manner leading to a substantial increase in the approval of Towers and Optical Fiber Cable permissions (3.81 lakh applications disposed so far). This acceleration has enabled more mobile connections and improved service quality, effectively bridging the digital divide, especially in rural and remote areas. Implementation of Right of Way (RoW) rules, 2024 across country The Government of India, Department of Telecom has notified the Telecommunications (Right of Way) Rules, 2024 on 17th September, 2024, which came into effect on the 1st day of January, 2025. It, inter-alia, aims to significantly streamline and mitigate several challenges faced in the rollout of telecom infrastructure: Single Window Approval System: Establishment of a unified, single window system for telecom infrastructure approval. This reduces the delays that telecom companies previously faced when obtaining permissions from various local, state, and central authorities. Clear Timelines: The new rules set strict timelines for granting approvals. Uniformity across States and Local Authorities: The rules standardize the process for obtaining RoW permissions across different states and municipalities. This consistency helps telecom companies avoid navigating varying requirements in each region. Facilitating Efficient Use of Public Land/Building: The public entity which is responsible for the infrastructure project or class of infrastructure projects, shall make available such common ducts or conduits or cable corridors for the installation of telecommunication network, on an open access basis, that is, non-discriminatory and non-exclusive, subject to prescribed conditions. Faster Dispute Resolution: The rules introduce a dispute resolution mechanism, allowing telecom companies to resolve conflicts with local authorities or landowners faster than before. Encouraging Shared Infrastructure: The rules also encourage infrastructure sharing between telecom providers, reducing the need for multiple towers or infrastructure in the same area. PM Gati Shakti National Master Plan (NMP) Platform Department of Telecommunications (DoT) has mapped ~13.5 Lakh Route Km of OFC of PSUs, ~43,000 km OFC of state governments, ~8.40 Lakh Telecom towers having ~31.31 lakh (Base Transceivers) BTSs, ~3.15 lakh PM- WANI Wi-Fi hotspots and planned mobile towers from various DBN (Digital Bharat Nidhi) projects on the PM Gati Shakti NMP platform. The mapping of telecom assets has aided in planning new infrastructure projects and rolling out new technologies such as 5G. This comprehensive mapping has enhanced strategic decision-making, optimized resource allocation and accelerate the deployment of telecom infrastructure. Reducing Compliance Burden With the objective of enhancing Ease of Living and Ease of Doing Business, the department has launched an ambitious initiative to reduce compliance burden by simplifying both Government-to-Citizen and Government-to-Business interfaces. In line with this initiative, the Department of Telecommunications (DoT) identified 114 compliances for removal or rationalization, of which 110 have already been addressed. Further, following consultations with service providers, the requirements for various periodical reports were reviewed, resulting in the discontinuation of several non-essential reports, increased periodicity for many others, and a transition from physical to digital submissions for multiple compliance requirements. This has significantly streamlined procedures and reduced operational burden on stakeholders. The department has strengthened ease of doing business by extending the validity of Pro Tem Security Certification—from the earlier six months to two years—enabling smoother business continuity for telecom and ICT manufacturers. With 102 certificates already issued, the longer validity will significantly reduce renewal pressures on industry. This move complements DoT’s July 2025 reduction of up to 95% in security testing fees and simplification of processes for Highly Specialized Equipment and End-of-Sale/End-of-Life products, reaffirming the Government’s commitment to supporting domestic and global OEMs under the ComSec scheme, aligned with India’s broader MTCTE-based security certification framework. The DoT has also simplified the security testing and compliance process for Highly Specialized Equipment (HSE) and End-of-Sale/End-of-Life telecom products. These moves signal the government's resolve to enable ease of doing business for both domestic and international Original Equipment Manufacturers (OEMs) in the telecom/ICT sectors. Disaster Management Department of Telecommunications (DoT) continued to strengthen its disaster preparedness and emergency communications framework under SOP-2020, ensuring resilient telecom infrastructure and uninterrupted services during natural disasters and evolving security situations. The Disaster Management (DM) Division coordinated closely with LSAs, Telecom Service Providers (TSPs), and Central and State agencies to ensure rapid restoration of telecom networks and effective communication support for emergency services and citizens. Response and Restoration during Natural Disasters (2025) Himachal Pradesh Floods & Landslides (August 2025): Severe rainfall and landslides in Chamba, Kullu, and Lahaul-Spiti caused major disruptions. DoT enabled immediate ICR activation and Priority Call Routing (PCR). Teams, including those air-dropped in inaccessible regions with State support. Jammu & Kashmir Cloudburst & Landslides (August 2025): Heavy rainfall led to extensive fibre damages and BTS outages across Kishtwar, Doda, Ramban, Reasi, and Udhampur. A 24×7 control room was activated, and ICR remained operational from 26 August to 10 September. With special logistics support and coordination with NDMA, Army, and UT authorities, ~99% connectivity was restored within two weeks. Uttarakhand Cloudbursts – Dharali & Tharali (August 2025): Rapid activation of ICR, deployment of BTSs and small cells, and emergency fibre replacement (with Army support) enabled full restoration within 3–5 days. Punjab Floods (August 2025): Telecom backbone remained intact; BTSs in water-logged pockets were swiftly restored as the situation improved. Cyclone Montha (October 2025): In advance of landfall over coastal Andhra Pradesh and Odisha, DoT activated a 24×7 control room at Vijayawada and issued directions to all TSPs for ensuring uninterrupted network availability, adequate fuel reserves, and deployment of emergency field teams. ICR and Cell Broadcast testing were completed for all TSPs as per SOP-2020, with indigenous Cell Broadcast successfully tested with APSDMA and subsequently utilised for sending early warning alerts. Necessary COWs and mobile BTS units were pre-positioned at vulnerable locations through coordinated planning with State authorities. There was no impact on network during the event and outages of few sites were mainly due to non-availability of power, which got restored immediately on resumption of power supply. Cyclone Ditwah (November 2025): For Cyclone Ditwah, DoT and TN LSA undertook advance preparedness based on IMD warnings by reviewing readiness with all TSPs, ensuring intra-circle roaming, fuel arrangements, identification of response teams, and positioning of critical resources such as mobile DG sets and Cells-on-Wheels; coordination meetings were held with the Tamil Nadu Government, Puducherry Administration and NDMA, network status was monitored twice daily through a dedicated Telecom Control Room, and DoT officers were deployed at the State Emergency Operations Centre—resulting in zero network outages in Tamil Nadu and Puducherry during the cyclone period. Strategic Preparedness & Resilience Measures during Operation Sindoor In May 2025, the Department of Telecommunications (DoT) issued a series of comprehensive directives and action plans to strengthen the resilience and continuity of telecom services across the country. The Continuity of Telecom Services Directive emphasized safeguarding networks in border and sensitive districts through adequate fuel stocking, crew mobility facilitation, infrastructure protection, and ICR readiness. Simultaneously, DoT released an Action Plan for Infrastructure Hardening and Cyber-Resilience, outlining measures such as GIS-based risk mapping of telecom assets, enhanced power redundancy, deployment of Quick Response Teams (QRTs), readiness of VSAT and Cell-on-Wheels (COW) systems, and round-the-clock Security Operations Centre (SOC) monitoring. Further, all Telecom Service Providers (TSPs) were mandated to establish National Level Control Centres (NLCCs) for real-time network monitoring and coordinated national response during emergencies. To enhance international connectivity resilience, the Submarine Cable Resilience Programme was implemented, under which all submarine cable operators submitted detailed plans ensuring network redundancy, geographically diverse routes, and readiness of SEAIOCMA repair ships with requisite MoD/MHA clearances. Pan-India Implementation of indigenous Cell Broadcasting for alerts dissemination To strengthen India’s national public warning infrastructure, a Memorandum of Understanding (MoU) was signed between the Centre for Development of Telematics (C-DOT) and the National Disaster Management Authority (NDMA) in February 2025 for the implementation of an indigenous Cell Broadcast (CB) system across all Indian telecom networks. The initiative, undertaken under the guidance of the Department of Telecommunications (DoT) and NDMA, aims to enable the dissemination of location-specific alerts to citizens through mobile networks during natural disasters and emergencies. Following the MoU, C-DOT successfully integrated its indigenously developed CB platform across all four major Telecom Service Providers (Airtel, BSNL, Jio, and Vi), achieving more than 95% pan-India network readiness. During the year, significant milestones were achieved, including pilot testing of the CB system across all TSPs, nationwide integration testing under DoT and NDMA supervision, and live operational deployment during Cyclone Montha (October 2025) in Andhra Pradesh and Odisha. The alerts were disseminated in regional languages within 2–3 seconds, reaching affected populations effectively and demonstrating the reliability of India’s indigenous CB technology for mass public alerting. The initiative represents a major step toward achieving the vision of an “Alert for All” system, ensuring rapid and reliable dissemination of disaster warnings across the nation. 5G and 6G Rollout of 5G services 5G services have been rolled out in all States/ UTs across the country and it is available in 99.9% of the districts in the country with a population coverage of 85%. As on 31.10.2025, 5.08 lakh 5G Base Transceiver Stations (BTSs) have been installed by the Telecom Service Providers (TSPs) across the country. To accelerate the deployment of 5G services and infrastructure across the country, Government has taken several initiatives, which, inter alia, include the following: Auction of spectrum for 5G mobile services Financial reforms to rationalize Adjusted Gross Revenue (AGR), Bank Guarantees (BGs) and interest rates. Removal of Spectrum Usage Charges for spectrum acquired in auction of 2022 and thereafter. Simplification of procedure for SACFA (Standing Advisory Committee on Radio Frequency Allocations) clearance. Launch of GatiShakti Sanchar portal and RoW (Right of Way) Rules to streamline RoW permissions and clearance of installation of telecom infrastructure. Time-bound permission for use of street furniture for installation of small cells and telecommunication line. Implementation of 100 5G Labs Initiative In October 2023, the Hon’ble Prime Minister awarded 100 5G Use Case Labs. All the Labs have been set up, and operationalized since April 2025. A Gradation Framework has been developed to grade the lab’s performance and create a heathy competition among the labs. Top three institutes were felicitated in India Mobile Congress-25. The high performing institutions are being engaged in sharing experience with other institutes to improve their performance. A Competition Framework has been created, in the form 6-month long Hackathon, to create competition among students, faculty, researchers, and startups, and develop solutions for real world problems. This year’s nation-wide Hackathon was conducted from April to September 25. Experts from Industry and ITU were engaged in mentoring the participants. The winners were awarded and facilitated to showcase their products in IMC-25. Industry Leaders in telecommunication [Ericsson & Qualcomm] have been engaged in Capacity Building in Telecommunication. Bharat 6G Vision and Bharat 6G Alliance The Hon’ble Prime Minister launched the Bharat 6G Vision in March 2023, positioning India as a global leader in designing, developing, and deploying 6G technology by 2030. The Bharat 6G Alliance (B6GA) is a collaborative platform bringing together academia, industry, and government to build a comprehensive 6G ecosystem in India. The alliance focuses on research, development, and standardization of 6G technology, with the goal of making India a global leader in the emerging 6G landscape. Bharat 6G Alliance has constituted seven Working Groups on different domains of 6G like Spectrum, Technology, Applications, Green and Sustainability and use cases. In a step towards redefining the future of global communication, the Bharat 6G Alliance signed a Memorandum of Understanding (MoU) with leading research alliances for collaborative research and standardization. These MoUs with 6G research alliances will further enable development of secure and trusted telecommunication technology including resilient supply chains. The Government has taken the following initiatives to facilitate the development of 6G technology in the country: Funding two testbeds namely 6G THz Testbed & Advance Optical Communication Testbed to promote R&D and innovation in the country. 100+ research proposals have been approved on 6G network ecosystems to promote research and innovation in line with global roadmap for 6G technology. The Apex Council meeting of the Bharat 6G Mission on 10 th December 2025, chaired by Union Minister Jyotiraditya M. Scindia, highlighted India’s rapid progress toward emerging as a global 6G leader by 2030. The Council reviewed advances in indigenous 6G components, spectrum strategy, international standard-setting, and progress driven by the ₹1-lakh-crore RDI Fund. It also showcased achievements from the 5G Use Case Labs and honoured top-performing institutions. The Bharat 6G Alliance reported strong expansion to over 84 members and deepening global collaborations, reinforcing India’s commitment to building a world-class, future-ready 6G ecosystem. PROJECTS & INITIATIVES Digital Bharat Nidhi (DBN) Universal Service Obligation Fund (USOF), formed by an Act of Parliament, was established w.e.f. 01.04.2002 under the Indian Telegraph (Amendment) Act, 2003 (further amended in 2006), to provide financial support for the provision of telecom services in commercially unviable rural and remote areas of the country. The USOF was established with the fundamental objective of providing access to ‘basic’ telecom services to people in the rural and remote areas at affordable and reasonable prices. As per the Telecommunication Act, 2023 (No.44 of 2023) and the subsequent notification of Telecommunications (Administration of Digital Bharat Nidhi) Rules 2024 dated 30.08.2024, the Universal Service Obligation Fund (USOF) has been renamed as “Digital Bharat Nidhi” (DBN). The Telecommunication Act, 2023 also expanded the scope of DBN to: support universal service through promoting access to and delivery of telecommunication services in underserved rural, remote and urban areas; support research and development of telecommunication services, technologies, and products; support pilot projects, consultancy assistance and advisory support towards provision of service under clause (a) of this section; support introduction of telecommunication services, technologies, and products. BharatNet BharatNet project is being implemented in a phased manner to provide broadband connectivity to all Gram Panchayats (GPs) and villages in the country. The Phase-I has been completed in December 2017 with the implementation of over 1 lakh GPs and the remaining GPs are being connected under various models of implementation, i.e. State-led Model, CPSU-led Model and Private Sector-led model, etc. As on October 2025, 6,94,711 km of Optical Fibre Cable (OFC) has been laid and 2,09,809 GPs are Service Ready on OFC. In addition, 5,034 GPs have been connected over satellite media. Thus, a total 2,14,843 GPs are now endowed with broadband connectivity. The Amended BharatNet project is being implemented in a phased manner to provide broadband connectivity to 2.65 lakhs Gram Panchayats (GPs) and Villages beyond GPs on demand basis across the country with outlay of ₹1.39 lakh crore. Assets created under BharatNet will be National Assets owned by Digital Bharat Nidhi (DBN) under Department of telecommunications (DoT) and accessible on a non-discriminatory basis to all service providers. Saturation of 4G mobile services The Union Cabinet on 27.07.2022 approved a project for saturation of 4G mobile services in uncovered villages across the country at a total cost of Rs. 26,316 Cr. The project aimed to provide 4G mobile services in 24,680 uncovered villages in remote and difficult areas. The project has a provision to include 20% additional villages on account of rehabilitation, new-settlements, withdrawal of services by existing operators etc. In addition, 6,279 villages having only 2G/3G connectivity shall be upgraded to 4G. Implementation work of the project is under progress and till October, 2025, 17,193 towers including upgradation of 648 towers have been planned out of which 13,142 towers have been made functional covering 19,465 villages. Telecom Technology Development Fund (TTDF) The Telecom Technology Development Fund (TTDF) Scheme aims to fund research and development (R&D) in rural-specific communication technologies, fostering collaboration between academia, start-ups, research institutes, and industry to enhance the telecom ecosystem in India. The TTDF is aligned with the Hon'ble Prime Minister's vision of \"Jai Anusandhan\" and seeks to promote indigenous telecom solutions. Total 136 projects at cost of ₹ 550 Cr have been funded spanning across emerging telecom technologies viz. 5G/6G, AI, Quantum communications etc. Production Linked Incentive Scheme for Telecom and Networking products The PLI Scheme for Telecom and Networking products, effective from April 2021 with a total outlay of Rs. 12,195 crore was launched by DoT to boost domestic manufacturing of telecom products by incentivising incremental investments and turnover. The scheme has helped in increasing the sales of domestically manufactured telecom products. The scheme registers an impressive performance with cumulative investment of more than Rs. 4,646 crore, total sales exceeding Rs. 96,240 crore including exports worth Rs. 19,240 crore and employment generation of (Nos) 29,574 as on 30.09.2025 National Broadband Mission 2.0 (2025-30) The Hon’ble Minister of Communications and Development of North Eastern Region Shri Jyotiraditya M. Scindia launched the National Broadband Mission (NBM) 2.0 on 17 th January, 2025. The NBM 2.0 aims to propel India into a new era of digital transformation. Aligning with the Hon’ble Prime Minister’s vision of a Viksit Bharat by 2047, it envisions India as a global knowledge society by providing High-speed Broadband and Meaningful Connectivity for all. Building on the success of NBM 1.0. Following will be the key benefits of NBM 2.0: Extending operational optical fiber cable (OFC) connectivity to 2.70 lakh villages by 2030 with 95% uptime To provide broadband connectivity to 90% of anchor institutions like Schools, PHCs, Anganwadi Centre, and Panchayat offices by 2030. Improve the Fixed broadband download Speeds- National Average to a minimum 100 Mbps by 2030. To achieve 100% mapping of fiber networks owned by government PSUs by 2026 on PM GatiShakti National Master Plan Platform (PMGS) and use PMGS for planning of Additional Bharatnet project. For Ease of Doing Business, reduce the Right of Way application average disposal time Increase the number of rural internet subscribers per 100 population Achieve the target of powering 30% of mobile towers with sustainable energy by 2030. Collaborate with all stakeholders viz. Central Ministries and departments, States, UTs and municipalities to ensure the effective implementation of the Telecommunications (Right of Way) Rules, 2024, issued under the Telecommunications Act, 2023. Call Before u Dig (CBuD) Mobile App: Hon’ble Prime Minister launched the 'Call Before u Dig' (CBuD) Mobile Application on March 22, 2023, which provides an interface for excavating agencies/contractors to alert/inform owners of existing utility assets about their upcoming excavation route. Over the past year, CBuD has witnessed a significant rise in usage, with monthly enquiries increased from 1,211 in November 2024 to 11,258 in October 2025 — usages jumped nine-fold (9X) year on year. Sanchar Mitra The Sanchar Mitra Scheme of DoT, initially launched on a pilot basis, has now been revamped and rolled out as a regular initiative on 26.05.2025 as Sanchar Mitra 2.0. This youth-oriented initiative is aimed at harnessing the energy and potential of young students to spread awareness about safe digital behaviour. Under this scheme, student volunteers, named as Sanchar Mitra, will raise public awareness about mobile safety, telecom fraud prevention, and about government digital initiatives. They will conduct outreach in communities, schools, and public spaces to educate citizens on responsible and secure use of telecom services. Around 2,200 Sanchar Mitras have been selected by LSAs from nearly 230 reputed institutes across the country. In a short span of time, Sanchar Mitras have conducted around 100 awareness sessions on key citizen-centric telecom initiatives such as Sanchar Saathi features and EMF radiation myths. Citizens are being sensitized on: Protecting themselves from unsolicited commercial calls, spam calls, digital arrest scams, and other fraudulent communication. Identifying and reporting international scam calls using Indian numbers. Lodging complaints for lost/stolen mobile phones through CEIR. Verifying the genuineness of mobile handsets. EMF radiation myth busting Auction of Spectrum Policy Initiatives Re-farm of spectrum for IMT: For India to take a lead in the development of 6G services, re-farming of spectrum for mobile communication services is a significant step. It underscores the government’s commitment to optimize use of natural resources to enable cutting-edge mobile communication services across the nation. In this regard, the Government has re-farmed 687 MHz of spectrum in various frequency bands viz. 6425-7025 MHz, 2500-2690 MHz and 1427-1518 MHz for IMT based services. This initiative aims to bolster the reach, quality, and affordability of mobile networks, further accelerating the realization of a robust and inclusive Digital India. This move also lays a strong foundation for the advancement of next-generation technologies, including 6G. Spectrum for Wi-Fi and Intelligent Transport System: The DoT is taking important initiative to facilitate east of living for the common citizen, which include additional spectrum in the 6 GHz band for Wi-Fi, promoting next generation use cases such as Augmented Reality (AR)/ Virtual Reality (VR) and in the 70 GHz band for Intelligent Transport systems. Revision of NFAP 2022: The National Frequency Allocation Plan (NFAP) is an important document for managing India's radio spectrum, ensuring its efficient and effective use across various sectors. NFAP has been revised incorporating outcomes from the World Radiocommunication Conference 2023 and the updated ITU Radio Regulations 2024. The revision process involved consultations with various stakeholders including government agencies, private sector entities, industry associations, academic institutions, and startups to ensure that the updated NFAP addresses the evolving needs of all users. The revised NFAP aims to provide regulatory certainty, foster investment, and support the development of emerging technologies such as 5G, 6G, satellite communications etc. Process Simplification and moving the entire process to online portal has developed an online CRS module for simplification of process for issuing Community Radio Station (CRS) Licences. The Saral Sanchar portal of DoT and Broadcast Seva Portal of MIB, have been integrated for fetching of data/document from each other at different stage while processing the CRS cases. REVIVAL OF BSNL & MTNL: The Government has taken various steps for the revival of BSNL & MTNL by issuing Revival Packages in 2019, 2022 & 2023; under which several measures, including Voluntary Retirement Scheme (VRS), capital infusion through Capex support, spectrum allocation for 4G and 5G, debt restructuring, and asset monetization, have been implemented or currently in progress. As a result of the above-mentioned revival packages and efforts by GoI: BSNL has sustained revenue increase and positive EBIDTA over the last 5 years. MTNL has also become EBITDA positive in last 4 years. For the first time since FY 2008-09, BSNL has achieved a net profit of Rs. 262 Cr. in Q3 and Rs. 280Cr. in Q4 of 2024-25. BSNL has accelerated Capex investment in the last 2 years to upgrade its network and telecom infra pan India. A massive investment has been done in transmission equipment & optical fiber cable (OFC) network. This CAPEX is expected to put BSNL on a higher revenue growth trajectory in the future. In line with Atmanirbhar Bharat initiative, BSNL has placed purchase order for 1 Lakh indigenously developed 4G sites for pan India deployment. Supply of 4G equipment has started from September 2023 and as on 31.10.2025, total 97,068 4G sites have been installed and 93,511 sites are ON-Air. The equipment is upgradable to 5G. IMPORTANT EVENTS India Mobile Congress, 2025 The ninth edition of the India Mobile Congress (IMC 2025) was organized jointly by the Department of Telecommunications (DoT) and the Cellular Operators Association of India (COAI) from 8th to 11th October 2025 at Yashobhoomi, New Delhi. Recognized as Asia’s largest technology and innovation forum, IMC 2025 carried forward its vision of promoting digital transformation and technological self-reliance under the theme “Innovate to Transform.” The event was inaugurated by the Hon’ble Prime Minister of India, Shri Narendra Modi, in the august presence of the Hon’ble Minister for Communications, Shri Jyotiraditya M. Scindia, the Hon’ble Minister of State for Communications, Dr. Chandra Sekhar Pemmasani, senior government officials, and captains of industry. IMC 2025 served as a dynamic platform for global collaboration and technological innovation, bringing together leaders, innovators, policymakers, and researchers from 101 countries. The four-day event featured 860 exhibitors and partners, including leading telecom operators Airtel, Jio, and Vi, alongside major technology companies such as Ericsson, Nokia, TCS, Qualcomm, Intel, Tejas Networks, STL, VVDN, Tanla Platforms and many more. The exhibition showcased over 1,500 cutting-edge technology use cases across diverse sectors, highlighting India’s growing capabilities in AI, Deep Tech, Cybersecurity, Quantum Communication, Semiconductors, SATCOM, Digital Health, and Smart Mobility. The demonstrations reflected India’s evolution from a technology adopter to a global innovation leader, capable of developing scalable, home grown solutions for both domestic and international markets. Startups formed the backbone of this year’s edition, with 465 Indian startups presenting breakthrough solutions in areas such as AI, optical communications, semiconductor applications, quantum networking, and fraud risk detection. Aspire, IMC’s flagship startup program, exemplified the spirit of Atmanirbhar Bharat, underscoring the growing synergy between government, academia, and industry in nurturing indigenous innovation. A key highlight of IMC 2025 was its comprehensive conference program, featuring 918 speakers across 113 sessions, including 52 keynote addresses, 12 roundtables, and 84 panel discussions. These sessions provided a global platform for exchange of ideas on the future of connectivity, digital trust, and next generation innovation. Discussions spanned themes such as 5G and 6G, AI, Cloud, Cybersecurity, Manufacturing, Satcom, Quantum Computing and many more. IMC 2025 attracted an unprecedented footfall of over 1.4 lakh visitors, reflecting a year-on-year growth in international engagement and public participation. With its scale, diversity, and depth of discussion, the event reaffirmed India’s growing influence as a hub for digital and telecom innovation. By uniting government, industry, academia, startups, and investors on one platform, IMC 2025 advanced India’s aspiration to emerge as a trusted global partner in digital transformation. The event embodied the Prime Minister’s vision of “Harnessing Innovation to Power Bharat’s Transformation,” charting a course toward an inclusive, secure, and innovation-led digital future. Rollout of Indigenous 4G stack The rollout of indigenous 4G network by Prime Minister Shri Narendra Modi on 27th September 2025 marked a transformative milestone in the country’s telecom sector. The fully homegrown 4G technology stack—featuring a Radio Access Network (RAN) developed by Tejas Networks, a core network engineered by C-DOT, and system integration by TCS—has been deployed by BSNL as part of the Aatmanirbhar Bharat vision. This Swadeshi 4G network is entirely software-driven, cloud-based, and designed with future-ready architecture that enables a seamless upgrade to 5G, demonstrating India’s commitment to technological self-sufficiency. Its deployment across nearly 98,000 towers reflects India’s emergence as a global telecom equipment manufacturer, shifting from dependence on foreign technologies to becoming a creator and exporter of advanced telecom solutions. India has become 5th country in the world to have its own 4G stack. While it took decades to develop such technology in other parts of the world, it took just 2 years to develop the technology. This indigenous rollout represents more than technological achievement—it symbolizes India’s growing self-reliance and leadership in digital infrastructure. The network is already serving millions of customers nationwide, demonstrating both scalability and reliability. It enables robust connectivity across diverse terrains and communities, ensuring that no part of the country remains underserved. By developing and deploying this end-to-end Indian 4G ecosystem, the nation has proven its capability to innovate at scale, strengthen digital sovereignty, and position itself at the forefront of future telecom advancements. DoT’S INTERNATIONAL ENGAGEMENTS IN 2025 Asia Pacific Telecommunity Ministerial Meeting (APT-MM) from 30-31st May 2025: A delegation headed by Secretary, DoT participated in the APT SOM and Ministerial Meeting from 29-31 May, 2025m in Tokyo, Japan. India actively engaged in the activities of APT and made a statement highlighting the leadership position of India in telecoms/ ICTs. World Telecommunication Development Conference, 2025 (WTDC-25) in Baku, Azerbaijan from 17 to 28 November 2025: India participated in WTDC-25 under the leadership of Dr. Pemmasani Chandra Sekhar, Hon’ble Minister of State for Communications and Rural Development (HMoSC), who delivered India’s high-level policy statement on universal and meaningful connectivity, inclusive digital transformation and the role of emerging technologies. India held several key leadership positions during WTDC-25, served as Conference Vice-Chair, APT-WTDC-25 Coordination Chair and Chair of the Ad Hoc Group on Digital Transformation and Innovation. India also secured two Leadership positions (Vice-Chairs) for the ITU-D Study Groups for the 2026–29 cycle. Indian delegation played a major role in the adoption of more than 19 APT common proposals at the conference. BRICS 2025 Communications Ministers’ Meeting: The 11th BRICS Ministers’ of Communications Meeting was held on 2nd June 2025. Dr. Pemmasani Chandra Sekhar, Hon’ble Minister of State for Communications, Government of India led the Indian delegation. This was preceded by the regulated engagements such as the Working Group Meeting on Cooperation in ICTs, the Digital BRICS Task Force (DBTF), the BRICS Institute of Future Networks (BIFN), and a Business Dialogue, between 29 May 25 –30 May 25. India-UK Connectivity and Innovation Centre: India and the UK announced a landmark strategic partnership in the form of The India-UK Connectivity and Innovation Centre on 10th Oct 2025 to advance digital inclusion and shape the future of secure and innovative communications. The India-UK Connectivity and Innovation Centre will bring together complementary strengths in UK and Indian innovation in advanced connectivity – linking cutting-edge research at universities, with lab testing and field trials, through to market deployment. The initiative will create new commercial opportunities by enabling industry partners to innovate, test and scale products with a pathway to market adoption. MOU with GSMA: Department of Telecommunications, signed an MOU with GSMA Global for capacity building in field of Telecommunications on 10th Oct, 2025. India-Japan 8th ICT JWG: The 8th meeting of the India-Japan ICT JWG led by Secretary, DoT, India and Vice Minister for International Affairs, Ministry of Internal Affairs and Communications, Japan was held on 10th October 2025 in New Delhi. The meeting spotlighted the two nations’ joint commitment to drive the next wave of digital innovation through discussions involving the government as well as the private sector. From 5G/6G and AI to Open RAN and Quantum Security, both countries aim to shape a future-ready, resilient, and inclusive digital ecosystem through strategic ICT collaboration. Signed 2 LoIs (Letter of Intents) with ITU: Driving innovation in advanced technologies like Digital Twin Promoting research through academic dialogues with PhD scholars ***** MI/ARJ (रिलीज़ आईडी: 2206477)",
    "scraped_at": "2025-12-19T09:46:46.196175"
  },
  {
    "id": "2206502",
    "ministry": "Ministry of Environment, Forest and Climate Change",
    "title": "Union Environment Minister Chairs Fourth High-Level Review Meeting on Delhi-NCR Air Pollution; Continuous Monthly Ministerial Reviews of finalised State Action Plans from January 2026",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206502",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Environment, Forest and Climate Change Union Environment Minister Chairs Fourth High-Level Review Meeting on Delhi-NCR Air Pollution; Continuous Monthly Ministerial Reviews of finalised State Action Plans from January 2026 Take Necessary steps to Ensure Visible Improvement in the prevailing Air Quality situation across the NCR within One Week: Shri Yadav प्रविष्टि तिथि:\r\n                19 DEC 2025 3:02PM by PIB Delhi Union Minister for Environment, Forest and Climate Change, Shri Bhupender Yadav today chaired a high-level meeting to undertake a detailed review of Action Plans of the State Governments of NCT Delhi, Haryana and Uttar Pradesh, along with concerned Municipal Bodies, for tackling the prevailing adverse air pollution situation in Delhi-NCR. This was the fourth in a series of such review meetings, conducted on a structured set of parameters in the prescribed format, as directed by the Minister in the earlier meeting held on 03.12.2025. Also present in the meeting was the Union Minister of State (EFCC), Shri Kirti Vardhan Singh. Expressing concern over the persistence of poor air quality in the Delhi-NCR, Shri Yadav announced that from January 2026 onwards reviews of action plans, being finalised now, will be held every month at the Ministerial level. State Governments were asked to integrate the action plans of all NCR cities under their jurisdiction for future presentations. The Minister assured that implementation-related bottlenecks would be addressed through regular inter-State coordination meetings at the highest level. Shri Yadav reviewed the individual presentations on measures taken by the State Governments and Municipal Bodies to control air pollution in Delhi-NCR. He emphasised that the momentum of these actions must be sustained until there is a visible improvement in air quality across the NCR. The Minister further made it clear that strict measures must be taken against defaulters, but at the same time the general public must not get inconvenienced unnecessarily. Identified issues are to be addressed through corrective actions, with a review scheduled in 15 days. Directions were issued to ensure smooth traffic management at 62 identified congestion hotspots, and to promote EV/CNG buses for employees by corporates and industrial units in Delhi-NCR. Staggered timings for offices, shopping malls and commercial complexes were also emphasised to reduce peak-hour congestion. Special measures were emphasised to provide end-to-end public transport on high-traffic routes, while strict directions were given to intensify action against illegal and polluting industrial units operating in the region. Gurugram, Faridabad, Ghaziabad and Noida were directed to fast-track the implementation of the Integrated Smart Traffic Management System (ITMS), while traffic police were asked to ensure that enforcement checks do not themselves lead to congestion. The Minister underscored coordinated planning with DMRC and State authorities to improve last-mile metro connectivity across NCR cities. Directions were issued to remove encroachments causing traffic congestion within 10 days, ensure annual maintenance contracts for pothole-free roads, and provide proper drainage to prevent monsoon-related damage to the roads. Coordinated redressal of public grievances related to pollution was to be ensured under CAQM’s supervision, along with focused IEC activities for stakeholder engagement. Shri Yadav emphasized on taking necessary steps to ensure visible improvement in the prevailing air quality situation across the NCR within one week. He directed the authorities  to remove dust and construction and demolition (C&D) waste lying on roads, containment of biomass burning, and strict enforcement of construction bans during high pollution periods. Individual officers were asked to be assigned responsibility for Mechanical Road Sweeping Machines (MRSMs), supported by GPS tracking, to ensure efficient road cleaning and dust control. Public representatives were to be involved to strengthen accountability, he desired. The CAQM was advised to issue guidance to Municipal Bodies to not permit demolition activities unless C&D waste collection sub-centres are available within a 10 km radius. C&D activities are to be banned during October–December, and CAQM was asked to explore engagement of start-ups and the private sector for innovative C&D waste management solutions through stakeholder consultations. Haryana was directed to replace defunct Crop Residue Management (CRM) machines, ensure utilisation of paddy straw in power plants, brick kilns and crematoriums, and encourage setting up of pelletisation plants with Central financial assistance. Decentralised and in-situ solutions, including Compressed Bio-Gas ( CBG) and ethanol plants, were to be explored to generate revenue and discourage stubble burning. Specific directions were issued to seal illegal tyre-burning units and other non-permitted polluting establishments operating in Delhi-NCR. Further, it was directed to ensure installation of Online Continuous Emission Monitoring Systems (OCEMS) in all polluting units—particularly in Haryana—and enforce the 31 st December deadline for compliance. The Minister also directed ensuring society-wise solid waste collection and joint disposal of Bandhwari legacy waste by Faridabad and Gurugram at a common facility. In coordination with the Delhi Forest Department, the Minister directed exploration of plantation opportunities in the NDMC area, with a target of planting 11 lakh saplings on the World Environment Day 2026. NHAI was advised to reduce congestion at toll plazas through improved sensors and better Automatic Number Plate Recognition (ANPR) systems, and to ensure proper upkeep of major traffic-carrying roads. The meeting was attended by the Secretary (MoEFCC), Chairman, Commission for Air Quality Management (CAQM), Senior officers from Union Ministries of Environment, Forest and Climate Change; Road Transport and Highways; Heavy Industries and State Governments of NCT Delhi, Haryana and Uttar Pradesh. Also present in the meeting were MD (DMRC), senior officers of MCD, NDMC, Delhi Police, NHAI and DDA, besides Municipal Commissioners and DMs of  Noida, Ghaziabad, Gurugram, Faridabad, along with senior officers from Central Pollution Control Board (CPCB), respective State Pollution Control Boards (SPCBs) and Delhi Pollution Control Committee (DPCC). ***** VM (रिलीज़ आईडी: 2206502) आगंतुक पटल  : 18 Ministry of Environment, Forest and Climate Change Union Environment Minister Chairs Fourth High-Level Review Meeting on Delhi-NCR Air Pollution; Continuous Monthly Ministerial Reviews of finalised State Action Plans from January 2026 Take Necessary steps to Ensure Visible Improvement in the prevailing Air Quality situation across the NCR within One Week: Shri Yadav प्रविष्टि तिथि:\r\n                        19 DEC 2025 3:02PM by PIB Delhi Union Minister for Environment, Forest and Climate Change, Shri Bhupender Yadav today chaired a high-level meeting to undertake a detailed review of Action Plans of the State Governments of NCT Delhi, Haryana and Uttar Pradesh, along with concerned Municipal Bodies, for tackling the prevailing adverse air pollution situation in Delhi-NCR. This was the fourth in a series of such review meetings, conducted on a structured set of parameters in the prescribed format, as directed by the Minister in the earlier meeting held on 03.12.2025. Also present in the meeting was the Union Minister of State (EFCC), Shri Kirti Vardhan Singh. Expressing concern over the persistence of poor air quality in the Delhi-NCR, Shri Yadav announced that from January 2026 onwards reviews of action plans, being finalised now, will be held every month at the Ministerial level. State Governments were asked to integrate the action plans of all NCR cities under their jurisdiction for future presentations. The Minister assured that implementation-related bottlenecks would be addressed through regular inter-State coordination meetings at the highest level. Shri Yadav reviewed the individual presentations on measures taken by the State Governments and Municipal Bodies to control air pollution in Delhi-NCR. He emphasised that the momentum of these actions must be sustained until there is a visible improvement in air quality across the NCR. The Minister further made it clear that strict measures must be taken against defaulters, but at the same time the general public must not get inconvenienced unnecessarily. Identified issues are to be addressed through corrective actions, with a review scheduled in 15 days. Directions were issued to ensure smooth traffic management at 62 identified congestion hotspots, and to promote EV/CNG buses for employees by corporates and industrial units in Delhi-NCR. Staggered timings for offices, shopping malls and commercial complexes were also emphasised to reduce peak-hour congestion. Special measures were emphasised to provide end-to-end public transport on high-traffic routes, while strict directions were given to intensify action against illegal and polluting industrial units operating in the region. Gurugram, Faridabad, Ghaziabad and Noida were directed to fast-track the implementation of the Integrated Smart Traffic Management System (ITMS), while traffic police were asked to ensure that enforcement checks do not themselves lead to congestion. The Minister underscored coordinated planning with DMRC and State authorities to improve last-mile metro connectivity across NCR cities. Directions were issued to remove encroachments causing traffic congestion within 10 days, ensure annual maintenance contracts for pothole-free roads, and provide proper drainage to prevent monsoon-related damage to the roads. Coordinated redressal of public grievances related to pollution was to be ensured under CAQM’s supervision, along with focused IEC activities for stakeholder engagement. Shri Yadav emphasized on taking necessary steps to ensure visible improvement in the prevailing air quality situation across the NCR within one week. He directed the authorities  to remove dust and construction and demolition (C&D) waste lying on roads, containment of biomass burning, and strict enforcement of construction bans during high pollution periods. Individual officers were asked to be assigned responsibility for Mechanical Road Sweeping Machines (MRSMs), supported by GPS tracking, to ensure efficient road cleaning and dust control. Public representatives were to be involved to strengthen accountability, he desired. The CAQM was advised to issue guidance to Municipal Bodies to not permit demolition activities unless C&D waste collection sub-centres are available within a 10 km radius. C&D activities are to be banned during October–December, and CAQM was asked to explore engagement of start-ups and the private sector for innovative C&D waste management solutions through stakeholder consultations. Haryana was directed to replace defunct Crop Residue Management (CRM) machines, ensure utilisation of paddy straw in power plants, brick kilns and crematoriums, and encourage setting up of pelletisation plants with Central financial assistance. Decentralised and in-situ solutions, including Compressed Bio-Gas ( CBG) and ethanol plants, were to be explored to generate revenue and discourage stubble burning. Specific directions were issued to seal illegal tyre-burning units and other non-permitted polluting establishments operating in Delhi-NCR. Further, it was directed to ensure installation of Online Continuous Emission Monitoring Systems (OCEMS) in all polluting units—particularly in Haryana—and enforce the 31 st December deadline for compliance. The Minister also directed ensuring society-wise solid waste collection and joint disposal of Bandhwari legacy waste by Faridabad and Gurugram at a common facility. In coordination with the Delhi Forest Department, the Minister directed exploration of plantation opportunities in the NDMC area, with a target of planting 11 lakh saplings on the World Environment Day 2026. NHAI was advised to reduce congestion at toll plazas through improved sensors and better Automatic Number Plate Recognition (ANPR) systems, and to ensure proper upkeep of major traffic-carrying roads. The meeting was attended by the Secretary (MoEFCC), Chairman, Commission for Air Quality Management (CAQM), Senior officers from Union Ministries of Environment, Forest and Climate Change; Road Transport and Highways; Heavy Industries and State Governments of NCT Delhi, Haryana and Uttar Pradesh. Also present in the meeting were MD (DMRC), senior officers of MCD, NDMC, Delhi Police, NHAI and DDA, besides Municipal Commissioners and DMs of  Noida, Ghaziabad, Gurugram, Faridabad, along with senior officers from Central Pollution Control Board (CPCB), respective State Pollution Control Boards (SPCBs) and Delhi Pollution Control Committee (DPCC). ***** VM (रिलीज़ आईडी: 2206502)",
    "scraped_at": "2025-12-19T09:46:47.848052"
  },
  {
    "id": "2206421",
    "ministry": "Ministry of Environment, Forest and Climate Change",
    "title": "NBA Releases ₹14.88 Crore as Access and Benefit Sharing funds to Andhra Pradesh Forest Department",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206421",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Environment, Forest and Climate Change NBA Releases ₹14.88 Crore as Access and Benefit Sharing funds to Andhra Pradesh Forest Department Till date, over ₹104 crore disbursed under ABS mechanism for Red Sanders conservation to Andhra Pradesh, taking NBA’s total ABS disbursements beyond ₹143 crores प्रविष्टि तिथि:\r\n                19 DEC 2025 12:05PM by PIB Delhi The National Biodiversity Authority (NBA) has continued its succession of Access and Benefit Sharing (ABS) disbursements with the release of ₹14.88 crore (USD 1.65 million) to the Andhra Pradesh Forest Department. The funds are earmarked for the protection, conservation, regeneration, research and development, awareness creation, and capacity-building programmes related to Red Sanders, as benefit-sharing contributions arising from 29 Form-I applications. With this release, India’s cumulative ABS disbursements have crossed above ₹143 crore (USD 15.8 million). To date, the NBA has released over ₹104 crore (USD 12.5 million) to the State of Andhra Pradesh towards Red Sanders conservation as well as benefit claimers, and over ₹15 crore (USD 1.8 million) released to various states such as Tamil Nadu, Karnataka, Maharashtra, Odisha and Telangana. Red Sanders (Pterocarpus santalinus), globally valued for its distinctive deep red timber, is endemic to limited pockets of the Eastern Ghats, notably in the Anantapur, Chittoor, Kadapa, Prakasam and Kurnool districts of Andhra Pradesh. The benefit-sharing contributions have accrued from the auction of 1,115 tonnes of Red Sanders wood confiscated and seized by the Directorate of Revenue Intelligence and subsequently auctioned by Central Government agencies, including the State Trading Corporation of India Ltd., MMTC Limited and PEC Limited. Noteworthy to mention that through the Red Sanders access and benefit-sharing amount, NBA supported research projects on Red Sanders, covering conservation, sustainable use, genetic improvement, and value addition through reputed government research institutions like ICFRE-IFGTB, ICFRE-IWST, CSIR-IICB. Field surveys across forest divisions of Andhra Pradesh resulted in the documentation of 1,513 genetic resources with geo-referenced traits and assessed over 15,000 standing trees for variability and reproductive behaviour. Seeds from elite resources were collected for ex situ conservation, with ongoing efforts to establish a National Red Sanders Field Gene Bank. Propagation technologies were strengthened through standardised tissue culture, improved germination, and high-success vegetative propagation methods. Preliminary Seed Production Area guidelines were also developed to support long-term sustainability. Value-added products such as soaps, creams, lip care products, and wood coatings were successfully developed from bark and heartwood. Notably, Royalseema RS Soap® was trademarked (Trademark No. 5870030) and Royal Red lipstick met Bureau of Indian Standards specifications, demonstrating translation of research into practical applications by ICFRE – Institute of Forest Genetics and Tree Breeding, Coimbatore. The initiative reaffirms the NBA’s sustained commitment to fair and equitable benefit sharing, prevention of illegal trade, and strengthening of collective action in biodiversity governance.  NBA is ensuring long-term protection of the ecological, genetic, and socio-economic values of Red Sanders by reinvesting ABS proceeds into conservation, scientific innovation, and community-linked development. These efforts collectively safeguard this endemic species for present and future generations while reinforcing India’s leadership in biodiversity governance. **** VM/SK (रिलीज़ आईडी: 2206421) आगंतुक पटल  : 198 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी Ministry of Environment, Forest and Climate Change NBA Releases ₹14.88 Crore as Access and Benefit Sharing funds to Andhra Pradesh Forest Department Till date, over ₹104 crore disbursed under ABS mechanism for Red Sanders conservation to Andhra Pradesh, taking NBA’s total ABS disbursements beyond ₹143 crores प्रविष्टि तिथि:\r\n                        19 DEC 2025 12:05PM by PIB Delhi The National Biodiversity Authority (NBA) has continued its succession of Access and Benefit Sharing (ABS) disbursements with the release of ₹14.88 crore (USD 1.65 million) to the Andhra Pradesh Forest Department. The funds are earmarked for the protection, conservation, regeneration, research and development, awareness creation, and capacity-building programmes related to Red Sanders, as benefit-sharing contributions arising from 29 Form-I applications. With this release, India’s cumulative ABS disbursements have crossed above ₹143 crore (USD 15.8 million). To date, the NBA has released over ₹104 crore (USD 12.5 million) to the State of Andhra Pradesh towards Red Sanders conservation as well as benefit claimers, and over ₹15 crore (USD 1.8 million) released to various states such as Tamil Nadu, Karnataka, Maharashtra, Odisha and Telangana. Red Sanders (Pterocarpus santalinus), globally valued for its distinctive deep red timber, is endemic to limited pockets of the Eastern Ghats, notably in the Anantapur, Chittoor, Kadapa, Prakasam and Kurnool districts of Andhra Pradesh. The benefit-sharing contributions have accrued from the auction of 1,115 tonnes of Red Sanders wood confiscated and seized by the Directorate of Revenue Intelligence and subsequently auctioned by Central Government agencies, including the State Trading Corporation of India Ltd., MMTC Limited and PEC Limited. Noteworthy to mention that through the Red Sanders access and benefit-sharing amount, NBA supported research projects on Red Sanders, covering conservation, sustainable use, genetic improvement, and value addition through reputed government research institutions like ICFRE-IFGTB, ICFRE-IWST, CSIR-IICB. Field surveys across forest divisions of Andhra Pradesh resulted in the documentation of 1,513 genetic resources with geo-referenced traits and assessed over 15,000 standing trees for variability and reproductive behaviour. Seeds from elite resources were collected for ex situ conservation, with ongoing efforts to establish a National Red Sanders Field Gene Bank. Propagation technologies were strengthened through standardised tissue culture, improved germination, and high-success vegetative propagation methods. Preliminary Seed Production Area guidelines were also developed to support long-term sustainability. Value-added products such as soaps, creams, lip care products, and wood coatings were successfully developed from bark and heartwood. Notably, Royalseema RS Soap® was trademarked (Trademark No. 5870030) and Royal Red lipstick met Bureau of Indian Standards specifications, demonstrating translation of research into practical applications by ICFRE – Institute of Forest Genetics and Tree Breeding, Coimbatore. The initiative reaffirms the NBA’s sustained commitment to fair and equitable benefit sharing, prevention of illegal trade, and strengthening of collective action in biodiversity governance.  NBA is ensuring long-term protection of the ecological, genetic, and socio-economic values of Red Sanders by reinvesting ABS proceeds into conservation, scientific innovation, and community-linked development. These efforts collectively safeguard this endemic species for present and future generations while reinforcing India’s leadership in biodiversity governance. **** VM/SK (रिलीज़ आईडी: 2206421)",
    "scraped_at": "2025-12-19T09:46:49.495422"
  },
  {
    "id": "2206443",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister and Minister of Cooperation Shri Amit Shah convenes a meeting for the constitution of a dedicated body, the Bureau of Port Security (BoPS), for the security of vessels and port facilities",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206443",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah convenes a meeting for the constitution of a dedicated body, the Bureau of Port Security (BoPS), for the security of vessels and port facilities Union Home Minister emphasizes need to establish a robust port security framework across the country Home Minister directs that security measures should be implemented in a graded and risk-based manner, taking into account vulnerabilities, trade potential, location and other relevant parameters Bureau of Port Security (BoPS) shall be constituted as a statutory body under provisions of Section 13 of newly promulgated Merchant Shipping Act, 2025 The Bureau is being modelled on the lines of the Bureau of Civil Aviation Security (BCAS) BoPS shall ensure timely analysis, collection and exchange of security-related information, with a special focus on cyber security, including a dedicated division to safeguard port IT infrastructure from digital threats CISF has been designated as a Recognised Security Organisation (RSO) for port facilities with responsibility for undertaking security assessments and preparation of security plans for ports प्रविष्टि तिथि:\r\n                19 DEC 2025 12:40PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah convened a meeting for the constitution of a dedicated body, the Bureau of Port Security (BoPS), for the security of vessels and port facilities. The meeting was attended by Union Minister for Ports, Shipping and Waterways and Minister of Civil Aviation. During the meeting, Union Home Minister and Minister of Cooperation Shri Amit Shah emphasized the need to establish a robust port security framework across the country. Shri Shah directed that security measures should be implemented in a graded and risk-based manner, taking into account vulnerabilities, trade potential, location, and other relevant parameters. The Bureau of Port Security (BoPS) shall be constituted as a statutory body under the provisions of Section 13 of the newly promulgated Merchant Shipping Act, 2025. The Bureau, headed by a Director General, shall function under the aegis of the Ministry of Ports, Shipping and Waterways (MoPSW) and shall be responsible for regulatory and oversight functions relating to the security of ships and port facilities. The Bureau is being modelled on the lines of the Bureau of Civil Aviation Security (BCAS). The BoPS shall be headed by an IPS officer (Pay Level-15). During the transition period of one year, the Director General of Shipping (DGS/DGMA) shall function as the Director General, BoPS. The BoPS shall also ensure timely analysis, collection and exchange of security-related information, with a special focus on cyber security, including a dedicated division to safeguard port IT infrastructure from digital threats. In order to strengthen port security infrastructure, the Central Industrial Security Force (CISF) has been designated as a Recognised Security Organisation (RSO) for port facilities with responsibility for undertaking security assessments and preparation of security plans for ports. CISF has also been mandated to train and build the capacities of Private Security Agencies (PSAs) engaged in port security. These agencies shall be certified and appropriate regulatory measures shall be introduced to ensure that only licensed PSAs operate in this sector. During the meeting, it was also noted that lessons learned from the maritime security framework shall be replicated in the aviation security domain. ***** RR / PS (रिलीज़ आईडी: 2206443) आगंतुक पटल  : 402 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Assamese , Gujarati , Kannada Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah convenes a meeting for the constitution of a dedicated body, the Bureau of Port Security (BoPS), for the security of vessels and port facilities Union Home Minister emphasizes need to establish a robust port security framework across the country Home Minister directs that security measures should be implemented in a graded and risk-based manner, taking into account vulnerabilities, trade potential, location and other relevant parameters Bureau of Port Security (BoPS) shall be constituted as a statutory body under provisions of Section 13 of newly promulgated Merchant Shipping Act, 2025 The Bureau is being modelled on the lines of the Bureau of Civil Aviation Security (BCAS) BoPS shall ensure timely analysis, collection and exchange of security-related information, with a special focus on cyber security, including a dedicated division to safeguard port IT infrastructure from digital threats CISF has been designated as a Recognised Security Organisation (RSO) for port facilities with responsibility for undertaking security assessments and preparation of security plans for ports प्रविष्टि तिथि:\r\n                        19 DEC 2025 12:40PM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah convened a meeting for the constitution of a dedicated body, the Bureau of Port Security (BoPS), for the security of vessels and port facilities. The meeting was attended by Union Minister for Ports, Shipping and Waterways and Minister of Civil Aviation. During the meeting, Union Home Minister and Minister of Cooperation Shri Amit Shah emphasized the need to establish a robust port security framework across the country. Shri Shah directed that security measures should be implemented in a graded and risk-based manner, taking into account vulnerabilities, trade potential, location, and other relevant parameters. The Bureau of Port Security (BoPS) shall be constituted as a statutory body under the provisions of Section 13 of the newly promulgated Merchant Shipping Act, 2025. The Bureau, headed by a Director General, shall function under the aegis of the Ministry of Ports, Shipping and Waterways (MoPSW) and shall be responsible for regulatory and oversight functions relating to the security of ships and port facilities. The Bureau is being modelled on the lines of the Bureau of Civil Aviation Security (BCAS). The BoPS shall be headed by an IPS officer (Pay Level-15). During the transition period of one year, the Director General of Shipping (DGS/DGMA) shall function as the Director General, BoPS. The BoPS shall also ensure timely analysis, collection and exchange of security-related information, with a special focus on cyber security, including a dedicated division to safeguard port IT infrastructure from digital threats. In order to strengthen port security infrastructure, the Central Industrial Security Force (CISF) has been designated as a Recognised Security Organisation (RSO) for port facilities with responsibility for undertaking security assessments and preparation of security plans for ports. CISF has also been mandated to train and build the capacities of Private Security Agencies (PSAs) engaged in port security. These agencies shall be certified and appropriate regulatory measures shall be introduced to ensure that only licensed PSAs operate in this sector. During the meeting, it was also noted that lessons learned from the maritime security framework shall be replicated in the aviation security domain. ***** RR / PS (रिलीज़ आईडी: 2206443)",
    "scraped_at": "2025-12-19T09:46:51.141314"
  },
  {
    "id": "2206418",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister and Minister of Cooperation Shri Amit Shah extends best wishes to the people of Goa on Goa Liberation Day",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206418",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah extends best wishes to the people of Goa on Goa Liberation Day The present generation may not know that Indians had to obtain permission to visit Goa till 1961, many great souls stood against this and fought for the liberation of Goa After great sacrifices made by our patriots, Goa became an integral part of India With heartfelt gratitude, I bow to all the noble souls who endured immense pain for the freedom of Goa प्रविष्टि तिथि:\r\n                19 DEC 2025 11:58AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has extended best wishes to the people of Goa on Goa Liberation Day. In a post on ‘X’, Union Home Minister Shri Amit Shah said “Best wishes to the people of Goa on Goa Liberation Day. The present generation may not know that Indians had to obtain permission to visit Goa till 1961. Many great souls like Prabhakar Vaidya, Bala Raya Mapari, Nanaji Deshmukh Ji, and Jagannath Rao Joshi Ji stood against this and fought for the liberation of Goa. After great sacrifices made by our patriots, Goa became an integral part of India. With heartfelt gratitude, I bow to all the noble souls who endured immense pain for the freedom of Goa.” Best wishes to the people of Goa on Goa Liberation Day. The present generation may not know that Indians had to obtain permission to visit Goa till 1961. Many great souls like Prabhakar Vaidya, Bala Raya Mapari, Nanaji Deshmukh Ji, and Jagannath Rao Joshi Ji stood against this… — Amit Shah (@AmitShah) December 19, 2025 *** RR / PS (रिलीज़ आईडी: 2206418) आगंतुक पटल  : 122 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , Marathi , हिन्दी , Assamese , Gujarati , Kannada , Malayalam Ministry of Home Affairs Union Home Minister and Minister of Cooperation Shri Amit Shah extends best wishes to the people of Goa on Goa Liberation Day The present generation may not know that Indians had to obtain permission to visit Goa till 1961, many great souls stood against this and fought for the liberation of Goa After great sacrifices made by our patriots, Goa became an integral part of India With heartfelt gratitude, I bow to all the noble souls who endured immense pain for the freedom of Goa प्रविष्टि तिथि:\r\n                        19 DEC 2025 11:58AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has extended best wishes to the people of Goa on Goa Liberation Day. In a post on ‘X’, Union Home Minister Shri Amit Shah said “Best wishes to the people of Goa on Goa Liberation Day. The present generation may not know that Indians had to obtain permission to visit Goa till 1961. Many great souls like Prabhakar Vaidya, Bala Raya Mapari, Nanaji Deshmukh Ji, and Jagannath Rao Joshi Ji stood against this and fought for the liberation of Goa. After great sacrifices made by our patriots, Goa became an integral part of India. With heartfelt gratitude, I bow to all the noble souls who endured immense pain for the freedom of Goa.” Best wishes to the people of Goa on Goa Liberation Day. The present generation may not know that Indians had to obtain permission to visit Goa till 1961. Many great souls like Prabhakar Vaidya, Bala Raya Mapari, Nanaji Deshmukh Ji, and Jagannath Rao Joshi Ji stood against this… — Amit Shah (@AmitShah) December 19, 2025 *** RR / PS (रिलीज़ आईडी: 2206418)",
    "scraped_at": "2025-12-19T09:46:52.807730"
  },
  {
    "id": "2206414",
    "ministry": "Ministry of Home Affairs",
    "title": "Union Home Minister Shri Amit Shah pays tribute to Pandit Ram Prasad Bismil, Ashfaqulla Khan and Roshan Singh on their Balidaan Diwas",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206414",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Home Affairs Union Home Minister Shri Amit Shah pays tribute to Pandit Ram Prasad Bismil, Ashfaqulla Khan and Roshan Singh on their Balidaan Diwas Their sacrifice gave new energy to the freedom struggle through the 'Kakori Train Action' and shook the foundations of British rule These freedom fighters realized the resolve that the resources of the country and the goods produced by its hardworking people rightfully belong to the people themselves They also became a source of inspiration for courage and valor for other revolutionaries The nation will never forget these martyrs प्रविष्टि तिथि:\r\n                19 DEC 2025 11:55AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has paid tribute to Pandit Ram Prasad Bismil, Ashfaqulla Khan and Roshan Singh on their Balidaan Diwas, honoring their sacrifice which gave new energy to the freedom struggle through the 'Kakori Train Action' and shook the foundations of British rule. In a post on ‘X’, Union Home Minister Shri Amit Shah said, tribute to Pandit Ram Prasad Bismil, Ashfaqulla Khan and Roshan Singh on their Balidaan Diwas, honoring their sacrifice which gave new energy to the freedom struggle through the 'Kakori Train Action' and shook the foundations of British rule. He said that these freedom fighters not only realized the resolve that the resources of the country and the goods produced by its hardworking people rightfully belong to the people themselves, but they also became a source of inspiration for courage and valor for other revolutionaries. Shri Shah said that the nation will never forget these martyrs. स्वाधीनता संग्राम को ‘काकोरी ट्रेन एक्शन’ के माध्यम से नई ऊर्जा देकर ब्रिटिश हुकूमत की नींव हिलाने वाले वाले पं. राम प्रसाद बिस्मिल जी, अशफाक उल्ला खां जी और रोशन सिंह जी के बलिदान दिवस पर उन्हें नमन करता हूँ। देश के संसाधनों और मेहनतकश देशवासियों के श्रम से बनी वस्तुओं पर यहाँ… pic.twitter.com/VbWvmAKka5 — Amit Shah (@AmitShah) December 19, 2025 *** RR / PS (रिलीज़ आईडी: 2206414) आगंतुक पटल  : 136 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Urdu , हिन्दी , Assamese , Gujarati , Kannada , Malayalam Ministry of Home Affairs Union Home Minister Shri Amit Shah pays tribute to Pandit Ram Prasad Bismil, Ashfaqulla Khan and Roshan Singh on their Balidaan Diwas Their sacrifice gave new energy to the freedom struggle through the 'Kakori Train Action' and shook the foundations of British rule These freedom fighters realized the resolve that the resources of the country and the goods produced by its hardworking people rightfully belong to the people themselves They also became a source of inspiration for courage and valor for other revolutionaries The nation will never forget these martyrs प्रविष्टि तिथि:\r\n                        19 DEC 2025 11:55AM by PIB Delhi Union Home Minister and Minister of Cooperation Shri Amit Shah has paid tribute to Pandit Ram Prasad Bismil, Ashfaqulla Khan and Roshan Singh on their Balidaan Diwas, honoring their sacrifice which gave new energy to the freedom struggle through the 'Kakori Train Action' and shook the foundations of British rule. In a post on ‘X’, Union Home Minister Shri Amit Shah said, tribute to Pandit Ram Prasad Bismil, Ashfaqulla Khan and Roshan Singh on their Balidaan Diwas, honoring their sacrifice which gave new energy to the freedom struggle through the 'Kakori Train Action' and shook the foundations of British rule. He said that these freedom fighters not only realized the resolve that the resources of the country and the goods produced by its hardworking people rightfully belong to the people themselves, but they also became a source of inspiration for courage and valor for other revolutionaries. Shri Shah said that the nation will never forget these martyrs. स्वाधीनता संग्राम को ‘काकोरी ट्रेन एक्शन’ के माध्यम से नई ऊर्जा देकर ब्रिटिश हुकूमत की नींव हिलाने वाले वाले पं. राम प्रसाद बिस्मिल जी, अशफाक उल्ला खां जी और रोशन सिंह जी के बलिदान दिवस पर उन्हें नमन करता हूँ। देश के संसाधनों और मेहनतकश देशवासियों के श्रम से बनी वस्तुओं पर यहाँ… pic.twitter.com/VbWvmAKka5 — Amit Shah (@AmitShah) December 19, 2025 *** RR / PS (रिलीज़ आईडी: 2206414)",
    "scraped_at": "2025-12-19T09:46:54.923884"
  },
  {
    "id": "2206474",
    "ministry": "Ministry of Law and Justice",
    "title": "Tele Law Services 2.0",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206474",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Law and Justice Tele Law Services 2.0 प्रविष्टि तिथि:\r\n                19 DEC 2025 1:51PM by PIB Delhi As on 30 th November, 2025,61,98,407 citizens have benefitted from the Tele Law 2.0 services since its launch in 2023under Nyaya Bandhuprogramme of the Central Sector Scheme ‘Designing Innovative Solutions for Holistic Access to Justice’ (DISHA). An AI based Chatbot named Nyaya Setu has been developed as a Virtual Legal Assistant. Till 30 November, 2025, the number of pro-bono lawyers registered on Nyaya Bandhu Application are9776 and the nature of cases handled include, but not limited, tocivil and criminal laws, including Women and Child safety, Family and Matrimonial disputes, Domestic Violence, Property disputes, Work place Harassment, etc. This information was given by the Minister of State (Independent Charge) of the Ministry of Law and Justice; and Minister of State in the Ministry of Parliamentary Affairs Shri Arjun Ram Meghwal in Lok Sabha today. **** Samrat (रिलीज़ आईडी: 2206474) आगंतुक पटल  : 81 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी Ministry of Law and Justice Tele Law Services 2.0 प्रविष्टि तिथि:\r\n                        19 DEC 2025 1:51PM by PIB Delhi As on 30 th November, 2025,61,98,407 citizens have benefitted from the Tele Law 2.0 services since its launch in 2023under Nyaya Bandhuprogramme of the Central Sector Scheme ‘Designing Innovative Solutions for Holistic Access to Justice’ (DISHA). An AI based Chatbot named Nyaya Setu has been developed as a Virtual Legal Assistant. Till 30 November, 2025, the number of pro-bono lawyers registered on Nyaya Bandhu Application are9776 and the nature of cases handled include, but not limited, tocivil and criminal laws, including Women and Child safety, Family and Matrimonial disputes, Domestic Violence, Property disputes, Work place Harassment, etc. This information was given by the Minister of State (Independent Charge) of the Ministry of Law and Justice; and Minister of State in the Ministry of Parliamentary Affairs Shri Arjun Ram Meghwal in Lok Sabha today. **** Samrat (रिलीज़ आईडी: 2206474)",
    "scraped_at": "2025-12-19T09:46:56.890500"
  },
  {
    "id": "2206473",
    "ministry": "Ministry of Law and Justice",
    "title": "Regulation of AI in Courts",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206473",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Law and Justice Regulation of AI in Courts प्रविष्टि तिथि:\r\n                19 DEC 2025 1:50PM by PIB Delhi As part of the National eGovernance Plan, Phase-III of the eCourts Mission Mode project with an outlay of Rs 7210 crore is under implementation for ICT (Information and Communication Technology) in the Indian Judiciary. Its vision is to transform the judicial system with Information and Communication Technology enablement of courts and to enhance the judicial productivity, both qualitatively & quantitatively, making the justice delivery system accessible, cost effective, reliable, and transparent. Under eCourts Project Phase III, an amount of Rs. 53.57 crore has been earmarked for the component “Future Technological Advancements(AI, Blockchain etc)”to integrate modern technologies for smoother user experience.The Supreme Court of India constituted Artificial Intelligence Committee to explore the use of AI in the judicial domain. However, no formal policy or guidelines exist for adopting AI tools in judicial processes, as AI-based solutions remain in the controlled pilot phase and authorities use AI only within the areas approved in the DPR of eCourts Phase III. Besides, formulation and regulation of operational frameworks in this regard will begoverned by the rules of Business and policies of the concerned High Courts. Judiciary is aware that integrating AI into judicial processes poses key challenges such as algorithmic bias, language and translation issues, data privacy and security concerns, and the need for manual verification of AI-generated outputs. The eCommittee, Supreme Court of India has formed a Sub-Committee of six High Court judges with technical experts to recommend secure connectivity and authentication mechanism for data and privacy protection, assess the digital infrastructure and service delivery systems under the eCourts Project to strengthen data security. An AI based software tool called Legal Research Analysis Assistant [LegRAA] has been developed to aid judges in legal research and document analysis. An upgraded platform called Digital Courts 2.1 has been designed to assist Hon'ble Judges and Judicial Officers by providing a single window for managing case-related information and tasks. The platform includes AI-powered voice-to-text (ASR-SHRUTI) and translation (PANINI) functionalities to assist the judges with order and judgment dictation.At present, in the pilot phase of AI based solutions, the eCommittee of the Supreme Court of India reports no systemic bias, unintended content, or other issues. This information was given by the Minister of State (Independent Charge) of the Ministry of Law and Justice; and Minister of State in the Ministry of Parliamentary Affairs Shri Arjun Ram Meghwal in Lok Sabha today. **** Samrat (रिलीज़ आईडी: 2206473) आगंतुक पटल  : 116 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी Ministry of Law and Justice Regulation of AI in Courts प्रविष्टि तिथि:\r\n                        19 DEC 2025 1:50PM by PIB Delhi As part of the National eGovernance Plan, Phase-III of the eCourts Mission Mode project with an outlay of Rs 7210 crore is under implementation for ICT (Information and Communication Technology) in the Indian Judiciary. Its vision is to transform the judicial system with Information and Communication Technology enablement of courts and to enhance the judicial productivity, both qualitatively & quantitatively, making the justice delivery system accessible, cost effective, reliable, and transparent. Under eCourts Project Phase III, an amount of Rs. 53.57 crore has been earmarked for the component “Future Technological Advancements(AI, Blockchain etc)”to integrate modern technologies for smoother user experience.The Supreme Court of India constituted Artificial Intelligence Committee to explore the use of AI in the judicial domain. However, no formal policy or guidelines exist for adopting AI tools in judicial processes, as AI-based solutions remain in the controlled pilot phase and authorities use AI only within the areas approved in the DPR of eCourts Phase III. Besides, formulation and regulation of operational frameworks in this regard will begoverned by the rules of Business and policies of the concerned High Courts. Judiciary is aware that integrating AI into judicial processes poses key challenges such as algorithmic bias, language and translation issues, data privacy and security concerns, and the need for manual verification of AI-generated outputs. The eCommittee, Supreme Court of India has formed a Sub-Committee of six High Court judges with technical experts to recommend secure connectivity and authentication mechanism for data and privacy protection, assess the digital infrastructure and service delivery systems under the eCourts Project to strengthen data security. An AI based software tool called Legal Research Analysis Assistant [LegRAA] has been developed to aid judges in legal research and document analysis. An upgraded platform called Digital Courts 2.1 has been designed to assist Hon'ble Judges and Judicial Officers by providing a single window for managing case-related information and tasks. The platform includes AI-powered voice-to-text (ASR-SHRUTI) and translation (PANINI) functionalities to assist the judges with order and judgment dictation.At present, in the pilot phase of AI based solutions, the eCommittee of the Supreme Court of India reports no systemic bias, unintended content, or other issues. This information was given by the Minister of State (Independent Charge) of the Ministry of Law and Justice; and Minister of State in the Ministry of Parliamentary Affairs Shri Arjun Ram Meghwal in Lok Sabha today. **** Samrat (रिलीज़ आईडी: 2206473)",
    "scraped_at": "2025-12-19T09:46:58.539975"
  },
  {
    "id": "2206500",
    "ministry": "Ministry of Micro,Small & Medium Enterprises",
    "title": "Ministry of MSME implements National Scheduled Caste and Scheduled Tribe Hub (NSSH) Scheme to promote entrepreneurship amongst SCs/STs; to fulfill mandated 4% procurement from SC/ST MSEs",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206500",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Micro,Small & Medium Enterprises Ministry of MSME implements National Scheduled Caste and Scheduled Tribe Hub (NSSH) Scheme to promote entrepreneurship amongst SCs/STs; to fulfill mandated 4% procurement from SC/ST MSEs Single Point Registration Scheme (SRPS) provides financial assistance to MSEs for registration Marketing Assistance Scheme (SMAS) facilitates participation of SC/ST entrepreneurs in domestic and international exhibitions; 3,929 SC/ST entrepreneurs benefitted from the scheme प्रविष्टि तिथि:\r\n                19 DEC 2025 2:53PM by PIB Delhi The Ministry of Micro, Small and Medium Enterprises (MSME) is implementing National Scheduled Caste and Scheduled Tribe Hub (NSSH) Scheme to promote entrepreneurship amongst the SCs/STs and to fulfill the mandated 4% of procurement from SC/ST MSEs under the Public Procurement Policy for Micro and Small Enterprises, Government of India. The Scheme has undertaken several initiatives to provide support which include capacity building programmes; market linkage programmes, organization of Special Vendor Development programmes, workshops/awareness programmes, subsidy on purchase of plant & machinery/equipment, financial assistance for registration under Single Point Registration Scheme, for enrollment on Government promoted e-commerce portals, etc. Under ‘Special Marketing Assistance Scheme (SMAS)’ component of t he NSSH Scheme, SC/ST entrepreneurs are facilitated to participate in domestic and international exhibitions to strengthen and develop their capacities to participate in public procurement. 3,929 SC/ST entrepreneurs at a cost of Rs. 36.41 crore were facilitated for participation in domestic exhibitions in the country during the last five years. To spread awareness about various benefits available under NSSH Scheme; Conclaves, Special Vendor Development Programmes (SVDPs) and awareness workshops are being organized at various locations in the country. The scheme also actively uses social media platforms for wider dissemination, particularly focusing on the intended audience. This information was given by the Minister of State for Micro, Small and Medium Enterprises (Sushri Shobha Karandlaje) in a written reply in Lok Sabha. **** AKS (रिलीज़ आईडी: 2206500) आगंतुक पटल  : 29 Ministry of Micro,Small & Medium Enterprises Ministry of MSME implements National Scheduled Caste and Scheduled Tribe Hub (NSSH) Scheme to promote entrepreneurship amongst SCs/STs; to fulfill mandated 4% procurement from SC/ST MSEs Single Point Registration Scheme (SRPS) provides financial assistance to MSEs for registration Marketing Assistance Scheme (SMAS) facilitates participation of SC/ST entrepreneurs in domestic and international exhibitions; 3,929 SC/ST entrepreneurs benefitted from the scheme प्रविष्टि तिथि:\r\n                        19 DEC 2025 2:53PM by PIB Delhi The Ministry of Micro, Small and Medium Enterprises (MSME) is implementing National Scheduled Caste and Scheduled Tribe Hub (NSSH) Scheme to promote entrepreneurship amongst the SCs/STs and to fulfill the mandated 4% of procurement from SC/ST MSEs under the Public Procurement Policy for Micro and Small Enterprises, Government of India. The Scheme has undertaken several initiatives to provide support which include capacity building programmes; market linkage programmes, organization of Special Vendor Development programmes, workshops/awareness programmes, subsidy on purchase of plant & machinery/equipment, financial assistance for registration under Single Point Registration Scheme, for enrollment on Government promoted e-commerce portals, etc. Under ‘Special Marketing Assistance Scheme (SMAS)’ component of t he NSSH Scheme, SC/ST entrepreneurs are facilitated to participate in domestic and international exhibitions to strengthen and develop their capacities to participate in public procurement. 3,929 SC/ST entrepreneurs at a cost of Rs. 36.41 crore were facilitated for participation in domestic exhibitions in the country during the last five years. To spread awareness about various benefits available under NSSH Scheme; Conclaves, Special Vendor Development Programmes (SVDPs) and awareness workshops are being organized at various locations in the country. The scheme also actively uses social media platforms for wider dissemination, particularly focusing on the intended audience. This information was given by the Minister of State for Micro, Small and Medium Enterprises (Sushri Shobha Karandlaje) in a written reply in Lok Sabha. **** AKS (रिलीज़ आईडी: 2206500)",
    "scraped_at": "2025-12-19T09:47:00.182315"
  },
  {
    "id": "2206458",
    "ministry": "Ministry of Panchayati Raj",
    "title": "Over ₹94 Crores XV Finance Commission Grants Released for PRIs in Uttarakhand",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206458",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Panchayati Raj Over ₹94 Crores XV Finance Commission Grants Released for PRIs in Uttarakhand प्रविष्टि तिथि:\r\n                19 DEC 2025 1:22PM by PIB Delhi The Union Government has released ₹94.236 crores as XV Finance Commission (XV FC) grants during the Financial Year 2025-26 for Rural Local Bodies / Panchayati Raj Institutions in Uttarakhand. The release includes the second instalment of Untied Grants for the Financial Year 2024-25 amounting to ₹9,410.03 lakhs for all eligible 13 District Panchayats, 95 Block Panchayats and 7,784 Gram Panchayats in the State. In addition, ₹13.60 lakhs towards the withheld portion of the first instalment of Untied Grants for FY 2024- 25 has been released to 15 additionally eligible Gram Panchayats. The Ministry of Panchayati Raj and the Ministry of Jal Shakti (Department of Drinking Water and Sanitation) recommend the release of XV FC Grants for RLBs/PRIs, which is subsequently released by the Ministry of Finance in two installments during a financial year. Untied Grants are meant to be utilized by Rural Local Bodies/PRIs for location-specific felt needs under the 29 subjects listed in the Eleventh Schedule of the Constitution, except for salaries and other establishment expenditures. Tied Grants, on the other hand, are earmarked for basic services relating to (a) sanitation and maintenance of ODF status including management and treatment of household waste, human excreta and fecal sludge, and (b) supply of drinking water, rainwater harvesting, and water recycling. ***** AA (रिलीज़ आईडी: 2206458) आगंतुक पटल  : 130 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी Ministry of Panchayati Raj Over ₹94 Crores XV Finance Commission Grants Released for PRIs in Uttarakhand प्रविष्टि तिथि:\r\n                        19 DEC 2025 1:22PM by PIB Delhi The Union Government has released ₹94.236 crores as XV Finance Commission (XV FC) grants during the Financial Year 2025-26 for Rural Local Bodies / Panchayati Raj Institutions in Uttarakhand. The release includes the second instalment of Untied Grants for the Financial Year 2024-25 amounting to ₹9,410.03 lakhs for all eligible 13 District Panchayats, 95 Block Panchayats and 7,784 Gram Panchayats in the State. In addition, ₹13.60 lakhs towards the withheld portion of the first instalment of Untied Grants for FY 2024- 25 has been released to 15 additionally eligible Gram Panchayats. The Ministry of Panchayati Raj and the Ministry of Jal Shakti (Department of Drinking Water and Sanitation) recommend the release of XV FC Grants for RLBs/PRIs, which is subsequently released by the Ministry of Finance in two installments during a financial year. Untied Grants are meant to be utilized by Rural Local Bodies/PRIs for location-specific felt needs under the 29 subjects listed in the Eleventh Schedule of the Constitution, except for salaries and other establishment expenditures. Tied Grants, on the other hand, are earmarked for basic services relating to (a) sanitation and maintenance of ODF status including management and treatment of household waste, human excreta and fecal sludge, and (b) supply of drinking water, rainwater harvesting, and water recycling. ***** AA (रिलीज़ आईडी: 2206458)",
    "scraped_at": "2025-12-19T09:47:01.841694"
  },
  {
    "id": "2206497",
    "ministry": "Ministry of Road Transport & Highways",
    "title": "From Flood Fear to Freedom: A New Bridge of Hope Over the Kosi",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206497",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Road Transport & Highways From Flood Fear to Freedom: A New Bridge of Hope Over the Kosi प्रविष्टि तिथि:\r\n                19 DEC 2025 2:50PM by PIB Delhi On the banks of the Kosi River, where for decades people have battled floods, isolation, and long detours, a new dream is taking shape. The 13.3-kilometer Bheja–Bakaur Kosi Bridge is now in its final stage of completion. Once operational, the Kosi River Bridge will reduce travel distance by 44 kilometers, linking the flood-affected, underserved regions of Madhubani and Supaul directly to NH-27 and Patna. It will also open seamless routes to Nepal and the Northeast, boosting cross-border trade, regional commerce, and long-awaited investments. This development falls under the BRT scheme of Bharatmala Pariyojana Phase I in Bihar on EPC mode. With an investment of ₹1101.99 crore, the bridge stands as a significant step toward transforming connectivity in the region. And the project is scheduled to be completed in the Financial Year 2026–2027. Pilgrims will also find easier access to sacred sites like Bhagwati Uchchaith, Bideshwar Dham, Ugratara Temple, and Singheshwar Sthan. Farmers will no longer fear being stranded during floods. Students will reach schools without fear. Traders will deliver goods on time. Small shops will grow; transport services will flourish; local youth will find new jobs. In a region once defined by its struggles against a turbulent river, this bridge is redefining what is possible. And as the final segments of the Kosi bridge rise above the river, the people of North Bihar are united by a single sentiment – their world is about to change forever. Quick Facts: Length of the Project (in Km): 13.300 KM Estimated Civil Project Cost: 1101.99 Cr. Completion Date: Financial Year 2026-2027 For the people of Madhubani, Supaul, Saharsa, and surrounding districts, this bridge is far more than steel and concrete. It is a lifeline, an unbroken chain of hope, easing the journey for communities shaped by the challenges of the Kosi’s floodplain. For Roshan Kumar, a schoolteacher from Saharsa who travels daily to a plus-two school in Madhubani, the bridge represents liberation from years of exhausting journeys. “Right now, to reach Bheja, I travel nearly 70 extra kilometers through Balwaha Pul and the Kosi embankment,” he explains. “Earlier we had to go via Darbhanga or Phulparas, 150 to 200 kilometers of travel. Once the bridge opens, Saharsa to Madhubani will be nearly 70 kilometers shorter. The difference is life-changing.” His voice softens as he adds, “This is not just a bridge. It's time saved, money saved, and energy saved for teachers, students, traders…everyone.” For Pankaj, a medical shop owner in the region, the emotional weight of the project is even deeper. “We have suffered so much,” he says. “Taking patients to hospitals was a nightmare. Floods would cut us off, ferries would stop, and sometimes people lost their lives because help came too late.” Looking at the rising structure, his eyes shine with pride. “Now an ambulance will cross in half an hour. Patients will reach on time. This is dignity. This is safety. We feel proud that such a bridge is being built in our district.” The youth of the region share the same excitement. Neha, an 11th-grade student, recalls how the area suffered during monsoons. “People were scared to cross. The roads would be washed away. But now everything will change. We will reach school safely. Our area will finally feel connected to the rest of the state.” The transformative impact of the bridge extends far beyond these personal journeys. *** GDH/DS (रिलीज़ आईडी: 2206497) आगंतुक पटल  : 36 Ministry of Road Transport & Highways From Flood Fear to Freedom: A New Bridge of Hope Over the Kosi प्रविष्टि तिथि:\r\n                        19 DEC 2025 2:50PM by PIB Delhi On the banks of the Kosi River, where for decades people have battled floods, isolation, and long detours, a new dream is taking shape. The 13.3-kilometer Bheja–Bakaur Kosi Bridge is now in its final stage of completion. Once operational, the Kosi River Bridge will reduce travel distance by 44 kilometers, linking the flood-affected, underserved regions of Madhubani and Supaul directly to NH-27 and Patna. It will also open seamless routes to Nepal and the Northeast, boosting cross-border trade, regional commerce, and long-awaited investments. This development falls under the BRT scheme of Bharatmala Pariyojana Phase I in Bihar on EPC mode. With an investment of ₹1101.99 crore, the bridge stands as a significant step toward transforming connectivity in the region. And the project is scheduled to be completed in the Financial Year 2026–2027. Pilgrims will also find easier access to sacred sites like Bhagwati Uchchaith, Bideshwar Dham, Ugratara Temple, and Singheshwar Sthan. Farmers will no longer fear being stranded during floods. Students will reach schools without fear. Traders will deliver goods on time. Small shops will grow; transport services will flourish; local youth will find new jobs. In a region once defined by its struggles against a turbulent river, this bridge is redefining what is possible. And as the final segments of the Kosi bridge rise above the river, the people of North Bihar are united by a single sentiment – their world is about to change forever. Quick Facts: Length of the Project (in Km): 13.300 KM Estimated Civil Project Cost: 1101.99 Cr. Completion Date: Financial Year 2026-2027 For the people of Madhubani, Supaul, Saharsa, and surrounding districts, this bridge is far more than steel and concrete. It is a lifeline, an unbroken chain of hope, easing the journey for communities shaped by the challenges of the Kosi’s floodplain. For Roshan Kumar, a schoolteacher from Saharsa who travels daily to a plus-two school in Madhubani, the bridge represents liberation from years of exhausting journeys. “Right now, to reach Bheja, I travel nearly 70 extra kilometers through Balwaha Pul and the Kosi embankment,” he explains. “Earlier we had to go via Darbhanga or Phulparas, 150 to 200 kilometers of travel. Once the bridge opens, Saharsa to Madhubani will be nearly 70 kilometers shorter. The difference is life-changing.” His voice softens as he adds, “This is not just a bridge. It's time saved, money saved, and energy saved for teachers, students, traders…everyone.” For Pankaj, a medical shop owner in the region, the emotional weight of the project is even deeper. “We have suffered so much,” he says. “Taking patients to hospitals was a nightmare. Floods would cut us off, ferries would stop, and sometimes people lost their lives because help came too late.” Looking at the rising structure, his eyes shine with pride. “Now an ambulance will cross in half an hour. Patients will reach on time. This is dignity. This is safety. We feel proud that such a bridge is being built in our district.” The youth of the region share the same excitement. Neha, an 11th-grade student, recalls how the area suffered during monsoons. “People were scared to cross. The roads would be washed away. But now everything will change. We will reach school safely. Our area will finally feel connected to the rest of the state.” The transformative impact of the bridge extends far beyond these personal journeys. *** GDH/DS (रिलीज़ आईडी: 2206497)",
    "scraped_at": "2025-12-19T09:47:03.497955"
  },
  {
    "id": "2206345",
    "ministry": "Ministry of Textiles",
    "title": "NIFT reduces application fee for entrance test for the batch of 2026-27 across various categories",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206345",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Textiles NIFT reduces application fee for entrance test for the batch of 2026-27 across various categories प्रविष्टि तिथि:\r\n                19 DEC 2025 10:01AM by PIB Delhi National Institute of Fashion Technology (NIFT) has commenced its process for entrance exam for batch of 2026-27 in various UG and PG courses of fashion design, management and technology. The last date for form filling is 6 th January 2026 (from 7 th to 10 th January 2026 with late fee) and the exam date is 8 th February 2026 . The CBT and pen-paper based All India entrance exam will be conducted by National Testing Agency (NTA) in over 100 cities across the country. For the batch of 2026-27, fees had been reduced from Rs. 3,000/- to Rs. 2,000/- for Open, OBC (NCL) and Open-EWS category candidates and from Rs. 1,500/- to Rs. 500/- for SC, ST and PwD candidates. ******** MAM/VN (रिलीज़ आईडी: 2206345) आगंतुक पटल  : 394 इस विज्ञप्ति को इन भाषाओं में पढ़ें: Tamil , Gujarati , Urdu , Marathi , हिन्दी , Malayalam Ministry of Textiles NIFT reduces application fee for entrance test for the batch of 2026-27 across various categories प्रविष्टि तिथि:\r\n                        19 DEC 2025 10:01AM by PIB Delhi National Institute of Fashion Technology (NIFT) has commenced its process for entrance exam for batch of 2026-27 in various UG and PG courses of fashion design, management and technology. The last date for form filling is 6 th January 2026 (from 7 th to 10 th January 2026 with late fee) and the exam date is 8 th February 2026 . The CBT and pen-paper based All India entrance exam will be conducted by National Testing Agency (NTA) in over 100 cities across the country. For the batch of 2026-27, fees had been reduced from Rs. 3,000/- to Rs. 2,000/- for Open, OBC (NCL) and Open-EWS category candidates and from Rs. 1,500/- to Rs. 500/- for SC, ST and PwD candidates. ******** MAM/VN (रिलीज़ आईडी: 2206345)",
    "scraped_at": "2025-12-19T09:47:05.139040"
  },
  {
    "id": "2206446",
    "ministry": "Ministry of Tribal Affairs",
    "title": "Tribal MPs Join Hands under Jual Oram’s Leadership to Accelerate Tribal Development Nationwide",
    "detail_page": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2206446",
    "date": "19 DEC 2025",
    "content": "Press Release:Press Information Bureau Ministry of Tribal Affairs Tribal MPs Join Hands under Jual Oram’s Leadership to Accelerate Tribal Development Nationwide प्रविष्टि तिथि:\r\n                19 DEC 2025 1:01PM by PIB Delhi Union Minister for Tribal Affairs Shri Jual Oram on Thursday led a high-level interaction with Tribal Members of Parliament and Ministers, highlighting the collective resolve of elected tribal leadership to fast-track the holistic development of India’s tribal communities under the leadership of PM Shri Narendra Modi. Reading out a detailed statement, Shri Oram underscored that the interaction reflected a shared responsibility and unified approach towards inclusion, empowerment, and dignity of tribal citizens, in alignment with the national vision of Sabka Saath, Sabka Vikas, Sabka Vishwas, Sabka Prayas . He emphasized that Tribal MPs play a crucial role not only in policy advocacy but also in ensuring effective implementation and last-mile delivery of welfare initiatives. The Minister outlined key national programmes such as PM-JANMAN , Dharti Aaba Janjatiya Gram Utkarsh Abhiyan , Eklavya Model Residential Schools , and strengthened implementation of the Forest Rights Act , which are collectively transforming tribal and PVTG -dominated regions through saturation-based development. Major gains in housing, drinking water, electrification, healthcare outreach, education, livelihoods, and cultural preservation were highlighted. Special emphasis was laid on quality residential education for tribal children, elimination of Sickle Cell Disease, expansion of livelihood opportunities through Van Dhan initiatives, and community empowerment through forest rights recognition. The interaction reaffirmed the collective endeavor of Tribal MPs, guided by the Union Government, to ensure inclusive growth, social justice, and sustainable development for tribal communities across the country. Minister of State Tribal Affairs Shri. Durgadas Uikey, Smt. Savitri Thakur-Dhar (MP) , Shri Patel Umeshbhai Babubhai-Daman & Diu, Shri Sukhdeo Bhagat- Jharkhand , Shri Rajkumar Roat-Rajasthan, Shri Manoj Tigga- West Bengal, Shri Amarsing Tisso-Assam, Shri Pradeep Purohit- (Bargarh) Odisha, Shri Balabhadra Majhi- (Nabrangpur) Odisha, Shri Naba Charan Majhi- (Mayurbhanj) Odisha, Smt. Malvika Devi- (Kalahandi) Odisha. Besides it was attended by the Secretary Tribal Affairs Smt. Ranjana Choppra, Joint Secretary Shri. Anant Prakash Pandey , Additional Secretary Shri. Manish Thakur , Commissioner NESTS Shri Ajit Kumar Srivastav and other prominent officials. The interaction reflected a rare convergence of policy, political will, and grassroots insight, with Tribal MPs playing a proactive role in guiding implementation, strengthening convergence, and ensuring accountability on the ground. The collective endeavor reaffirmed Parliament’s commitment to inclusive growth, social justice, and dignity for tribal communities, aligned with the national vision of Sabka Saath, Sabka Vikas, Sabka Vishwas, Sabka Prayas . ********* RN/ (रिलीज़ आईडी: 2206446) आगंतुक पटल  : 153 इस विज्ञप्ति को इन भाषाओं में पढ़ें: हिन्दी Ministry of Tribal Affairs Tribal MPs Join Hands under Jual Oram’s Leadership to Accelerate Tribal Development Nationwide प्रविष्टि तिथि:\r\n                        19 DEC 2025 1:01PM by PIB Delhi Union Minister for Tribal Affairs Shri Jual Oram on Thursday led a high-level interaction with Tribal Members of Parliament and Ministers, highlighting the collective resolve of elected tribal leadership to fast-track the holistic development of India’s tribal communities under the leadership of PM Shri Narendra Modi. Reading out a detailed statement, Shri Oram underscored that the interaction reflected a shared responsibility and unified approach towards inclusion, empowerment, and dignity of tribal citizens, in alignment with the national vision of Sabka Saath, Sabka Vikas, Sabka Vishwas, Sabka Prayas . He emphasized that Tribal MPs play a crucial role not only in policy advocacy but also in ensuring effective implementation and last-mile delivery of welfare initiatives. The Minister outlined key national programmes such as PM-JANMAN , Dharti Aaba Janjatiya Gram Utkarsh Abhiyan , Eklavya Model Residential Schools , and strengthened implementation of the Forest Rights Act , which are collectively transforming tribal and PVTG -dominated regions through saturation-based development. Major gains in housing, drinking water, electrification, healthcare outreach, education, livelihoods, and cultural preservation were highlighted. Special emphasis was laid on quality residential education for tribal children, elimination of Sickle Cell Disease, expansion of livelihood opportunities through Van Dhan initiatives, and community empowerment through forest rights recognition. The interaction reaffirmed the collective endeavor of Tribal MPs, guided by the Union Government, to ensure inclusive growth, social justice, and sustainable development for tribal communities across the country. Minister of State Tribal Affairs Shri. Durgadas Uikey, Smt. Savitri Thakur-Dhar (MP) , Shri Patel Umeshbhai Babubhai-Daman & Diu, Shri Sukhdeo Bhagat- Jharkhand , Shri Rajkumar Roat-Rajasthan, Shri Manoj Tigga- West Bengal, Shri Amarsing Tisso-Assam, Shri Pradeep Purohit- (Bargarh) Odisha, Shri Balabhadra Majhi- (Nabrangpur) Odisha, Shri Naba Charan Majhi- (Mayurbhanj) Odisha, Smt. Malvika Devi- (Kalahandi) Odisha. Besides it was attended by the Secretary Tribal Affairs Smt. Ranjana Choppra, Joint Secretary Shri. Anant Prakash Pandey , Additional Secretary Shri. Manish Thakur , Commissioner NESTS Shri Ajit Kumar Srivastav and other prominent officials. The interaction reflected a rare convergence of policy, political will, and grassroots insight, with Tribal MPs playing a proactive role in guiding implementation, strengthening convergence, and ensuring accountability on the ground. The collective endeavor reaffirmed Parliament’s commitment to inclusive growth, social justice, and dignity for tribal communities, aligned with the national vision of Sabka Saath, Sabka Vikas, Sabka Vishwas, Sabka Prayas . ********* RN/ (रिलीज़ आईडी: 2206446)",
    "scraped_at": "2025-12-19T09:47:06.789306"
  }
]